{
    "arxiv_id": "2303.16825",
    "paper_title": "Strong coupling between a microwave photon and a singlet-triplet qubit",
    "authors": [
        "Jann H. Ungerer",
        "Alessia Pally",
        "Artem Kononov",
        "Sebastian Lehmann",
        "Joost Ridderbos",
        "Claes Thelander",
        "Kimberly A. Dick",
        "Ville F. Maisi",
        "Pasquale Scarlino",
        "Andreas Baumgartner",
        "Christian Schönenberger"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "quant-ph"
    ],
    "abstract": "Tremendous progress in few-qubit quantum processing has been achieved lately using superconducting resonators coupled to gate voltage defined quantum dots. While the strong coupling regime has been demonstrated recently for odd charge parity flopping mode spin qubits, first attempts towards coupling a resonator to even charge parity singlet-triplet spin qubits have resulted only in weak spin-photon coupling strengths. Here, we integrate a zincblende InAs nanowire double quantum dot with strong spin-orbit interaction in a magnetic-field resilient, high-quality resonator. In contrast to conventional strategies, the quantum confinement is achieved using deterministically grown wurtzite tunnel barriers without resorting to electrical gating. Our experiments on even charge parity states and at large magnetic fields, allow us to identify the relevant spin states and to measure the spin decoherence rates and spin-photon coupling strengths. Most importantly, at a specific magnetic field, we find an anti-crossing between the resonator mode in the single photon limit and a singlet-triplet qubit with an electron spin-photon coupling strength of $g = 114 \\pm 9$ MHz, reaching the strong coupling regime in which the coherent coupling exceeds the combined qubit and resonator linewidth.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16825v1"
    ],
    "publication_venue": "10 pages, 7 figures"
}