{
    "arxiv_id": "2303.08092",
    "paper_title": "The Random Hivemind: An Ensemble Deep Learner. A Case Study of Application to Solar Energetic Particle Prediction Problem",
    "authors": [
        "Patrick M. O'Keefe",
        "Viacheslav Sadykov",
        "Alexander Kosovichev",
        "Irina N. Kitiashvili",
        "Vincent Oria",
        "Gelu M. Nita",
        "Fraila Francis",
        "Chun-Jie Chong",
        "Paul Kosovich",
        "Aatiya Ali",
        "Russell D. Marroquin"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "physics.data-an"
    ],
    "abstract": "Deep learning has become a popular trend in recent years in the machine learning community and has even occasionally become synonymous with machine learning itself thanks to its efficiency, malleability, and ability to operate free of human intervention. However, a series of hyperparameters passed to a conventional neural network (CoNN) may be rather arbitrary, especially if there is no surefire way to decide how to program hyperparameters for a given dataset. The random hivemind (RH) alleviates this concern by having multiple neural network estimators make decisions based on random permutations of features. The learning rate and the number of epochs may be boosted or attenuated depending on how all features of a given estimator determine the class that the numerical feature data belong to, but all other hyperparameters remain the same across estimators. This allows one to quickly see whether consistent decisions on a given dataset can be made by multiple neural networks with the same hyperparameters, with random subsets of data chosen to force variation in how data are predicted by each, placing the quality of the data and hyperparameters into focus. The effectiveness of RH is demonstrated through experimentation in the predictions of dangerous solar energetic particle events (SEPs) by comparing it to that of using both CoNN and the traditional approach used by ensemble deep learning in this application. Our results demonstrate that RH outperforms the CoNN and a committee-based approach, and demonstrates promising results with respect to the ``all-clear'' prediction of SEPs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08092v1"
    ],
    "publication_venue": "10 pages, 2 figures, 5 tables"
}