{
    "arxiv_id": "2303.09120",
    "paper_title": "Introduction to Renormalization Theory and Chiral Gauge Theories in Dimensional Regularization with Non-Anticommuting $γ_5$",
    "authors": [
        "Hermès Bélusca-Maïto",
        "Amon Ilakovac",
        "Paul Kühler",
        "Marija Mađor-Božinović",
        "Dominik Stöckinger",
        "Matthias Weißwange"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph",
        "hep-th"
    ],
    "abstract": "This review provides a detailed introduction to chiral gauge theories, renormalization theory, and the application of dimensional regularization with the non-anticommuting BMHV scheme for $γ_5$.\n  One goal is to show how chiral gauge theories can be renormalized despite the spurious breaking of gauge invariance and how to obtain the required symmetry-restoring counterterms. A second goal is to familiarize the reader with the theoretical basis of the renormalization of chiral gauge theories, the theorems that guarantee the existence of renormalized chiral gauge theories at all orders as consistent quantum theories. Relevant topics include BPHZ renormalization, Slavnov-Taylor identities, the BRST formalism and algebraic renormalization, as well as the theorems guaranteeing that dimensional regularization is a consistent regularization/renormalization scheme. All of these, including their proofs and interconnections, are explained and discussed in detail.\n  Further, these theoretical concepts are illustrated in practical applications with the example of an Abelian and a non-Abelian chiral gauge theory. Not only the renormalization procedure for such chiral gauge theories is explained step by step, but also the results of all counterterms, including the symmetry-restoring ones, necessary for the consistent renormalization are explicitly provided.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09120v1"
    ],
    "publication_venue": "139 pages, pedagogical review, invited for special issue \"Chiral Symmetry in Physics\", Symmetry Journal, guest editor Dubravko Klabučar. Agrees with published version up to minor editorial changes"
}