{
    "arxiv_id": "2303.12302",
    "paper_title": "Anomaly Detection in Aeronautics Data with Quantum-compatible Discrete Deep Generative Model",
    "authors": [
        "Thomas Templin",
        "Milad Memarzadeh",
        "Walter Vinci",
        "P. Aaron Lott",
        "Ata Akbari Asanjan",
        "Anthony Alexiades Armenakas",
        "Eleanor Rieffel"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG"
    ],
    "abstract": "Deep generative learning cannot only be used for generating new data with statistical characteristics derived from input data but also for anomaly detection, by separating nominal and anomalous instances based on their reconstruction quality. In this paper, we explore the performance of three unsupervised deep generative models -- variational autoencoders (VAEs) with Gaussian, Bernoulli, and Boltzmann priors -- in detecting anomalies in flight-operations data of commercial flights consisting of multivariate time series. We devised two VAE models with discrete latent variables (DVAEs), one with a factorized Bernoulli prior and one with a restricted Boltzmann machine (RBM) as prior, because of the demand for discrete-variable models in machine-learning applications and because the integration of quantum devices based on two-level quantum systems requires such models. The DVAE with RBM prior, using a relatively simple -- and classically or quantum-mechanically enhanceable -- sampling technique for the evolution of the RBM's negative phase, performed better than the Bernoulli DVAE and on par with the Gaussian model, which has a continuous latent space. Our studies demonstrate the competitiveness of a discrete deep generative model with its Gaussian counterpart on anomaly-detection tasks. Moreover, the DVAE model with RBM prior can be easily integrated with quantum sampling by outsourcing its generative process to measurements of quantum states obtained from a quantum annealer or gate-model device.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12302v1"
    ],
    "publication_venue": "25 pages, 7 figures, 3 tables, appendix, supplementary material"
}