{
    "arxiv_id": "2303.07961",
    "paper_title": "A Deep Relational Event Additive Model for modeling patent citations",
    "authors": [
        "Edoardo Filippi-Mazzola",
        "Ernst C. Wit"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "stat.CO"
    ],
    "abstract": "The patent citation network is a complex and dynamic system that reflects the diffusion of knowledge and innovation across different fields of technology. With this work, we aim to analyze such citation networks by developing a novel approach that leverages Relational Event Models (REMs) and Machine learning concepts. Overcoming the main limitations of REMs on analyzing large sparse networks, we propose a Deep Relational Event Additive Model (DREAM) that models the relationships between cited and citing patents as events that occur over time, capturing the dynamic nature of the patent citation network. Each predictor in the generative model is assumed to have a non-linear behavior, which has been modeled through a B-spline approach that allowed us to capture such smooth effects. By estimating the model through a stochastic gradient descent approach, we were able to efficiently estimate the parameters of the DREAM and identify the key factors that drive the network dynamics. Additionally, our spline approach allowed us to capture complex relationships between predictors through elaborate interaction effects, leading to a more accurate and comprehensive interpretation of the underlying mechanisms of the patent citation network. Our analysis revealed several interesting insights, such as the identification of time windows in which citations are more likely to happen and the relevancy of the increasing number of citations received per patent. Overall, our results demonstrate the potential of the DREAM in capturing complex dynamics that arise in a large sparse network, maintaining the features and the interpretability for which REMs are mostly famous.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07961v1"
    ],
    "publication_venue": null
}