{
    "arxiv_id": "2303.08813",
    "paper_title": "A High Fraction of Heavily X-ray Obscured Active Galactic Nuclei",
    "authors": [
        "Christopher M. Carroll",
        "Tonima T. Ananna",
        "Ryan C. Hickox",
        "Alberto Masini",
        "Roberto J. Assef",
        "Daniel Stern",
        "Chien-Ting J. Chen",
        "Lauranne Lanz"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
    ],
    "abstract": "We present new estimates on the fraction of heavily X-ray obscured, Compton-thick (CT) active galactic nuclei (AGNs) out to a redshift of $z \\leq$ 0.8. From a sample of 540 AGNs selected by mid-IR (MIR) properties in observed X-ray survey fields, we forward model the observed-to-intrinsic X-ray luminosity ratio ($R_{L_{\\text{X}}}$) with a Markov chain Monte Carlo (MCMC) simulation to estimate the total fraction of CT AGNs ($f_{\\text{CT}}$), many of which are missed in typical X-ray observations. We create model $N_{\\text{H}}$ distributions and convert these to $R_{L_{\\text{X}}}$ using a set of X-ray spectral models. We probe the posterior distribution of our models to infer the population of X-ray non-detected sources. From our simulation we estimate a CT fraction of $f_{\\text{CT}}$ = $\\text{0.555}^{+\\text{0.037}}_{-\\text{0.032}}$. We perform an X-ray stacking analysis for sources in Chandra X-ray Observatory fields and find that the expected soft (0.5-2 keV) and hard (2-7 keV) observed fluxes drawn from our model to be within 0.48 and 0.12 dex of our stacked fluxes, respectively. Our results suggests at least 50% of all MIR-selected AGNs, possibly more, are Compton-thick ($N_{\\text{H}} \\gtrsim$ 10$^{\\text{24}}$ cm$^{-\\text{2}}$), which is in excellent agreement with other recent work using independent methods. This work indicates that the total number of AGNs is higher than can be identified using X-ray observations alone, highlighting the importance of a multiwavelength approach. A high $f_{\\text{CT}}$ also has implications for black hole (BH) accretion physics and supports models of BH and galaxy co-evolution that include periods of heavy obscuration.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08813v1"
    ],
    "publication_venue": "14 pages, 6 figures, 1 table, plus appendix figures. Accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc402"
}