{
    "arxiv_id": "2303.12037",
    "paper_title": "Understanding the leading indicators of hospital admissions from COVID-19 across successive waves in the UK",
    "authors": [
        "Jonathon Mellor",
        "Christopher E Overton",
        "Martyn Fyles",
        "Liam Chawner",
        "James Baxter",
        "Tarrion Baird",
        "Thomas Ward"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "stat.AP"
    ],
    "abstract": "Following the UK Government's Living with COVID-19 Strategy and the end of universal testing, hospital admissions are an increasingly important measure of COVID-19 pandemic pressure. Understanding leading indicators of admissions at National Health Service (NHS) Trust, regional and national geographies help health services plan capacity needs and prepare for ongoing pressures. We explored the spatio-temporal relationships of leading indicators of hospital pressure across successive waves of SARS-CoV-2 incidence in England. This includes an analysis of internet search volume values from Google Trends, NHS triage calls and online queries, the NHS COVID-19 App, lateral flow devices and the ZOE App. Data sources were analysed for their feasibility as leading indicators using linear and non-linear methods; granger causality, cross correlations and dynamic time warping at fine spatial scales. Consistent temporal and spatial relationships were found for some of the leading indicators assessed across resurgent waves of COVID-19. Google Trends and NHS queries consistently led admissions in over 70% of Trusts, with lead times ranging from 5-20 days, whereas an inconsistent relationship was found for the ZOE app, NHS COVID-19 App, and rapid testing, that diminished with granularity, showing limited autocorrelation of leads between -7 to 7 days. This work shows that novel syndromic surveillance data has utility for understanding the expected hospital burden at fine spatial scales. The analysis shows at low level geographies that some surveillance sources can predict hospital admissions, though care must be taken in relying on the lead times and consistency between waves.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12037v1"
    ],
    "publication_venue": null
}