{
    "arxiv_id": "2303.15629",
    "paper_title": "Nested Skills in Labor Ecosystems: A Hidden Dimension of Human Capital",
    "authors": [
        "Moh Hosseinioun",
        "Frank Neffke",
        "Letian",
        "Zhang",
        "Hyejin Youn"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2025-03-26"
    ],
    "latest_version": 4,
    "categories": [
        "physics.soc-ph"
    ],
    "abstract": "Modern economies, characterized by their vast output of goods and services, operate through globally interconnected networks. As economies become more complex, so do these networks, coordinating increasingly diverse portfolios of specialized efforts and knowledge. In this study, we analyze U.S. survey data (2005--2019) to infer an underlying interdependency tree within the fabric of skill portfolios. Hierarchically constructed, this skill tree starts from widely needed, foundational abilities, constituting the root, and extends to highly specialized, niche skills required by select jobs at the extremities. The directionality is defined by the asymmetrical conditional probabilities of the presence of one skill given the existence of another. Examining 70 million job transitions in resumes and national surveys, we observe that individuals tend to delve deeper into these nested specialization paths as they ascend the career ladder to enjoy higher wage premiums. Nevertheless, we find the role of foundational skills for such ascent remains pivotal; without reinforcing them, the anticipated wage premiums may vanish. Hence, we further differentiate \\textit{nested} skills from others, with the former building on common prerequisites while the latter does not, and analyze disparities in these skill gaps across different genders and racial/ethnic groups. Our analysis reveals a growing and concerning fragmentation in the divide between these two skill groups over the past two decades, suggesting further polarization within the job landscape. Our findings highlight the critical role of robust foundational skills as a stepping stone to specialization and the economic advantages it can confer, reinforcing the need for balanced skill development strategies in complex economies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15629v1",
        "http://arxiv.org/pdf/2303.15629v2",
        "http://arxiv.org/pdf/2303.15629v3",
        "http://arxiv.org/pdf/2303.15629v4"
    ],
    "publication_venue": "32 pages, 7 figures",
    "doi": "10.1038/s41562-024-02093-2"
}