{
    "arxiv_id": "2303.11746",
    "paper_title": "Recommendation Systems in Libraries: an Application with Heterogeneous Data Sources",
    "authors": [
        "Alessandro Speciale",
        "Greta Vallero",
        "Luca Vassio",
        "Marco Mellia"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cs.IR",
        "cs.CY",
        "cs.LG"
    ],
    "abstract": "The Reading&Machine project exploits the support of digitalization to increase the attractiveness of libraries and improve the users' experience. The project implements an application that helps the users in their decision-making process, providing recommendation system (RecSys)-generated lists of books the users might be interested in, and showing them through an interactive Virtual Reality (VR)-based Graphical User Interface (GUI). In this paper, we focus on the design and testing of the recommendation system, employing data about all users' loans over the past 9 years from the network of libraries located in Turin, Italy. In addition, we use data collected by the Anobii online social community of readers, who share their feedback and additional information about books they read. Armed with this heterogeneous data, we build and evaluate Content Based (CB) and Collaborative Filtering (CF) approaches. Our results show that the CF outperforms the CB approach, improving by up to 47\\% the relevant recommendations provided to a reader. However, the performance of the CB approach is heavily dependent on the number of books the reader has already read, and it can work even better than CF for users with a large history. Finally, our evaluations highlight that the performances of both approaches are significantly improved if the system integrates and leverages the information from the Anobii dataset, which allows us to include more user readings (for CF) and richer book metadata (for CB).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11746v1"
    ],
    "publication_venue": "Accepted at 7th International workshop on Data Analytics solutions for Real-LIfe APplications - 28th March-31st March, 2023, Ioannina, Greece. The paper will be published in the Proceedings of EDBT/ICDT 2023 Joint Conference"
}