{
    "arxiv_id": "2303.14825",
    "paper_title": "Symmetry- and Energy-Resolved Entanglement Dynamics in Disordered Bose-Hubbard Model",
    "authors": [
        "Jie Chen",
        "Chun Chen",
        "Xiaoqun Wang"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2025-03-20"
    ],
    "latest_version": 3,
    "categories": [
        "cond-mat.dis-nn",
        "cond-mat.str-el"
    ],
    "abstract": "Using numerical quantum quenches with the integration of both symmetry and energy resolutions, we comprehensively study the dynamics of symmetry-resolved entanglement in a disordered Bose-Hubbard (dBH) model, concentrating on the two types of inhomogeneous initial states to target the lower- and higher-energy sections of its dynamical phase diagram. (i) Motivated by the recent experiment [A. Lukin et al., Science 364, 256 (2019)] which focused on the lower-energy dynamic behaviors of the dBH chain, we first show that, at low energies, for a thermalizing state, although the second law of thermodynamics prohibits the decrease of the total entropy over time, for part of the channel-resolved entropies, a long-term entropic reduction may arise at weak disorder. (ii) A companion channel-resolved analysis at strong disorder further hints that the priorly observed double-log growth of the number entropy might not directly indicate the breakdown of MBL in spin or fermion chains, providing a refreshing perspective on this major controversy in the community. (iii) From time-evolving the line-shape low-energy product state, we subsequently reveal an abrupt formation of a novel \"entropy imbalance pattern\" across the different symmetry channels. Intriguingly, this imbalance melts in the strong-disorder limit. We conjecture that the melting of the entropic pattern, together with the freezing of a concurrent particle-density wave, embodies a dual trait inherent to MBL. (iv) Specifically, we find a cluster MBL regime, unique to the Bose statistics, emerging from the higher-energy section. This cluster MBL regime realizable even at weak disorder appears not suffer from the finite-size drift and is distinguished by its absence of the hallmark of MBL - the unbounded growth of the entanglement entropy. Our theoretical predictions are by and large testable via the present experimental facilities.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14825v1",
        "http://arxiv.org/pdf/2303.14825v2",
        "http://arxiv.org/pdf/2303.14825v3"
    ],
    "publication_venue": null
}