{
    "arxiv_id": "2303.08786",
    "paper_title": "Evolution of a stratified turbulent cloud under rotation",
    "authors": [
        "Tianyi Li",
        "Minping Wan",
        "Shiyi Chen"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn",
        "physics.ao-ph"
    ],
    "abstract": "Localized turbulence is prevalent in many geophysical flows where rotation and stratification are common features. Here we investigate the evolution of a stratified turbulent cloud under rotation. Since the turbulent cloud consists of vortices with different shapes and sizes, a single eddy under rotation and stratification is considered first. The stratified eddy is different from an eddy under pure rotation in two respects. First, a new potential vorticity (PV) mode is found, which is manifested as a static stable vortex. Second, inertial waves found in the purely rotating case are replaced by inertial-gravity waves in the stratified case. We then investigate a turbulent cloud for which we perform numerical simulations at a fixed Rossby number and for various Froude numbers. Unlike the purely rotating case where vertical columnar structures spontaneously grow out of the turbulent cloud, in the stratified case the columnar structures emerge and tilt away from the vertical direction. As the stratification gets stronger, the tilting angle increases and the rate of cloud expansion decreases. The columnar structures are composed of inertial-gravity waves, as both the tilting angles of the flow structures and vertical growth rates of the turbulent cloud can be predicted by the linear theory. We adopt Lagrangian particle tracking to identify regions dominated by wave and turbulence. When the stratification is weak, the inertial-gravity waves carry a considerable portion of energy away from the turbulent cloud. This portion of energy reduces as the stratification becomes stronger.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08786v1"
    ],
    "publication_venue": null
}