{
    "arxiv_id": "2303.08071",
    "paper_title": "The hunt for the Kármán \"constant'' revisited",
    "authors": [
        "Peter A. Monkewitz",
        "Hassan M. Nagib"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "The logarithmic law of the wall, joining the inner, near-wall mean velocity profile (MVP) to the outer region, has been a permanent fixture of turbulence research for over hundred years, but there is still no general agreement on the value of the pre-factor, the inverse of the Kármán ``constant'' or on its universality. The choice diagnostic tool to locate logarithmic parts of the MVP is to look for regions where the indicator function $Ξ$ (equal to the wall-normal coordinate $y^+$ times the mean velocity derivative $\\dd U^+/\\dd y^+$) is constant. In pressure driven flows however, such as channel and pipe flow, $Ξ$ is significantly affected by a term proportional to the wall-normal coordinate, of order $\\mathcal{O}(\\Reytau^{-1})$ in the inner expansion, but moving up across the overlap to the leading $\\mathcal{O}(1)$ in the outer expansion. Here we show, that due to this linear overlap term, $\\Reytau$'s of the order of $10^6$ and beyond are required to produce one decade of near constant $Ξ$ in channels and pipes. The problem is resolved by considering the common part of the inner asymptotic expansion carried to $\\mathcal{O}(\\Reytau^{-1})$, and the leading order of the outer expansion, which is a \\textit{superposition} of log law and linear term $L_0 \\,y^+\\Reytau^{-1}$. The approach provides a new and robust method to simultaneously determine $κ$ and $L_0$ in pressure driven flows at currently accessible $\\Reytau$'s, and yields $κ$'s which are consistent with the $κ$'s deduced from the Reynolds number dependence of centerline velocities. A comparison with the zero-pressure-gradient turbulent boundary layer, henceforth abbreviated ``ZPG TBL'', further clarifies the issues.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08071v1"
    ],
    "publication_venue": null
}