{
    "arxiv_id": "2303.10287",
    "paper_title": "Non-Steepness and Maximum Likelihood Estimation Properties of the Truncated Multivariate Normal Distributions",
    "authors": [
        "Michael Levine",
        "Donald Richards",
        "Jianxi Su"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2025-05-27"
    ],
    "latest_version": 2,
    "categories": [
        "math.ST"
    ],
    "abstract": "This article considers exponential families of truncated multivariate normal distributions with one-sided truncation for some or all coordinates. We observe that if all components are one-sided truncated then this family is not full. The family of truncated multivariate normal distributions is extended to a full family, and the extended family is investigated in detail. We identify the canonical parameter space of the extended family, establish that the family is not regular, and deduce as a consequence that the family is not steep. We also consider maximum likelihood estimation for the location vector parameter, and the positive definite (symmetric) matrix dispersion parameter of a truncated non-singular multivariate normal distribution. It is shown that if the sample size is sufficiently large then, almost surely, the likelihood function has a unique maximizer on the canonical parameter space if any such maximizer exists. It is also shown that each solution to the score equations for the location and dispersion parameters satisfies the method-of-moments equations. The family of truncated multivariate normal distributions with a single one-sided truncated component is also considered; the corresponding canonical parameter space is identified, and it is shown that the family is not steep. Finally, it is observed that similar results arise in the case of an arbitrary number of truncated components.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10287v1",
        "http://arxiv.org/pdf/2303.10287v2"
    ],
    "publication_venue": "33 pages"
}