{
    "arxiv_id": "2303.09836",
    "paper_title": "An in-depth exploration of LAMOST Unknown spectra based on density clustering",
    "authors": [
        "Haifeng Yang",
        "Xiaona Yin",
        "Jianghui Cai",
        "Yuqing Yang",
        "Ali Luo",
        "Zhongrui Bai",
        "Lichan Zhou",
        "Xujun Zhao",
        "Yaling Xun"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM"
    ],
    "abstract": "LAMOST (Large Sky Area Multi-Object Fiber Spectroscopic Telescope) has completed the observation of nearly 20 million celestial objects, including a class of spectra labeled `Unknown'. Besides low signal-to-noise ratio, these spectra often show some anomalous features that do not work well with current templates. In this paper, a total of 638,000 `Unknown' spectra from LAMOST DR5 are selected, and an unsupervised-based analytical framework of `Unknown' spectra named SA-Frame (Spectra Analysis-Frame) is provided to explore their origins from different perspectives. The SA-Frame is composed of three parts: NAPC-Spec clustering, characterization and origin analysis. First, NAPC-Spec(Nonparametric density clustering algorithm for spectra) characterizes different features in the \"unknown\" spectrum by adjusting the influence space and divergence distance to minimize the effects of noise and high dimensionality, resulting in 13 types. Second, characteristic extraction and representation of clustering results are carried out based on spectral lines and continuum, where these 13 types are characterized as regular spectra with low S/Ns, splicing problems, suspected galactic emission signals, contamination from city light and un-gregarious type respectively. Third, a preliminary analysis of their origins is made from the characteristics of the observational targets, contamination from the sky, and the working status of the instruments. These results would be valuable for improving the overall data quality of large-scale spectral surveys.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09836v1"
    ],
    "publication_venue": "18 pages, 15 figures",
    "doi": "10.1088/1674-4527/acc507"
}