{
    "arxiv_id": "2303.09448",
    "paper_title": "Topology optimization of flexoelectric metamaterials with apparent piezoelectricity",
    "authors": [
        "Francesco Greco",
        "David Codony",
        "Hossein Mohammadi",
        "Sonia Fernandez-Mendez",
        "Irene Arias"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "math.NA",
        "physics.comp-ph"
    ],
    "abstract": "The flexoelectric effect, coupling polarization and strain gradient as well as strain and electric field gradients, is universal to dielectrics, but, as compared to piezoelectricity, it is more difficult to harness as it requires field gradients and it is a small-scale effect. These drawbacks can be overcome by suitably designing metamaterials made of a non-piezoelectric base material but exhibiting apparent piezoelectricity. We develop a theoretical and computational framework to perform topology optimization of the representative volume element of such metamaterials by accurately modeling the governing equations of flexoelectricity using a Cartesian B-spline method, describing geometry with a level set, and resorting to genetic algorithms for optimization. We consider a multi-objective optimization problem where area fraction competes with four fundamental piezoelectric functionalities (stress/strain sensor/ actuator). We computationally obtain Pareto fronts, and discuss the different geometries depending on the apparent piezoelectric coefficient being optimized. In general, we find competitive estimations of apparent piezoelectricity as compared to reference materials such as quartz and PZT ceramics. This opens the possibility to design devices for sensing, actuation and energy harvesting from a much wider, cheaper and effective class of materials.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09448v1"
    ],
    "publication_venue": null
}