{
    "arxiv_id": "2303.09422",
    "paper_title": "Improved prior for adaptive optics point spread function estimation from science images: Application for deconvolution",
    "authors": [
        "A. Lau",
        "R. JL. Fétick",
        "B. Neichel",
        "O. Beltramo-Martin",
        "T. Fusco"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.SR"
    ],
    "abstract": "Access to knowledge of the point spread function (PSF) of adaptive optics(AO)-assisted observations is still a major limitation when processing AO data. This limitation is particularly important when image analysis requires the use of deconvolution methods. As the PSF is a complex and time-varying function, reference PSFs acquired on calibration stars before or after the scientific observation can be too different from the actual PSF of the observation to be used for deconvolution, and lead to artefacts in the final image. We improved the existing PSF-estimation method based on the so-called marginal approach by enhancing the object prior in order to make it more robust and suitable for observations of resolved extended objects. Our process is based on a two-step blind deconvolution approach from the literature. The first step consists of PSF estimation from the science image. For this, we made use of an analytical PSF model, whose parameters are estimated based on a marginal algorithm. This PSF was then used for deconvolution. In this study, we first investigated the requirements in terms of PSF parameter knowledge to obtain an accurate and yet resilient deconvolution process using simulations. We show that current marginal algorithms do not provide the required level of accuracy, especially in the presence of small objects. Therefore, we modified the marginal algorithm by providing a new model for object description, leading to an improved estimation of the required PSF parameters. Our method fulfills the deconvolution requirement with realistic system configurations and different classes of Solar System objects in simulations. Finally, we validate our method by performing blind deconvolution with SPHERE/ZIMPOL observations of the Kleopatra asteroid.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09422v1"
    ],
    "publication_venue": "accepted for publication in Astronomy & Astrophysics (A&A)",
    "doi": "10.1051/0004-6361/202245471"
}