{
    "arxiv_id": "2303.11736",
    "paper_title": "CEERS Key Paper VI: JWST/MIRI Uncovers a Large Population of Obscured AGN at High Redshifts",
    "authors": [
        "G. Yang",
        "K. I. Caputi",
        "C. Papovich",
        "P. Arrabal Haro",
        "M. B. Bagley",
        "P. Behroozi",
        "E. F. Bell",
        "L. Bisigello",
        "V. Buat",
        "D. Burgarella",
        "Y. Cheng",
        "N. J. Cleri",
        "R. Dave",
        "M. Dickinson",
        "D. Elbaz",
        "H. C. Ferguson",
        "S. L. Finkelstein",
        "N. A. Grogin",
        "N. P. Hathi",
        "M. Hirschmann",
        "B. W. Holwerda",
        "M. Huertas-Company",
        "T. Hutchison",
        "E. Iani",
        "J. S. Kartaltepe",
        "A. Kirkpatrick",
        "D. D. Kocevski",
        "A. M. Koekemoer",
        "V. Kokorev",
        "R. L. Larson",
        "R. A. Lucas",
        "P. G. Perez-Gonzalez",
        "P. Rinaldi",
        "L. Shen",
        "J. R. Trump",
        "A. de la Vega",
        "L. Y. A. Yung",
        "J. A. Zavala"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Mid-infrared observations are powerful in identifying heavily obscured Active Galactic Nuclei (AGN) which have weak emission in other wavelengths. The Mid-Infrared Instrument (MIRI) onboard JWST offers an excellent chance to perform such studies. We take advantage of the MIRI imaging data from the Cosmic Evolution Early Release Science Survey (CEERS) to investigate the AGN population in the distant universe. We estimate the source properties of MIRI-selected objects by utilizing spectral energy distribution (SED) modelling, and classify them into star-forming galaxies (SF), SF-AGN mixed objects, and AGN. The source numbers of these types are 418, 111, and 31, respectively, from 4 MIRI pointings covering $\\sim 9$ arcmin$^2$. The sample spans a redshift range of $\\approx 0$--5. We derive the median SEDs for all three source types, respectively, and publicly release them. The median MIRI SED of AGN is similar to the typical SEDs of hot dust-obscured galaxies and Seyfert 2s, for which the mid-IR SEDs are dominantly from AGN-heated hot dust. Based on our SED-fit results, we estimate the black-hole accretion density (BHAD; i.e., total BH growth rate per comoving volume) as a function of redshift. At $z<3$, the resulting BHAD agrees with the X-ray measurements in general. At $z>3$, we identify a total of 28 AGN and SF-AGN mixed objects, leading to that our high-$z$ BHAD is substantially higher than the X-ray results ($\\sim 1$ dex at $z \\approx 4$--5). This difference indicates MIRI can identify a large population of heavily obscured AGN missed by X-ray surveys at high redshifts.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11736v1"
    ],
    "publication_venue": "submitted to ApJ as part of the CEERS Focus Issue. 13 pages and 7 figures (median SEDs in Fig. 5 are available upon request)"
}