{
    "arxiv_id": "2303.10643",
    "paper_title": "Astrophysical and Cosmological Searches for Lorentz Invariance Violation",
    "authors": [
        "Shantanu Desai"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.CO",
        "astro-ph.HE",
        "gr-qc",
        "hep-ph"
    ],
    "abstract": "Lorentz invariance is one of the fundamental tenets of Special Relativity, and has been extensively tested with laboratory and astrophysical observations. However, many quantum gravity models and theories beyond the Standard Model of Particle Physics predict a violation of Lorentz invariance at energies close to Planck scale. This article reviews observational and experimental tests of Lorentz invariance violation (LIV) with photons, neutrinos and gravitational waves. Most astrophysical tests of LIV using photons are based on searching for a correlation of the spectral lag data with redshift and energy. These have been primarily carried out using compact objects such as pulsars, Active Galactic Nuclei (AGN), and Gamma-ray bursts (GRB). There have also been some claims for LIV from some of these spectral lag observations with GRBs, which however are in conflict with the most stringent limits obtained from other LIV searches. Searches have also been carried out using polarization measurements from GRBs and AGNs. For neutrinos, tests have been made using both astrophysical observations at MeV energies (from SN 1987A) as well as in the TeV-PeV energy range based on IceCube observations, atmospheric neutrinos, and long-baseline neutrino oscillation experiments. Cosmological tests of LIV entail looking for a constancy of the speed of light as a function of redshift using multiple observational probes, as well as looking for birefringence in Cosmic Microwave background observations. This article will review all of these aforementioned observational tests of LIV, including results which are in conflict with each other.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10643v1",
        "http://arxiv.org/pdf/2303.10643v2"
    ],
    "publication_venue": "32 pages. Added some references related to GWs. Invited chapter for the edited book {\\it Recent Progress on Gravity Tests: Challenges and Future Perspectives} (Eds. C. Bambi and A. Cárdenas-Avendaño, Springer Singapore, expected in 2023)"
}