{
    "arxiv_id": "2303.08053",
    "paper_title": "Scalable spin squeezing in a dipolar Rydberg atom array",
    "authors": [
        "Guillaume Bornet",
        "Gabriel Emperauger",
        "Cheng Chen",
        "Bingtian Ye",
        "Maxwell Block",
        "Marcus Bintz",
        "Jamie A. Boyd",
        "Daniel Barredo",
        "Tommaso Comparin",
        "Fabio Mezzacapo",
        "Tommaso Roscilde",
        "Thierry Lahaye",
        "Norman Y. Yao",
        "Antoine Browaeys"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "cond-mat.quant-gas",
        "physics.atom-ph"
    ],
    "abstract": "The standard quantum limit bounds the precision of measurements that can be achieved by ensembles of uncorrelated particles. Fundamentally, this limit arises from the non-commuting nature of quantum mechanics, leading to the presence of fluctuations often referred to as quantum projection noise. Quantum metrology relies on the use of non-classical states of many-body systems in order to enhance the precision of measurements beyond the standard quantum limit. To do so, one can reshape the quantum projection noise -- a strategy known as squeezing. In the context of many-body spin systems, one typically utilizes all-to-all interactions (e.g. the one-axis twisting model) between the constituents to generate the structured entanglement characteristic of spin squeezing. Motivated by recent theoretical work, here we explore the prediction that short-range interactions -- and in particular, the two-dimensional dipolar XY model -- can also enable the realization of scalable spin squeezing. Working with a dipolar Rydberg quantum simulator of up to 100 atoms, we demonstrate that quench dynamics from a polarized initial state lead to spin squeezing that improves with increasing system size up to a maximum of -3.5 dB (prior to correcting for detection errors, or approximately -5 dB after correction). Finally, we present two independent refinements: first, using a multistep spin-squeezing protocol allows us to further enhance the squeezing by approximately 1 dB, and second, leveraging Floquet engineering to realize Heisenberg interactions, we demonstrate the ability to extend the lifetime of the squeezed state by freezing its dynamics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08053v1"
    ],
    "publication_venue": "12 pages, 10 figures"
}