{
    "arxiv_id": "2303.13285",
    "paper_title": "Fourier Diffusion Models: A Method to Control MTF and NPS in Score-Based Stochastic Image Generation",
    "authors": [
        "Matthew Tivnan",
        "Jacopo Teneggi",
        "Tzu-Cheng Lee",
        "Ruoqiao Zhang",
        "Kirsten Boedeker",
        "Liang Cai",
        "Grace J. Gang",
        "Jeremias Sulam",
        "J. Webster Stayman"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "physics.med-ph",
        "physics.comp-ph"
    ],
    "abstract": "Score-based stochastic denoising models have recently been demonstrated as powerful machine learning tools for conditional and unconditional image generation. The existing methods are based on a forward stochastic process wherein the training images are scaled to zero over time and white noise is gradually added such that the final time step is approximately zero-mean identity-covariance Gaussian noise. A neural network is then trained to approximate the time-dependent score function, or the gradient of the logarithm of the probability density, for that time step. Using this score estimator, it is possible to run an approximation of the time-reversed stochastic process to sample new images from the training data distribution. These score-based generative models have been shown to out-perform generative adversarial neural networks using standard benchmarks and metrics. However, one issue with this approach is that it requires a large number of forward passes of the neural network. Additionally, the images at intermediate time steps are not useful, since the signal-to-noise ratio is low. In this work we present a new method called Fourier Diffusion Models which replaces the scalar operations of the forward process with shift-invariant convolutions and the additive white noise with additive stationary noise. This allows for control of MTF and NPS at intermediate time steps. Additionally, the forward process can be crafted to converge to the same MTF and NPS as the measured images. This way, we can model continuous probability flow from true images to measurements. In this way, the sample time can be used to control the tradeoffs between measurement uncertainty and generative uncertainty of posterior estimates. We compare Fourier diffusion models to existing scalar diffusion models and show that they achieve a higher level of performance and allow for a smaller number of time steps.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13285v1"
    ],
    "publication_venue": null
}