{
    "arxiv_id": "2303.08701",
    "paper_title": "New detection systems for an enhanced sensitivity in key stellar (n,$γ$) measurements",
    "authors": [
        "J. Lerendegui-Marco",
        "V. Babiano-Suárez",
        "J. Balibrea-Correa",
        "C. Domingo-Pardo",
        "I. Ladarescu",
        "A. Tarifeño-Saldivia",
        "V. Alcayne",
        "D. Cano-Ott",
        "E. González-Romero",
        "T. Martínez",
        "E. Mendoza",
        "C. Guerrero",
        "F. Calviño",
        "A. Casanovas",
        "U. Köster",
        "N. M. Chiera",
        "R. Dressler",
        "E. A. Maugeri",
        "D. Schumann",
        "the n_TOF Collaboration"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2024-10-18"
    ],
    "latest_version": 1,
    "categories": [
        "nucl-ex",
        "astro-ph.IM"
    ],
    "abstract": "Neutron capture cross-section measurements are fundamental in the study of astrophysical phenomena, such as the slow neutron capture (s-) process of nucleosynthesis operating in red-giant and massive stars. However, neutron capture measurements via the time-of-flight (TOF) technique on key $s$-process nuclei are often challenging. Difficulties arise from the limited mass ($\\sim$mg) available and the high sample-related background in the case of the unstable $s$-process branching points. Measurements on neutron magic nuclei, that act as $s$-process bottlenecks, are affected by low (n,$γ$) cross sections and a dominant neutron scattering background. Overcoming these experimental challenges requires the combination of facilities with high instantaneous flux, such as n\\_TOF-EAR2, with detection systems with an enhanced detection sensitivity and high counting rate capabilities. This contribution reviews some of the latest detector developments in detection systems for (n,$γ$) measurements at n\\_TOF, such as i-TED, an innovative detection system which exploits the Compton imaging technique to reduce the dominant neutron scattering background and s-TED, a highly segmented total energy detector intended for high flux facilities. The discussion will be illustrated with results of the first measurement of key the $s$-process branching-point reaction $^{79}$Se(n,$γ$).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08701v1"
    ],
    "publication_venue": "7 pages, 4 figures (8 panels). Accepted for publication in EPJ-WOC (proceedings of the NPA-X conference). arXiv admin note: text overlap with arXiv:2301.11199",
    "doi": "10.1051/epjconf/202327913001"
}