{
    "arxiv_id": "2303.14583",
    "paper_title": "Shear dispersion of multispecies electrolyte solutions in the channel domain",
    "authors": [
        "Lingyun Ding"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn",
        "math.AP",
        "physics.chem-ph"
    ],
    "abstract": "In multispecies electrolyte solutions, even in the absence of an external electric field, differences in ion diffusivities induce an electric potential and generate additional fluxes for each species. This electro-diffusion process is well-described by the advection-Nernst-Planck equation. This study aims to analyze the long-time behavior of the governing equation under the electroneutrality and zero current conditions and investigate how the diffusion-induced electric potential and the shear flow enhance the effective diffusion coefficients of each species in channel domains. To achieve this goal, the homogenization method was used to derive a reduced model of the advection-Nernst-Planck equation in the channel domain. There are several interesting properties of the effective equation. First, it is a generalization of the Taylor dispersion, with a nonlinear diffusion tensor replacing the scalar diffusion coefficient. Second, the effective equation reveals that the system without the flow is asymptotically equivalent to the system with a strong flow and scaled physical parameters. Furthermore, when the background concentration is much greater than the perturbed concentration, the effective equation reduces to a multidimensional diffusion equation, consistent with the classical Taylor dispersion theory. However, for zero background concentration, the ion-electric interaction results in several phenomena don't present in the advection-diffusion equation, including upstream migration of some species, spontaneous separation of ions, and non-monotonic dependence of the effective diffusivity on Péclet numbers. Last, the dependence of effective diffusivity on concentration and ion diffusivity suggests a method to infer the concentration ratio of each component and ion diffusivity by measuring the effective diffusivity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14583v1"
    ],
    "publication_venue": null
}