{
    "arxiv_id": "2303.11591",
    "paper_title": "SVCNet: Scribble-based Video Colorization Network with Temporal Aggregation",
    "authors": [
        "Yuzhi Zhao",
        "Lai-Man Po",
        "Kangcheng Liu",
        "Xuehui Wang",
        "Wing-Yin Yu",
        "Pengfei Xian",
        "Yujia Zhang",
        "Mengyang Liu"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV",
        "cs.MM"
    ],
    "abstract": "In this paper, we propose a scribble-based video colorization network with temporal aggregation called SVCNet. It can colorize monochrome videos based on different user-given color scribbles. It addresses three common issues in the scribble-based video colorization area: colorization vividness, temporal consistency, and color bleeding. To improve the colorization quality and strengthen the temporal consistency, we adopt two sequential sub-networks in SVCNet for precise colorization and temporal smoothing, respectively. The first stage includes a pyramid feature encoder to incorporate color scribbles with a grayscale frame, and a semantic feature encoder to extract semantics. The second stage finetunes the output from the first stage by aggregating the information of neighboring colorized frames (as short-range connections) and the first colorized frame (as a long-range connection). To alleviate the color bleeding artifacts, we learn video colorization and segmentation simultaneously. Furthermore, we set the majority of operations on a fixed small image resolution and use a Super-resolution Module at the tail of SVCNet to recover original sizes. It allows the SVCNet to fit different image resolutions at the inference. Finally, we evaluate the proposed SVCNet on DAVIS and Videvo benchmarks. The experimental results demonstrate that SVCNet produces both higher-quality and more temporally consistent videos than other well-known video colorization approaches. The codes and models can be found at https://github.com/zhaoyuzhi/SVCNet.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11591v1"
    ],
    "publication_venue": "under revision of IEEE Transactions on Image Processing"
}