{
    "arxiv_id": "2303.07925",
    "paper_title": "Deep incremental learning models for financial temporal tabular datasets with distribution shifts",
    "authors": [
        "Thomas Wong",
        "Mauricio Barahona"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-09-18"
    ],
    "latest_version": 9,
    "categories": [
        "cs.LG",
        "q-fin.MF"
    ],
    "abstract": "We present a robust deep incremental learning framework for regression tasks\non financial temporal tabular datasets which is built upon the incremental use\nof commonly available tabular and time series prediction models to adapt to\ndistributional shifts typical of financial datasets. The framework uses a\nsimple basic building block (decision trees) to build self-similar models of\nany required complexity to deliver robust performance under adverse situations\nsuch as regime changes, fat-tailed distributions, and low signal-to-noise\nratios. As a detailed study, we demonstrate our scheme using XGBoost models\ntrained on the Numerai dataset and show that a two layer deep ensemble of\nXGBoost models over different model snapshots delivers high quality predictions\nunder different market regimes. We also show that the performance of XGBoost\nmodels with different number of boosting rounds in three scenarios (small,\nstandard and large) is monotonically increasing with respect to model size and\nconverges towards the generalisation upper bound. We also evaluate the\nrobustness of the model under variability of different hyperparameters, such as\nmodel complexity and data sampling settings. Our model has low hardware\nrequirements as no specialised neural architectures are used and each base\nmodel can be independently trained in parallel.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07925v1",
        "http://arxiv.org/pdf/2303.07925v2",
        "http://arxiv.org/pdf/2303.07925v3",
        "http://arxiv.org/pdf/2303.07925v4",
        "http://arxiv.org/pdf/2303.07925v5",
        "http://arxiv.org/pdf/2303.07925v6",
        "http://arxiv.org/pdf/2303.07925v7",
        "http://arxiv.org/pdf/2303.07925v8",
        "http://arxiv.org/pdf/2303.07925v9"
    ],
    "publication_venue": null
}