{
    "arxiv_id": "2303.09915",
    "paper_title": "Privacy-preserving Pedestrian Tracking using Distributed 3D LiDARs",
    "authors": [
        "Masakazu Ohno",
        "Riki Ukyo",
        "Tatsuya Amano",
        "Hamada Rizk",
        "Hirozumi Yamaguchi"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV",
        "cs.HC"
    ],
    "abstract": "The growing demand for intelligent environments unleashes an extraordinary cycle of privacy-aware applications that makes individuals' life more comfortable and safe. Examples of these applications include pedestrian tracking systems in large areas. Although the ubiquity of camera-based systems, they are not a preferable solution due to the vulnerability of leaking the privacy of pedestrians.In this paper, we introduce a novel privacy-preserving system for pedestrian tracking in smart environments using multiple distributed LiDARs of non-overlapping views. The system is designed to leverage LiDAR devices to track pedestrians in partially covered areas due to practical constraints, e.g., occlusion or cost. Therefore, the system uses the point cloud captured by different LiDARs to extract discriminative features that are used to train a metric learning model for pedestrian matching purposes. To boost the system's robustness, we leverage a probabilistic approach to model and adapt the dynamic mobility patterns of individuals and thus connect their sub-trajectories.We deployed the system in a large-scale testbed with 70 colorless LiDARs and conducted three different experiments. The evaluation result at the entrance hall confirms the system's ability to accurately track the pedestrians with a 0.98 F-measure even with zero-covered areas. This result highlights the promise of the proposed system as the next generation of privacy-preserving tracking means in smart environments.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09915v1",
        "http://arxiv.org/pdf/2303.09915v2"
    ],
    "publication_venue": "Accepted to the 21st International Conference on Pervasive Computing and Communications (PerCom 2023)"
}