{
    "arxiv_id": "2303.15896",
    "paper_title": "Efficient Quality Diversity Optimization of 3D Buildings through 2D Pre-optimization",
    "authors": [
        "Alexander Hagg",
        "Martin L. Kliemank",
        "Alexander Asteroth",
        "Dominik Wilde",
        "Mario C. Bedrunka",
        "Holger Foysi",
        "Dirk Reith"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cs.NE",
        "cs.LG"
    ],
    "abstract": "Quality diversity algorithms can be used to efficiently create a diverse set of solutions to inform engineers' intuition. But quality diversity is not efficient in very expensive problems, needing 100.000s of evaluations. Even with the assistance of surrogate models, quality diversity needs 100s or even 1000s of evaluations, which can make it use infeasible. In this study we try to tackle this problem by using a pre-optimization strategy on a lower-dimensional optimization problem and then map the solutions to a higher-dimensional case. For a use case to design buildings that minimize wind nuisance, we show that we can predict flow features around 3D buildings from 2D flow features around building footprints. For a diverse set of building designs, by sampling the space of 2D footprints with a quality diversity algorithm, a predictive model can be trained that is more accurate than when trained on a set of footprints that were selected with a space-filling algorithm like the Sobol sequence. Simulating only 16 buildings in 3D, a set of 1024 building designs with low predicted wind nuisance is created. We show that we can produce better machine learning models by producing training data with quality diversity instead of using common sampling techniques. The method can bootstrap generative design in a computationally expensive 3D domain and allow engineers to sweep the design space, understanding wind nuisance in early design phases.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15896v1"
    ],
    "publication_venue": "This is the final version and has been accepted for publication in Evolutionary Computation (MIT Press)"
}