{
    "arxiv_id": "2303.09256",
    "paper_title": "Effect of carbon content on electronic structure of uranium carbides",
    "authors": [
        "S. M. Butorin",
        "S. Bauters",
        "L. Amidani",
        "A. Beck",
        "A. Rossberg",
        "S. Weiss",
        "T. Vitova",
        "K. O. Kvashnina",
        "O. Tougait"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph",
        "cond-mat.mtrl-sci",
        "cond-mat.str-el",
        "physics.app-ph"
    ],
    "abstract": "The electronic structure of UC$_x$ (x=0.9, 1.0, 1.1, 2.0) was studied by means of x-ray absorption spectroscopy (XAS) at the C $K$ edge and measurements in the high energy resolution fluorescence detection (HERFD) mode at the U $M_4$ and $L_3$ edges. The full-relativistic density functional theory calculations taking into account the $5f-5f$ Coulomb interaction $U$ and spin-orbit coupling (DFT+$U$+SOC) were also performed for UC and UC$_2$. While the U $L_3$ HERFD-XAS spectra of the studied samples reveal little difference, the U $M_4$ HERFD-XAS spectra show certain sensitivity to the varying carbon content in uranium carbides. The observed gradual changes in the U $M_4$ HERFD spectra suggest an increase in the C $2p$-U $5f$ charge transfer, which is supported by the orbital population analysis in the DFT+$U$+SOC calculations, indicating an increase in the U $5f$ occupancy in UC$_2$ as compared to that in UC. On the other hand, the density of states at the Fermi level were found to be significantly lower in UC$_2$, thus affecting the thermodynamic properties. Both the x-ray spectroscopic data (in particular, the C $K$ XAS measurements) and results of the DFT+$U$+SOC indicate the importance of taking into account $U$ and SOC for the description of the electronic structure of actinide carbides.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09256v1"
    ],
    "publication_venue": null
}