{
    "arxiv_id": "2303.12237",
    "paper_title": "Automated deep learning segmentation of high-resolution 7 T ex vivo MRI for quantitative analysis of structure-pathology correlations in neurodegenerative diseases",
    "authors": [
        "Pulkit Khandelwal",
        "Michael Tran Duong",
        "Shokufeh Sadaghiani",
        "Sydney Lim",
        "Amanda Denning",
        "Eunice Chung",
        "Sadhana Ravikumar",
        "Sanaz Arezoumandan",
        "Claire Peterson",
        "Madigan Bedard",
        "Noah Capp",
        "Ranjit Ittyerah",
        "Elyse Migdal",
        "Grace Choi",
        "Emily Kopp",
        "Bridget Loja",
        "Eusha Hasan",
        "Jiacheng Li",
        "Karthik Prabhakaran",
        "Gabor Mizsei",
        "Marianna Gabrielyan",
        "Theresa Schuck",
        "Winifred Trotman",
        "John Robinson",
        "Daniel Ohm",
        "Edward B. Lee",
        "John Q. Trojanowski",
        "Corey McMillan",
        "Murray Grossman",
        "David J. Irwin",
        "John Detre",
        "M. Dylan Tisdall",
        "Sandhitsu R. Das",
        "Laura E. M. Wisse",
        "David A. Wolk",
        "Paul A. Yushkevich"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV",
        "cs.AI"
    ],
    "abstract": "Ex vivo MRI of the brain provides remarkable advantages over in vivo MRI for visualizing and characterizing detailed neuroanatomy, and helps to link microscale histology studies with morphometric measurements. However, automated segmentation methods for brain mapping in ex vivo MRI are not well developed, primarily due to limited availability of labeled datasets, and heterogeneity in scanner hardware and acquisition protocols. In this work, we present a high resolution dataset of 37 ex vivo post-mortem human brain tissue specimens scanned on a 7T whole-body MRI scanner. We developed a deep learning pipeline to segment the cortical mantle by benchmarking the performance of nine deep neural architectures. We then segment the four subcortical structures: caudate, putamen, globus pallidus, and thalamus; white matter hyperintensities, and the normal appearing white matter. We show excellent generalizing capabilities across whole brain hemispheres in different specimens, and also on unseen images acquired at different magnetic field strengths and different imaging sequence. We then compute volumetric and localized cortical thickness measurements across key regions, and link them with semi-quantitative neuropathological ratings. Our code, containerized executables, and the processed datasets are publicly available at: https://github.com/Pulkit-Khandelwal/upenn-picsl-brain-ex-vivo.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12237v1"
    ],
    "publication_venue": "Preprint submitted to NeuroImage Project website: https://github.com/Pulkit-Khandelwal/upenn-picsl-brain-ex-vivo"
}