{
    "arxiv_id": "2303.09565",
    "paper_title": "A SysML-based language for evaluating digital twin software reusability in cyber-physical system structure",
    "authors": [
        "Wojciech Dudek",
        "Narcis Miguel",
        "Tomasz Winiarski"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2024-12-17"
    ],
    "latest_version": 6,
    "categories": [
        "cs.SE",
        "cs.AR",
        "cs.MA",
        "cs.RO",
        "eess.SY"
    ],
    "abstract": "Evaluating early design concepts is crucial as it impacts quality and cost. This process is often hindered by vague and uncertain design information. This article introduces the SysML-based Simulated-Physical Systems Modeling Language (SPSysML). It is a Domain-Specification Language for evaluating component reusability in Cyber-Physical Systems incorporating Digital Twins and other simulated parts. The proposed factors assess the design quantitatively. SPSysML uses a requirement-based system structuring method to couple simulated and physical parts with requirements. SPSysML enables DTs to perceive exogenous actions in the simulated world.\n  SPSysML validation is survey- and application-based. First, we develop a robotic system for an assisted living project. As a result of the SPSysML application, we observed an integrity improvement between the simulated and physical parts of the system. Thus, more system components are shared between the simulated and physical setups. The system was deployed on the physical robot and two simulators based on ROS and ROS2. Additionally, we share a questionnaire for SPSysML assessment. The feedback that we already received is published in this article.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09565v1",
        "http://arxiv.org/pdf/2303.09565v2",
        "http://arxiv.org/pdf/2303.09565v3",
        "http://arxiv.org/pdf/2303.09565v4",
        "http://arxiv.org/pdf/2303.09565v5",
        "http://arxiv.org/pdf/2303.09565v6"
    ],
    "publication_venue": "This work has been submitted to the Elsevier Robotics and Autonomous Systems Journal",
    "doi": "10.1016/j.robot.2024.104884"
}