{
    "arxiv_id": "2303.13181",
    "paper_title": "Partially Fault-tolerant Quantum Computing Architecture with Error-corrected Clifford Gates and Space-time Efficient Analog Rotations",
    "authors": [
        "Yutaro Akahoshi",
        "Kazunori Maruyama",
        "Hirotaka Oshima",
        "Shintaro Sato",
        "Keisuke Fujii"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2024-08-28"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Quantum computers are expected to bring drastic acceleration to several computing tasks against classical computers. Noisy intermediate-scale quantum (NISQ) devices, which have tens to hundreds of noisy physical qubits, are gradually becoming available, but it is still challenging to achieve useful quantum advantages in meaningful tasks at this moment. On the other hand, the full fault-tolerant quantum computing (FTQC) based on the quantum error correction (QEC) code remains far beyond realization due to its extremely large requirement of high-precision physical qubits. In this study, we propose a quantum computing architecture to close the gap between NISQ and FTQC. Our architecture is based on erroneous arbitrary rotation gates and error-corrected Clifford gates implemented by lattice surgery. We omit the typical distillation protocol to achieve direct analog rotations and small qubit requirements, and minimize the remnant errors of the rotations by a carefully-designed state injection protocol. Our estimation based on numerical simulations shows that, for early-FTQC devices that consist of $10^4$ physical qubits with physical error probability $p = 10^{-4}$, we can perform roughly $1.72 \\times 10^7$ Clifford operations and $3.75 \\times 10^4$ arbitrary rotations on 64 logical qubits. Such computations cannot be realized by the existing NISQ and FTQC architectures on the same device, as well as classical computers. We hope that our proposal and the corresponding development of quantum algorithms based on it bring new insights on realization of practical quantum computers in future.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13181v1"
    ],
    "publication_venue": "20 pages, 28 figures",
    "doi": "10.1103/PRXQuantum.5.010337"
}