{
    "arxiv_id": "2303.08107",
    "paper_title": "Linking social network structure and function to social preferences",
    "authors": [
        "Josefine Bohr Brask",
        "Andreas Koher",
        "Darren P. Croft",
        "Sune Lehmann"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "physics.soc-ph",
        "cs.SI",
        "q-bio.PE"
    ],
    "abstract": "Social network structures play an important role in the lives of humans and non-human animals by affecting wellbeing, the spread of disease and information, and evolutionary processes. Nevertheless, we still lack a good understanding of how these structures emerge from individual behaviour. Here we present a general model for the emergence of social structures, which is based on a key aspect of real social systems observed across species, namely social preferences for traits (individual characteristics such as age, sex, etc.). We first show that the model can generate diverse artificial social structures, and consider its potential for being combined with real network data. We then use the model to gain fundamental insights into how two main categories of social preferences (similarity and popularity) affect social structure and function. The results show that the types of social preference, in combination with the types of trait they are used with, can have important consequences for the spread of information and disease, and the robustness of social structures against fragmentation. The results also suggest that symmetric degree distributions could be expected to be common in social networks. More generally, the study implies that trait-based social preferences can have consequences for social systems that go far beyond their effect on direct benefits from social partners. We discuss the implications of the results for social evolution.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08107v1"
    ],
    "publication_venue": "19 pages, + 16 pages supplementary material. 4 figures, + 11 supplementary figures"
}