{
    "arxiv_id": "2303.15030",
    "paper_title": "Effective Temperature Estimations from Line Depth Ratios in the \\H\\ and \\K-band Spectra of IGRINS",
    "authors": [
        "Melike Afşar",
        "Zeynep Bozkurt",
        "Gamze Böcek Topcu",
        "Sergen Özdemir",
        "Christopher Sneden",
        "Gregory N. Mace",
        "Daniel T. Jaffe",
        "Ricardo López-Valdivia"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "Determining accurate effective temperatures of stars buried in the dust-obscured Galactic regions is extremely difficult from photometry. Fortunately, high-resolution infrared spectroscopy is a powerful tool for determining the temperatures of stars with no dependence on interstellar extinction. It has long been known that the depth ratios of temperature-sensitive and relatively insensitive spectral lines are excellent temperature indices. In this work, we provide the first extensive line depth ratio (LDR) method application in the infrared region that encompasses both \\H\\ and \\K\\ bands (1.48 $μ$m - 2.48 $μ$m). We applied the LDR method to high-resolution (R $\\simeq$ 45,000) \\H\\ and \\K-band spectra of 110 stars obtained with the Immersion Grating Infrared Spectrograph (IGRINS). Our sample contained stars with 3200 $<$ \\teff\\ (K) $<$ 5500, 0.20 $\\leq$ log g $<$ 4.6, and $-$1.5 $<$ [M/H] $<$ 0.5. Application of this method in the \\K-band yielded 21 new LDR$-$\\teff\\ relations. We also report five new LDR$-$\\teff\\ relations found in the \\H-band region, augmenting the relations already published by other groups. The temperatures found from our calibrations provide reliable temperatures within $\\sim$70 K accuracy compared to spectral \\teff\\ values from the literature.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15030v1"
    ],
    "publication_venue": "4 Tables, 8 Figures, Accepted for publication in The Astrophysical Journal",
    "doi": "10.3847/1538-4357/acc946"
}