{
    "arxiv_id": "2303.10217",
    "paper_title": "Quantifying Space-Time Load Shifting Flexibility in Electricity Markets",
    "authors": [
        "Weiqi Zhang",
        "Victor M. Zavala"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY",
        "math.OC"
    ],
    "abstract": "The power grid is undergoing significant restructuring driven by the adoption of wind/solar power and the incorporation of new flexible technologies that can shift load in space and time (e.g., data centers, battery storage, and modular manufacturing). Load shifting is needed to mitigate space-time fluctuations associated with wind/solar power and other disruptions (e.g., extreme weather). The impact of load shifting on electricity markets is typically quantified via sensitivity analysis, which aims to assess impacts in terms of price volatility and total welfare. This sensitivity approach does not explicitly quantify operational flexibility (e.g., range or probability of feasible operation). In this work, we present a computational framework to enable this; specifically, we quantify operational flexibility by assessing how much uncertainty in net loads (which capture uncertain power injections/withdrawals) can be tolerated by the system under varying levels of load shifting capacity. The proposed framework combines optimization formulations that quantify operational flexibility with power grid models that capture load shifting in the form of virtual links (pathways that transfer load across space-time). Our case studies reveal that adding a single virtual link that shifts load in either space or time can lead to dramatic improvements in system-wide flexibility; this is because shifting relieves space-time congestion that results from transmission constraints and generator ramping constraints. Our results provide insights into how the incorporation of flexible technologies can lead to non-intuitive, system-wide gains in flexibility.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10217v1"
    ],
    "publication_venue": "20 pages, 11 figures"
}