{
    "arxiv_id": "2303.08246",
    "paper_title": "Insulators at Fractional Fillings in Twisted Bilayer Graphene Partially Aligned to Hexagonal Boron Nitride",
    "authors": [
        "Dillon Wong",
        "Kevin P. Nuckolls",
        "Myungchul Oh",
        "Ryan L. Lee",
        "Kenji Watanabe",
        "Takashi Taniguchi",
        "Ali Yazdani"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-07-12"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "At partial fillings of its flat electronic bands, magic-angle twisted bilayer graphene (MATBG) hosts a rich variety of competing correlated phases that show sample to sample variations. Divergent phase diagrams in MATBG are often attributed to the sublattice polarization energy scale, tuned by the degree of alignment of the hexagonal boron nitride (hBN) substrates typically used in van der Waals devices. Unaligned MATBG exhibits unconventional superconductivity and correlated insulating phases, while nearly perfectly aligned MATBG/hBN exhibits zero-field Chern insulating phases and lacks superconductivity. Here we use scanning tunneling microscopy and spectroscopy (STM/STS) to observe gapped phases at partial fillings of the flat bands of MATBG in a new intermediate regime of sublattice polarization, observed when MATBG is only partially aligned ($θ_{Gr-hBN}$ $\\approx$ 1.65$^\\circ$) to the underlying hBN substrate. Under this condition, MATBG hosts not only phenomena that naturally interpolate between the two sublattice potential limits, but also unexpected gapped phases absent in either of these limits. At charge neutrality, we observe an insulating phase with a small energy gap ($Δ$ < 5 meV) likely related to weak sublattice symmetry breaking from the hBN substrate. In addition, we observe new gapped phases near fractional fillings $ν$ = $\\pm 1/3$ and $ν$ = $\\pm 1/6$, which have not been previously observed in MATBG. Importantly, energy-resolved STS unambiguously identifies these fractional filling states to be of single-particle origin, possibly a result of the super-superlattice formed by two moiré superlattices. Our observations emphasize the power of STS in distinguishing single-particle gapped phases from many-body gapped phases in situations that could be easily confused in electrical transport measurements.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08246v1"
    ],
    "publication_venue": "4 figures",
    "doi": "10.1063/10.0019422"
}