{
    "arxiv_id": "2303.11422",
    "paper_title": "Hyperfine interactions in open-shell planar $sp^2$-carbon nanostructures",
    "authors": [
        "Sanghita Sengupta",
        "Thomas Frederiksen",
        "Geza Giedke"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-07-04"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "We investigate hyperfine interaction (HFI) using density-functional theory for several open-shell planar $sp^2$-carbon nanostructures displaying $π$ magnetism. Our prototype structures include both benzenoid ([$n$]triangulenes and a graphene nanoribbon) as well as non-benzenoid (indene, fluorene, and indene[2,1-b]fluorene) molecules. Our results obtained with ORCA indicate that isotropic Fermi contact and anisotropic dipolar terms contribute in comparable strength, rendering the HFI markedly anisotropic. We find that the magnitude of HFI in these molecules can reach more than 100 MHz, thereby opening up the possibility of experimental detection via methods such as electron spin resonance-scanning tunneling microscopy (ESR-STM). Additionally, we use empirical models based on $π$-spin polarization at carbon sites to provide generic $sp^2$ HFI fit parameters for these classes of molecules using methods such as ORCA, SIESTA and mean-field Hubbard (MFH) models that successfully describe the Fermi contact and dipolar contributions for $^{13}$C and $^{1}$H nuclei. These fit parameters allow to obtain hyperfine tensors for large systems where existing methodology is not suitable or computationally too expensive. As an example, we show how HFI scales with system size in [$n$]triangulenes for large $n$ using MFH. We also discuss some implications of HFI for electron-spin decoherence and for coherent nuclear dynamics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11422v1"
    ],
    "publication_venue": "19 pages, 8 figures",
    "doi": "10.1103/PhysRevB.107.224433"
}