{
    "arxiv_id": "2303.08744",
    "paper_title": "Towards Phytoplankton Parasite Detection Using Autoencoders",
    "authors": [
        "Simon Bilik",
        "Daniel Baktrakhanov",
        "Tuomas Eerola",
        "Lumi Haraguchi",
        "Kaisa Kraft",
        "Silke Van den Wyngaert",
        "Jonna Kangas",
        "Conny Sjöqvist",
        "Karin Madsen",
        "Lasse Lensu",
        "Heikki Kälviäinen",
        "Karel Horak"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV",
        "cs.AI"
    ],
    "abstract": "Phytoplankton parasites are largely understudied microbial components with a potentially significant ecological impact on phytoplankton bloom dynamics. To better understand their impact, we need improved detection methods to integrate phytoplankton parasite interactions in monitoring aquatic ecosystems. Automated imaging devices usually produce high amount of phytoplankton image data, while the occurrence of anomalous phytoplankton data is rare. Thus, we propose an unsupervised anomaly detection system based on the similarity of the original and autoencoder-reconstructed samples. With this approach, we were able to reach an overall F1 score of 0.75 in nine phytoplankton species, which could be further improved by species-specific fine-tuning. The proposed unsupervised approach was further compared with the supervised Faster R-CNN based object detector. With this supervised approach and the model trained on plankton species and anomalies, we were able to reach the highest F1 score of 0.86. However, the unsupervised approach is expected to be more universal as it can detect also unknown anomalies and it does not require any annotated anomalous data that may not be always available in sufficient quantities. Although other studies have dealt with plankton anomaly detection in terms of non-plankton particles, or air bubble detection, our paper is according to our best knowledge the first one which focuses on automated anomaly detection considering putative phytoplankton parasites or infections.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08744v1"
    ],
    "publication_venue": null
}