{
    "arxiv_id": "2303.14699",
    "paper_title": "Mobile solutions for clinical surveillance and evaluation in infancy -- General Movement Apps",
    "authors": [
        "Peter B Marschik",
        "Amanda KL Kwong",
        "Nelson Silva",
        "Joy E Olsen",
        "Martin Schulte-Ruether",
        "Sven Bolte",
        "Maria Ortqvist",
        "Abbey Eeles",
        "Luise Poustka",
        "Christa Einspieler",
        "Karin Nielsen-Saines",
        "Dajie Zhang",
        "Alicia J Spittle"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.HC",
        "cs.CY",
        "cs.SE"
    ],
    "abstract": "The Prechtl General Movements Assessment (GMA) has become a clinician and researcher tool-box for evaluating neurodevelopment in early infancy. Given it involves observation of infant movements from video recordings, utilising smartphone applications to obtain these recordings seems like the natural progression for the field. In this review, we look back on the development of apps for acquiring general movement videos, describe the application and research studies of available apps, and discuss future directions of mobile solutions and their usability in research and clinical practice. We emphasise the importance of understanding the background that has led to these developments while introducing new technologies, including the barriers and facilitators along the pathway. The GMApp and Baby Moves App were the first ones developed to increase accessibility of the GMA, with two further apps, NeuroMotion and InMotion, designed since. The Baby Moves app has been applied most frequently. For the mobile future of GMA, we advocate collaboration to boost the field's progression and to reduce research waste. We propose future collaborative solutions including standardisation of cross-sites data collection, adaption to local context and privacy laws, employment of user feedback, and sustainable IT structures enabling continuous software updating.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14699v1"
    ],
    "publication_venue": "19 pages, 3 Figures, 2 Tables"
}