{
    "arxiv_id": "2303.14223",
    "paper_title": "Machine Guided Discovery of Novel Carbon Capture Solvents",
    "authors": [
        "James L. McDonagh",
        "Benjamin H. Wunsch",
        "Stamatia Zavitsanou",
        "Alexander Harrison",
        "Bruce Elmegreen",
        "Stacey Gifford",
        "Theodore van Kessel",
        "Flaviu Cipcigan"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG"
    ],
    "abstract": "The increasing importance of carbon capture technologies for deployment in remediating CO2 emissions, and thus the necessity to improve capture materials to allow scalability and efficiency, faces the challenge of materials development, which can require substantial costs and time. Machine learning offers a promising method for reducing the time and resource burdens of materials development through efficient correlation of structure-property relationships to allow down-selection and focusing on promising candidates. Towards demonstrating this, we have developed an end-to-end \"discovery cycle\" to select new aqueous amines compatible with the commercially viable acid gas scrubbing carbon capture. We combine a simple, rapid laboratory assay for CO2 absorption with a machine learning based molecular fingerprinting model approach. The prediction process shows 60% accuracy against experiment for both material parameters and 80% for a single parameter on an external test set. The discovery cycle determined several promising amines that were verified experimentally, and which had not been applied to carbon capture previously. In the process we have compiled a large, single-source data set for carbon capture amines and produced an open source machine learning tool for the identification of amine molecule candidates (https://github.com/IBM/Carbon-capture-fingerprint-generation).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14223v1"
    ],
    "publication_venue": "21 single-column pages (LaTex article), 8 figures, 2 tables, separate ESI"
}