{
    "arxiv_id": "2303.11738",
    "paper_title": "Quiet Sun flux rope formation via incomplete Taylor relaxation",
    "authors": [
        "Rebecca Robinson",
        "Guillaume Aulanier",
        "Mats Carlsson"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Low-altitude twisted magnetic fields may be relevant to atmospheric heating in the quiet Sun, but the exact role, topology, and formation of these twisted fields remains to be studied. We investigate the formation and evolution of a preflare flux rope in a stratified, 3D MHD simulation. One puzzle is that this modelled flux rope does not form by the usual mechanisms at work in larger flares such as flux emergence, flux cancellation, or tether-cutting. Using Lagrangian markers to trace representative field lines, we follow the spatiotemporal evolution of the flux rope. We isolate flux bundles associated with reconnecting field line pairs by focusing on thin current sheets within the flux system. We also analyze the time-varying distribution of the force-free parameter as the rope relaxes. Lastly, we compare different seeding methods for magnetic fields and discuss their relevance. We show that the modeled flux rope is gradually built from coalescing, current-carrying flux tubes. This occurs through a series of component reconnections that are driven by flows in the underlying convection zone. These reconnections lead to an inverse cascade of helicity from small to larger scales. We also find that the system attempts to relax toward a linear force-free field, but that the convective drivers and eventual nanoflare prevent full relaxation. Using a self-consistently driven simulation of a nanoflare event, we show for the first time an inverse helicity cascade tending toward a Taylor relaxation in the Sun's corona, resulting in a well-ordered flux rope that later reconnects with surrounding fields. This provides clues toward understanding the buildup of nanoflare events in the quiet Sun through incomplete Taylor relaxations when no flux emergence or cancellation is observed.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11738v1"
    ],
    "publication_venue": null,
    "doi": "10.1051/0004-6361/202346065"
}