{
    "arxiv_id": "2303.12617",
    "paper_title": "Absence of topological protection of the interface states in $\\mathbb{Z}_2$ photonic crystals",
    "authors": [
        "Shupeng Xu",
        "Yuhui Wang",
        "Ritesh Agarwal"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-08-02"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.optics"
    ],
    "abstract": "Inspired from electronic systems, topological photonics aims to engineer new optical devices with robust properties. In many cases, the ideas from topological phases protected by internal symmetries in fermionic systems are extended to those protected by crystalline symmetries. One such popular photonic crystal model was proposed by Wu and Hu in 2015 for realizing a bosonic $\\mathbb{Z}_2$ topological crystalline insulator with robust topological edge states, which led to intense theoretical and experimental studies. However, rigorous relationship between the bulk topology and edge properties for this model, which is central to evaluating its advantage over traditional photonic designs, has never been established. In this work we revisit the expanded and shrunken honeycomb lattice structures proposed by Wu and Hu by using topological quantum chemistry tools and show that they are topologically trivial in the sense that symmetric, localized Wannier functions can be constructed. We show that the $\\mathbb{Z}$ and $\\mathbb{Z}_2$ type classification of the Wu-Hu model are equivalent to the $C_2T$ protected Euler class and the second Stiefel-Whitney class respectively, with the latter characterizing the full valence bands of Wu-Hu model indicating only a higher order topological insulator (HOTI) phase. We show that the Wu-Hu interface states can be gapped by a uniform topology preserving $C_6$ and $T$ symmetric perturbation, which demonstrates the trivial nature of the interface. Our results reveals that topology is not a necessary condition for the reported helical edge states in many photonics systems and opens new possibilities for interface engineering that may not be constrained to require topological designs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12617v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevLett.131.053802"
}