{
    "arxiv_id": "2303.10408",
    "paper_title": "ExplainFix: Explainable Spatially Fixed Deep Networks",
    "authors": [
        "Alex Gaudio",
        "Christos Faloutsos",
        "Asim Smailagic",
        "Pedro Costa",
        "Aurelio Campilho"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
    ],
    "abstract": "Is there an initialization for deep networks that requires no learning? ExplainFix adopts two design principles: the \"fixed filters\" principle that all spatial filter weights of convolutional neural networks can be fixed at initialization and never learned, and the \"nimbleness\" principle that only few network parameters suffice. We contribute (a) visual model-based explanations, (b) speed and accuracy gains, and (c) novel tools for deep convolutional neural networks. ExplainFix gives key insights that spatially fixed networks should have a steered initialization, that spatial convolution layers tend to prioritize low frequencies, and that most network parameters are not necessary in spatially fixed models. ExplainFix models have up to 100x fewer spatial filter kernels than fully learned models and matching or improved accuracy. Our extensive empirical analysis confirms that ExplainFix guarantees nimbler models (train up to 17\\% faster with channel pruning), matching or improved predictive performance (spanning 13 distinct baseline models, four architectures and two medical image datasets), improved robustness to larger learning rate, and robustness to varying model size. We are first to demonstrate that all spatial filters in state-of-the-art convolutional deep networks can be fixed at initialization, not learned.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10408v1"
    ],
    "publication_venue": "Recently Published in Wiley WIREs Journal of Data Mining and Knowledge Discovery. This version has minor formatting differences and includes the supplementary appendix with the main document. Source code: https://github.com/adgaudio/ExplainFix/",
    "doi": "10.1002/widm.1483"
}