{
    "arxiv_id": "2303.14137",
    "paper_title": "Classification of blazar candidates of unknown type in Fermi 4LAC by unanimous voting from multiple Machine Learning Algorithms",
    "authors": [
        "Aditi Agarwal"
    ],
    "submission_date": "2023-03-13",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The Fermi fourth catalog of active galactic nuclei (AGNs) data release 3 (4LAC-DR3) contains 3407 AGNs, out of which 755 are flat spectrum radio quasars (FSRQs), 1379 are BL Lacertae objects (BL Lacs), 1208 are blazars of unknown (BCUs) type, while 65 are non AGNs. Accurate categorization of many unassociated blazars still remains a challenge due to the lack of sufficient optical spectral information. The aim of this work is to use high-precision, optimized machine learning (ML) algorithms to classify BCUs into BL Lacs and FSRQs. To address this, we selected the 4LAC-DR3 Clean sample (i.e., sources with no analysis flags) containing 1115 BCUs. We employ five different supervised ML algorithms, namely, random forest, logistic regression, XGBoost, CatBoost, and neural network with seven features: Photon index, synchrotron-peak frequency, Pivot Energy, Photon index at Pivot\\_Energy, Fractional variability, $νFν$ at synchrotron-peak frequency, and Variability index. Combining results from all models leads to better accuracy and more robust predictions. These five methods together classified 610 BCUs as BL Lacs and 333 BCUs as FSRQs with a classification metric area under the curve $>$ 0.96. Our results are significantly compatible with recent studies as well. The output from this study provides a larger blazar sample with many new targets that could be used for forthcoming multi-wavelength surveys. This work can be further extended by adding features in X-rays, UV, visible, and radio wavelengths.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14137v1"
    ],
    "publication_venue": "22 pages, 10 figures, 3 tables, Accepted in ApJ",
    "doi": "10.3847/1538-4357/acbdfa"
}