{
    "arxiv_id": "2303.15675",
    "paper_title": "The impact of dust evolution on the dead zone outer edge in magnetized protoplanetary disks",
    "authors": [
        "Timmy N. Delage",
        "Matías Gárate",
        "Satoshi Okuzumi",
        "Chao-Chin Yang",
        "Paola Pinilla",
        "Mario Flock",
        "Sebastian Markus Stammler",
        "Tilman Birnstiel"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
    ],
    "abstract": "[Abridged] Aims. We provide an important step toward a better understanding of the magnetorotational instability (MRI)-dust coevolution in protoplanetary disks by presenting a proof of concept that dust evolution ultimately plays a crucial role in the MRI activity. Methods. First, we study how a fixed power-law dust size distribution with varying parameters impacts the MRI activity, especially the steady-state MRI-driven accretion, by employing and improving our previous 1+1D MRI-driven turbulence model. Second, we relax the steady-state accretion assumption in this disk accretion model, and partially couple it to a dust evolution model in order to investigate how the evolution of dust (dynamics and grain growth processes combined) and MRI-driven accretion are intertwined on million-year timescales. Results. Dust coagulation and settling lead to a higher gas ionization degree in the protoplanetary disk, resulting in stronger MRI-driven turbulence as well as a more compact dead zone. On the other hand, fragmentation has an opposite effect because it replenishes the disk in small dust particles. Since the dust content of the disk decreases over million years of evolution due to radial drift, the MRI-driven turbulence overall becomes stronger and the dead zone more compact until the disk dust-gas mixture eventually behaves as a grain-free plasma. Furthermore, our results show that dust evolution alone does not lead to a complete reactivation of the dead zone. Conclusions. The MRI activity evolution (hence the temporal evolution of the MRI-induced $α$-parameter) is controlled by dust evolution and occurs on a timescale of local dust growth, as long as there is enough dust particles in the disk to dominate the recombination process for the ionization chemistry. Once it is no longer the case, it is expected to be controlled by gas evolution and occurs on a viscous evolution timescale.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15675v1"
    ],
    "publication_venue": "23 pages, 13 figures, Accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202244731"
}