{
    "arxiv_id": "2303.12894",
    "paper_title": "Signatures of a quantum phase transition on a single-mode bosonic model",
    "authors": [
        "Emmanouil Grigoriou",
        "Carlos Navarrete-Benlloch"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "cond-mat.quant-gas"
    ],
    "abstract": "Equilibrium phase transitions usually emerge from the microscopic behavior of many-body systems and are associated to interesting phenomena such as the generation of long-range order and spontaneous symmetry breaking. They can be defined through the non-analytic behavior of thermodynamic potentials in the thermodynamic limit. This limit is obtained when the number of available configurations of the system approaches infinity, which is conventionally associated to spatially-extended systems formed by an infinite number of degrees of freedom (infinite number of particles or modes). Taking previous ideas to the extreme, we argue that such a limit can be defined even in non-extended systems, providing a specific example in the simplest form of a single-mode bosonic Hamiltonian. In contrast to previous non-extended models, the simplicity of our model allows us to find approximate analytical expressions that can be confronted with precise numerical simulations in all the parameter space, particularly as close to the thermodynamic limit as we want. We are thus able to show that the system undergoes a change displaying all the characteristics of a second-order phase transition as a function of a control parameter. We derive critical exponents and scaling laws revealing the universality class of the model, which coincide with that of more elaborate non-extended models such as the quantum Rabi or Lipkin-Meshkov-Glick models. Analyzing our model, we are also able to offer insights into the features of this type of phase transitions, by showing that the thermodynamic and classical limits coincide. In other words, quantum fluctuations must be tamed in order for the system to undergo a true phase transition.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12894v1"
    ],
    "publication_venue": null
}