{
    "arxiv_id": "2303.15102",
    "paper_title": "Investigating the turbulent hot gas in X-COP galaxy clusters",
    "authors": [
        "Simon Dupourqué",
        "Nicolas Clerc",
        "Etienne Pointecouteau",
        "Dominique Eckert",
        "Stefano Ettori",
        "Franco Vazza"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-05-18"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "Turbulent processes at work in the intracluster medium perturb this environment, displacing gas, and creating local density fluctuations that can be quantified via X-ray surface brightness fluctuation analyses. Improved knowledge of these phenomena would allow for a better determination of the mass of galaxy clusters, as well as a better understanding of their dynamic assembly. In this work, we aim to set constraints on the structure of turbulence using X-ray surface brightness fluctuations. We seek to consider the stochastic nature of this observable and to constrain the structure of the underlying power spectrum. We propose a new Bayesian approach, relying on simulation-based inference to account for the whole error budget. We used the X-COP cluster sample to individually constrain the power spectrum in four regions and within $R_{500}$. We spread the analysis on the 12 systems to alleviate the sample variance. We then interpreted the density fluctuations as the result of either gas clumping or turbulence. For each cluster considered individually, the normalisation of density fluctuations correlates positively with the Zernike moment and centroid shift, but negatively with the concentration and the Gini coefficient. The spectral index within $R_{500}$ and evaluated over all clusters is consistent with a Kolmogorov cascade. The normalisation of density fluctuations, when interpreted in terms of clumping, is consistent within $0.5 R_{500}$ with the literature results and numerical simulations; however, it is higher between 0.5 and $1 R_{500}$. Conversely, when interpreted on the basis of turbulence, we deduce a non-thermal pressure profile that is lower than the predictions of the simulations within 0.5 $R_{500}$, but still in agreement in the outer regions. We explain these results by the presence of central structural residues that are remnants of the dynamic assembly of the clusters.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15102v1"
    ],
    "publication_venue": "Accepted for publication in A&A. Abstract slightly abridged for arXiv",
    "doi": "10.1051/0004-6361/202245779"
}