{
    "arxiv_id": "2303.15911",
    "paper_title": "A Study of Modified Characteristics of Hadronic Interactions",
    "authors": [
        "Jiri Blazek",
        "Jan Ebr",
        "Jakub Vicha",
        "Tanguy Pierog",
        "Petr Travnicek"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "We have implemented ad-hoc modifications to the CORSIKA Monte-Carlo generator which allow us to simultaneously adjust the multiplicity, elasticity and cross-section of hadronic interactions with respect to the predictions of the Sibyll 2.3d interaction model, in order to assess whether a reasonable combination of changes (that is not excluded by current experimental data) could alleviate the observed tension between the model predictions and observed features of extensive air showers induced by ultra-high energy cosmic rays (UHECR). Previously, we have studied the effects of such changes on proton-initiated showers. Because a multitude of experimental data suggest that the primary composition of the UHECR is mixed, we have expanded the modification procedure to include nuclear projectiles in a consistent way based on the superposition model, in a similar manner as was used in the previous studies carried out using one-dimensional simulation methods. As we are using a fully three-dimensional approach, we can quantify the effects of the changes on both longitudinal and lateral features of the showers. With the inclusion of nuclear projectiles, we can study the impact of the changes on observable quantities for realistic primary beams as well as on the determination of the primary composition from data under the assumption of the modified hadronic interactions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15911v1"
    ],
    "publication_venue": "6 pages, 9 figures, a conference proceeding for UHECR2022",
    "doi": "10.1051/epjconf/202328305005"
}