{
    "arxiv_id": "2303.09082",
    "paper_title": "Collider constraints on electroweakinos in the presence of a light gravitino",
    "authors": [
        "The GAMBIT Collaboration",
        "Viktor Ananyev",
        "Csaba Balázs",
        "Ankit Beniwal",
        "Lasse Lorentz Braseth",
        "Andy Buckley",
        "Jonathan Butterworth",
        "Christopher Chang",
        "Matthias Danninger",
        "Andrew Fowlie",
        "Tomás E. Gonzalo",
        "Anders Kvellestad",
        "Farvah Mahmoudi",
        "Gregory D. Martinez",
        "Markus T. Prim",
        "Tomasz Procter",
        "Are Raklev",
        "Pat Scott",
        "Patrick Stöcker",
        "Jeriek Van den Abeele",
        "Martin White",
        "Yang Zhang"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph"
    ],
    "abstract": "Using the GAMBIT global fitting framework, we constrain the MSSM with an eV-scale gravitino as the lightest supersymmetric particle, and the six electroweakinos (neutralinos and charginos) as the only other light new states. We combine 15 ATLAS and 12 CMS searches at 13\\,TeV, along with a large collection of ATLAS and CMS measurements of Standard Model signatures. This model, which we refer to as the $\\tilde G$-EWMSSM, exhibits quite varied collider phenomenology due to its many permitted electroweakino production processes and decay modes. Characteristic $\\tilde G$-EWMSSM signal events have two or more Standard Model bosons and missing energy due to the escaping gravitinos. While much of the $\\tilde G$-EWMSSM parameter space is excluded, we find several viable parameter regions that predict phenomenologically rich scenarios with multiple neutralinos and charginos within the kinematic reach of the LHC during Run 3, or the High Luminosity LHC. In particular, we identify scenarios with Higgsino-dominated electroweakinos as light as 140 GeV that are consistent with our combined set of collider searches and measurements. The full set of $\\tilde G$-EWMSSM parameter samples and GAMBIT input files generated for this work is available via Zenodo.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09082v1"
    ],
    "publication_venue": "38 pages, 12 figures, 5 tables"
}