{
    "arxiv_id": "2303.16049",
    "paper_title": "On the role of dust and mass loss in the extended main sequence turnoff of star clusters: the case of NGC 1783",
    "authors": [
        "F. D'Antona",
        "F. Dell'Agli",
        "M. Tailo",
        "A. P. Milone",
        "P. Ventura",
        "E. Vesperini",
        "G. Cordoni",
        "A. Dotter",
        "A. F. Marino"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "The Color Magnitude Diagram (CMD) morphology of the \"extended\" main sequence turnoff (eMSTO) and upper main sequence (MS) of the intermediate age ($\\lesssim 2$ Gyr) Large Magellanic Cloud Cluster NGC 1783 shows the presence of a small group of UV-dim stars, that, in the ultraviolet Hubble Space Telescope filters, are located at colors on the red side of the typical \"fan\" shape displayed by the eMSTO. We model the UV-dim stars by assuming that some of the stars which would intrinsically be located on the left side of the eMSTO are obscured by a ring of dust due to grain condensation at the periphery of the excretion disc expelled when they spin at the high rotation rates typical of stars in the Be stage. A reasonably low optical depth at 10$μ$ is necessary to model the UV-dim group. Introduction of dust in the interpretation of the eMSTO may require a substantial re-evaluation of previous conclusions concerning the role of age and/or rotation spreads in the MC clusters: the entire eMSTO can be populated by dusty stars, and the reddest UV-dim stars simply represents the tail of the distribution with both maximum obscuration and the dust ring seen along the line of sight. The model stars having higher rotational projected velocity ($v \\sin$ i) are predicted to be preferentially redder than the slowly-rotating stars. The mass loss responsible for the dust may also cause the non-monotonic distribution of stars in the upper main sequence, with two peaks and gaps showing up in the UV CMD.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16049v1"
    ],
    "publication_venue": "11 pages, 13 figures. This is a pre-copyedited, author-produced PDF of an article (stad851) accepted for publication in MNRAS following peer review",
    "doi": "10.1093/mnras/stad851"
}