{
    "arxiv_id": "2303.09656",
    "paper_title": "Revealing complexities when adult readers engage in the credibility evaluation of social media posts",
    "authors": [
        "Miikka Kuutila",
        "Carita Kiili",
        "Reijo Kupiainen",
        "Eetu Huusko",
        "Junhao Li",
        "Simo Hosio",
        "Mika Mäntylä",
        "Julie Coiro",
        "Kristian Kiili"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-10-03"
    ],
    "latest_version": 3,
    "categories": [
        "cs.SI",
        "cs.HC"
    ],
    "abstract": "The present study investigates the role of source characteristics, evidence quality, crowdsourcing platform, and prior beliefs of the topic in adult readers' credibility evaluations of short healthrelated social media posts. Researchers designed content for the posts concerning five health topics by manipulating source characteristics (source's expertise, gender, and ethnicity), accuracy of the claims, and evidence quality (research evidence, testimony, consensus, and personal experience) in the posts. Then, accurate and inaccurate posts varying in these other manipulated aspects were computer-generated. Crowdworkers (N = 844) recruited from two platforms were asked to evaluate the credibility of ten social media posts, resulting in 8380 evaluations. Before credibility evaluation, participants' prior beliefs on the topics of the posts were assessed. Results showed that prior belief consistency and source expertise most affected the perceived credibility of accurate and inaccurate social media posts after controlling for the topic of the post. In contrast, the quality of evidence supporting the health claim mattered relatively little. In addition, the data collection platform had a notable impact, such that posts containing inaccurate claims were much more likely to be rated higher on one platform compared to the other. Implications for credibility evaluation theory and research are discussed.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09656v1",
        "http://arxiv.org/pdf/2303.09656v2",
        "http://arxiv.org/pdf/2303.09656v3"
    ],
    "publication_venue": "25 pages, 5 figures including the appendix. Submitted to a journal for peer review"
}