{
    "arxiv_id": "2303.12530",
    "paper_title": "Inhomogeneous Galactic Chemical Evolution: Modelling Ultra-Faint Dwarf Galaxies of the Large Magellanic Cloud",
    "authors": [
        "Ryan K. Alexander",
        "Fiorenzo Vincenzo",
        "Alexander P. Ji",
        "Hannah Richstein",
        "Chris J. Jordan",
        "Brad K. Gibson"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.SR"
    ],
    "abstract": "Ultra-faint dwarf galaxies are among the oldest and most metal-poor galaxies in the cosmos, observed to contain no traces of gas at the present time and a high dark matter mass fraction. Understanding the chemical abundance dispersion in such extreme environments could shed light on the properties of the first generations of stars in the cosmos. We present a novel inhomogeneous chemical evolution model, i-GEtool, that we apply to two ultra-faint dwarf galaxies, Carina II (Car II) and Reticulum II (Ret II), which are satellites of the Large Magellanic Cloud. In summary, our model is based on the Monte Carlo sampling of the initial mass function as star formation proceeds in different gas cells of the simulated galaxy volume. We account for the chemical enrichment of Supernova bubbles as they spread in the interstellar medium, which causes dispersion in the predicted elemental abundances. We recreate the elemental abundance patterns by focusing on $α$- and odd-$\\textit{Z}$ elements, predicting two sequences in [C/Fe] and [N/Fe] at all metallicities. Our models systematically underestimate [C/Fe] and [Ti/Fe] because of the large uncertainty in the adopted stellar nucleosynthesis yields. We discuss that the observed C and N abundances had likely been affected by internal mixing processes, which changed the initial surface abundances in the red giants. Our Supernova feedback scheme is responsible for driving galactic outflows, which quench the star formation activity in the simulated galaxies at early times. The average outflow mass-loading factor as predicted by our models is $\\approx 10^{3}$, which extrapolates towards very low galaxy stellar masses the trend observed at high stellar masses. Finally, by combining our model with the MIST isochrone database, we draw synthetic colour-magnitude diagrams of Car II and Ret II and compare them to observations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12530v1"
    ],
    "publication_venue": "18 Pages, 11 Figures, 2 Tables"
}