{
    "arxiv_id": "2303.13667",
    "paper_title": "APES: Approximate Posterior Ensemble Sampler",
    "authors": [
        "Sandro Dias Pinto Vitenti",
        "Eduardo J. Barroso"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-07-20"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.CO",
        "astro-ph.IM",
        "physics.comp-ph",
        "physics.data-an"
    ],
    "abstract": "This paper proposes a novel approach to generate samples from target distributions that are difficult to sample from using Markov Chain Monte Carlo (MCMC) methods. Traditional MCMC algorithms often face slow convergence due to the difficulty in finding proposals that suit the problem at hand. To address this issue, the paper introduces the Approximate Posterior Ensemble Sampler (APES) algorithm, which employs kernel density estimation and radial basis interpolation to create an adaptive proposal, leading to fast convergence of the chains. The APES algorithm's scalability to higher dimensions makes it a practical solution for complex problems. The proposed method generates an approximate posterior probability that closely approximates the desired distribution and is easy to sample from, resulting in smaller autocorrelation times and a higher probability of acceptance by the chain. In this work, we compare the performance of the APES algorithm with the affine invariance ensemble sampler with the stretch move in various contexts, demonstrating the efficiency of the proposed method. For instance, on the Rosenbrock function, the APES presented an autocorrelation time 140 times smaller than the affine invariance ensemble sampler. The comparison showcases the effectiveness of the APES algorithm in generating samples from challenging distributions. This paper presents a practical solution to generating samples from complex distributions while addressing the challenge of finding suitable proposals. With new cosmological surveys set to deal with many new systematics, which will require many new nuisance parameters in the models, this method offers a practical solution for the upcoming era of cosmological analyses.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13667v1",
        "http://arxiv.org/pdf/2303.13667v2"
    ],
    "publication_venue": "18 pages, 8 figures, 7 tables"
}