{
    "arxiv_id": "2303.15155",
    "paper_title": "The beta Pictoris system: Setting constraints on the planet and the disk structures at mid-IR wavelengths with NEAR",
    "authors": [
        "Nour Skaf",
        "Anthony Boccaletti",
        "Eric Pantin",
        "Philippe Thebault",
        "Quentin Kral",
        "Camilla Danielski",
        "Raphael Galicher",
        "Julien Milli",
        "Anne-Marie Lagrange",
        "Clement Baruteau",
        "Matthew Kenworthy",
        "Olivier Absil",
        "Maud Langlois",
        "Johan Olofsson",
        "Gael Chauvin",
        "Nuria Huelamo",
        "Philippe Delorme",
        "Benjamin Charnay",
        "Olivier Guyon",
        "Michael Bonnefoy",
        "Faustine Cantalloube",
        "H. Jens Hoeijmakers",
        "Ulli Käufl",
        "Markus Kasper",
        "Anne-Lise Maire",
        "Mathilde Mâlin",
        "Ralf Siebenmorgen",
        "Ignas Snellen",
        "Gerard Zins"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-07-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "[abridged] We analyzed mid-infrared high-contrast coronagraphic images of the beta Pictoris system, taking advantage of the NEAR experiment using the VLT/VISIR instrument. The goal of our analysis is to investigate both the detection of the planet beta Pictoris b and of the disk features at mid-IR wavelengths. In addition, by combining several epochs of observation, we expect to constrain the position of the known clumps and improve our knowledge on the dynamics of the disk. To evaluate the planet b flux contribution, we extracted the photometry and compared it to the flux published in the literature. In addition, we used previous data from T-ReCS and VISIR, to study the evolution of the position of the southwest clump that was initially observed in the planetary disk back in 2003. While we did not detect the planet b, we were able to put constraints on the presence of circumplanetary material, ruling out the equivalent of a Saturn-like planetary ring around the planet. The disk presents several noticeable structures, including the known southwest clump. Using a 16-year baseline, sampled with five epochs of observations, we were able to examine the evolution of the clump: the clump orbits in a Keplerian motion with an sma of 56.1+-0.4 au. In addition to the known clump, the images clearly show the presence of a second clump on the northeast side of the disk and fainter and closer structures that are yet to be confirmed. We found correlations between the CO clumps detected with ALMA and the mid-IR images. If the circumplanetary material were located at the Roche radius, the maximum amount of dust determined from the flux upper limit around beta Pictoris b would correspond to the mass of an asteroid of 5 km in diameter. Finally, the Keplerian motion of the southwestern clump is possibly indicative of a yet-to-be-detected planet or signals the presence of a vortex.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15155v1"
    ],
    "publication_venue": "Accepted in Astronomy and Astrophysics",
    "doi": "10.1051/0004-6361/202245143"
}