{
    "arxiv_id": "2303.12686",
    "paper_title": "SRG/eROSITA and XMM-Newton observations of Vela Jr",
    "authors": [
        "Francesco Camilloni",
        "Werner Becker",
        "Peter Predehl",
        "Konrad Dennerl",
        "Michael Freyberg",
        "Martin G. F. Mayer",
        "Manami Sasaki"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The Vela supernova remnant complex is a region containing at least three supernova remnants: Vela, Puppis A, and Vela Jr. With the launch of the spectro-imaging X-ray telescope eROSITA on board the Spectrum Roentgen Gamma (SRG) mission, it became possible to observe the one degree wide Vela Jr in its entirety. Although several previous pointed Chandra and XMM-Newton observations are available, it is only the second time after the ROSAT all-sky survey that the whole remnant was observed in X-rays with homogeneous sensitivity. Vela Jr is one of the few remnants emitting in the TeV band, making it an important object in shock acceleration studies. However, the age and distance determination using X-ray emission is largely hampered by the presence of the Vela SNR along the same line. With the eROSITA data set our aim is to characterize the emission of Vela Jr and distinguish it from Vela emission, and also to characterize the spectral emission of the inner remnant. We processed the eROSITA data dividing the whole remnant into seven different regions. In addition, images of the whole remnant were employed to pinpoint the position of the geometric center and constrain the proper motion of the CCO. We also employed archival XMM-Newton pointed observations of the NW rim to determine the cutoff energy of the electrons and the expansion velocity. We find the magnetic field can vary between 2 $μ$G and 16 $μ$G in the NW rim. We also find that the remnant spectrum is uniformly featureless in most regions, except for two inner regions where an extra thermal model component improves the fit. We obtain new coordinates for the geometric remnant center, resulting in a separation of only 35.2 $\\pm$ 15.8\" from the position of the CCO. As a result, we reinforce the association between the CCO and a proposed faint optical/IR counterpart.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12686v1"
    ],
    "publication_venue": "Accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202245475"
}