{
    "arxiv_id": "2303.08205",
    "paper_title": "The IAG spectral atlas of the spatially resolved Sun: Centre-to-limb observations",
    "authors": [
        "M. Ellwarth",
        "S. Schäfer",
        "A. Reiners",
        "M. Zechmeister"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Solar surface magneto-convection appears as granulation pattern that impacts spectral lines in terms of both shape and wavelength. Such induced effects also tend to vary over the observed solar disc because of the changing observation angle and, thus, the changing observation height as well. Centre-to-limb observations of the resolved Sun offer an insight into the variable spectral behaviour across different heliocentric observing positions, providing crucial information about limb darkening, convective velocities, and line profile variability relevant to radial velocity (RV) calculations. Thus, RV measurements and exoplanet transit spectroscopy depend on precise reference templates. We want to provide a spectroscopic centre-to-limb solar atlas at high spectral resolution and high-frequency accuracy. The atlas shall help improve the understanding of the solar atmosphere and convection processes. We performed high-resolution observations of the resolved quiet Sun with a Fourier transform spectrograph at the Institut für Astrophysik und Geophysik in Göttingen. Our dataset contains a wavelength range from 4200Å to 8000Å. We obtained 165 spectra in total, with a spectral resolution of $Δν$ = 0.024cm$^{-1}$, corresponding to a resolving power $R$ of 700,000 at $\\sim$6000Å. We present a centre-to-limb solar atlas containing 14 heliocentric positions. To check for consistency, we investigated the FeI ~6175Å absorption line and compared our line profiles with previous centre-to-limb observations and also with simulations. The line profile and also the bisector profiles are generally consistent with previous observations, but we have identified differences to model line profiles, especially close to the solar limb.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08205v1"
    ],
    "publication_venue": null,
    "doi": "10.1051/0004-6361/202245612"
}