{
    "arxiv_id": "2303.15384",
    "paper_title": "Branching Fraction of the Decay $B^+ \\to π^+ τ^+ τ^-$ and Lepton Flavor Universality Test via the Ratio $R_π(τ/μ)$",
    "authors": [
        "Ahmed Ali",
        "Alexander Ya. Parkhomenko",
        "Irina M. Parnova"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph",
        "hep-ex",
        "hep-lat"
    ],
    "abstract": "Among (semi)leptonic rare $B$-decays induced by the $b \\to d$ flavor changing neutral current, the decay $B^+ \\to π^+ μ^+ μ^-$ is the only one observed so far experimentally. Related decays involving the $e^+e^-$ and $τ^+ τ^-$ pairs are the targets for the ongoing experiments at the LHC, in particular LHCb, and Belle II. The muonic and electronic semileptonic decays have almost identical branching fractions in the Standard Model (SM). However, the tauonic decay $B^+ \\to π^+ τ^+ τ^-$ differs from the other two due to the higher reaction threshold which lies slightly below the $ψ(2S)$-resonance. We present calculations of the ditauon ($τ^+ τ^-$) invariant-mass distribution and the branching fraction ${\\rm Br} (B^+ \\to π^+ τ^+ τ^-)$ in the SM based on the Effective Electroweak Hamiltonian approach, taking into account also the so-called long-distance contributions. The largest theoretical uncertainty in the short-distance part of the decay rates is due to the $B \\to π$ form factors, which we quantify using three popular parametrizations. The long-distance contribution can be minimized by a cut on the ditauon mass $m_{τ^+ τ^-} > M_{ψ(2S)}$. Once available, the branching fractions in the tauonic and muonic (and electronic) modes provide stringent test of the lepton flavor universality in the $b \\to d$ transitions. We illustrate this by calculating the ratio $R_π(τ/μ) \\equiv {\\rm Br} (B^+ \\to π^+ τ^+ τ^-)/{\\rm Br} (B^+ \\to π^+ μ^+ μ^-)$ in the SM for the total and binned ratios of the branching fractions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15384v1"
    ],
    "publication_venue": "11 pages, 5 figures, 11 tables"
}