{
    "arxiv_id": "2303.14654",
    "paper_title": "The effect of the magnetically dead layer on the magnetization and the magnetic anisotropy of the dextran coated magnetite nanoparticles",
    "authors": [
        "Zhila Shaterabadi",
        "Gholamreza Nabiyouni",
        "Gerardo F Goya",
        "Meysam Soleymani"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "We present a study on the magnetic behavior of dextran-coated magnetite nanoparticles (DM NPs) with sizes between 3 and 19 nm, synthesized by hydrothermal-assisted co-precipitation method. The decrease of saturation magnetization ($M_s$) with decreasing particle size has been modeled by assuming the existence of a spin-disordered layer at the particle surface, which is magnetically dead. Based on this core-shell model and taking into account the weight contribution of the non-magnetic coating layer (dextran) to the whole magnetization, the dead layer thickness ($t$) and saturation magnetization $M_s$ of the magnetic cores in our samples were estimated to be $t = 6.8~\\mathrmÅ$ and $M_s = 98.8~\\mathrm{emu/g}$, respectively. The data of $M_s$ were analyzed using a law of approach to saturation, indicating an increase in effective magnetic anisotropy ($K_{eff}$) with decreasing particle size as expected from the increased surface/volume ratio in small MNPs. The obtained $K_{eff}$ values were successfully modeled by including an extra contribution of dipolar interactions due to the formation of chain-like clusters of MNPs. The surface magnetic anisotropy ($K_s$) was estimated to be about $K_s = 1.04\\times10^5~\\mathrm{J/m^3}$. Our method provides a simple and accurate way to obtain the $M_s$ core values in surface-disordered MNPs, a relevant parameter required for magnetic modeling in many applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14654v1"
    ],
    "publication_venue": "16 pages, 1 table, 3 figures",
    "doi": "10.1007/s00339-022-05675-x"
}