{
    "arxiv_id": "2303.09434",
    "paper_title": "Comment on \"Observing whiteness in introductory physics: A case study''",
    "authors": [
        "C. Reichhardt",
        "A. Small",
        "C. Nisoli",
        "C. J. O. Reichhardt"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ed-ph",
        "physics.soc-ph"
    ],
    "abstract": "In the recent article of A. D. Robertson and W. T. Hairston [Phys. Rev. Phys. Educ. Res. 18, 010119 (2022)], the authors claim to name mechanisms that reproduce whiteness, and they identify whiteness in introductory physics from analysis of a six-minute video. We argue that even if one accepts their rather tenuous proposition that \"whiteness'' is sufficiently well defined to observe, their study lacks the proper controls, checks, and consistent methodology to allow for the confirmation or disconfirmation of the asserted interpretation of the data. The work does not provide a consistency check of the interpretations and lacks sufficient data to give any type of statistical reliability estimate. It also contains no evidence that analysis of a single video segment captures typical interactions in introductory physics classes. We argue that the work does not meet even the requirements for a qualitative study as the authors do not consider alternative interpretations or other hypotheses for explaining the observations, nor do they describe how to conduct studies that could confirm or contradict the results. In particular, whiteness is so poorly defined that it is not possible to show that whiteness is absent. The authors make the stunning claim that their study cannot be judged by the scientific standards used in physics and any such evaluations would be in bad faith. Their framework is completely incompatible with quantitative and qualitative scientific studies. If the work cannot be evaluated by scientific standards, then it is not a scientific study and does not belong in Physical Review. In an Appendix, we provide a timeline of this Comment and its genesis as a response to an American Physical Society (APS) News Back Page article in which APS quotes a Phys. Rev. Phys. Educ. Res. Editorial stating that a Comment is the appropriate venue for addressing issues with the paper at hand.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09434v1"
    ],
    "publication_venue": "4 pages, no figures"
}