{
    "arxiv_id": "2303.09106",
    "paper_title": "Formally Verified Animation for RoboChart using Interaction Trees",
    "authors": [
        "Kangfeng Ye",
        "Simon Foster",
        "Jim Woodcock"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LO"
    ],
    "abstract": "RoboChart is a core notation in the RoboStar framework. It is a timed and probabilistic domain-specific and state machine-based language for robotics. RoboChart supports shared variables and communication across entities in its component model. It has formal denotational semantics given in CSP. The semantic technique of Interaction Trees (ITrees) represents behaviours of reactive and concurrent programs interacting with their environments. Recent mechanisation of ITrees, along with ITree-based CSP semantics and a Z mathematical toolkit in Isabelle/HOL, bring new applications of verification and animation for state-rich process languages, such as RoboChart. In this paper, we use ITrees to give RoboChart novel operational semantics, implement it in Isabelle, and use Isabelle's code generator to generate verified and executable animations. We illustrate our approach using an autonomous chemical detector model and a patrol robot model additionally exhibiting nondeterminism and using shared variables. With animation, we show two concrete scenarios for the chemical detector when the robot encounters different environmental inputs and three concrete scenarios for the patrol robot when its calibrated position is in different sections of a corridor. We also verify that the animated scenarios are truly trace refinements of the CSP denotational semantics of the RoboChart models using FDR, a refinement model checker for CSP. This supports the soundness of our approach that the use of CSP operators with priority resolves nondeterminism correctly.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09106v1"
    ],
    "publication_venue": "The journal extension version of the ICFEM2022 paper (https://doi.org/10.1007/978-3-031-17244-1_24). 35 pages and submitted to the Journal of Logical and Algebraic Methods in Programming (JLAMP)"
}