{
    "arxiv_id": "2303.09926",
    "paper_title": "StarHorse results for spectroscopic surveys + Gaia DR3: Chrono-chemical populations in the solar vicinity, the genuine thick disk, and young-alpha rich stars",
    "authors": [
        "Anna B. A. Queiroz",
        "Friedrich Anders",
        "Cristina Chiappini",
        "Arman Khalatyan",
        "Basilio X. Santiago",
        "Samir Nepal",
        "Matthias Steinmetz",
        "Carme Gallart",
        "Marica Valentini",
        "Marina Dal Ponte",
        "Beatriz Barbuy",
        "Angeles Pérez-Villegas",
        "Thomas Masseron",
        "José G. Fernández-Trincado",
        "Sergey Khoperskov",
        "Ivan Minchev",
        "Emma Fernández-Alvar",
        "Richard R. Lane",
        "Christian Nitschelm"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
    ],
    "abstract": "The Gaia mission has provided an invaluable wealth of astrometric data for more than a billion stars in our Galaxy. The synergy between Gaia astrometry, photometry, and spectroscopic surveys give us comprehensive information about the Milky Way. Using the Bayesian isochrone-fitting code StarHorse, we derive distances and extinctions for more than 10 million unique stars observed by both Gaia Data Release 3 as well as public spectroscopic surveys: GALAH DR3, LAMOST DR7 LRS, LAMOST DR7 MRS, APOGEE DR17, RAVE DR6, SDSS DR12 (optical spectra from BOSS and SEGUE), Gaia-ESO DR5 survey, and Gaia RVS part of Gaia DR3 release. We use StarHorse for the first time to derive stellar age for main-sequence turnoff and subgiant branch stars (MSTO-SGB), around 2.5 million stars with age uncertainties typically around 30%, 15% for only SGB stars, depending on the resolution of the survey. With the derived ages in hand, we investigate the chemical-age relations. In particular, the $α$ and neutron-capture element ratios versus age in the solar neighbourhood show trends similar to previous works, validating our ages. We use the chemical abundances from local subgiant samples of GALAH DR3, APOGEE DR17 and LAMOST MRS DR7 to map groups with similar chemical compositions and StarHorse ages with the dimensionality reduction technique t-SNE and the clustering algorithm HDBSCAN. We identify three distinct groups in all three samples. Their kinematic properties confirm them to be the genuine chemical thick disk, the thin disk and a considerable number of young alpha-rich stars. We confirm that the genuine thick disk's kinematics and age properties are radically different from those of the thin disk and compatible with high-redshift (z$\\approx$2) star-forming disks with high dispersion velocities.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09926v1"
    ],
    "publication_venue": "27 pages, 19 figures. Accepted for publication in Astronomy & Astrophysics. Catalogues can be downloaded at https://data.aip.de/",
    "doi": "10.1051/0004-6361/202245399"
}