{
    "arxiv_id": "2303.09687",
    "paper_title": "BeamSense: Rethinking Wireless Sensing with MU-MIMO Wi-Fi Beamforming Feedback",
    "authors": [
        "Khandaker Foysal Haque",
        "Milin Zhang",
        "Francesca Meneghello",
        "Francesco Restuccia"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2025-01-22"
    ],
    "latest_version": 1,
    "categories": [
        "cs.NI",
        "eess.SP"
    ],
    "abstract": "In this paper, we propose BeamSense, a completely novel approach to implement standard-compliant Wi-Fi sensing applications. Wi-Fi sensing enables game-changing applications in remote healthcare, home entertainment, and home surveillance, among others. However, existing work leverages the manual extraction of channel state information (CSI) from Wi-Fi chips to classify activities, which is not supported by the Wi-Fi standard and hence requires the usage of specialized equipment. On the contrary, BeamSense leverages the standard-compliant beamforming feedback information (BFI) to characterize the propagation environment. Conversely from CSI, the BFI (i) can be easily recorded without any firmware modification, and (ii) captures the multiple channels between the access point and the stations, thus providing much better sensitivity. BeamSense includes a novel cross-domain few-shot learning (FSL) algorithm to handle unseen environments and subjects with few additional data points. We evaluate BeamSense through an extensive data collection campaign with three subjects performing twenty different activities in three different environments. We show that our BFI-based approach achieves about 10% more accuracy when compared to CSI-based prior work, while our FSL strategy improves accuracy by up to 30% and 80% when compared with state-of-the-art cross-domain algorithms.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09687v1"
    ],
    "publication_venue": "This work has been submitted to the IEEE for possible publication",
    "doi": "10.1016/j.comnet.2024.111020"
}