{
    "arxiv_id": "2303.15065",
    "paper_title": "Single-subject Multi-contrast MRI Super-resolution via Implicit Neural Representations",
    "authors": [
        "Julian McGinnis",
        "Suprosanna Shit",
        "Hongwei Bran Li",
        "Vasiliki Sideri-Lampretsa",
        "Robert Graf",
        "Maik Dannecker",
        "Jiazhen Pan",
        "Nil Stolt Ansó",
        "Mark Mühlau",
        "Jan S. Kirschke",
        "Daniel Rueckert",
        "Benedikt Wiestler"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-09-25"
    ],
    "latest_version": 2,
    "categories": [
        "eess.IV",
        "cs.CV"
    ],
    "abstract": "Clinical routine and retrospective cohorts commonly include multi-parametric Magnetic Resonance Imaging; however, they are mostly acquired in different anisotropic 2D views due to signal-to-noise-ratio and scan-time constraints. Thus acquired views suffer from poor out-of-plane resolution and affect downstream volumetric image analysis that typically requires isotropic 3D scans. Combining different views of multi-contrast scans into high-resolution isotropic 3D scans is challenging due to the lack of a large training cohort, which calls for a subject-specific framework. This work proposes a novel solution to this problem leveraging Implicit Neural Representations (INR). Our proposed INR jointly learns two different contrasts of complementary views in a continuous spatial function and benefits from exchanging anatomical information between them. Trained within minutes on a single commodity GPU, our model provides realistic super-resolution across different pairs of contrasts in our experiments with three datasets. Using Mutual Information (MI) as a metric, we find that our model converges to an optimum MI amongst sequences, achieving anatomically faithful reconstruction. Code is available at: https://github.com/jqmcginnis/multi_contrast_inr/",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15065v1",
        "http://arxiv.org/pdf/2303.15065v2"
    ],
    "publication_venue": null
}