{
    "arxiv_id": "2303.09653",
    "paper_title": "Atmospheres as windows into sub-Neptune interiors: coupled chemistry and structure of hydrogen-silane-water envelopes",
    "authors": [
        "William Misener",
        "Hilke E. Schlichting"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Sub-Neptune exoplanets are commonly hypothesized to consist of a silicate-rich magma ocean topped by a hydrogen-rich atmosphere. Previous work studying the outgassing of silicate material has demonstrated that such atmosphere-interior interactions can affect the atmosphere's overall structure and extent. But these models only considered SiO in an atmosphere of hydrogen gas, without considering chemical reactions between them. Here we couple calculations of the chemical equilibrium between H, Si, and O species with an atmospheric structure model. We find that substantial amounts of silane, SiH$_4$, and water, H$_2$O, are produced by the interaction between the silicate-rich interior and hydrogen-rich atmosphere. These species extend high into the atmosphere, though their abundance is greatest at the hottest, deepest regions. For example, for a 4 $M_\\oplus$ planet with an equilibrium temperature of 1000 K, a base temperature of 5000 K, and a 0.1 $M_\\oplus$ hydrogen envelope, silicon species and water can comprise 30 percent of the atmosphere by number at the bottom of the atmosphere. Due to this abundance enhancement, we find that convection is inhibited at temperatures $\\gtrsim 2500$ K. This temperature is lower, implying that the resultant non-convective region is thicker, than was found in previous models which did not account for atmospheric chemistry. Our findings show that significant endogenous water is be produced by magma-hydrogen interactions alone, without the need to accrete ice-rich material. We discuss the observability of the signatures of atmosphere-interior interaction and directions for future work, including condensate lofting and more complex chemical networks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09653v1"
    ],
    "publication_venue": "10 pages, 7 figures, under review at MNRAS"
}