{
    "arxiv_id": "2303.14972",
    "paper_title": "HelioCast: heliospheric forecasting based on white-light observations of the solar corona. I. Solar minimum conditions",
    "authors": [
        "Victor Réville",
        "Nicolas Poirier",
        "Athanasios Kouloumvakos",
        "Alexis P. Rouillard",
        "Rui F. Pinto",
        "Naïs Fargette",
        "Mikel Indurain",
        "Raphaël Fournon",
        "Théo James",
        "Raphaël Pobeda",
        "Cyril Scoul"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "physics.space-ph"
    ],
    "abstract": "We present a new 3D MHD heliospheric model for space-weather forecasting driven by boundary conditions defined from white-light observations of the solar corona. The model is based on the MHD code PLUTO, constrained by an empirical derivation of the solar wind background properties at 0.1au. This empirical method uses white-light observations to estimate the position of the heliospheric current sheet. The boundary conditions necessary to run HelioCast are then defined from pre-defined relations between the necessary MHD properties (speed, density and temperature) and the distance to the current sheet. We assess the accuracy of the model over six Carrington rotations during the first semester of 2018. Using point-by-point metrics and event based analysis, we evaluate the performances of our model varying the angular width of the slow solar wind layer surrounding the heliospheric current sheet. We also compare our empirical technique with two well tested models of the corona: Multi-VP and WindPredict-AW. We find that our method is well suited to reproduce high speed streams, and does -- for well chosen parameters -- better than full MHD models. The model shows, nonetheless, limitations that could worsen for rising and maximum solar activity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14972v1"
    ],
    "publication_venue": "Accepted for publication in the Journal of Space Weather and Space Climate. 23 pages, 12 figures. The model runs live at http://heliocast.irap.omp.eu/"
}