{
    "arxiv_id": "2303.12816",
    "paper_title": "From Wide to Deep: Dimension Lifting Network for Parameter-efficient Knowledge Graph Embedding",
    "authors": [
        "Borui Cai",
        "Yong Xiang",
        "Longxiang Gao",
        "Di Wu",
        "He Zhang",
        "Jiong Jin",
        "Tom Luan"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-11-14"
    ],
    "latest_version": 3,
    "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CL"
    ],
    "abstract": "Knowledge graph embedding (KGE) that maps entities and relations into vector representations is essential for downstream applications. Conventional KGE methods require high-dimensional representations to learn the complex structure of knowledge graph, but lead to oversized model parameters. Recent advances reduce parameters by low-dimensional entity representations, while developing techniques (e.g., knowledge distillation or reinvented representation forms) to compensate for reduced dimension. However, such operations introduce complicated computations and model designs that may not benefit large knowledge graphs. To seek a simple strategy to improve the parameter efficiency of conventional KGE models, we take inspiration from that deeper neural networks require exponentially fewer parameters to achieve expressiveness comparable to wider networks for compositional structures. We view all entity representations as a single-layer embedding network, and conventional KGE methods that adopt high-dimensional entity representations equal widening the embedding network to gain expressiveness. To achieve parameter efficiency, we instead propose a deeper embedding network for entity representations, i.e., a narrow entity embedding layer plus a multi-layer dimension lifting network (LiftNet). Experiments on three public datasets show that by integrating LiftNet, four conventional KGE methods with 16-dimensional representations achieve comparable link prediction accuracy as original models that adopt 512-dimensional representations, saving 68.4% to 96.9% parameters.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12816v1",
        "http://arxiv.org/pdf/2303.12816v2",
        "http://arxiv.org/pdf/2303.12816v3"
    ],
    "publication_venue": null
}