{
    "arxiv_id": "2303.14299",
    "paper_title": "Systematic analysis of (multi)strange hadron $p_t$ spectra from small collision systems at the large hadron collider",
    "authors": [
        "Thomas A. Trainor"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph"
    ],
    "abstract": "Small collision systems, e.g. $p$-$p$ and $p$-Pb collisions, comprise a potential reference for more-central A-A collisions with regard to production (or not) of a thermalized quark-gluon plasma (QGP). Small systems with low particle densities should evolve according to simple QCD mechanisms including projectile-nucleon dissociation and dijet production. But it is now claimed that QGP may appear even in $p$-$p$ collisions based on apparent evidence for radial flow from shape evolution of $p_t$ spectra and from variation of total yields for strange and multistrange hadrons relative to statistical models. The present study confronts such arguments with a detailed analysis of $p_t$ spectra for strange and multistrange hadrons from 5 TeV $p$-Pb collisions and 13 TeV $p$-$p$ collisions via a two-component model (TCM) of hadron production. Based on previous analysis of lighter hadrons the TCM accurately predicts spectra for Cascade and Omega hadrons. Significant results include multistrange hadron spectra dominated by jet fragments, variation of strange-hadron abundances exaggerated by certain plot formats and spectrum extrapolations, and detailed relations between ensemble-mean $\\bar p_t$ evolution with event charge density and small shifts of jet fragment distributions on $p_t$. Within the context of the TCM, $p$-$p$ and $p$-Pb collision systems with comparable jet contributions are found to be equivalent within data uncertainties. Attribution of certain data features to radial flow is falsified.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14299v1"
    ],
    "publication_venue": "21 pages, 13 figures"
}