{
    "arxiv_id": "2303.17279",
    "paper_title": "The FAST Galactic Plane Pulsar Snapshot Survey: II. Discovery of 76 Galactic rotating radio transients and their enigma",
    "authors": [
        "D. J. Zhou",
        "J. L. Han",
        "Jun Xu",
        "Chen Wang",
        "P. F. Wang",
        "Tao Wang",
        "Wei-Cong Jing",
        "Xue Chen",
        "Yi Yan",
        "Wei-Qi. Su",
        "Heng-Qian Gan",
        "Peng Jiang",
        "Jing-Hai Sun",
        "Hong-Guang Wang",
        "Na Wang",
        "Shuang-Qiang Wang",
        "Ren-Xin Xu",
        "Xiao-Peng You"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "We are carrying out the GPPS survey by using the FAST, the most sensitive systematic pulsar survey in the Galactic plane. In addition to about 500 pulsars already discovered through normal periodical search, we report here the discovery of 76 new transient radio sources with sporadic strong pulses, detected by using the newly developed module for a sensitive single pulse search. Their small DM values suggest that they all are the Galactic RRATs. More radio pulses have been detected from 26 transient radio sources but no periods can be found due to a limited small number of pulses from all FAST observations. The following-up observations show that 16 transient sources are newly identified as being the prototypes of RRATs with a period already determined from more detected sporadic pulses, 10 sources are extremely nulling pulsars, and 24 sources are weak pulsars with sparse strong pulses. On the other hand, 48 previously known RRATs have been detected by the FAST. Except for 1 RRAT with four pulses detected in a session of five minute observation and 4 RRATs with only one pulse detected in a session, sensitive FAST observations reveal that 43 RRATs are just generally weak pulsars with sporadic strong pulses or simply very nulling pulsars, so that the previously known RRATs always have an extreme emission state together with a normal hardly detectable weak emission state. This is echoed by the two normal pulsars J1938+2213 and J1946+1449 with occasional brightening pulses. Though strong pulses of RRATs are very outstanding in the energy distribution, their polarization angle variations follow the polarization angle curve of the averaged normal pulse profile, suggesting that the predominant sparse pulses of RRATs are emitted in the same region with the same geometry as normal weak pulsars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17279v1"
    ],
    "publication_venue": "Accepted for publication in RAA"
}