{
    "arxiv_id": "2303.16336",
    "paper_title": "Update on the indication of a mass-dependent anisotropy above $10^{18.7}\\,$eV in the hybrid data of the Pierre Auger Observatory",
    "authors": [
        "Eric Mayotte"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "We test for an anisotropy in the mass of arriving cosmic-ray primaries associated with the galactic plane. The sensitivity to primary mass is obtained through the depth of shower maximum, $X_{\\rm max}$, extracted from hybrid events measured over a 14-year period at the Pierre Auger Observatory. The sky is split into distinct on- and off-plane regions using the galactic latitude of each arriving cosmic ray to form two distributions of $X_{\\rm max}$, which are compared using an Anderson-Darling 2-samples test. A scan over roughly half of the data is used to select a lower threshold energy of $10^{18.7}\\,$eV and a galactic latitude splitting at $|b| = 30^\\circ$, which are set as a prescription for the remaining data. With these thresholds, the distribution of $X_{\\rm max}$ from the on-plane region is found to have a $9.1 \\pm 1.6^{+2.1}_{-2.2}\\,$g$\\,$cm$^-2$ shallower mean and a $5.9\\pm2.1^{+3.5}_{-2.5}\\,$g$\\,$cm$^-2$ narrower width than that of the off-plane region and is observed in all telescope sites independently. These differences indicate that the mean mass of primary particles arriving from the on-plane region is greater than that of those from the off-plane region. Monte Carlo studies yield a $5.9\\times10^{-6}$ random chance probability for the result in the independent data, lowering to a $6.0\\times10^{-7}$ post-penalization random chance probability when the scanned data is included. Accounting for systematic uncertainties leads to an indication for anisotropy in mass composition above $10^{18.7}\\,$eV with a $3.3\\,σ$ significance. Furthermore, the result has been newly tested using additional FD data recovered from the selection process. This test independently disfavors the on- and off-plane regions being uniform in composition at the $2.2\\,σ$ level, which is in good agreement with the expected sensitivity of the dataset used for this test.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16336v1"
    ],
    "publication_venue": "Proceedings of the 6th International Symposium on Ultra High Energy Cosmic Rays (UHECR 2022), Oct 3-7, 2022, Gran Sasso Science Institute, L'Aquila, Italy. Accepted for publications in EPJ Web of Conferences series"
}