{
    "arxiv_id": "2303.17150",
    "paper_title": "A pore-scale model for electrokinetic in situ recovery of copper: the Influence of mineral occurrence, zeta potential, and electric potential",
    "authors": [
        "Kunning Tang",
        "Zhe Li",
        "Ying Da Wang",
        "James McClure",
        "Hongli Su",
        "Peyman Mostaghimi",
        "Ryan Armstrong"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "Electrokinetic in-situ recovery is an alternative to conventional mining, relying on the application of an electric potential to enhance the subsurface flow of ions. Understanding the pore-scale flow and ion transport under electric potential is essential for petrophysical properties estimation and flow behavior characterization. The governing physics of electrokinetic transport is electromigration and electroosmotic flow, which depend on the electric potential gradient, mineral occurrence, domain morphology, and electrolyte properties. Herein, mineral occurrence and its associated zeta potential are investigated for EK transport. The governing model includes three coupled equations: (1) Poisson equation, (2) Nernst--Planck equation, and (3) Navier--Stokes equation. These equations were solved using the lattice Boltzmann method within X-ray computed microtomography images. The proposed model is validated against COMSOL Multiphysics in a 2-dimensional microchannel in terms of fluid flow behavior when the electrical double layer is both resolvable and unresolvable. A more complex chalcopyrite-silica system is then obtained by micro-CT scanning to evaluate the model performance. The effects of mineral occurrence, zeta potential, and electric potential on the 3-dimensional chalcopyrite-silica system were evaluated. Although the positive zeta potential of chalcopyrite can induce a flow of ferric ion counter to the direction of electromigration, the net effect is dependent on the occurrence of chalcopyrite. However, the ion flux induced by electromigration was the dominant transport mechanism, whereas advection induced by electroosmosis made a lower contribution. Overall, a pore-scale EK model is proposed for direct simulation on pore-scale images. The proposed model can be coupled with other geochemical models for full physicochemical transport simulations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17150v1"
    ],
    "publication_venue": null
}