{
    "arxiv_id": "2303.15287",
    "paper_title": "Large transitive models in local {\\rm ZFC}",
    "authors": [
        "Athanassios Tzouvaras"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "math.LO"
    ],
    "abstract": "This paper is a sequel to \\cite{Tz10}, where a local version of ZFC, LZFC, was introduced and examined and transitive models of ZFC with properties that resemble large cardinal properties, namely Mahlo and $Π_1^1$-indescribable models, were considered. By analogy we refer to such models as \"large models\", and the properties in question as \"large model properties\". Continuing here in the same spirit we consider further large model properties, that resemble stronger large cardinals, namely, \"elementarily embeddable\", \"extendible\" and \"strongly extendible\", \"critical\" and \"strongly critical\", \"self-critical'' and \"strongly self-critical\", the definitions of which involve elementary embeddings. Each large model property $φ$ gives rise to a localization axiom $Loc^φ({\\rm ZFC})$ saying that every set belongs to a transitive model of ZFC satisfying $φ$. The theories ${\\rm LZFC}^φ={\\rm LZFC}$+$Loc^φ({\\rm ZFC})$ are local analogues of the theories ZFC+\"there is a proper class of large cardinals $ψ$\", where $ψ$ is a large cardinal property. If $sext(x)$ is the property of strong extendibility, it is shown that ${\\rm LZFC}^{sext}$ proves Powerset and $Σ_1$-Collection. In order to refute $V=L$ over LZFC, we combine the existence of strongly critical models with an axiom of different flavor, the Tall Model Axiom ($TMA$). $V=L$ can also be refuted by $TMA$ plus the axiom $GC$ saying that \"there is a greatest cardinal\", although it is not known if $TMA+GC$ is consistent over LZFC. Finally Vopěnka's Principle ($VP$) and its impact on LZFC are examined. It is shown that ${\\rm LZFC}^{sext}+VP$ proves Powerset and Replacement, i.e., ZFC is fully recovered. The same is true for some weaker variants of ${\\rm LZFC}^{sext}$. Moreover the theories LZFC$^{sext}$+$VP$ and ZFC+$VP$ are shown to be identical.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15287v1"
    ],
    "publication_venue": "32 pages",
    "doi": "10.1007/s00153-013-0364-5"
}