{
    "arxiv_id": "2303.16191",
    "paper_title": "Hard Nominal Example-aware Template Mutual Matching for Industrial Anomaly Detection",
    "authors": [
        "Zixuan Chen",
        "Xiaohua Xie",
        "Lingxiao Yang",
        "Jianhuang Lai"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2024-12-10"
    ],
    "latest_version": 4,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Anomaly detectors are widely used in industrial manufacturing to detect and localize unknown defects in query images. These detectors are trained on anomaly-free samples and have successfully distinguished anomalies from most normal samples. However, hard-normal examples are scattered and far apart from most normal samples, and thus they are often mistaken for anomalies by existing methods. To address this issue, we propose Hard-normal Example-aware Template Mutual Matching (HETMM), an efficient framework to build a robust prototype-based decision boundary. Specifically, HETMM employs the proposed Affine-invariant Template Mutual Matching (ATMM) to mitigate the affection brought by the affine transformations and easy-normal examples. By mutually matching the pixel-level prototypes within the patch-level search spaces between query and template set, ATMM can accurately distinguish between hard-normal examples and anomalies, achieving low false-positive and missed-detection rates. In addition, we also propose PTS to compress the original template set for speed-up. PTS selects cluster centres and hard-normal examples to preserve the original decision boundary, allowing this tiny set to achieve comparable performance to the original one. Extensive experiments demonstrate that HETMM outperforms state-of-the-art methods, while using a 60-sheet tiny set can achieve competitive performance and real-time inference speed (around 26.1 FPS) on a Quadro 8000 RTX GPU. HETMM is training-free and can be hot-updated by directly inserting novel samples into the template set, which can promptly address some incremental learning issues in industrial manufacturing.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16191v1",
        "http://arxiv.org/pdf/2303.16191v2",
        "http://arxiv.org/pdf/2303.16191v3",
        "http://arxiv.org/pdf/2303.16191v4"
    ],
    "publication_venue": "This paper is recently accepted in the International Journal of Computer Vision (IJCV). Please see our code at https://github.com/NarcissusEx/HETMM"
}