{
    "arxiv_id": "2303.15200",
    "paper_title": "The evolution of catastrophically evaporating rocky planets",
    "authors": [
        "Alfred Curry",
        "Richard Booth",
        "James E. Owen",
        "Subhanjoy Mohanty"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Catastrophically evaporating planets are observed through their dusty tails, formed through rocky material evaporated from their highly irradiated molten surfaces. The composition of these tails offers an avenue for studying the composition of rocky exoplanets, but only if the evolution of the underlying interior is understood. This is because it is the interior evolution that sets the composition at the base of the mass outflow. In this work, we present a model of the evolution of the interiors of catastrophically evaporating planets. Its basis is a one-dimensional code that takes into account energy flow through conduction and convection as well as melting. We find that these planets are likely to be entirely solid when significant mass loss occurs, other than a thin magma pool on the day side. Consequently, the outflows from the planets, and thus the dust tails, sample material only from the surface of the planet. We also use our model to investigate the occurrence rate of planets that can catastrophically evaporate, and find that, on average, a star in the Kepler sample has approximately one such planet. Our value is above, but within an order of magnitude of, the occurrence rate inferred from the Kepler statistics for Super-Earths, implying that exotic mechanisms to produce the catastrophically evaporating planet population may not be required. We also find that the range of substellar temperatures of the observed systems are well explained by recent theoretical models which only produce dust in a limited temperature region.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15200v1"
    ],
    "publication_venue": "Submitted to MNRAS"
}