{
    "arxiv_id": "2303.13058",
    "paper_title": "Evolution of rotating massive stars with new hydrodynamic wind models",
    "authors": [
        "Alex Camilo Gormaz-Matamala",
        "Jorge Cuadra",
        "Georges Meynet",
        "Michel Curé"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "Mass loss due to line-driven winds is central to our understanding of the evolution of massive stars.\n  We extend the evolution models introduced in Paper I, where the mass loss recipe is based on the simultaneous calculation of the wind hydrodynamics and the line-acceleration, by incorporating the effects of stellar rotation. We introduce a grid of self-consistent line-force parameters for a set of standard evolutionary tracks. With that, we generate a new set of evolutionary tracks with rotation for $M_\\text{ZAMS}=25,40,70,$ and $120\\,M_\\odot$, and metallicities $Z=0.014$ and $0.006$.\n  The self-consistent approach gives lower mass loss rates than the standard values adopted in previous evolution models. This decrease impacts strongly on the tracks of the most massive models. Weaker winds allow the star to retain more mass, but also more angular momentum. As a consequence, weaker wind models rotate faster and show a less efficient mixing in their inner stellar structure.\n  The new tracks predict an evolution of the rotational velocities through the MS in close agreement with the range of $\\varv\\sin i$ values found by recent surveys of Galactic O-type stars. As subsequent implications, the weaker winds from self-consistent models suggest a reduction of the contribution of the isotope $^{26}$Al to the ISM due to stellar winds of massive stars during the MS phase. Moreover, the higher luminosities found for the self-consistent evolutionary models suggest that some populations of massive stars might be less massive than previously thought, as in the case of Ofpe stars at the Galactic Centre. Therefore, this study opens a wide range of consequences for further research based on the evolution of massive stars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13058v1"
    ],
    "publication_venue": "Accepted for publication in Astronomy & Astrophysics journal",
    "doi": "10.1051/0004-6361/202345847"
}