{
    "arxiv_id": "2303.15028",
    "paper_title": "Ultra low background Micromegas detectors for BabyIAXO solar axion search",
    "authors": [
        "E. Ferrer-Ribas",
        "K. Altenmüller",
        "B. Biasuzzi",
        "J. F. Castel",
        "S. Cebrián",
        "T. Dafni",
        "K. Desch",
        "D. Díez-Ibañez",
        "J. Galán",
        "J. Galindo",
        "J. A. García",
        "A. Giganon",
        "C. Goblin",
        "I. G. Irastorza",
        "J. Kaminski",
        "G. Luzón",
        "C. Margalejo",
        "H. Mirallas",
        "X. F. Navick",
        "L. Obis",
        "A. Ortiz de Solórzano",
        "J. von Oy",
        "T. Papaevangelou",
        "O. Pérez",
        "E. Picatoste",
        "J. Ruz",
        "T. Schiffer",
        "S. Schmidt",
        "L. Segui",
        "J. K. Vogel"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ex",
        "physics.ins-det"
    ],
    "abstract": "The International AXion Observatory (IAXO) is a large scale axion helioscope that will look for axions and axion-like particles produced in the Sun with unprecedented sensitivity. BabyIAXO is an intermediate experimental stage that will be hosted at DESY (Germany) and that will test all IAXO subsystems serving as a prototype for IAXO but at the same time as a fully-fledged helioscope with potential for discovery.\n  One of the crucial components of the project is the ultra-low background X-ray detectors that will image the X-ray photons produced by axion conversion in the experiment. The baseline detection technology for this purpose are Micromegas (Microbulk) detectors. We will show the quest and the strategy to attain the very challenging levels of background targeted for BabyIAXO that need a multi-approach strategy coming from ground measurements, screening campaigns of components of the detector, underground measurements, background models, in-situ background measurements as well as powerful rejection algorithms. First results from the commissioning of the BabyIAXO prototype will be shown.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15028v1"
    ],
    "publication_venue": "4 pages, 2 figures, submitted for the proceedings of the International Conference on Micro Pattern Gaseous Detectors, December 2022, Israel"
}