{
    "arxiv_id": "2303.14331",
    "paper_title": "Natural orbitals renormalization group approach to a spin-1/2 impurity interacting with two helical liquids",
    "authors": [
        "Ru Zheng",
        "Rong-Qiang He",
        "Zhong-Yi Lu"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el"
    ],
    "abstract": "Using the natural orbitals renormalization group, we studied the problem of a localized spin- 1/2 impurity coupled to two helical liquids via the Kondo interaction in a quantum spin Hall insulator, based on the Kane-Mele model defined in a finite zigzag graphene nanoribbon. We investigated the influence of the Kondo couplings with the helical liquids on both the static and dynamic properties of the ground state. The number and distinct spatial structures of the active natural orbitals (ANOs), which play essential roles in constructing the ground-state wave function, were first analyzed. Our numerical results indicate that two ANOs emerge, equal to the number of helical liquids. Specifically, at the coupling symmetry point, both ANOs are fully active with their spatial structures being respectively constituted by the different helical liquids. In comparison, when deviating from the symmetry point, only one ANO remains fully active, which is dominantly constructed by the helical liquid with the larger Kondo coupling. Local screening of the impurity, described by the impurity spin polarization and susceptibility, was further studied. It shows that at the coupling symmetry point, the impurity is maximally polarized and the spin susceptibility reaches the maximum. On the contrary, the impurity tends to be screened without polarization when the Kondo couplings deviate well from the symmetry point. The Kondo screening cloud, manifested by the spin correlation between the impurity and the conduction electrons, was finally explored. It is demonstrated that the Kondo cloud is mainly formed by the helical liquid with the larger Kondo coupling to the impurity. On the other hand, the spin-orbital coupling breaks the symmetry in spatial distribution of the spin correlation, leading to anisotropy in the Kondo cloud.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14331v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevB.107.115149"
}