{
    "arxiv_id": "2303.16921",
    "paper_title": "Bosonic Rational Conformal Field Theories in Small Genera, Chiral Fermionization, and Symmetry/Subalgebra Duality",
    "authors": [
        "Brandon C. Rayhaun"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-07-12"
    ],
    "latest_version": 3,
    "categories": [
        "hep-th",
        "math.NT",
        "math.QA",
        "math.RT"
    ],
    "abstract": "A (1+1)D unitary bosonic rational conformal field theory (RCFT) may be organized according to its genus, a tuple $(c,\\mathscr{C})$ consisting of its central charge $c$ and a unitary modular tensor category $\\mathscr{C}$ which describes the (2+1)D topological quantum field theory (TQFT) for which its maximally extended chiral algebra forms a holomorphic boundary condition. We establish a number of results pertaining to RCFTs in \"small\" genera, by which we informally mean genera with the central charge $c$ and the number of primary operators $\\mathrm{rank}(\\mathscr{C})$ both not too large.\n  We start by completely solving the modular bootstrap problem for theories with at most four primary operators. In particular, we characterize, and provide an algorithm which efficiently computes, the function spaces to which the partition function of any bosonic RCFT with $\\mathrm{rank}(\\mathscr{C})\\leq 4$ must belong. Using this result, and leveraging relationships between RCFTs and holomorphic vertex operator algebras which come from \"gluing\" and cosets, we rigorously enumerate all bosonic theories in $95$ of the $105$ genera $(c,\\mathscr{C})$ with $c\\leq 24$ and $\\mathrm{rank}(\\mathscr{C})\\leq 4$. This includes as (new) special cases the classification of chiral algebras with three primaries and $c<\\frac{120}7\\sim 17.14$, and the classification of chiral algebras with four primaries and $c<\\frac{62}3\\sim 20.67$.\n  We then study two applications of our classification. First, by making use of chiral versions of bosonization and fermionization, we obtain the complete list of purely left-moving fermionic RCFTs with $c< 23$ as a corollary of the results of the previous paragraph. Second, using a (conjectural) concept which we call \"symmetry/subalgebra duality,\" we precisely relate our bosonic classification to the problem of determining certain generalized global symmetries of chiral CFTs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16921v1",
        "http://arxiv.org/pdf/2303.16921v2",
        "http://arxiv.org/pdf/2303.16921v3"
    ],
    "publication_venue": "25 pages + appendices, references updated, small typos corrected, 2 figures added, more physical discussion of symmetry/subalgebra duality added, two tables consolidated into one"
}