{
    "arxiv_id": "2303.08837",
    "paper_title": "Optical and near-infrared spectroscopy of the black hole transient 4U 1543-47 during its 2021 ultra-luminous state",
    "authors": [
        "J. Sánchez-Sierras",
        "T. Muñoz-Darias",
        "J. Casares",
        "G. Panizo-Espinar",
        "M. Armas Padilla",
        "J. Corral-Santana",
        "V. A. Cúneo",
        "D. Mata Sánchez",
        "S. E. Motta",
        "G. Ponti",
        "D. Steeghs",
        "M. A. P. Torres",
        "F. Vicentelli"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
    ],
    "abstract": "We present simultaneous optical and near-infrared spectra obtained during the 2021 outburst of the black hole transient 4U 1543-47. The X-ray hardness-intensity diagram and the comparison with similar systems reveal a luminous outburst, probably reaching the Eddington luminosity, as well as a long-lasting excursion to the so-called ultra-luminous state. VLT/X-shooter spectra were taken in two epochs 14 days apart during the early and brightest part of the outburst, while the source was in this ultra-luminous accretion state. The data show strong H and HeI emission lines, as well as high-excitation HeII and OIII transitions. Most lines are single-peaked in both spectra, except for the OIII lines that exhibit evident double-peaked profiles during the second epoch. The Balmer lines are embedded in broad absorption wings that we believe are mainly produced by the contribution of the A2V donor to the optical flux, which we estimate to be in the range of 11 to 14 per cent in the $r$ band during our observations. Although no conspicuous outflow features are found, we observe some wind-related line profiles, particularly in the near-infrared. Such lines include broad emission line wings and skewed red profiles, suggesting the presence of a cold (i.e. low ionisation) outflow with similar observational properties to those found in other low-inclination black hole transients.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08837v1"
    ],
    "publication_venue": "Accepted for publication in A&A"
}