{
    "arxiv_id": "2303.09148",
    "paper_title": "Massive Protostellar Disks as a Hot Laboratory of Silicate Grain Evolution",
    "authors": [
        "Ryota Yamamuro",
        "Kei E. I. Tanaka",
        "Satoshi Okuzumi"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-05-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
    ],
    "abstract": "Typical accretion disks around massive protostars are hot enough for water ice to sublimate. We here propose to utilize the massive protostellar disks for investigating the collisional evolution of silicate grains with no ice mantle, which is an essential process for the formation of rocky planetesimals in protoplanetary disks around lower-mass stars. We for the first time develop a model of massive protostellar disks that includes the coagulation, fragmentation, and radial drift of dust. We show that the maximum grain size in the disks is limited by collisional fragmentation rather than by radial drift. We derive analytic formulas that produce the radial distribution of the maximum grain size and dust surface density in the steady state. Applying the analytic formulas to the massive protostellar disk of GGD27-MM1, where the grain size is constrained from a millimeter polarimetric observation, we infer that the silicate grains in this disk fragment at collision velocities above ~ 10 m/s. The inferred fragmentation threshold velocity is lower than the maximum grain collision velocity in typical protoplanetary disks around low-mass stars, implying that coagulation alone may not lead to the formation of rocky planetesimals in those disks. With future measurements of grain sizes in massive protostellar disks, our model will provide more robust constraints on the sticking property of silicate grains.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09148v1"
    ],
    "publication_venue": "17 pages, 5 figures,accepted for publication to The Astrophysical Journal",
    "doi": "10.3847/1538-4357/acc52f"
}