{
    "arxiv_id": "2303.07898",
    "paper_title": "ISLE: A Framework for Image Level Semantic Segmentation Ensemble",
    "authors": [
        "Erik Ostrowski",
        "Muhammad Shafique"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-09-15"
    ],
    "latest_version": 4,
    "categories": [
        "cs.CV"
    ],
    "abstract": "One key bottleneck of employing state-of-the-art semantic segmentation\nnetworks in the real world is the availability of training labels. Conventional\nsemantic segmentation networks require massive pixel-wise annotated labels to\nreach state-of-the-art prediction quality. Hence, several works focus on\nsemantic segmentation networks trained with only image-level annotations.\nHowever, when scrutinizing the results of state-of-the-art in more detail, we\nnotice that they are remarkably close to each other on average prediction\nquality, different approaches perform better in different classes while\nproviding low quality in others. To address this problem, we propose a novel\nframework, ISLE, which employs an ensemble of the \"pseudo-labels\" for a given\nset of different semantic segmentation techniques on a class-wise level.\nPseudo-labels are the pixel-wise predictions of the image-level semantic\nsegmentation frameworks used to train the final segmentation model. Our\npseudo-labels seamlessly combine the strong points of multiple segmentation\ntechniques approaches to reach superior prediction quality. We reach up to 2.4%\nimprovement over ISLE's individual components. An exhaustive analysis was\nperformed to demonstrate ISLE's effectiveness over state-of-the-art frameworks\nfor image-level semantic segmentation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07898v1",
        "http://arxiv.org/pdf/2303.07898v2",
        "http://arxiv.org/pdf/2303.07898v3",
        "http://arxiv.org/pdf/2303.07898v4"
    ],
    "publication_venue": "Accepted for Publication at the International Symposium on Visual\n  Computing (ISVC), October 2023, Lake Tahoe, NV, USA"
}