{
    "arxiv_id": "2303.16197",
    "paper_title": "Nonlinear topological symmetry protection in a dissipative system",
    "authors": [
        "Stéphane Coen",
        "Bruno Garbin",
        "Gang Xu",
        "Liam Quinn",
        "Nathan Goldman",
        "Gian-Luca Oppo",
        "Miro Erkintalo",
        "Stuart G. Murdoch",
        "Julien Fatome"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics",
        "nlin.PS"
    ],
    "abstract": "We report an experimental and theoretical investigation of a system whose dynamics is dominated by an intricate interplay between three key concepts of modern physics: topology, nonlinearity, and spontaneous symmetry breaking. The experiment is based on a two-mode coherently-driven optical resonator in which photons interact through the Kerr nonlinearity. In presence of a phase defect between the modes, a nonlinear attractor develops, which confers a synthetic Möbius topology to the modal structure of the system. That topology is associated with an inherently protected exchange symmetry between the modes, enabling the realization of spontaneous symmetry breaking in ideal, bias-free, conditions without any fine tuning of parameters. The dynamic manifests itself by a periodic alternation of the modes from one resonator roundtrip to the next reminiscent of period-doubling. This extends to a range of localized structures in the form of domain walls, bright solitons, and breathers, which have all been observed with remarkable long term stability. A rigorous testing of the randomness of the symmetry-broken state selection statistics has also confirmed the robustness of the exchange symmetry in our experiment. Our results and conclusions are supported by an effective Hamiltonian model explaining the symmetry protection in our system. The model also shows that our work has relevance to other systems of interacting bosons and to the Floquet engineering of quantum matter. Our work could also be beneficial to the implementation of coherent Ising machines.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16197v1"
    ],
    "publication_venue": "14 pages, 5 figures"
}