{
    "arxiv_id": "2303.15886",
    "paper_title": "Refining the 2022 OJ 287 impact flare arrival epoch",
    "authors": [
        "Mauri J. Valtonen",
        "Staszek Zola",
        "Gopakumar",
        "Anne Lähteenmäki",
        "Merja Tornikoski",
        "Lankeswar Dey",
        "Alok C. Gupta",
        "Tapio Pursimo",
        "Emil Knudstrup",
        "Jose L. Gomez",
        "Rene Hudec",
        "Martin Jelínek",
        "Jan Štrobl",
        "Andrei V. Berdyugin",
        "Stefano Ciprini",
        "Daniel E. Reichart",
        "Vladimir V. Kouprianov",
        "Katsura Matsumoto",
        "Marek Drozdz",
        "Markus Mugrauer",
        "Alberto Sadun",
        "Michal Zejmo",
        "Aimo Sillanpää",
        "Harry J. Lehto",
        "Kari Nilsson",
        "Ryo Imazawa",
        "Makoto Uemura"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "gr-qc"
    ],
    "abstract": "The bright blazar OJ~287 routinely parades high brightness bremsstrahlung flares, which are explained as being a result of a secondary supermassive black hole (SMBH) impacting the accretion disc of a more massive primary SMBH in a binary system. The accretion disc is not rigid but rather bends in a calculable way due to the tidal influence of the secondary. Below we refer to this phenomenon as a variable disc level. We begin by showing that these flares occur at times predicted by a simple analytical formula, based on general relativity inspired modified Kepler equation, which explains impact flares since 1888.\n  The 2022 impact flare, namely flare number 26, is rather peculiar as it breaks the typical pattern of two impact flares per 12-year cycle. This is the third bremsstrahlung flare of the current cycle that follows the already observed 2015 and 2019 impact flares from OJ~287.\n  It turns out that the arrival epoch of flare number 26 is sensitive to the level of primary SMBH's accretion disc relative to its mean level in our model. We incorporate these tidally induced changes in the level of the accretion disc to infer that the thermal flare should have occurred during July-August 2022, when it was not possible to observe it from the Earth. Thereafter, we explore possible observational evidence for certain pre-flare activity by employing spectral and polarimetric data from our campaigns in 2004/05 and 2021/22. We point out theoretical and observational implications of two observed mini-flares during January-February 2022.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15886v1"
    ],
    "publication_venue": "29 pages, 6 figures, 1 table. arXiv admin note: text overlap with arXiv:2209.08360",
    "doi": "10.1093/mnras/stad922"
}