{
    "arxiv_id": "2303.12826",
    "paper_title": "Searching for clues of past binary supermassive black hole mergers in nuclear star clusters",
    "authors": [
        "Alessandra Mastrobuono-Battisti",
        "Go Ogiya",
        "Oliver Hahn",
        "Mathias Schultheis"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Galaxy mergers are common processes in the Universe. As a large fraction of galaxies hosts at their centres a central supermassive black hole (SMBH), mergers can lead to the formation of a supermassive black hole binary (SMBHB). The formation of such a binary is more efficient when the SMBHs are embedded in a nuclear star cluster (NSC). NSCs are dense and massive stellar clusters present in the majority of the observed galaxies. Their central densities can reach up to $10^7\\,M_\\odot/{\\rm pc}^3$ and their masses can be as large as a few $10^7\\,M_\\odot$. The direct detection of an SMBHB is observationally challenging. In this work, we illustrate how the large scale structural and dynamical properties of an NSC can help to identify nucleated galaxies that recently went through a merger that possibly led to the formation of a central SMBHB. Our models show that the merger can imprint signatures on the shape, density profile, rotation and velocity structure of the NSC. The strength of the signatures depends on the mass ratio between the SMBHs and on the orbital initial conditions of the merger. In addition, the number of hypervelocity stars produced in the mergers is linked to the SMBHB properties. The merger can also contribute to the formation of the nuclear stellar disc of the galaxy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12826v1"
    ],
    "publication_venue": "16 pages, 7 figures, 2 tables, 2 appendices with 3 additional figures. Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad898"
}