{
    "arxiv_id": "2303.14076",
    "paper_title": "Interferometer response characterization algorithm for multi-aperture Fabry-Perot imaging spectrometers",
    "authors": [
        "Daniele Picone",
        "Silvére Gousset",
        "Mauro Dalla Mura",
        "Yann Ferrec",
        "Etienne Le Coarer"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-05-30"
    ],
    "latest_version": 3,
    "categories": [
        "eess.IV"
    ],
    "abstract": "In recent years, the demand for hyperspectral imaging devices has grown significantly, driven by their ability of capturing high-resolution spectral information. Among the several possible optical designs for acquiring hyperspectral images, there is a growing interest in interferometric spectral imaging systems based on division of aperture. These systems have the advantage of capturing snapshot acquisitions while maintaining a compact design. However, they require a careful calibration to operate properly. In this work, we present the interferometer response characterization algorithm (IRCA), a robust three-step procedure designed to characterize the transmittance response of multi-aperture imaging spectrometers based on the interferometry of Fabry-Perot. Additionally, we propose a formulation of the image formation model for such devices suitable to estimate the parameters of interest by considering the model under various regimes of finesse. The proposed algorithm processes the image output obtained from a set of monochromatic light sources and refines the results using nonlinear regression after an ad-hoc initialization. Through experimental analysis conducted on four different prototypes from the Image SPectrometer On Chip (ImSPOC) family, we validate the performance of our approach for characterization. The associated source code for this paper is available at https://github.com/danaroth83/irca.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14076v1",
        "http://arxiv.org/pdf/2303.14076v2",
        "http://arxiv.org/pdf/2303.14076v3"
    ],
    "publication_venue": "20 pages, 11 figures. (Revised structure, added experiments)"
}