{
    "arxiv_id": "2303.15867",
    "paper_title": "Magnetised tori with magnetic polarisation around Kerr black holes: variable angular momentum discs",
    "authors": [
        "Sergio Gimeno-Soler",
        "Oscar. M. Pimentel",
        "Fabio D. Lora-Clavijo",
        "Alejandro Cruz-Osorio",
        "José A. Font"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.HE",
        "gr-qc"
    ],
    "abstract": "Analytical models of magnetised, geometrically thick discs are relevant to understand the physical conditions of plasma around compact objects and to explore its emitting properties. This has become increasingly important in recent years in the light of the Event Horizon Telescope observations of Sgr A* and M87. Models of thick discs around black holes usually consider constant angular momentum distributions and do not take into account the magnetic response of the fluid to applied magnetic fields. We present a generalisation of our previous work on stationary models of magnetised accretion discs with magnetic polarisation (Pimentel et al. 2018). This extension is achieved by accounting for non-constant specific angular momentum profiles, done through a two-parameter ansatz for those distributions. We build a large number of new equilibrium solutions of thick discs with magnetic polarisation around Kerr black holes, selecting suitable parameter values within the intrinsically substantial parameter space of the models. We study the morphology and the physical properties of those solutions, finding qualitative changes with respect to the constant angular momentum tori of (Pimentel et al. 2018). However, the dependences found on the angular momentum distribution or on the black hole spin do not seem to be strong. Some of the new solutions, however, exhibit a local maximum of the magnetisation function, absent in standard magnetised tori. Due to the enhanced development of the magneto-rotational instability as a result of magnetic susceptibility, those models might be particularly well-suited to investigate jet formation through general-relativistic MHD simulations. The new equilibrium solutions reported here can be used as initial data in numerical codes to assess the impact of magnetic susceptibility in the dynamics and observational properties of thick disc-black hole systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15867v1",
        "http://arxiv.org/pdf/2303.15867v2"
    ],
    "publication_venue": "15 pages, 8 figures. Comments welcome"
}