{
    "arxiv_id": "2303.13950",
    "paper_title": "Reviewing the prospect of fermion triplets as dark matter and source of baryon asymmetry in non-standard cosmology",
    "authors": [
        "Anirban Biswas",
        "Mainak Chakraborty",
        "Sarif Khan"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph",
        "astro-ph.CO"
    ],
    "abstract": "The indirect searches of Dark Matter (DM), in conjugation with the so called `missing track searches' at the collider seems to confine fermion triplet DM mass within a narrow range around 1 TeV. The canonical picture of pure triplet fermionic DM is in tension since it is under-abundant for the said mass range. Several preceding studies have shown that the existence of an extra species over the radiation background, prior to the Big Bang Nucleosynthesis, leads to a fast expanding Universe driven by an enhanced Hubble parameter. This faster (than radiation) expansion has the potential to revive the under-abundant fermion triplet ($\\mathbb{Z}_2$ odd) WIMP dark matter scenario by causing freeze-out earlier without modifying the interaction strength between DM and thermal bath. Although the CP asymmetry, produced due to the decay of $\\mathbb{Z}_2$ even heavier generations of the triplet, remains unaffected by the modification of cosmology, the evolution of the same receives significant non-trivial effect. It has been observed through numerical estimations that the minimum mass of the decaying triplet, required to produce sufficient baryon asymmetry, can be lowered up to two orders (compared to the standard cosmology) in this fast expansion scenario. The non-standard parameters $n$ and $T_r$, which simultaneously control the DM relic abundance as well the frozen value of baryon asymmetry, are tightly constrained due to consecutive imposition of experimental bounds on relic density followed by observed value of baryon asymmetry of the Universe. It has been found that $n$ is strictly bounded within the interval $0.4\\lesssim n \\lesssim 1.6$. The upper bound is imposed by the baryon asymmetry constraint whereas the lower bound arises to satisfy the correct relic abundance of the DM. The restriction on $T_r$ is not so stringent as it can vary from sub GeV to few tens of GeV.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13950v1"
    ],
    "publication_venue": "39 pages, 10 figures, 1 table"
}