{
    "arxiv_id": "2303.15351",
    "paper_title": "Formation and Evolution of Coherent Structures in 3D Strongly Turbulent Magnetized Plasmas",
    "authors": [
        "Loukas Vlahos",
        "Heinz Isliker"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "physics.plasm-ph"
    ],
    "abstract": "We review the current literature on the formation of Coherent Structures (CoSs) in strongly turbulent 3D magnetized plasmas. CoSs (Current Sheets (CS), magnetic filaments, large amplitude magnetic disturbances, vortices, and shocklets) appear intermittently inside a turbulent plasma and are collectively the locus of magnetic energy transfer (dissipation) into particle kinetic energy, leading to heating and/or acceleration of the latter. CoSs and especially CSs are also evolving and fragmenting, becoming locally the source of new clusters of CoSs. Strong turbulence can be generated by the nonlinear coupling of large amplitude unstable plasma modes, by the explosive reorganization of large scale magnetic fields, or by the fragmentation of CoSs. A small fraction of CSs inside a strongly turbulent plasma will end up reconnecting. Magnetic Reconnection (MR) is one of the potential forms of energy dissipation of a turbulent plasma. Analysing the evolution of CSs and MR in isolation from the surrounding CoSs and plasma flows may be convenient for 2D numerical studies, but it is far from a realistic modeling of 3D astrophysical, space and laboratory environments, where strong turbulence can be exited, as e.g. in the solar wind, the solar atmosphere, solar flares and Coronal Mass Ejections (CMEs), large scale space and astrophysical shocks, the magnetosheath, the magnetotail, astrophysical jets, Edge Localized Modes (ELMs) in confined laboratory plasmas (TOKAMAKS), etc.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15351v1"
    ],
    "publication_venue": "27 pages, 31 figures; review; accepted for publication in Physics of Plasmas 2023",
    "doi": "10.1063/5.0141512"
}