{
    "arxiv_id": "2303.12099",
    "paper_title": "Convective boundary mixing in main-sequence stars: theory and empirical constraints",
    "authors": [
        "Evan H. Anders",
        "May G. Pedersen"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "physics.flu-dyn"
    ],
    "abstract": "The convective envelopes of solar-type stars and the convective cores of intermediate- and high-mass stars share boundaries with stable radiative zones. Through a host of processes we collectively refer to as \"convective boundary mixing\" (CBM), convection can drive efficient mixing in these nominally stable regions. In this review, we discuss the current state of CBM research in the context of main-sequence stars through three lenses. (1) We examine the most frequently implemented 1D prescriptions of CBM -- exponential overshoot, step overshoot, and convective penetration -- and we include a discussion of implementation degeneracies and how to convert between various prescriptions. (2) Next, we examine the literature of CBM from a fluid dynamical perspective, with a focus on three distinct processes: convective overshoot, entrainment, and convective penetration. (3) Finally, we discuss observational inferences regarding how much mixing should occur in the cores of intermediate- and high-mass stars, and the implied constraints that these observations place on 1D CBM implementations. We conclude with a discussion of pathways forward for future studies to place better constraints on this difficult challenge in stellar evolution modeling.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12099v1"
    ],
    "publication_venue": "Accepted for publication as an invited review in the Galaxies special issue, \"The Structure and Evolution of Stars\" (see https://www.mdpi.com/journal/galaxies/special_issues/star_structure_evolution). Supplementary materials including MESA inlists and collected data used to generate some figures can be found online in a Zenodo repository at https://zenodo.org/record/7735067"
}