{
    "arxiv_id": "2303.08827",
    "paper_title": "Simulations of pre-supernova feedback in spherical clouds",
    "authors": [
        "Michalis Kourniotis",
        "Richard Wünsch",
        "Sergio Martínez-González",
        "Jan Palouš",
        "Guillermo Tenorio-Tagle",
        "Soňa Ehlerová"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "We present a one-dimensional radiation-hydrodynamic model of a spherically symmetric cloud evolving under the influence of the self-gravity and the feedback from a star cluster forming in its centre. On one hand, the model is simple due to its 1D geometry, on the other hand, the feedback includes the ionising radiation, stellar winds and the radiation pressure acting on gas and dust. The star cluster is formed from the gas flowing into the cloud centre and the feedback parameters are determined from stellar evolution models and the cluster star forming history. The model is compared to the semi-analytic code WARPFIELD implementing similar physical processes and exploring the scenario that the young cluster R136 in the Large Magellanic Cloud was formed due to re-collapse of the shell formed by the previous generation star cluster. A good qualitative agreement is found, however, $3 - 4$ times higher stellar mass is needed to disrupt the cloud in our model, because it takes into account (contrary to WARPFIELD) self-gravity of the cloud surrounding the shell. We use the model to explore star formation in clouds with different mass, radius and density profile measuring their star formation efficiency (SFE), i.e. the fraction of the cloud mass converted to stars. We found that SFE is a function of a single parameter, $\\mathrm{log(SFE)} \\propto -n_{hm}^{-0.46}$, with $n_{hm}$ being the cloud mean particle density within its half-mass radius. Furthermore, we found that the feedback efficiency, i.e. a fraction of the feedback energy retained by gas, has a nearly constant value $\\sim 10^{-3}$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08827v1"
    ],
    "publication_venue": "15 pages including appendix, 11 figures. Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad822"
}