{
    "arxiv_id": "2303.14127",
    "paper_title": "Apparent dark matter as a non-local manifestation of emergent gravity",
    "authors": [
        "Kimet Jusufi",
        "Ahmad Sheykhi",
        "Salvatore Capozziello"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc",
        "hep-th"
    ],
    "abstract": "We disclose a close correspondence between Verlinde's Emergent Gravity (VEG) theory and the non-local gravity theories. Such non-local effects can play crucial role at small distances as well as in large scale structures. In particular, we argue that the emergent gravity effectively is a manifestation of the entanglement entropy and can modify Newton's law of gravity as well as address the flat rotation curves of spiral galaxies. In the cosmological setup, we have considered three different models for the apparent dark matter density. In the first model, we have found that Friedmann equations get modified due to the presence of the apparent dark matter (DM) in such a way that Newton's constant of gravity shifts as $G\\rightarrow G_N=G\\left(1+ζ\\right)$, where $ζ$ is a dimensionless small parameter. This modification basically coincides with the modified gravity (MOG) theory. Using the flat rotating curves we estimate $ζ\\sim 10^{-7}$. Interestingly enough, for such a model, we find out that by rescaling the radial coordinate, $r$, the curvature space constant, $k$, and the scale factor of the universe, $a$, the effect of apparent DM can change the geometry of the universe and can shift the curvature space constant as $k_{\\star}=k (1-ζ)$. Finally, we study a more realistic model applied to the whole universe with evolving densities and we address the Hubble tension problem in the context of Verlindes emergent gravity using the look-back time quantity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14127v1"
    ],
    "publication_venue": "10 pages, no figures"
}