{
    "arxiv_id": "2303.16863",
    "paper_title": "The puzzle of the formation of T8 dwarf Ross 458c",
    "authors": [
        "Josefine Gaarn",
        "Ben Burningham",
        "Jacqueline K. Faherty",
        "Channon Visscher",
        "Mark S. Marley",
        "Eileen C. Gonzales",
        "Emily Calamari",
        "Daniella Bardalez Gagliuffi",
        "Roxana Lupu",
        "Richard Freedman"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
    ],
    "abstract": "At the lowest masses, the distinction between brown dwarfs and giant exoplanets is often blurred and literature classifications rarely reflect the deuterium burning boundary. Atmospheric characterisation may reveal the extent to which planetary formation pathways contribute to the population of very-low mass brown dwarfs, by revealing if their abundance distributions differ from those of the local field population or, in the case of companions, their primary stars. The T8 dwarf Ross 458c is a possible planetary mass companion to a pair of M dwarfs, and previous work suggests that it is cloudy. We here present the results of the retrieval analysis of Ross 458c, using archival spectroscopic data in the 1.0 to 2.4 micron range. We test a cloud free model as well as a variety of cloudy models and find that the atmosphere of Ross 458c is best described by a cloudy model (strongly preferred). The CH4/H2O is higher than expected at 1.97 +0.13 -0.14. This value is challenging to understand in terms of equilibrium chemistry and plausible C/O ratios. Comparisons to thermochemical grid models suggest a C/O of ~ 1.35, if CH4 and H2O are quenched at 2000 K, requiring vigorous mixing. We find a [C/H] ratio of +0.18, which matches the metallicity of the primary system, suggesting that oxygen is missing from the atmosphere. Even with extreme mixing, the implied C/O is well beyond the typical stellar regime, suggesting a either non-stellar formation pathway, or the sequestration of substantial quantities of oxygen via hitherto unmodeled chemistry or condensation processes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16863v1"
    ],
    "publication_venue": "16 pages, 9 figures",
    "doi": "10.1093/mnras/stad753"
}