{
    "arxiv_id": "2303.16142",
    "paper_title": "Selective Hybridization of a Terpyridine-Based Molecule with a Noble Metal",
    "authors": [
        "M. Capsoni",
        "A. Schiffrin",
        "K. A. Cochrane",
        "C. -G. Wang",
        "T. Roussy",
        "A. Q. Shaw",
        "W. Ji",
        "S. A. Burke"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.chem-ph"
    ],
    "abstract": "The electronic properties of metal-molecule interfaces can in principle be controlled by molecular design and self-assembly, yielding great potential for future nano- and optoelectronic technologies. However, the coupling between molecular orbitals and the electronic states of the surface can significantly influence molecular states. In particular, molecules designed to create metal-organic self-assembled networks have functional groups that by necessity are designed to interact strongly with metals. Here, we investigate the adsorption interactions of a terpyridine (tpy)-based molecule on a noble metal, Ag(111), by low-temperature scanning tunneling microscopy (STM) and spectroscopy (STS) together with density functional theory (DFT) calculations. By comparing the local density of states (DOS) information gained from STS for the molecule on the bare Ag(111) surface with that of the molecule decoupled from the underlying metal by a NaCl bilayer, we find that tpy-localized orbitals hybridize strongly with the metal substrate. Meanwhile, those related to the phenyl rings that link the two terminal tpy groups are less influenced by the interaction with the surface. The selective hybridization of the tpy groups provides an example of strong, orbital-specific electronic coupling between a functional group and a noble-metal surface, which may alter the intended balance of interactions and resulting electronic behavior of the molecule-metal interface.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16142v1"
    ],
    "publication_venue": null,
    "doi": "10.1021/acs.jpcc.7b08576"
}