{
    "arxiv_id": "2303.17106",
    "paper_title": "Probing into the Possible Range of the U Bosonic Coupling Constants in Neutron Stars Containing Hyperons",
    "authors": [
        "Yan Xu",
        "Bin Diao",
        "Yi-Bo Wang",
        "Xiu-Lin Huang",
        "Xing-Xing Hu",
        "Zi Yu"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "nucl-th",
        "astro-ph.HE"
    ],
    "abstract": "The range of the U bosonic coupling constants in neutron star matter is a very interesting but still unsolved problem which has multifaceted influences in nuclear physics, particle physics, astrophysics and cosmology. The combination of the theoretical numerical simulation and the recent observations provides a very good opportunity to solve this problem. In the present work, the range of the U bosonic coupling constants is inferred based on the three relations of the mass-radius, mass-frequency and mass-tidal deformability in neutron star containing hyperons using the GM1, TM1 and NL3 parameter sets under the two flavor symmetries of the SU(6) and SU(3) in the framework of the relativistic mean field theory. Combined with observations from PSRs J1614-2230, J0348+0432, J2215-5135, J0952-0607, J0740+6620, J0030-0451, J1748-2446ad, XTE J1739-285, GW170817 and GW190814 events, our numerical results show that the U bosonic coupling constants may tend to be within the range from 0 to 20 GeV$^{-2}$ in neutron star containing hyperons. Moreover, the numerical results of the three relations obtained by the SU(3) symmetry are better in accordance with observation data than those obtained by the SU(6) symmetry. The results will help us to improve the strict constraints of the equation of state for neutron stars containing hyperons.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17106v1"
    ],
    "publication_venue": "14pages,4figures",
    "doi": "10.1088/1674-4527/acc995"
}