{
    "arxiv_id": "2303.07898",
    "paper_title": "ISLE: A Framework for Image Level Semantic Segmentation Ensemble",
    "authors": [
        "Erik Ostrowski",
        "Muhammad Shafique"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-09-18"
    ],
    "latest_version": 4,
    "categories": [
        "cs.CV"
    ],
    "abstract": "One key bottleneck of employing state-of-the-art semantic segmentation networks in the real world is the availability of training labels. Conventional semantic segmentation networks require massive pixel-wise annotated labels to reach state-of-the-art prediction quality. Hence, several works focus on semantic segmentation networks trained with only image-level annotations. However, when scrutinizing the results of state-of-the-art in more detail, we notice that they are remarkably close to each other on average prediction quality, different approaches perform better in different classes while providing low quality in others. To address this problem, we propose a novel framework, ISLE, which employs an ensemble of the \"pseudo-labels\" for a given set of different semantic segmentation techniques on a class-wise level. Pseudo-labels are the pixel-wise predictions of the image-level semantic segmentation frameworks used to train the final segmentation model. Our pseudo-labels seamlessly combine the strong points of multiple segmentation techniques approaches to reach superior prediction quality. We reach up to 2.4% improvement over ISLE's individual components. An exhaustive analysis was performed to demonstrate ISLE's effectiveness over state-of-the-art frameworks for image-level semantic segmentation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07898v1",
        "http://arxiv.org/pdf/2303.07898v2",
        "http://arxiv.org/pdf/2303.07898v3",
        "http://arxiv.org/pdf/2303.07898v4"
    ],
    "publication_venue": "Accepted for Publication at the International Symposium on Visual Computing (ISVC), October 2023, Lake Tahoe, NV, USA"
}