{
    "arxiv_id": "2303.13639",
    "paper_title": "Hemodynamic Effects of Entry and Exit Tear Size in Aortic Dissection Evaluated with In Vitro Magnetic Resonance Imaging and Fluid-Structure Interaction Simulation",
    "authors": [
        "Judith Zimmermann",
        "Kathrin Bäumler",
        "Michael Loecher",
        "Tyler E. Cork",
        "Alison L. Marsden",
        "Daniel B. Ennis",
        "Dominik Fleischmann"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn",
        "physics.med-ph"
    ],
    "abstract": "Understanding the complex interplay between morphologic and hemodynamic features in aortic dissection is critical for risk stratification and for the development of individualized therapy. This work evaluates the effects of entry and exit tear size on the hemodynamics in type B aortic dissection by comparing fluid-structure interaction (FSI) simulations with in vitro 4D-flow magnetic resonance imaging (MRI). A baseline patient-specific 3D-printed model and two variants with modified tear size (smaller entry tear, smaller exit tear) were embedded into a flow- and pressure-controlled setup to perform MRI as well as 12-point catheter-based pressure measurements. The same models defined the wall and fluid domains for FSI simulations, for which boundary conditions were matched with measured data. Results showed exceptionally well matched complex flow patterns between 4D-flow MRI and FSI simulations. Compared to the baseline model, false lumen flow volume decreased with either a smaller entry tear (-17.8 and -18.5 %, for FSI simulation and 4D-flow MRI, respectively) or smaller exit tear (-16.0 and -17.3 %). True to false lumen pressure difference (initially 11.0 and 7.9 mmHg, for FSI simulation and catheter-based pressure measurements, respectively) increased with a smaller entry tear (28.9 and 14.6 mmHg), and became negative with a smaller exit tear (-20.6 and -13.2 mmHg). This work establishes quantitative and qualitative effects of entry or exit tear size on hemodynamics in aortic dissection, with particularly notable impact observed on FL pressurization. FSI simulations demonstrate acceptable qualitative and quantitative agreement with flow imaging, supporting its deployment in clinical studies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13639v1"
    ],
    "publication_venue": "Judith Zimmermann and Kathrin Bäumler contributed equally"
}