{
    "arxiv_id": "2303.13676",
    "paper_title": "Resolved stellar population properties of PHANGS-MUSE galaxies",
    "authors": [
        "I. Pessa",
        "E. Schinnerer",
        "P. Sanchez-Blazquez",
        "F. Belfiore",
        "B. Groves",
        "E. Emsellem",
        "J. Neumann",
        "A. K. Leroy",
        "F. Bigiel",
        "M. Chevance",
        "D. A. Dale",
        "S. C. O. Glover",
        "K. Grasha",
        "R. S. Klessen",
        "K. Kreckel",
        "J. M. D. Kruijssen",
        "F. Pinna",
        "M. Querejeta",
        "E. Rosolowsky",
        "T. G. Williams"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Analyzing resolved stellar populations across the disk of a galaxy can provide unique insights into how that galaxy assembled its stellar mass over its lifetime. Previous work at ~1 kpc resolution has already revealed common features in the mass buildup (e.g., inside-out growth of galaxies). However, even at approximate kpc scales, the stellar populations are blurred between the different galactic morphological structures such as spiral arms, bars and bulges. Here we present a detailed analysis of the spatially resolved star formation histories (SFHs) of 19 PHANGS-MUSE galaxies, at a spatial resolution of ~100 pc. We show that our sample of local galaxies exhibits predominantly negative radial gradients of stellar age and [Z/H], consistent with previous findings, and a radial structure that is primarily consistent with local star formation, and indicative of inside-out formation. In barred galaxies, we find flatter [Z/H] gradients along the semi-major axis of the bar than along the semi-minor axis, as is expected from the radial mixing of material along the bar. In general, the derived assembly histories of the galaxies in our sample tell a consistent story of inside-out growth, where low-mass galaxies assembled the majority of their stellar mass later in cosmic history than high-mass galaxies. We also show how stellar populations of different ages exhibit different kinematics, with younger stellar populations having lower velocity dispersions than older stellar populations at similar galactocentric distances, which we interpret as an imprint of the progressive dynamical heating of stellar populations as they age. Finally, we explore how the time-averaged star formation rate evolves with time, and how it varies across galactic disks. This analysis reveals a wide variation of the SFHs of galaxy centers and additionally shows that structural features become less pronounced with age.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13676v1"
    ],
    "publication_venue": "52 pages, 48 figures, accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202245673"
}