{
    "arxiv_id": "2303.11535",
    "paper_title": "Adaptive Goal Management System of Robots",
    "authors": [
        "Muhammad Kazim",
        "Michael Muldoon",
        "Kwang-Ki K. Kim"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cs.RO",
        "cs.MA",
        "eess.SY"
    ],
    "abstract": "This paper considers the problem of managing single or multiple robots and proposes a cloud-based robot fleet manager, Adaptive Goal Management (AGM) System, for teams of unmanned mobile robots. The AGM system uses an adaptive goal execution approach and provides a restful API for communication between single or multiple robots, enabling real-time monitoring and control. The overarching goal of AGM is to coordinate single or multiple robots to productively complete tasks in an environment. There are some existing works that provide various solutions for managing single or multiple robots, but the proposed AGM system is designed to be adaptable and scalable, making it suitable for managing multiple heterogeneous robots in diverse environments with dynamic changes. The proposed AGM system presents a versatile and efficient solution for managing single or multiple robots across multiple industries, such as healthcare, agriculture, airports, manufacturing, and logistics. By enhancing the capabilities of these robots and enabling seamless task execution, the AGM system offers a powerful tool for facilitating complex operations. The effectiveness of the proposed AGM system is demonstrated through simulation experiments in diverse environments using ROS1 with Gazebo. The results show that the AGM system efficiently manages the allocated tasks and missions. Tests conducted in the manufacturing industry have shown promising results in task and mission management for both a single Mobile Industrial Robot and multiple Turtlebot3 robots. To provide further insights, a supplementary video showcasing the experiments can be found at https://github.com/mukmalone/ AdaptiveGoalManagement.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11535v1"
    ],
    "publication_venue": null
}