{
    "arxiv_id": "2303.08188",
    "paper_title": "How to measure work functions from aqueous solutions",
    "authors": [
        "Michele Pugini",
        "Bruno Credidio",
        "Irina Walter",
        "Sebastian Malerz",
        "Florian Trinter",
        "Dominik Stemer",
        "Uwe Hergenhahn",
        "Gerard Meijer",
        "Iain Wilkinson",
        "Bernd Winter",
        "Stephan Thürmer"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-04-06"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.soft",
        "physics.chem-ph"
    ],
    "abstract": "The recent application of concepts from condensed-matter physics to photoelectron spectroscopy (PES) of volatile, liquid-phase systems has enabled the measurement of electronic energetics of liquids on an absolute scale. Particularly, vertical ionization energies, VIEs, of liquid water and aqueous solutions, both in the bulk and at associated interfaces, can now be routinely determined. These IEs are referenced to the local vacuum level, which is the appropriate quantity for condensed matter with associated surfaces, including liquids. Here, we connect this newly accessible energy level to another important surface property, namely, the solution work function, e$Φ_{liq}$. We lay out the prerequisites for and unique challenges of determining e$Φ$ of aqueous solutions and liquids in general. We demonstrate - for a model aqueous solution with a tetra-n-butylammonium iodide (TBAI) surfactant solute - that concentration-dependent work functions, associated with the surface dipoles generated by the segregated interfacial layer of TBA$^+$ and I$^-$ions, can be accurately measured under controlled conditions. We detail the nature of surface potentials, uniquely tied to the nature of the flowing-liquid sample, which must be eliminated or quantified to enable such measurements. This allows us to refer measured spectra of aqueous solutions to the Fermi level and quantitatively assign surfactant concentration-dependent spectral shifts to competing work function and electronic-structure effects, the latter determining, e.g., (electro)chemical reactivity. We describe the extension of liquid-jet PES to quantitatively access concentration-dependent surface descriptors that have so far been restricted to solid-phase measurements. These studies thus mark the beginning of a new era in the characterization of the interfacial electronic structure of aqueous solutions and liquids more generally.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08188v1",
        "http://arxiv.org/pdf/2303.08188v2"
    ],
    "publication_venue": "Main manuscript: 26 pages, 7 figures. Supporting information: 5 pages, 5 figures"
}