{
    "arxiv_id": "2303.11781",
    "paper_title": "QuantumDynamics.jl: A modular approach to simulations of dynamics of open quantum systems",
    "authors": [
        "Amartya Bose"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "physics.chem-ph"
    ],
    "abstract": "Simulation of non-adiabatic dynamics of a quantum system coupled to dissipative environments poses significant challenges. New sophisticated methods are regularly being developed with an eye towards moving to larger systems and more complicated description of solvents. Many of these methods, however, are quite difficult to implement and debug. Furthermore, trying to make the individual algorithms work together through a modular application programming interface (API) can be quite difficult. We present a new, open-source software framework, QuantumDynamics.jl, designed to address these challenges. It provides implementations of a variety of perturbative and non-perturbative methods for simulating the dynamics of these sytems. Most prominently, QuantumDynamics.jl supports hierarchical equations of motion and the family of methods based on path integrals. Effort has been made to ensure maximum compatibility of interface between the various methods. Additionally, QuantumDynamics.jl, being built on a high-level programming language, brings a host of modern features to explorations of systems such as usage of Jupyter notebooks and high level plotting for exploration of systems, possibility of leveraging high-performance machine learning libraries for further development. Thus, while the built-in methods can be used as end-points in themselves, the package provides an integrated platform for experimentation, exploration, and method development.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11781v1"
    ],
    "publication_venue": "17 pages, 9 figures",
    "doi": "10.1063/5.0151483"
}