{
    "arxiv_id": "2303.08586",
    "paper_title": "Decoherent phonon effects in fast atom-surface scattering",
    "authors": [
        "L. Frisco",
        "M. S. Gravielle"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-04-26"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Understanding the influence of phonon-mediated processes on grazing-incidence fast atom diffraction (GIFAD) patterns is relevant for its use as a surface analysis technique. In this work, we apply the Phonon-Surface Initial Value Representation (P0-SIVR) approximation to study lattice vibration effects on GIFAD patterns for the He-LiF(001) system at room temperature. The P0-SIVR approach is a semiquantum method that describes the zero-phonon atom-surface scattering including the contribution of intermediate phonon transitions. The main features introduced by thermal lattice vibrations in the angular distributions of the scattered helium atoms are investigated by considering normal energies in the 0.1 -3 eV range. In all the cases, thermal fluctuations introduce a wide polar spread that transforms the interference maxima into elongated strips. We found that the polar width of these fringes does not depend on the normal energy, as it was experimentally observed. In addition, when the normal energy increases, not only the relative intensities of interference peaks are affected by the crystal vibrations, but also the visibility of the interference structures, which disappear completely for normal energies approximately equal to or higher than 3 eV. These findings agree fairly well with the experimental data reported in Phys. Chem. Chem. Phys. 237615 (2021). However, it should be noticed that the simulated polar widths underestimate the experimentally-derived limit, suggesting that there are other mechanisms, such as inelastic phonon processes, that contribute to the polar dispersion of the GIFAD patterns.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08586v1"
    ],
    "publication_venue": "7 pages, 6 figures",
    "doi": "10.1016/j.nimb.2023.03.039"
}