{
    "arxiv_id": "2303.13426",
    "paper_title": "Influence of design parameters of upstream Venturi pipeline on multiphase flow measurement",
    "authors": [
        "Mengke Zhan",
        "Muhammad Alif bin Razali",
        "Ayush Moitra",
        "Cheng-Gang Xie",
        "Wai Lam Loh",
        "Jian-Jun Shu"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "A multiphase flowmeter (MPFM) is used in the upstream oil and gas industry for continuous, in-line, real-time, oil-gas-water flow measurement without fluid separation. An MPFM typically consists of phase-fraction (holdup) and velocity (or flow rate) measurements. It is desirable to have homogeneous flow at the measurement location so that the phase-fraction measurement is representative. A horizontal blind-tee pipe-section is often installed to homogenize flow in the downstream vertical Venturi-based flowmeters; however, little information is available on the effect of horizontal blind-tee depth (HBD) on flow homogeneity. In addition, the Venturi vertical entrance length (VEL) leading to the Venturi inlet from the horizontal blind-tee outlet is another design parameter that may potentially affect the downstream phase distribution. The phase-fraction measurement principle requires liquid properties (e.g. water salinity). The local liquid richness makes the horizontal blind-tee an ideal location for measuring liquid properties; however, an excessive HBD may affect the reliability of the measurements of liquid properties, because local vortices may degrade liquid measurement representativeness if the local liquid velocity is too low. This study uses a computational fluid dynamics approach to evaluate the effect of HBD and VEL on multiphase flow measurement, including the Venturi differential-pressure, the Venturi inlet and the throat phase-fraction, and the local liquid-property at the end of a horizontal blind-tee. The computational results are validated with experimental data collected in a multiphase flow facility. Appropriate HBD and VEL are recommended.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13426v1"
    ],
    "publication_venue": null,
    "doi": "10.1080/19942060.2023.2182831"
}