{
    "arxiv_id": "2303.17448",
    "paper_title": "NN-Copula-CD: A Copula-Guided Interpretable Neural Network for Change Detection in Heterogeneous Remote Sensing Images",
    "authors": [
        "Weiming Li",
        "Xueqian Wang",
        "Gang Li",
        "Baocheng Geng",
        "Pramod K. Varshney"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2024-09-19"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV",
        "cs.LG",
        "eess.IV"
    ],
    "abstract": "Change detection (CD) in heterogeneous remote sensing images has been widely used for disaster monitoring and land-use management. In the past decade, the heterogeneous CD problem has significantly benefited from the development of deep neural networks (DNNs). However, the purely data-driven DNNs perform like a black box where the lack of interpretability limits the trustworthiness and controllability of DNNs in most practical CD applications. As a powerful knowledge-driven tool, copula theory performs well in modeling relationships among random variables. To enhance the interpretability of existing neural networks for CD, we propose a knowledge-data-driven heterogeneous CD method based on a copula-guided neural network, named NN-Copula-CD. In our NN-Copula-CD, the mathematical characteristics of copula are employed as the loss functions to supervise a neural network to learn the dependence between bi-temporal heterogeneous superpixel pairs, and then the changed regions are identified via binary classification based on the degrees of dependence of all the superpixel pairs in the bi-temporal images. We conduct in-depth experiments on three datasets with heterogeneous images, including optical, synthetic aperture radar, multispectral, and near-infrared images, where both quantitative and visual results demonstrate both the effectiveness and interpretability of our proposed NN-Copula-CD method.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17448v1",
        "http://arxiv.org/pdf/2303.17448v2"
    ],
    "publication_venue": "Add new contributors to this version, submitted to IEEE Transactions on Geoscience and Remote Sensing"
}