{
    "arxiv_id": "2303.11007",
    "paper_title": "Simple experimental realization of optical Hilbert Hotel using scalar and vector fractional vortex beams",
    "authors": [
        "Subith Kumar",
        "Anirban Ghosh",
        "Chahat Kaushik",
        "Arash Shiri",
        "Greg Gbur",
        "Sudhir Sharma",
        "G. K. Samanta"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics"
    ],
    "abstract": "Historically, infinity was long considered a vague concept - boundless, endless, larger than the largest - without any quantifiable mathematical foundation. This view changed in the 1800s through the pioneering work of Georg Cantor showing that infinite sets follow their own seemingly paradoxical mathematical rules. In 1924, David Hilbert highlighted the strangeness of infinity through a thought experiment now referred to as the Hilbert Hotel paradox, or simply Hilbert's Hotel. The paradox describes an \"fully\" occupied imaginary hotel having infinite number of single-occupancy rooms, the manager can always find a room for new guest by simply shifting current guests to the next highest room, leaving first room vacant. The investigation of wavefield singularities has uncovered the existence of a direct optical analogy to Hilbert's thought experiment. Since then, efforts have been made to investigate the properties of Hilbert's Hotel by controlling the dynamics of phase singularities in``fractional'' order optical vortex beams. Here, we have taken such proposals to the next level and experimentally demonstrated Hilbert's Hotel using both phase and polarization singularities of optical fields. Using a multi-ramped spiral-phase-plate and a supercontinuum source, we generated and controlled fractional order vortex beams for the practical implementation of Hilbert's Hotel in scalar and vector vortex beams. Using a multi-ramped spiral-phase-plate, we show the possibility for complicated transitions of the generalized Hilbert's Hotel. The generic experimental scheme illustrates the usefulness of structured beams in visualizing unusual mathematical concepts and also for fractional vector beams driven fundamental and applied research.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11007v1"
    ],
    "publication_venue": "9 pages, 5 figures"
}