{
    "arxiv_id": "2303.16916",
    "paper_title": "Stability of superconducting gap symmetries arising from antiferromagnetic magnons",
    "authors": [
        "Chi Sun",
        "Kristian Mæland",
        "Asle Sudbø"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con"
    ],
    "abstract": "We consider a planar heterostructure consisting of a normal metal in proximity to an antiferromagnetic insulator, with an interlayer exchange-coupling between the metal and the insulator. The effective electron-electron interaction between electrons in the normal metal, mediated by antiferromagnetic magnons in the insulator, is derived to second order in the interlayer exchange coupling, using a Schrieffer-Wolff transformation. Particular emphasis is placed on including analytically derived expressions for the effective interactions including Umklapp processes in the solutions to the superconducting gap equation. The gap equation is first solved at the critical temperature as an eigenvalue problem by linearizing the gap equation. The eigenvectors yield information on the symmetry of the superconducting gap at the onset of superconductivity, and we derive a phase-diagram for the order-parameter in this case. In the various regimes of the phase-diagram, we find $p$-wave, $f$-wave, and $d$-wave superconductivity, with $p$-wave superconductivity in the dominant part of the phase diagram. Umklapp processes, that come into play with increasing size of the Fermi surface, yield $f$- and $d$-wave symmetries as the preferred symmetries when band filling approaches half-filling. To investigate the stability of this order parameter symmetry as the temperature is lowered, we also consider the nonlinear gap equation at zero temperature. We conclude that the phase diagram and the symmetries of the superconducting order parameter essentially are left intact as the temperature is lowered to zero temperature.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16916v1"
    ],
    "publication_venue": "8 pages, 3 figures"
}