{
    "arxiv_id": "2303.11001",
    "paper_title": "Slow solar wind sources. High-resolution observations with a quadrature view",
    "authors": [
        "Krzysztof Barczynski",
        "Louise Harra",
        "Conrad Schwanitz",
        "Nils Janitzek",
        "David Berghmans",
        "Frédéric Auchère",
        "Regina Aznar Cuadrado",
        "Éric Buchlin",
        "Emil Kraaikamp",
        "David M. Long",
        "Sudip Mandal",
        "Susanna Parenti",
        "Hardi Peter",
        "Luciano Rodriguez",
        "Udo Schühle",
        "Phil Smith",
        "Luca Teriaca",
        "Cis Verbeeck",
        "Andrei N. Zhukov"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "physics.space-ph"
    ],
    "abstract": "The origin of the slow solar wind is still an open issue. One possibility that has been suggested is that upflows at the edge of an active region can contribute to the slow solar wind.\n  We aim to explain how the plasma upflows are generated, which mechanisms are responsible for them, and what the upflow region topology looks like.\n  We investigated an upflow region using imaging data with the unprecedented temporal (3s) and spatial (2 pixels = 236km) resolution that were obtained on 30 March 2022 with the 174Å of the Extreme-Ultraviolet Imager (EUI)/High Resolution Imager (HRI) on board Solar Orbiter. During this time, the EUI and Earth-orbiting satellites (Solar Dynamics Observatory, Hinode, and the Interface Region Imaging Spectrograph, IRIS) were located in quadrature (92 degrees), which provides a stereoscopic view with high resolution. We used the Hinode/EIS (Fe XII) spectroscopic data to find coronal upflow regions in the active region. The IRIS slit-jaw imager provides a high-resolution view of the transition region and chromosphere.\n  For the first time, we have data that provide a quadrature view of a coronal upflow region with high spatial resolution. We found extended loops rooted in a coronal upflow region. Plasma upflows at the footpoints of extended loops determined spectroscopically through the Doppler shift are similar to the apparent upward motions seen through imaging in quadrature. The dynamics of small-scale structures in the upflow region can be used to identify two mechanisms of the plasma upflow: Mechanism I is reconnection of the hot coronal loops with open magnetic field lines in the solar corona, and mechanism II is reconnection of the small chromospheric loops with open magnetic field lines in the chromosphere or transition region. We identified the locations in which mechanisms I and II work.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11001v1"
    ],
    "publication_venue": "10 pages, 6 figures, accepted for publication in A&A; manuscript is a part of Astronomy & Astrophysics special issue: Solar Orbiter First Results (Nominal Mission Phase)",
    "doi": "10.1051/0004-6361/202345983"
}