{
    "arxiv_id": "2303.16643",
    "paper_title": "High-energy synchrotron flares powered by strongly radiative relativistic magnetic reconnection: 2D and 3D PIC simulations",
    "authors": [
        "K. M. Schoeffler",
        "T. Grismayer",
        "D. Uzdensky",
        "L. O. Silva"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "physics.plasm-ph"
    ],
    "abstract": "The time evolution of high-energy synchrotron radiation generated in a relativistic pair plasma energized by reconnection of strong magnetic fields is investigated with two- and three-dimensional (2D and 3D) particle-in-cell (PIC) simulations. The simulations in this 2D/3D comparison study are conducted with the radiative PIC code OSIRIS, which self-consistently accounts for the synchrotron radiation reaction on the emitting particles, and enables us to explore the effects of synchrotron cooling. Magnetic reconnection causes compression of the plasma and magnetic field deep inside magnetic islands (plasmoids), leading to an enhancement of the flaring emission, which may help explain some astrophysical gamma-ray flare observations. Although radiative cooling weakens the emission from plasmoid cores, it facilitates additional compression there, further amplifying the magnetic field $B$ and plasma density~$n$, and thus partially mitigating this effect. Novel simulation diagnostics utilizing 2D histograms in the $n\\mbox{-}B$ space are developed and used to visualize and quantify the effects of compression. The $n\\mbox{-}B$ histograms are observed to be bounded by relatively sharp power-law boundaries marking clear limits on compression. Theoretical explanations for some of these compression limits are developed, rooted in radiative resistivity or 3D kinking instabilities. Systematic parameter-space studies with respect to guide magnetic field, system size, and upstream magnetization are conducted and suggest that stronger compression, brighter high-energy radiation, and perhaps significant quantum electrodynamic (QED) effects such as pair production, may occur in environments with larger reconnection-region sizes and higher magnetization, particularly when magnetic field strengths approach the critical (Schwinger) field, as found in magnetar magnetospheres.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16643v1"
    ],
    "publication_venue": "31 pages, 23 figures",
    "doi": "10.1093/mnras/stad1588"
}