{
    "arxiv_id": "2303.10860",
    "paper_title": "Probabilistic state synthesis based on optimal convex approximation",
    "authors": [
        "Seiseki Akibue",
        "Go Kato",
        "Seiichiro Tani"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-04-25"
    ],
    "latest_version": 2,
    "categories": [
        "quant-ph",
        "math-ph"
    ],
    "abstract": "When preparing a pure state with a quantum circuit, there is an inevitable coherent error since each unitary gate suffers from the discretized coherent error due to fault-tolerant implementation. A recently proposed approach called probabilistic state synthesis, where the circuit is probabilistically sampled to turn such coherent errors into incoherent ones, is able to reduce the order of the approximation error compared to conventional deterministic synthesis. In this paper, we demonstrate that the optimal probabilistic synthesis quadratically reduces the approximation error with respect to the trace distance. We also show that a deterministic synthesis algorithm can be efficiently converted into a probabilistic one to achieve quadratic error reduction. To estimate how the error reduction reduces the circuit size, we show that probabilistic encoding asymptotically halves the length of the classical bit string, which provides a general lower bound on the circuit size, required to approximately encode a pure state. To derive these results, we prove general theorems about the optimal convex approximation of a quantum state by using a restricted subset of quantum states. As another application of our theorem, we provide exact formulas for the minimum trace distance between an entangled state and the set of separable states and alternate proof about a recently identified coincidence between an entanglement measure and a coherence measure.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10860v1",
        "http://arxiv.org/pdf/2303.10860v2"
    ],
    "publication_venue": "21 pages, 4 figures. ArXiv:2111.05531 is a preliminary version of this paper"
}