{
    "arxiv_id": "2303.09301",
    "paper_title": "Antiferromagnet-mediated interlayer exchange: hybridization versus proximity effect",
    "authors": [
        "D. M. Polishchuk",
        "Yu. O. Tykhonenko-Polishchuk",
        "Ya. M. Lytvynenko",
        "A. M. Rostas",
        "V. Kuncser",
        "A. F. Kravets",
        "A. I. Tovstolytkin",
        "O. V. Gomonay",
        "V. Korenivski"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "We investigate the interlayer coupling between two thin ferromagnetic (F) films mediated by an antiferromagnetic (AF) spacer in F*/AF/F trilayers and show how it transitions between different regimes on changing the AF thickness. Employing layer-selective Kerr magnetometry and ferromagnetic-resonance techniques in a complementary manner enables us to distinguish between three functionally distinct regimes of such ferromagnetic interlayer coupling. The F layers are found to be individually and independently exchange-biased for thick FeMn spacers - the first regime of no interlayer F-F* coupling. F-F* coupling appears on decreasing the FeMn thickness below 9 nm. In this second regime found in structures with 6.0-9.0 nm thick FeMn spacers, the interlayer coupling exists only in a finite temperature interval just below the effective Néel temperature of the spacer, which is due to magnon-mediated exchange through the thermally softened antiferromagnetic spacer, vanishing at lower temperatures. The third regime, with FeMn thinner than 4 nm, is characterized by a much stronger interlayer coupling in the entire temperature interval, which is attributed to a magnetic-proximity induced ferromagnetic exchange. These experimental results, spanning the key geometrical parameters and thermal regimes of the F*/AF/F nanostructure, complemented by a comprehensive theoretical analysis, should broaden the understanding of the interlayer exchange in magnetic multilayers and potentially be useful for applications in spin-thermionics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09301v1"
    ],
    "publication_venue": "14 pages, 9 figures"
}