{
    "arxiv_id": "2303.09354",
    "paper_title": "The NCI Imaging Data Commons as a platform for reproducible research in computational pathology",
    "authors": [
        "Daniela P. Schacherer",
        "Markus D. Herrmann",
        "David A. Clunie",
        "Henning Höfener",
        "William Clifford",
        "William J. R. Longabaugh",
        "Steve Pieper",
        "Ron Kikinis",
        "Andrey Fedorov",
        "André Homeyer"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-10-09"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
    ],
    "abstract": "Background and Objectives: Reproducibility is a major challenge in developing machine learning (ML)-based solutions in computational pathology (CompPath). The NCI Imaging Data Commons (IDC) provides >120 cancer image collections according to the FAIR principles and is designed to be used with cloud ML services. Here, we explore its potential to facilitate reproducibility in CompPath research.\n  Methods: Using the IDC, we implemented two experiments in which a representative ML-based method for classifying lung tumor tissue was trained and/or evaluated on different datasets. To assess reproducibility, the experiments were run multiple times with separate but identically configured instances of common ML services.\n  Results: The AUC values of different runs of the same experiment were generally consistent. However, we observed small variations in AUC values of up to 0.045, indicating a practical limit to reproducibility.\n  Conclusions: We conclude that the IDC facilitates approaching the reproducibility limit of CompPath research (i) by enabling researchers to reuse exactly the same datasets and (ii) by integrating with cloud ML services so that experiments can be run in identically configured computing environments.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09354v1",
        "http://arxiv.org/pdf/2303.09354v2"
    ],
    "publication_venue": "13 pages, 5 figures; improved manuscript, new experiments with P100 GPU",
    "doi": "10.1016/j.cmpb.2023.107839"
}