{
    "arxiv_id": "2303.08654",
    "paper_title": "Convergence, concentration and critical mass phenomena in a chemotaxis model with boundary signal production for eukaryotic cell migration",
    "authors": [
        "Nicolas Meunier",
        "Philippe Souplet"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-04-04"
    ],
    "latest_version": 2,
    "categories": [
        "math.AP"
    ],
    "abstract": "We consider a model of chemotaxis with boundary signal production which describes some aspects of eukaryotic cell migration. Generic polarity markers located in the cell are transported by actin which they help to polymerize. This leads to a problem whose mathematical novelty is the nonlinear and nonlocal destabilizing term in the boundary condition.\n  We provide a detailed study of the qualitative properties of this model, namely local and global existence, convergence and blow-up of solutions. We start with a complete analysis of local existence-uniqueness in Lebesgue spaces. This turns out to be particularly relevant, in view of the mass conservation property and of the existence of $L^p$ Liapunov functionals, also obtained in this paper.\n  With the help of this local theory, we next study the global existence and convergence of solutions. In particular, in the case of quadratic nonlinearity, for any space dimension, we find an explicit, sharp mass threshold for global existence vs.~finite time blow-up of solutions. The proof is delicate, based on the possiblity to control the solution by means of the entropy function via an $\\eps$-regularity type argument. This critical mass phenomenon is somehow reminiscent of the well-known situation for the $2d$ Keller-Segel system. For nonlinearitities with general power growth, under a suitable smallness condition on the initial data, we show that solutions exist globally and converge exponentially to a constant.\n  As for the possibility of blow-up for large initial data, it turns out to occur only for nonlinearities with quadratic or superquadratic growth, whereas all solutions are shown to be global and bounded in the subquadratic case, thus revealing the existence of a sharp critical exponent for blow-up. Finally, we analyse some aspects of the blow-up asymptotics of solutions in time and space.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08654v1",
        "http://arxiv.org/pdf/2303.08654v2"
    ],
    "publication_venue": "46 pages, a few minor typos corrected in v2"
}