{
    "arxiv_id": "2303.08272",
    "paper_title": "Automated patent extraction powers generative modeling in focused chemical spaces",
    "authors": [
        "Akshay Subramanian",
        "Kevin Greenman",
        "Alexis Gervaix",
        "Tzuhsiung Yang",
        "Rafael Gómez-Bombarelli"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-06-06"
    ],
    "latest_version": 2,
    "categories": [
        "physics.chem-ph",
        "cs.LG"
    ],
    "abstract": "Deep generative models have emerged as an exciting avenue for inverse molecular design, with progress coming from the interplay between training algorithms and molecular representations. One of the key challenges in their applicability to materials science and chemistry has been the lack of access to sizeable training datasets with property labels. Published patents contain the first disclosure of new materials prior to their publication in journals, and are a vast source of scientific knowledge that has remained relatively untapped in the field of data-driven molecular design. Because patents are filed seeking to protect specific uses, molecules in patents can be considered to be weakly labeled into application classes. Furthermore, patents published by the US Patent and Trademark Office (USPTO) are downloadable and have machine-readable text and molecular structures. In this work, we train domain-specific generative models using patent data sources by developing an automated pipeline to go from USPTO patent digital files to the generation of novel candidates with minimal human intervention. We test the approach on two in-class extracted datasets, one in organic electronics and another in tyrosine kinase inhibitors. We then evaluate the ability of generative models trained on these in-class datasets on two categories of tasks (distribution learning and property optimization), identify strengths and limitations, and suggest possible explanations and remedies that could be used to overcome these in practice.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08272v1",
        "http://arxiv.org/pdf/2303.08272v2"
    ],
    "publication_venue": null
}