{
    "arxiv_id": "2303.10685",
    "paper_title": "Disentangling superconductor and dielectric microwave losses in sub-micron $\\rm Nb$/$\\rm TEOS-SiO_2$ interconnects using a multi-mode microstrip resonator",
    "authors": [
        "Cougar A. T. Garcia",
        "Nancyjane Bailey",
        "Chris Kirby",
        "Joshua A. Strong",
        "Anna Yu. Herr",
        "Steven M. Anlage",
        "Vladimir V. Talanov"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2024-06-26"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con",
        "cond-mat.mtrl-sci",
        "physics.app-ph",
        "quant-ph"
    ],
    "abstract": "Understanding the origins of power loss in superconducting interconnects is essential for the energy efficiency and scalability of superconducting digital logic. At microwave frequencies, power dissipates in both the dielectrics and superconducting wires, and these losses can be of comparable magnitude. A novel method to accurately disentangle such losses by exploiting their frequency dependence using a multi-mode transmission line resonator, supported by a geometric factor concept and a 3D superconductor finite element method (FEM) modeling, is described. Using the method we optimized a planarized fabrication process of reciprocal quantum logic (RQL) for the interconnect loss at 4.2 K and GHz frequencies. The interconnects are composed of niobium ($\\rm Nb$) insulated by silicon dioxide made with a tetraethyl orthosilicate precursor ($\\rm TEOS-SiO_2$). Two process generations use damascene fabrication, and the third one uses Cloisonné fabrication. For all three, $\\rm TEOS-SiO_2$ exhibits a dielectric loss tangent $\\tan δ= 0.0012 \\pm 0.0001$, independent of $\\rm Nb$ wire width over $0.25 - 4 \\: μm$. The $\\rm Nb$ loss varies with both the processing and the wire width. For damascene fabrication, scanning transmission electron microscopy (STEM) and energy dispersive X-ray spectroscopy (EDS) reveal that Nb oxide and Nb grain growth orientation increase the loss above the Bardeen Cooper Schrieffer (BCS) minimum theoretical resistance $R _{BCS}$. For Cloisonné fabrication, the $0.25 \\: μm$ wide $\\rm Nb$ wires exhibit an intrinsic resistance $R_s = 13 \\pm 1.4 \\: μΩ$ at 10 GHz, which is below $R_{BCS} \\approx 17 \\: μΩ$. That is arguably the lowest resistive loss reported for $\\rm Nb$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10685v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevApplied.21.024056"
}