{
    "arxiv_id": "2303.08946",
    "paper_title": "Plasma Formation in Ambient Fluid from Hypervelocity Impacts",
    "authors": [
        "Shafquat T. Islam",
        "Wentao Ma",
        "John G. Michopoulos",
        "Kevin Wang"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "physics.plasm-ph"
    ],
    "abstract": "The generation of plasma from hypervelocity impacts is an active research topic due to its important science and engineering ramifications in various applications. Previous studies have mainly focused on the ionization of the solid materials that constitute the projectile and the target. In this letter, we consider impact events that occur in a fluid (e.g.,~gas) medium, and present a multiphysics computational modeling approach and associated analysis to predict the behavior of the dynamic fluid-solid interaction that causes the surrounding fluid to ionize. The proposed computational framework is applied to a specific case involving a system of three interacting domains: a copper rod projectile impacting onto a soda lime glass target in a neon gas environment. The impact velocity is varied between 3 km/s and 6 km/s in different simulations. The computational model couples the compressible inviscid Navier-Stokes equations with the Saha ionization equations. The three material interfaces formed among the projectile, the target, and the ambient gas are tracked implicitly by solving two level set equations that share the same velocity field. The mass, momentum, and energy fluxes across the interfaces are computed using the FInite Volume method with Exact two-material Riemann problems (FIVER). The simulation result reveals a region of neon gas with high velocity, temperature, pressure, and mass density, formed in the early stage of the impact mainly due to the hypersonic compression of the fluid between the projectile and the target. For impact velocities higher than 4 km/s, ionization is predicted in this region.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08946v1"
    ],
    "publication_venue": null
}