{
    "arxiv_id": "2303.10922",
    "paper_title": "Modular $A_4$ symmetry in 3+1 active-sterile neutrino masses and mixings",
    "authors": [
        "Mayengbam Kishan Singh",
        "S. Robertson Singh",
        "N. Nimai Singh"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2024-02-27"
    ],
    "latest_version": 5,
    "categories": [
        "hep-ph"
    ],
    "abstract": "Motivated by the significance of modular symmetry in generating neutrino masses and flavor mixings, we apply the modular $A_4$ symmetry in a 3+1 scheme of active-sterile neutrino mixings. Neutrino oscillation observables in the 3$σ$ range are successfully reproduced through the vacuum expectation value of the modulus $τ$ in the Inverted Hierarchy(IH) only, whereas Normal Hierarchy (NH) is ruled out. We also study phenomenologies related to the effective neutrino masses $m_β$ in tritium beta decay and $m_{ββ}$ in neutrinoless double beta decay. Mixings between active neutrinos and eV scale sterile neutrino are analyzed in detail. The model also predicts the Dirac CP-violating phase $δ_{CP}$ and Majonara phases $α$ and $β$. The best-fit values of the neutrino mixing angles and ratios of two mass-squared differences are determined using minimum $χ^2$ analysis. The best-fit values of the neutrino oscillation observables are predicted as $\\sin^2θ_{23}=0.566,$ $\\sin^2θ_{12}=0.307,$ $ \\sin^2θ_{13}=0.023$ and $r = 0.172$. The Dirac and Majorana phases are observed at $δ_{CP}=350.19^o,\\ α=355.75^o$ and $β=333.10^o$. We also observe that the predictions of effective neutrino mass parameters in the 3+1 scheme are significantly different from the three neutrino paradigm.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10922v1",
        "http://arxiv.org/pdf/2303.10922v2",
        "http://arxiv.org/pdf/2303.10922v3",
        "http://arxiv.org/pdf/2303.10922v4",
        "http://arxiv.org/pdf/2303.10922v5"
    ],
    "publication_venue": "18 pages. Revised and updated, added more figures and analysis"
}