{
    "arxiv_id": "2303.16379",
    "paper_title": "Comprehensive ab initio study of effects of alloying elements on generalized stacking fault energies of Ni and Ni$_3$Al",
    "authors": [
        "Heyu Zhu",
        "Jiantao Wang",
        "Yun Chen",
        "Mingfeng Liu",
        "Hui Ma",
        "Yan Sun",
        "Peitao Liu",
        "Xing-Qiu Chen"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Excellent high-temperature mechanical properties of Ni-based single crystal superalloys (NSCSs) are attributed to the yield strength anomaly of Ni$_{3}$Al that is intimately related to generalized stacking fault energies (GSFEs). Therefore, clarifying the effects of alloying elements on the GSFEs is of great significance for alloys design. Here, by means of ab initio density functional theory calculations, we systematically calculated the GSFEs of different slip systems of Ni and Ni$_{3}$Al without and with alloying elements using the alias shear method. We obtained that for Ni, except for magnetic elements Mn, Fe, and Co, most of alloying elements decrease the unstable stacking fault energy ($γ_{usf}$) of the $[01\\bar{1}](111)$ and $[11\\bar{2}](111)$ slip systems and also decrease the stable stacking fault energy ($γ_{sf}$) of the $[11\\bar{2}](111)$ slip system. For Ni$_{3}$Al, most of alloying elements in groups IIIB-VIIB show a strong Al site preference. Except for Mn and Fe, the elements in groups VB-VIIB and the first column of group VIII increase the values of $γ_{usf}$ of different slip systems of Ni$_{3}$Al. On the other hand, the elements in groups IIIB-VIIB also increase the value of $γ_{sf}$. We found that Re is an excellent strengthening alloying element that significantly increases the slip barrier of the tailing slip process for Ni, and also enhances the slip barrier of the leading slip process of three slip systems for Ni$_{3}$Al. W and Mo exhibit similar effects as Re. We predicted that Os, Ru, and Ir are good strengthening alloying elements as well, since they show the strengthening effects on both the leading and tailing slip process for Ni and Ni$_{3}$Al.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16379v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevMaterials.7.043602"
}