{
    "arxiv_id": "2303.15545",
    "paper_title": "Wide-range continuous tuning of the thermal conductivity of $\\rm La_{0.5}Sr_{0.5}CoO_{3-δ}$ films via room-temperature ion-gel gating",
    "authors": [
        "Yingying Zhang",
        "William M. Postiglione",
        "Rui Xie",
        "Chi Zhang",
        "Hao Zhou",
        "Vipul Chaturvedi",
        "Kei Heltemes",
        "Hua Zhou",
        "Tianli Feng",
        "Chris Leighton",
        "Xiaojia Wang"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-05-31"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.app-ph"
    ],
    "abstract": "Solid-state control of the thermal conductivity of materials is of exceptional interest for novel devices such as thermal diodes and switches. Here, we demonstrate the ability to continuously tune the thermal conductivity of nanoscale films of $\\rm La_{0.5}Sr_{0.5}CoO_{3-δ}$ (LSCO) by a factor of over 5, via a room-temperature electrolyte-gate-induced non-volatile topotactic phase transformation from perovskite (with $δ\\approx 0.1$) to an oxygen-vacancy-ordered brownmillerite phase (with $δ=0.5$), accompanied by a metal-insulator transition. Combining time-domain thermoreflectance and electronic transport measurements, model analyses based on molecular dynamics and Boltzmann transport, and structural characterization by X-ray diffraction, we uncover and deconvolve the effects of these transitions on heat carriers, including electrons and lattice vibrations. The wide-range continuous tunability of LSCO thermal conductivity enabled by low-voltage (below 4 V) room-temperature electrolyte gating opens the door to non-volatile dynamic control of thermal transport in perovskite-based functional materials, for thermal regulation and management in device applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15545v1"
    ],
    "publication_venue": null,
    "doi": "10.1038/s41467-023-38312-z"
}