{
    "arxiv_id": "2303.10747",
    "paper_title": "Linear Analysis of Boundary-Layer Instabilities on a Finned-Cone at Mach 6",
    "authors": [
        "Daniel B. Araya",
        "Neal P. Bitter",
        "Bradley M. Wheaton",
        "Omar Kamal",
        "Tim Colonius",
        "Anthony Knutson",
        "Heath Johnson",
        "Joseph Nichols",
        "Graham V. Candler",
        "Vincenzo Russo",
        "Christoph Brehm"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "Boundary-layer instabilities for a finned cone at Mach=6, $Re=8.4 \\times 10^6$ [m$^{-1}$], and zero incidence angle are examined using linear stability methods of varying fidelity and maturity, following earlier analysis presented in [doi.org/10.2514/6.2022-3247]. The geometry and laminar flow conditions correspond to experiments conducted at the Boeing Air Force Mach 6 Quiet Tunnel (BAM6QT) at Purdue University. Where possible, a common mean flow is utilized among the stability computations, and comparisons are made along the acreage of the cone where transition is first observed in the experiment. Stability results utilizing Linear Stability Theory (LST), planar Parabolized Stability Equations (planar-PSE), One-Way Navier Stokes (OWNS), forced direct numerical simulation (DNS), and Adaptive Mesh Refinement Wavepacket Tracking (AMR-WPT) are presented. A dominant three-dimensional vortex instability occurring at $\\approx$ 250 kHz is identified that correlates well with experimental measurements of transition onset. With the exception of LST, all of the higher-fidelity linear methods considered in this work were consistent in predicting the initial growth and general structure of the vortex instability as it evolved downstream. Some of the challenges, opportunities, and development needs of the stability methods considered are discussed.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10747v1"
    ],
    "publication_venue": null
}