{
    "arxiv_id": "2303.11676",
    "paper_title": "Deep Learning Pipeline for Preprocessing and Segmenting Cardiac Magnetic Resonance of Single Ventricle Patients from an Image Registry",
    "authors": [
        "Tina Yao",
        "Nicole St. Clair",
        "Gabriel F. Miller",
        "Adam L. Dorfman",
        "Mark A. Fogel",
        "Sunil Ghelani",
        "Rajesh Krishnamurthy",
        "Christopher Z. Lam",
        "Joshua D. Robinson",
        "David Schidlow",
        "Timothy C. Slesnick",
        "Justin Weigand",
        "Michael Quail",
        "Rahul Rathod",
        "Jennifer A. Steeden",
        "Vivek Muthurangu"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2025-02-18"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Purpose: To develop and evaluate an end-to-end deep learning pipeline for segmentation and analysis of cardiac magnetic resonance images to provide core-lab processing for a multi-centre registry of Fontan patients.\n  Materials and Methods: This retrospective study used training (n = 175), validation (n = 25) and testing (n = 50) cardiac magnetic resonance image exams collected from 13 institutions in the UK, US and Canada. The data was used to train and evaluate a pipeline containing three deep-learning models. The pipeline's performance was assessed on the Dice and IoU score between the automated and reference standard manual segmentation. Cardiac function values were calculated from both the automated and manual segmentation and evaluated using Bland-Altman analysis and paired t-tests. The overall pipeline was further evaluated qualitatively on 475 unseen patient exams.\n  Results: For the 50 testing dataset, the pipeline achieved a median Dice score of 0.91 (0.89-0.94) for end-diastolic volume, 0.86 (0.82-0.89) for end-systolic volume, and 0.74 (0.70-0.77) for myocardial mass. The deep learning-derived end-diastolic volume, end-systolic volume, myocardial mass, stroke volume and ejection fraction had no statistical difference compared to the same values derived from manual segmentation with p values all greater than 0.05. For the 475 unseen patient exams, the pipeline achieved 68% adequate segmentation in both systole and diastole, 26% needed minor adjustments in either systole or diastole, 5% needed major adjustments, and the cropping model only failed in 0.4%.\n  Conclusion: Deep learning pipeline can provide standardised 'core-lab' segmentation for Fontan patients. This pipeline can now be applied to the >4500 cardiac magnetic resonance exams currently in the FORCE registry as well as any new patients that are recruited.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11676v1"
    ],
    "publication_venue": "17 pages, 6 figures",
    "doi": "10.1148/ryai.230132"
}