{
    "arxiv_id": "2303.17149",
    "paper_title": "Capturing the electron-electron cusp with the coupling-constant averaged exchange-correlation hole: A case study for Hooke's atoms",
    "authors": [
        "Lin Hou",
        "Tom J. P. Irons",
        "Yanyong Wang",
        "James W. Furness",
        "Andrew M. Teale",
        "Jianwei Sun"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph"
    ],
    "abstract": "In density functional theory the exchange-correlation (XC) energy functional can be defined exactly through the coupling-constant ($位$) averaged XC hole $\\bar{n}_\\text{xc}(\\mathbf{r},\\mathbf{r}')$, representing the probability depletion of finding an electron at $\\mathbf{r}$ due to an electron at $\\mathbf{r}$. Accurate knowledge of $\\bar{n}_\\text{xc}(\\mathbf{r},\\mathbf{r}')$ has been crucial for developing various XC energy density functional approximations and understanding their performance for real molecules and materials. However, there are very few systems for which accurate XC holes have been calculated, since this requires evaluating the one- and two-particle reduced density matrices for a reference wave function over a range of $位$ whilst the electron density remains fixed at the physical ($位=1$) density. Although the coupled-cluster singles and doubles (CCSD) method can yield exact results for a two-electron system in the complete basis set limit, it cannot capture the electron-electron cusp with commonly used finite basis sets. In this study, focusing on the Hooke's atom as a two-electron model system for which certain analytic solutions are known, we examine the effect of this cusp error on the XC hole calculated using CCSD. The Lieb functional is calculated at a range of coupling constants to determine the $位$-integrated XC hole. Our results indicate that, for the Hooke's atoms, the error introduced by the description of the electron-electron cusp using Gaussian basis sets at the CCSD level is negligible compared to the basis set incompleteness error. The system-, angle- and coupling-constant-averaged XC hole is calculated using the same approach and provides a benchmark against which the Perdew-Burke-Ernzerhof (PBE) and local density approximation (LDA) XC hole models are assessed.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17149v1"
    ],
    "publication_venue": "16 pages, 7 figures"
}