{
    "arxiv_id": "2303.17173",
    "paper_title": "Flavor structure in magnetized orbifold and blow-up manifold compactification",
    "authors": [
        "Hikaru Uchida"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "hep-th",
        "hep-ph"
    ],
    "abstract": "As the effective field theory of the superstring theory, ten-dimensional ${\\cal N}=1$ supersymmetric Yang-Mills theory is induced. We consider the ten-dimensional space-time ${\\cal M}_{10}$ as direct products of our four-dimensional space-time ${\\cal M}_{4}$ and three two-dimensional compact spaces $X_i\\ (i=1,2,3)$, i.e. ${\\cal M}_{10} = {\\cal M}_4 \\times X_2 \\times X_2 \\times X_3$. In particular, we consider $X_i$ as a torus, the torus orbifold, and also the blow-up manifold of the torus orbifold with background magnetic fluxes. We discuss the modular symmetry in the magnetized torus and its orbifold compactifications. We find that the modular flavor groups and the representations as well as modular weights of the chiral fields such as quarks and leptons obtained from the magnetized torus as well as the orbifold compactifications can be uniquely determined with the magnetic fluxes. We also discuss the magnetized blow-up manifold compactification in which orbifold singularities are replaced by parts of sphere as a smooth manifold. We find that the chiral zero mode numbers on the blow-up manifold as well as the orbifold can be determined only by the magnetic fluxes including localized fluxes due to the Atiyah-Singer index theorem, and then the degree of freedom of localized fluxes gives new additional chiral zero modes. We also find that the new chiral zero modes correspond to localized modes around the orbifold singularities.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17173v1"
    ],
    "publication_venue": "Ph.D thesis submitted to Department of Physics, Hokkaido University (January 2023), 131 pages, 5 figures"
}