{
    "arxiv_id": "2303.13575",
    "paper_title": "LBT-MODS spectroscopy of high-redshift candidates in the Chandra J1030 field. A newly discovered z$\\sim$2.8 large scale structure",
    "authors": [
        "Stefano Marchesi",
        "Marco Mignoli",
        "Roberto Gilli",
        "Giovanni Mazzolari",
        "Matilde Signorini",
        "Marisa Brienza",
        "Susanna Bisogni",
        "Micol Bolzonella",
        "Olga Cucciati",
        "Quirino D'Amato",
        "Alessandro Peca",
        "Isabella Prandoni",
        "Paolo Tozzi",
        "Cristian Vignali",
        "Fabio Vito",
        "Andrea Comastri"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present the results of a spectroscopic campaign with the Multi-Object Double Spectrograph (MODS) instrument mounted on the Large Binocular Telescope (LBT), aimed at obtaining a spectroscopic redshift for seven Chandra J1030 sources with a photometric redshift >=2.7 and optical magnitude r_AB=[24.5-26.5]. We obtained a spectroscopic redshift for five out of seven targets: all of them have z_spec>=2.5, thus probing the reliability of the Chandra J1030 photometric redshifts. The spectroscopic campaign led to the serendipitous discovery of a z~2.78 large scale structure (LSS) in the J1030 field: the structure contains four X-ray sources (three of which were targeted in the LBT-MODS campaign) and two non-X-ray detected galaxies for which a VLT-MUSE spectrum was already available. The X-ray members of the LSS are hosted in galaxies that are significantly more massive (log(M_*/M_sun)=[10.0-11.1]) than those hosting the two MUSE-detected sources (log(M_*/M_sun)<10). Both observations and simulations show that massive galaxies, and particularly objects having log(M_*/M_sun)>10, are among the best tracers of large scale structures and filaments in the cosmic web. Consequently, our result can explain why X-ray-detected AGN have also been shown to be efficient tracers of large scale structures.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13575v1"
    ],
    "publication_venue": "16 pages, 9 Figures. Accepted for publication in Astronomy and Astrophysics",
    "doi": "10.1051/0004-6361/202245513"
}