{
    "arxiv_id": "2303.16442",
    "paper_title": "Hybrid-space reconstruction with add-on distortion correction for simultaneous multi-slab diffusion MRI",
    "authors": [
        "Jieying Zhang",
        "Simin Liu",
        "Erpeng Dai",
        "Xin Shao",
        "Ziyu Li",
        "Karla L. Miller",
        "Wenchuan Wu",
        "Hua Guo"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "physics.med-ph"
    ],
    "abstract": "Purpose: This study aims to propose a model-based reconstruction algorithm for simultaneous multi-slab diffusion MRI acquired with blipped-CAIPI gradients (blipped-SMSlab), which can also incorporate distortion correction.\n  Methods: We formulate blipped-SMSlab in a 4D k-space with kz gradients for the intra-slab slice encoding and km (blipped-CAIPI) gradients for the inter-slab encoding. Because kz and km gradients share the same physical axis, the blipped-CAIPI gradients introduce phase interference in the z-km domain while motion induces phase variations in the kz-m domain. Thus, our previous k-space-based reconstruction would need multiple steps to transform data back and forth between k-space and image space for phase correction. Here we propose a model-based hybrid-space reconstruction algorithm to correct the phase errors simultaneously. Moreover, the proposed algorithm is combined with distortion correction, and jointly reconstructs data acquired with the blip-up/down acquisition to reduce the g-factor penalty.\n  Results: The blipped-CAIPI-induced phase interference is corrected by the hybrid-space reconstruction. Blipped-CAIPI can reduce the g-factor penalty compared to the non-blipped acquisition in the basic reconstruction. Additionally, the joint reconstruction simultaneously corrects the image distortions and improves the 1/g-factors by around 50%. Furthermore, through the joint reconstruction, SMSlab acquisitions without the blipped-CAIPI gradients also show comparable correction performance with blipped-SMSlab.\n  Conclusion: The proposed model-based hybrid-space reconstruction can reconstruct blipped-SMSlab diffusion MRI successfully. Its extension to a joint reconstruction of the blip-up/down acquisition can correct EPI distortions and further reduce the g-factor penalty compared with the separate reconstruction.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16442v1"
    ],
    "publication_venue": "10 figures+tables, 8 supplementary figures"
}