{
    "arxiv_id": "2303.08146",
    "paper_title": "Radio halos and relics from extended cosmic-ray ion distributions with strong diffusion in galaxy clusters",
    "authors": [
        "Uri Keshet"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
    ],
    "abstract": "A joint hadronic model is shown to quantitatively explain the observations of diffuse radio emission from galaxy clusters in the form of minihalos, giant halos, relics, and their hybrid, transitional stages. Cosmic-ray diffusion of order $D\\sim 10^{31\\text{--}32}\\text{ cm}^2\\text{ s}^{-1}$, inferred independently from relic energies, the spatial variability of giant-halo spectra, and the spectral evolution of relics, reproduces the observed spatio-spectral distributions, explains the recently discovered mega-halos as enhanced peripheral magnetisation, and quenches electron (re)acceleration by weak shocks or turbulence. For instance, the hard-to-soft evolution along secondary-electron diffusion explains both the soft spectra in most halo peripheries and relic downstreams, and the hard spectra in most halo centres and relic edges, where the photon index can reach $α\\simeq -0.5$ regardless of the Mach number $\\mathcal{M}$ of the coincident shock. Such spatio-spectral modeling, recent $γ$-ray observations, and additional accumulated evidence are thus shown to support a previous claim (Keshet 2010) that the seamless transitions among minihalos, giant halos, and relics, their similar energetics, integrated spectra, and delineating discontinuities, the inconsistent $\\mathcal{M}$ inferred from radio vs. X-rays in leptonic models, and additional observations, all indicate that these diffuse radio phenomena are manifestations of the same cosmic-ray ion population, with no need to invoke less natural alternatives.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08146v1"
    ],
    "publication_venue": "23 pages + SM, comments are welcome"
}