{
    "arxiv_id": "2303.17743",
    "paper_title": "FairGen: Towards Fair Graph Generation",
    "authors": [
        "Lecheng Zheng",
        "Dawei Zhou",
        "Hanghang Tong",
        "Jiejun Xu",
        "Yada Zhu",
        "Jingrui He"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-07-26"
    ],
    "latest_version": 2,
    "categories": [
        "cs.LG",
        "cs.CV",
        "cs.SI"
    ],
    "abstract": "There have been tremendous efforts over the past decades dedicated to the generation of realistic graphs in a variety of domains, ranging from social networks to computer networks, from gene regulatory networks to online transaction networks. Despite the remarkable success, the vast majority of these works are unsupervised in nature and are typically trained to minimize the expected graph reconstruction loss, which would result in the representation disparity issue in the generated graphs, i.e., the protected groups (often minorities) contribute less to the objective and thus suffer from systematically higher errors. In this paper, we aim to tailor graph generation to downstream mining tasks by leveraging label information and user-preferred parity constraint. In particular, we start from the investigation of representation disparity in the context of graph generative models. To mitigate the disparity, we propose a fairness-aware graph generative model named FairGen. Our model jointly trains a label-informed graph generation module and a fair representation learning module by progressively learning the behaviors of the protected and unprotected groups, from the `easy' concepts to the `hard' ones. In addition, we propose a generic context sampling strategy for graph generative models, which is proven to be capable of fairly capturing the contextual information of each group with a high probability. Experimental results on seven real-world data sets, including web-based graphs, demonstrate that FairGen (1) obtains performance on par with state-of-the-art graph generative models across six network properties, (2) mitigates the representation disparity issues in the generated graphs, and (3) substantially boosts the model performance by up to 17% in downstream tasks via data augmentation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17743v1",
        "http://arxiv.org/pdf/2303.17743v2"
    ],
    "publication_venue": null
}