{
    "arxiv_id": "2303.11782",
    "paper_title": "Novel Method to Reliably Determine the QCD Coupling from $R_{\\rm uds}$ Measurements and its effects to Muon $g-2$ and $α(M_Z^2)$ within the Tau-Charm Energy Region",
    "authors": [
        "Jian-Ming Shen",
        "Bing-Hai Qin",
        "Jiang Yan",
        "Sheng-Quan Wang",
        "Xing-Gang Wu"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph"
    ],
    "abstract": "We present a novel method for precisely determining the QCD running coupling from $R_{\\rm uds}(s)$ measurements in electron-positron annihilation. When calculating the fixed-order perturbative QCD (pQCD) approximant of $R_{\\rm uds}$, its effective coupling constant $α_s(Q_*^2)$ is determined by using the principle of maximum conformality, a rigorous scale-setting method for gauge theories, whose resultant pQCD series satisfies all the requirements of renormalization group. Contribution due to the uncalculated higher-order terms is given by the Bayesian analysis. Using $R_{\\rm uds}$ data measured by the KEDR detector at $22$ centre-of-mass energies between $1.84$ and $3.72$ GeV, we obtain $α_s(M_Z^2)=0.1227^{+0.0117}_{-0.0132}({\\rm exp.})\\pm0.0016({\\rm the.})$, where the theoretical uncertainty (the.) is negligible compared to the experimental one (exp.). Numerical analyses confirm that the new method for calculating $R_{\\rm uds}(s)$ leads to a negligible renormalization scale dependence, a significant stabilization of the perturbative series, and a significant reduction of theoretical uncertainty. It thus provides a reliable theoretical basis for precise determination of the QCD running coupling from $R_{\\rm uds}$ Measurements at future Tau-Charm Facility. It can also be applied for the precise determination of the hadronic contribution to muon $g-2$ and QED coupling $α(M_Z^2)$ within the tau-charm energy range.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11782v1"
    ],
    "publication_venue": "7 pages, 3 figures"
}