{
    "arxiv_id": "2303.12451",
    "paper_title": "Disks around young planetary-mass objects: Ultradeep Spitzer imaging of NGC1333",
    "authors": [
        "Aleks Scholz",
        "Koraljka Muzic",
        "Ray Jayawardhana",
        "Victor Almendros-Abad",
        "Isaac Wilson"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-04-19"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA"
    ],
    "abstract": "We report on a sensitive infrared search for disks around isolated young planetary-mass objects (PMOs) in the NGC1333 cluster, by stacking 70 Spitzer/IRAC frames at 3.6 and 4.5$\\,μm$. Our co-added images go >2.3 mag deeper than single-epoch frames, and cover 50 brown dwarfs, 15 of which have M9 or later spectral types. Spectral types >M9 correspond to masses in the giant planet domain, i.e., near or below the Deuterium-burning limit of 0.015 Msol. Five of the 12 PMOs show definitive evidence of excess, implying a disk fraction of 42%, albeit with a large statistical uncertainty given the small sample. Comparing with measurements for higher-mass objects, the disk fraction does not decline substantially with decreasing mass in the sub-stellar domain, consistent with previous findings. Thus, free-floating PMOs have the potential to form their own miniature planetary systems. We note that only one of the six lowest-mass objects in NGC1333, with spectral type L0 or later, has a confirmed disk. Reviewing the literature, we find that the lowest mass free-floating objects with firm disk detections have masses ~0.01 Msol (or ~10 MJup). It is not clear yet whether even lower mass objects harbor disks. If not, it may indicate that ~10 MJup is the lower mass limit for objects that form like stars. Our disk detection experiment on deep Spitzer images paves the way for studies with JWST at longer wavelengths and higher sensitivity, which will further explore disk prevalence and formation of free-floating PMOs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12451v1"
    ],
    "publication_venue": "14 pages, 3 figures, 1 table. Accepted for publication in AJ",
    "doi": "10.3847/1538-3881/acc65d"
}