{
    "arxiv_id": "2303.11097",
    "paper_title": "Time- versus Event-Triggered Consensus of a Single-Integrator Multi-Agent System",
    "authors": [
        "David Meister",
        "Frank Aurzada",
        "Mikhail A. Lifshits",
        "Frank Allgöwer"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 2,
    "categories": [
        "eess.SY"
    ],
    "abstract": "Event-triggered control has shown the potential for providing improved control performance at the same average sampling rate when compared to time-triggered control. While this observation motivates numerous event-triggered control schemes, proving it from a theoretical perspective has only been achieved for a limited number of settings. Inspired by existing performance analyses for the single-loop case, we provide a first fundamental performance comparison of time- and event-triggered control in a distributed multi-agent consensus setting. For this purpose, we consider undirected connected network topologies and the long-term average of the quadratic deviation from consensus as a performance measure. The main finding of our analysis is that time-triggered control provably outperforms event-triggered control beyond a certain number of agents in our particular setting. We thereby provide an exemplary distributed problem setup in which event-triggered control results in a performance disadvantage when compared to time-triggered control in the case of large networks. Moreover, we derive the asymptotic orders of the performance measure under both triggering schemes which give more insights into the cost relationship for large numbers of agents. Thus, by presenting an analysis for a particular setup, this work points out that the often presumed superiority of event-triggered control over time-triggered control might not generally be provided if we consider distributed settings.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11097v1",
        "http://arxiv.org/pdf/2303.11097v2"
    ],
    "publication_venue": "19 pages, 3 figures. This paper builds upon our preceding work in arXiv:2206.08862"
}