{
    "arxiv_id": "2303.12551",
    "paper_title": "Analytical Green's function for the acoustic scattering by a flat plate with a serrated edge",
    "authors": [
        "Benshuai Lyu"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "An analytical Green's function is developed to study the acoustic scattering by a flat plate with a serrated edge. The scattered pressure is solved using the Wiener-Hopf technique in conjunction with the adjoint technique. It is shown that the kernel decomposition proposed in recent literature appears only valid at high frequencies. We focus on this high-frequency regime and obtain the scattered pressure in the form of a contour integral. We show that such an integral, although complicated, can be evaluated exactly for any arbitrary piecewise linear serrations, for which closed-form analytical Green's functions are obtained. The derivation is validated by performing numerical integration of the contour integral showing excellent agreement. The Green's function is shown to agree well with the numerical results obtained using the finite element method at high frequencies. The noise directivity patterns are studied as a function of the frequency, serration amplitude, source position and Mach number respectively. It is found that noise is often enhanced at low and may be slightly reduced at high observer angles, which may be understood from the perspective of an extended or removed rigid reflection surface. It is found that increasing the mean-flow Mach number leads to increasingly evident noise amplification at side angles, a seemingly strange Doppler behaviour exhibited in source-fixed coordinate frames. The analytical Green's function is applicable to both leading- and trailing-edge scatterings, and is particularly suitable for developing a three-dimensional trailing-edge noise model that is not only highly efficient but also capable of including non-frozen turbulence effects.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12551v1"
    ],
    "publication_venue": "38pages, 15 figures",
    "doi": "10.1017/jfm.2023.256"
}