{
    "arxiv_id": "2303.16993",
    "paper_title": "Broken symmetries and excitation spectra of interacting electrons in partially filled Landau levels",
    "authors": [
        "Gelareh Farahi",
        "Cheng-Li Chiu",
        "Xiaomeng Liu",
        "Zlatko Papic",
        "Kenji Watanabe",
        "Takashi Taniguchi",
        "Michael P. Zaletel",
        "Ali Yazdani"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "cond-mat.str-el"
    ],
    "abstract": "Interacting electrons in flat bands give rise to a myriad of exotic quantum phases from those discovered in Landau levels in high magnetic fields in two-dimensional (2D) systems to more recently discovered novel phases in moire materials. Fundamental to understanding of such states is probing the ordering of various electrons' flavors, such as spin or valley, and the excitation spectrum of the broken symmetry states that they form. These properties cannot be probed directly with electrical transport measurements typically used to study such states. The zeroth Landau level (ZLL) of monolayer graphene with four-fold spin-valley isospin degeneracy is a model system for such investigations, yet after more than a decade, the nature of its broken symmetry states, particularly at partial fillings, is still not understood. Here we have developed a non-invasive spectroscopic technique with the scanning tunneling microscope (STM) to perform measurements of valley polarization of electronic wavefunctions and their excitation spectrum in the partially filled ZLL of graphene. In the electron density range in which we can compare our experiments to theory, we find excellent agreement and extract important information such as the strength of Haldane pseudopotentials that characterize the repulsive interactions underlying the fractional quantum states. Beyond this regime, our experiments uncover a surprising isospin phase transition in the presence of robust particle-hole symmetry and demonstrate that fractional quantum Hall phases are built upon broken symmetry states that persist at partial filling. Our experimental approach quantifies the valley phase diagram of the partially filled LL as a model flat-band platform that is applicable to other interacting graphene-based electronic systems which can host related broken symmetry states.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16993v1"
    ],
    "publication_venue": null
}