{
    "arxiv_id": "2303.10312",
    "paper_title": "EGTSyn: Edge-based Graph Transformer for Anti-Cancer Drug Combination Synergy Prediction",
    "authors": [
        "Jie Hu",
        "Xiaozhi Zhang",
        "Desi Shang",
        "Lijun Ouyang",
        "Yue Li",
        "Dongping Xiong"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CE"
    ],
    "abstract": "Combination therapy with multiple drugs is a potent therapy strategy for complex diseases such as cancer, due to its therapeutic efficacy and potential for reducing side effects. However, the extensive search space of drug combinations makes it challenging to screen all combinations experimentally. To address this issue, computational methods have been developed to identify prioritized drug combinations. Recently, Convolutional Neural Networks based deep learning methods have shown great potential in this community. Although the significant progress has been achieved by existing computational models, they have overlooked the important high-level semantic information and significant chemical bond features of drugs. It is worth noting that such information is rich and it can be represented by the edges of graphs in drug combination predictions. In this work, we propose a novel Edge-based Graph Transformer, named EGTSyn, for effective anti-cancer drug combination synergy prediction. In EGTSyn, a special Edge-based Graph Neural Network (EGNN) is designed to capture the global structural information of chemicals and the important information of chemical bonds, which have been neglected by most previous studies. Furthermore, we design a Graph Transformer for drugs (GTD) that combines the EGNN module with a Transformer-architecture encoder to extract high-level semantic information of drugs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10312v1",
        "http://arxiv.org/pdf/2303.10312v2"
    ],
    "publication_venue": "15 pages,4 figures,6 tables"
}