{
    "arxiv_id": "2303.13533",
    "paper_title": "Towards risk-informed PBSHM: Populations as hierarchical systems",
    "authors": [
        "Aidan J. Hughes",
        "Paul Gardner",
        "Keith Worden"
    ],
    "submission_date": "2023-03-13",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cs.AI",
        "cs.LG",
        "stat.AP"
    ],
    "abstract": "The prospect of informed and optimal decision-making regarding the operation and maintenance (O&M) of structures provides impetus to the development of structural health monitoring (SHM) systems. A probabilistic risk-based framework for decision-making has already been proposed. However, in order to learn the statistical models necessary for decision-making, measured data from the structure of interest are required. Unfortunately, these data are seldom available across the range of environmental and operational conditions necessary to ensure good generalisation of the model.\n  Recently, technologies have been developed that overcome this challenge, by extending SHM to populations of structures, such that valuable knowledge may be transferred between instances of structures that are sufficiently similar. This new approach is termed population-based structural heath monitoring (PBSHM).\n  The current paper presents a formal representation of populations of structures, such that risk-based decision processes may be specified within them. The population-based representation is an extension to the hierarchical representation of a structure used within the probabilistic risk-based decision framework to define fault trees. The result is a series, consisting of systems of systems ranging from the individual component level up to an inventory of heterogeneous populations. The current paper considers an inventory of wind farms as a motivating example and highlights the inferences and decisions that can be made within the hierarchical representation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13533v1"
    ],
    "publication_venue": "Submitted to IMAC-XLI conference (2023), Austin, Texas, USA"
}