{
    "arxiv_id": "2303.12011",
    "paper_title": "The chemistry of H2NC in the interstellar medium and the role of the C + NH3 reaction",
    "authors": [
        "M. Agundez",
        "O. Roncero",
        "N. Marcelino",
        "C. Cabezas",
        "B. Tercero",
        "J. Cernicharo"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We carried out an observational search for the recently discovered molecule H2NC, and its more stable isomer H2CN, toward eight cold dense clouds (L1544, L134N, TMC-2, Lupus-1A, L1489, TMC-1 NH3, L1498, and L1641N) and two diffuse clouds (B0415+379 and B0355+508) in an attempt to constrain its abundance in different types of interstellar regions and shed light on its formation mechanism. We detected H2NC in most of the cold dense clouds targeted, 7 out of 8, while H2CN was only detected in 5 out of 8 clouds. The column densities derived for both H2NC and H2CN are in the range 1e11-1e12 cm-2 and the abundance ratio H2NC/H2CN varies between 0.51 and >2.7. The metastable isomer H2NC is therefore widespread in cold dense clouds where it is present with an abundance similar to that of H2CN. We did not detect either H2NC or H2CN in any of the two diffuse clouds targeted, which does not allow to shed light on how the chemistry of H2NC and H2CN varies between dense and diffuse clouds. We found that the column density of H2NC is correlated with that of NH3, which strongly suggests that these two molecules are chemically linked, most likely ammonia being a precursor of H2NC through the C + NH3 reaction. We performed electronic structure and statistical calculations which show that both H2CN and H2NC can be formed in the C + NH3 reaction through two different channels involving two different transition states which lie very close in energy. The predicted product branching ratio H2NC/H2CN is very method dependent but values between 0.5 and 0.8 are the most likely ones. Therefore, both the astronomical observations and the theoretical calculations support that the reaction C + NH3 is the main source of H2NC in interstellar clouds.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12011v1"
    ],
    "publication_venue": "Accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202346279"
}