{
    "arxiv_id": "2303.15020",
    "paper_title": "A Generalized Hybrid Hoare Logic",
    "authors": [
        "Naijun Zhan",
        "Xiangyu Jin",
        "Bohua Zhan",
        "Shuling Wang",
        "Dimitar Guelev"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2024-04-25"
    ],
    "latest_version": 2,
    "categories": [
        "cs.LO"
    ],
    "abstract": "Deductive verification of hybrid systems (HSs) increasingly attracts more attention in recent years because of its power and scalability, where a powerful specification logic for HSs is the cornerstone. Often, HSs are naturally modelled by concurrent processes that communicate with each other. However, existing specification logics cannot easily handle such models. In this paper, we present a specification logic and proof system for Hybrid Communicating Sequential Processes (HCSP), that extends CSP with ordinary differential equations (ODE) and interrupts to model interactions between continuous and discrete evolution. Because it includes a rich set of algebraic operators, complicated hybrid systems can be easily modelled in an algebra-like compositional way in HCSP. Our logic can be seen as a generalization and simplification of existing hybrid Hoare logics (HHL) based on duration calculus (DC), as well as a conservative extension of existing Hoare logics for concurrent programs. Its assertion logic is the first-order theory of differential equations (FOD), together with assertions about traces recording communications, readiness, and continuous evolution. We prove continuous relative completeness of the logic w.r.t. FOD, as well as discrete relative completeness in the sense that continuous behaviour can be arbitrarily approximated by discretization. Besides, we discuss how to simplify proofs using the logic by providing a simplified assertion language and the corresponding inference rules for HCSP, especially those for ODEs and interrupts. Finally, we implement the above logic in Isabelle/HOL, and apply it to verify a simplified version of the cruise control system.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15020v1",
        "http://arxiv.org/pdf/2303.15020v2"
    ],
    "publication_venue": null
}