{
    "arxiv_id": "2303.09351",
    "paper_title": "Optimizing antimicrobial treatment schedules: some fundamental analytical results",
    "authors": [
        "Guy Katriel"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.PE",
        "math.OC",
        "q-bio.QM"
    ],
    "abstract": "This work studies fundamental questions regarding the optimal design of antimicrobial treatment protocols, using standard pharmacodynamic and pharmacokinetic mathematical models. We consider the problem of designing an antimicrobial treatment schedule to achieve eradication of a microbial infection, while minimizing the area under the time-concentration curve (AUC). We first solve this problem under the assumption that an arbitrary antimicrobial concentration profile may be chosen, and prove that the 'ideal' concentration profile consists of a constant concentration over a finite time duration, where explicit expressions for the optimal concentration and the time duration are given in terms of the pharmacodynamic parameters. Since antimicrobial concentration profiles are induced by a dosing schedule and the antimicrobial pharmacokinetics, the ideal concentration profile is not strictly feasible. We therefore also investigate the possibility of achieving outcomes which are close to those provided by the ideal concentration profile,using a bolus+continuous dosing schedule, which consists of a loading dose followed by infusion of the antimicrobial at a constant rate. We explicitly find the optimal bolus+continuous dosing schedule, and show that, for realistic parameter ranges, this schedule achieves results which are nearly as efficient as those attained by the ideal concentration profile. The optimality results obtained here provide a baseline and reference point for comparison and evaluation of antimicrobial treatment plans.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09351v1"
    ],
    "publication_venue": null
}