{
    "arxiv_id": "2303.16629",
    "paper_title": "Power sector effects of alternative options for de-fossilizing heavy-duty vehicles: go electric, and charge smartly",
    "authors": [
        "Carlos Gaete-Morales",
        "Julius Jöhrens",
        "Florian Heining",
        "Wolf-Peter Schill"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2024-04-08"
    ],
    "latest_version": 3,
    "categories": [
        "econ.GN"
    ],
    "abstract": "In the passenger car segment, battery-electric vehicles (BEV) have emerged as the most promising option to de-fossilize transportation. For heavy-duty vehicles (HDV), the technology space still appears to be more open. Aside from BEV, electric road systems (ERS) for dynamic power transfer are discussed, as well as indirect electrification with trucks that use hydrogen fuel cells or e-fuels. Here we investigate the power sector implications of these alternative options. We apply an open-source capacity expansion model to future scenarios of Germany with high renewable energy shares, drawing on detailed route-based truck traffic data. Results show that power sector costs are lowest for flexibly charged BEV that also carry out vehicle-to-grid operations, and highest for HDV using e-fuels. If BEV and ERS-BEV are not charged in an optimized way, power sector costs increase, but are still substantially lower than in scenarios with hydrogen or e-fuels. This is a consequence of the poor energy efficiency of indirect HDV electrification, which outweighs its temporal flexibility benefits. We further find a higher use of solar photovoltaic energy for BEV and ERS-BEV, while hydrogen and e-fuel HDV lead to a higher use of wind power and fossil electricity generation. Results are qualitatively robust in sensitivity analyses without the European interconnection or with capacity limits for wind power expansion.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16629v1",
        "http://arxiv.org/pdf/2303.16629v2",
        "http://arxiv.org/pdf/2303.16629v3"
    ],
    "publication_venue": null
}