{
    "arxiv_id": "2303.10210",
    "paper_title": "The GLASS-JWST Early Release Science Program. III. Strong lensing model of Abell 2744 and its infalling regions",
    "authors": [
        "Pietro Bergamini",
        "Ana Acebron",
        "Claudio Grillo",
        "Piero Rosati",
        "Gabriel Bartosch Caminha",
        "Amata Mercurio",
        "Eros Vanzella",
        "Charlotte Mason",
        "Tommaso Treu",
        "Giuseppe Angora",
        "Gabriel B. Brammer",
        "Massimo Meneghetti",
        "Mario Nonino",
        "Kristan Boyett",
        "Marusa Bradac",
        "Marco Castellano",
        "Adriano Fontana",
        "Takahiro Morishita",
        "Diego Paris",
        "Gonzalo Prieto-Lyon",
        "Guido Roberts-Borsani",
        "Namrata Roy",
        "Paola Santini",
        "Benedetta Vulcani",
        "Xin Wang",
        "Lilan Yang"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
    ],
    "abstract": "We present a new high-precision, JWST-based, strong lensing model for the galaxy cluster Abell 2744 at $z=0.3072$. By combining the deep, high-resolution JWST imaging from the GLASS-JWST and UNCOVER programs and a Director's Discretionary Time program, with newly obtained VLT/MUSE data, we identify 32 multiple images from 11 background sources lensed by two external sub-clusters at distances of ~160\" from the main cluster. The new MUSE observations enable the first spectroscopic confirmation of a multiple image system in the external clumps. Moreover, the re-analysis of the spectro-photometric archival and JWST data yields 27 additional multiple images in the main cluster. The new lens model is constrained by 149 multiple images ($\\sim66\\%$ more than in our previous Bergamini et al. 2023 model) covering an extended redshift range between 1.03 and 9.76. The subhalo mass component of the cluster includes 177 member galaxies down to $m_{\\rm F160W}=21$, 163 of which are spectroscopically confirmed. Internal velocity dispersions are measured for 85 members. The new lens model is characterized by a remarkably low scatter between predicted and observed positions of the multiple images (0.43\"). This precision is unprecedented given the large multiple image sample, the complexity of the cluster mass distribution, and the large modeled area. The improved accuracy and resolution of the cluster total mass distribution provides a robust magnification map over a $\\sim\\!45$ arcmin$^2$ area, which is critical for inferring the intrinsic physical properties of the highly magnified, high-$z$ sources. The lens model and the new MUSE redshift catalog are released with this publication.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10210v1"
    ],
    "publication_venue": "Submitted to ApJ., 23 pages, 10 figures, 3 tables"
}