{
    "arxiv_id": "2303.10716",
    "paper_title": "$\\rm Li_x(C_5H_5N)_yFe_{2-z}Se_2$: a defect resilient expanded-lattice high-temperature superconductor",
    "authors": [
        "Alexandros Deltsidis",
        "Laura Simonelli",
        "Georgios Vailakis",
        "Izar Capel Berdiell",
        "Georgios Kopidakis",
        "Anna Krzton-Maziopa",
        "Emil S. Bozin",
        "Alexandros Lappas"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con",
        "cond-mat.mtrl-sci",
        "cond-mat.str-el"
    ],
    "abstract": "Two-dimensional iron-chalcogenide intercalates display a remarkable correlation of the interlayer spacing with the enhancement of the superconducting critical temperature ($T_c$). In this work, synchrotron x-ray absorption ($XAS$, at Fe and Se K edges) and emission ($XES$) spectroscopies, allow to discuss how the important rise of $T_c$ (44 K) in the molecule intercalated $\\rm Li_x(C_5H_5N)_yFe_{2-z}Se_2$ relates to the electronic and local structure changes felt by the inorganic host upon doping ($x$). $XES$ shows that widely-separated layers of edge-sharing $\\rm FeSe_4$ tetrahedra, carry low-spin moieties with a local Fe magnetic moment slightly reduced compared to the parent $β$-$\\rm Fe_{2-z}Se_2$. Pre-edge $XAS$ advises on the progressively reduced mixing of metal $3d-4p$ states upon lithiation. Doping-mediated local lattice modifications, probed by conventional $T_c$-optimization measures (cf. anion height and $FeSe_4$ tetrahedra regularity), become less relevant when layers are spaced far away. On the basis of extended x-ray absorption fine structure, such distortions are compensated by a softer Fe-network that relates to Fe-site vacancies, alleviating electron-lattice correlations and superconductivity. Density functional theory ($DFT$) guided modification of isolated $\\rm Fe_{2-z}Se_2$ ($z$, vacant sites) planes, resembling the host layers, identify that Fe-site deficiency occurs at low energy cost, giving rise to stretched Fe-sheets, in accord with experiments. The robust high-$T_c$ in $\\rm Li_x(C_5H_5N)_yFe_{2-z}Se_2$, arises from the interplay of electron donating spacers and the iron-selenide layers tolerance to defect chemistry, a tool to favorably tune its Fermi surface properties.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10716v1"
    ],
    "publication_venue": "Main text of 29 pages, 9 Figures, 1 Table. Supplemental Material of 17 pages, 7 Figures, 1 Table",
    "doi": "10.1021/acs.inorgchem.2c01906"
}