{
    "arxiv_id": "2303.16595",
    "paper_title": "A general equilibrium model for multi-passenger ridesharing systems with stable matching",
    "authors": [
        "Rui Yao",
        "Shlomo Bekhor"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "econ.GN"
    ],
    "abstract": "This paper proposes a general equilibrium model for multi-passenger ridesharing systems, in which interactions between ridesharing drivers, passengers, platforms, and transportation networks are endogenously captured. Stable matching is modeled as an equilibrium problem in which no ridesharing driver or passenger can reduce ridesharing disutility by unilaterally switching to another matching sequence. This paper is one of the first studies that explicitly integrates the ridesharing platform multi-passenger matching problem into the model. By integrating matching sequence with hyper-network, ridesharing-passenger transfers are avoided in a multi-passenger ridesharing system. Moreover, the matching stability between the ridesharing drivers and passengers is extended to address the multi-OD multi-passenger case in terms of matching sequence. The paper provides a proof for the existence of the proposed general equilibrium. A sequence-bush algorithm is developed for solving the multi-passenger ridesharing equilibrium problem. This algorithm is capable to handle complex ridesharing constraints implicitly. Results illustrate that the proposed sequence-bush algorithm outperforms general-purpose solver, and provides insights into the equilibrium of the joint stable matching and route choice problem. Numerical experiments indicate that ridesharing trips are typically longer than average trip lengths. Sensitivity analysis suggests that a properly designed ridesharing unit price is necessary to achieve network benefits, and travelers with relatively lower values of time are more likely to participate in ridesharing.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16595v1"
    ],
    "publication_venue": null
}