{
    "arxiv_id": "2303.13184",
    "paper_title": "Effects of accretion on the Structure and Rotation of Forming Stars",
    "authors": [
        "Amard L.",
        "Matt S. P"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Rotation period measurements of low-mass stars show that the spin distributions in young clusters do not exhibit the spin-up expected due to contraction, during the phase when a large fraction of stars are still surrounded by accretion discs. During this stage, the stars accrete mass and angular momentum and may experience accretion enhanced-magnetised winds. At the same time, the accretion of mass and energy has a significant impact on the evolution of stellar structure and moment of inertia. We compute evolution models of accreting very young stars and determine, in a self-consistent way, the effect of accretion on stellar structure and the angular momentum exchanges between the stars and their disc. We then vary the deuterium content, the accretion history, the entropy content of the accreted material, and the magnetic field as well as the efficiency of the accretion-enhanced winds. It comes that the models are driven alternatively both by the evolution of the momentum of inertia, and by the star-disc interaction torques. Of all the parameters we tested, the magnetic field strength, the accretion history and the Deuterium content have the largest impact. The injection of heat only plays a major role early in the evolution. This work demonstrates the importance of the moment of inertia's evolution under the influence of accretion to explain the constant rotation rates distributions that are observed over the star-disc interactions. When accounting for rotation, the models computed with an up-to-date torque along with a consistent structural evolution of the accreting star are able to explain the almost constant spin evolution for the whole range of parameter we investigated, albeit only reproducing a narrow range around the median of the observed spin rate distributions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13184v1"
    ],
    "publication_venue": "13 pages, submitted version improved after 1st referee report, comments always welcome"
}