{
    "arxiv_id": "2303.13688",
    "paper_title": "Low-cost Efficient Wireless Intelligent Sensor (LEWIS) for Engineering, Research, and Education",
    "authors": [
        "Mahsa Sanei",
        "Solomon Atcitty",
        "Fernando Moreu"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CY",
        "cs.HC"
    ],
    "abstract": "Sensors have the capability of collecting engineering data and quantifying environmental changes, activities, or phenomena. Civil engineers lack of knowledge in sensor technology. Therefore, the vision of smart cities equipped with sensors informing decisions has not been realized to date. The cost associated with data acquisition systems, laboratories, and experiments restricts access to sensors for wider audiences. Recently, sensors are becoming a new tool in education and training, giving learners real-time information that can reinforce their confidence and understanding of scientific or engineering new concepts. However, the electrical components and computer knowledge associated with sensors are still a challenge for civil engineers. If sensing technology costs and use are simplified, sensors could be tamed by civil engineering students. The researcher developed, fabricated, and tested an efficient low-cost wireless intelligent sensor (LEWIS) aimed at education and research, named LEWIS1. This platform is directed at learners connected with a cable to the computer but has the same concepts and capabilities as the wireless version. The content of this paper describes the hardware and software architecture of the first prototype and their use, as well as the proposed new LEWIS1 (LEWIS1 beta) that simplifies both hardware and software, and user interfaces. The capability of the proposed sensor is compared with an accurate commercial PCB sensor through experiments. The later part of this paper demonstrates applications and examples of outreach efforts and suggests the adoption of LEWIS1 beta as a new tool for education and research. The authors also investigated the number of activities and sensor building workshops that has been done since 2015 using the LEWIS sensor which shows an ascending trend of different professionals excitement to involve and learn the sensor fabrication.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13688v1"
    ],
    "publication_venue": "19 pages, 17 figures, 7 tables"
}