{
    "arxiv_id": "2303.08174",
    "paper_title": "A super-Earth and a mini-Neptune near the 2:1 MMR straddling the radius valley around the nearby mid-M dwarf TOI-2096",
    "authors": [
        "F. J. Pozuelos",
        "M. Timmermans",
        "B. V. Rackham",
        "L. J. Garcia",
        "A. J. Burgasser",
        "S. R. Kane",
        "M. N. Günther",
        "K. G. Stassun",
        "V. Van Grootel",
        "M. Dévora-Pajares",
        "R. Luque",
        "B. Edwards",
        "P. Niraula",
        "N. Schanche",
        "R. D. Wells",
        "E. Ducrot",
        "S. Howell",
        "D. Sebastian",
        "K. Barkaoui",
        "W. Waalkes",
        "C. Cadieux",
        "R. Doyon",
        "R. P. Boyle",
        "J. Dietrich",
        "A. Burdanov",
        "L. Delrez",
        "B. -O. Demory",
        "J. de Wit",
        "G. Dransfield",
        "M. Gillon",
        "Y. Gómez Maqueo Chew",
        "M. J. Hooton",
        "E. Jehin",
        "C. A. Murray",
        "P. P. Pedersen",
        "D. Queloz",
        "S. J. Thompson",
        "A. H. M. J. Triaud",
        "S. Zúñiga-Fernández",
        "K. A. Collins",
        "M. M. Fausnaugh",
        "C. Hedges",
        "K. M. Hesse",
        "J. M. Jenkins",
        "M. Kunimoto",
        "D. W. Latham",
        "A. Shporer",
        "E. B. Ting",
        "G. Torres",
        "P. Amado",
        "J. R. Rodón",
        "C. Rodríguez-López",
        "J. C. Suárez",
        "R. Alonso",
        "Z. Benkhaldoun",
        "Z. K. Berta-Thompson",
        "P. Chinchilla",
        "M. Ghachoui",
        "M. A. Gómez-Muñoz",
        "R. Rebolo",
        "L. Sabin",
        "U. Schroffenegger",
        "E. Furlan",
        "C. Gnilka",
        "K. Lester",
        "N. Scott",
        "C. Aganze",
        "R. Gerasimov",
        "C. Hsu",
        "C. Theissen",
        "D. Apai",
        "W. P. Chen",
        "P. Gabor",
        "T. Henning",
        "L. Mancini"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Several planetary formation models have been proposed to explain the observed abundance and variety of compositions of super-Earths and mini-Neptunes. In this context, multitransiting systems orbiting low-mass stars whose planets are close to the radius valley are benchmark systems, which help to elucidate which formation model dominates. We report the discovery, validation, and initial characterization of one such system, TOI-2096, composed of a super-Earth and a mini-Neptune hosted by a mid-type M dwarf located 48 pc away. We first characterized the host star by combining different methods. Then, we derived the planetary properties by modeling the photometric data from TESS and ground-based facilities. We used archival data, high-resolution imaging, and statistical validation to support our planetary interpretation. We found that TOI-2096 corresponds to a dwarf star of spectral type M4. It harbors a super-Earth (R$\\sim1.2 R_{\\oplus}$) and a mini-Neptune (R$\\sim1.90 R_{\\oplus}$) in likely slightly eccentric orbits with orbital periods of 3.12 d and 6.39 d, respectively. These orbital periods are close to the first-order 2:1 mean-motion resonance (MMR), which may lead to measurable transit timing variations (TTVs). We computed the expected TTVs amplitude for each planet and found that they might be measurable with high-precision photometry delivering mid-transit times with accuracies of $\\lesssim$2 min. Moreover, measuring the planetary masses via radial velocities (RVs) is also possible. Lastly, we found that these planets are among the best in their class to conduct atmospheric studies using the James Webb Space Telescope (JWST). The properties of this system make it a suitable candidate for further studies, particularly for mass determination using RVs and/or TTVs, decreasing the scarcity of systems that can be used to test planetary formation models around low-mass stars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08174v1"
    ],
    "publication_venue": "25 pages, 21 figures. Aceptted for publication in Astronomy & Astrophysics",
    "doi": "10.1051/0004-6361/202245440"
}