{
    "arxiv_id": "2303.15401",
    "paper_title": "Constraints on cosmic curvature from cosmic chronometer and quasar observations",
    "authors": [
        "Bikash R. Dinda"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "gr-qc"
    ],
    "abstract": "We consider cosmic chronometer (CC) data for the Hubble parameter, quasar (QSO) luminosities data of X-rays and ultraviolet rays emission, and the latest measurements of the present value of the Hubble parameter from 2018 Planck mission (PL18), and SH0ES observations (SHOES) to constrain the present value of cosmic curvature density parameter. We consider three kinds of dark energy models: the $Λ$CDM model, the wCDM model, and the CPL parametrization. In all these three models, we find higher values of the matter-energy density parameter, $Ω_{\\rm m0}$ compared to the one obtained from the Planck 2018 mission of CMB observation. Also, we find evidence for a nonflat and closed Universe at 0.5$σ$ to 3$σ$ confidence levels. The flat Universe is almost 2 to 3$σ$, 1 to 1.5$σ$, and 0.5 to 1$σ$ away from the corresponding mean values, obtained in $Λ$CDM model, wCDM model, and CPL parametrization respectively obtained from different combinations of datasets. The evidence for nonzero cosmic curvature is lesser in dynamical dark energy models compared to the $Λ$CDM model. That means the evidence of nonzero cosmic curvature depends on the behavior of the equation of state of the dark energy. Since the values of the cosmic curvature are degenerate to the equation of state of the dark energy, we also consider a model independent analysis to constrain the cosmic curvature using the combination of Gaussian process regression analysis and artificial neural networks analysis. In the model independent analysis, we also find evidence for a closed Universe, and the flat Universe is almost 1$σ$ away. So, both the model dependent and independent analyses favor a closed Universe from the combinations of CC, QSO, and $H_0$ observations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15401v1"
    ],
    "publication_venue": "17 pages (double column), 7 figures, 6 tables, comments are welcome"
}