{
    "arxiv_id": "2303.14911",
    "paper_title": "Finite Strain Topology Optimization with Nonlinear Stability Constraints",
    "authors": [
        "Guodong Zhang",
        "Kapil Khandelwal",
        "Tong Guo"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CE",
        "math.OC"
    ],
    "abstract": "This paper proposes a computational framework for the design optimization of stable structures under large deformations by incorporating nonlinear buckling constraints. A novel strategy for suppressing spurious buckling modes related to low-density elements is proposed. The strategy depends on constructing a pseudo-mass matrix that assigns small pseudo masses for DOFs surrounded by only low-density elements and degenerates to an identity matrix for the solid region. A novel optimization procedure is developed that can handle both simple and multiple eigenvalues wherein consistent sensitivities of simple eigenvalues and directional derivatives of multiple eigenvalues are derived and utilized in a gradient-based optimization algorithm - the method of moving asymptotes. An adaptive linear energy interpolation method is also incorporated in nonlinear analyses to handle the low-density elements distortion under large deformations. The numerical results demonstrate that, for systems with either low or high symmetries, the nonlinear stability constraints can ensure structural stability at the target load under large deformations. Post-analysis on the B-spline fitted designs shows that the safety margin, i.e., the gap between the target load and the 1st critical load, of the optimized structures can be well controlled by selecting different stability constraint values. Interesting structural behaviors such as mode switching and multiple bifurcations are also demonstrated.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14911v1"
    ],
    "publication_venue": "77 pages, 44 Figures",
    "doi": "10.1016/j.cma.2023.116119"
}