{
    "arxiv_id": "2303.11083",
    "paper_title": "A broken \"$α$-intensity\" relation caused by the evolving photosphere emission and the nature of the extraordinarily bright GRB~230307A",
    "authors": [
        "Yun Wang",
        "Zi-Qing Xia",
        "Tian-Ci Zheng",
        "Jia Ren",
        "Yi-Zhong Fan"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-05-30"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "GRB~230307A is one of the brightest gamma-ray bursts detected so far. With the excellent observation of GRB~230307A by Fermi-GBM, we can reveal the details of the prompt emission evolution. As found in high-time-resolution spectral analysis, the early low-energy spectral indices ($α$) of this burst exceed the limit of synchrotron radiation ($α=-2/3$), and gradually decreases with the energy flux ($F$). A tight $E_{\\rm p}\\propto F^{0.54}$ correlation anyhow holds within the whole duration of the burst, where $E_{\\rm p}$ is the spectral peak energy. Such evolution pattern of $α$ and $E_{\\rm p}$ with intensity is called ``double tracking\". For the $α-F$ relation, we find a log Bayes factor $\\sim$ 210 in favor of a smoothly broken power-law function over a linear function in log-linear space. We call this particular $α-F$ relation as broken ``$α$-intensity\", and interpret it as the evolution of the ratio of thermal and non-thermal components, which is also the evolution of the photosphere. We also show that GRB 230307A with a duration of $\\sim 35~\\rm s$, if indeed at a redshift of $z=0.065$, is likely a neutron star merger event (i.e., it is intrinsically ``short\"). Intriguingly, different from GRB 060614 and GRB 211211A, this long event is not composed of a hard spike followed by a soft tail, suggesting that the properties of the prompt emission light curves are not a good tracer of the astrophysical origins of the bursts. The other possibility of $z=3.87$ would point toward very peculiar nature of both GRB 230307A and its late time thermal-like emission.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11083v1",
        "http://arxiv.org/pdf/2303.11083v2"
    ],
    "publication_venue": "14 pages, 6 figures, 1 table. We have excluded the GBM instrument pile-up time interval in the data analysis and also discussed the nature of this event"
}