{
    "arxiv_id": "2303.13163",
    "paper_title": "Transiently delocalized states enhance hole mobility in organic molecular semiconductors",
    "authors": [
        "Samuele Giannini",
        "Lucia Di Virgilio",
        "Marco Bardini",
        "Julian Hausch",
        "Jaco Geuchies",
        "Wenhao Zheng",
        "Martina Volpi",
        "Jan Elsner",
        "Katharina Broch",
        "Yves H. Geerts",
        "Frank Schreiber",
        "Guillaume Schweicher",
        "Hai I. Wang",
        "Jochen Blumberger",
        "Mischa Bonn",
        "David Beljonne"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "There is compelling evidence that charge carriers in organic semiconductors (OSs) self-localize in nano-scale space because of dynamic disorder. Yet, some OSs, in particular recently emerged high-mobility organic molecular crystals, feature reduced mobility at increasing temperature, a hallmark for delocalized band transport. Here we present the temperature-dependent mobility in two record-mobility OSs: DNTT (dinaphtho[2,3-b:2',3'-f]thieno[3,2-b]-thiophene), and its alkylated derivative, C8-DNTT-C8. By combining terahertz photoconductivity measurements with fully atomistic non-adiabatic molecular dynamics simulations, we show that while both crystals display a power-law decrease of the mobility (μ) with temperature (T, following: μ\\propto T^(-n)), the exponent n differs substantially. Modelling provides n values in good agreement with experiments and reveals that the differences in the falloff parameter between the two chemically closely related semiconductors can be traced to the delocalization of the different states thermally accessible by charge carriers, which in turn depends on the specific electronic band structure of the two systems. The emerging picture is that of holes surfing on a dynamic manifold of vibrationally-dressed extended states with a temperature-dependent mobility that provides a sensitive fingerprint for the underlying density of states.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13163v1"
    ],
    "publication_venue": "28 pages, 5 Figures"
}