{
    "arxiv_id": "2303.15114",
    "paper_title": "Automatic breach detection during spine pedicle drilling based on vibroacoustic sensing",
    "authors": [
        "Aidana Massalimova",
        "Maikel Timmermans",
        "Nicola Cavalcanti",
        "Daniel Suter",
        "Matthias Seibold",
        "Fabio Carrillo",
        "Christoph J. Laux",
        "Reto Sutter",
        "Mazda Farshad",
        "Kathleen Denis",
        "Philipp Fürnstahl"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Pedicle drilling is a complex and critical spinal surgery task. Detecting breach or penetration of the surgical tool to the cortical wall during pilot-hole drilling is essential to avoid damage to vital anatomical structures adjacent to the pedicle, such as the spinal cord, blood vessels, and nerves. Currently, the guidance of pedicle drilling is done using image-guided methods that are radiation intensive and limited to the preoperative information. This work proposes a new radiation-free breach detection algorithm leveraging a non-visual sensor setup in combination with deep learning approach. Multiple vibroacoustic sensors, such as a contact microphone, a free-field microphone, a tri-axial accelerometer, a uni-axial accelerometer, and an optical tracking system were integrated into the setup. Data were collected on four cadaveric human spines, ranging from L5 to T10. An experienced spine surgeon drilled the pedicles relying on optical navigation. A new automatic labeling method based on the tracking data was introduced. Labeled data was subsequently fed to the network in mel-spectrograms, classifying the data into breach and non-breach. Different sensor types, sensor positioning, and their combinations were evaluated. The best results in breach recall for individual sensors could be achieved using contact microphones attached to the dorsal skin (85.8\\%) and uni-axial accelerometers clamped to the spinous process of the drilled vertebra (81.0\\%). The best-performing data fusion model combined the latter two sensors with a breach recall of 98\\%. The proposed method shows the great potential of non-visual sensor fusion for avoiding screw misplacement and accidental bone breaches during pedicle drilling and could be extended to further surgical applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15114v1"
    ],
    "publication_venue": null
}