{
    "arxiv_id": "2303.12081",
    "paper_title": "Intelligent Throughput-based Sleep Control Algorithm for the 5G Dense Heterogeneous Cellular Networks",
    "authors": [
        "Topside E. Mathonsi",
        "Tshimangadzo M. Tshilongamulenzhe"
    ],
    "submission_date": "2023-02-27",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cs.NI"
    ],
    "abstract": "In the recent past, many mobile/telecom operators have seen a continuously growing demand for ubiquitous high-speed wireless access and an unprecedented increase in connected wireless devices. As a result, we have seen explosive growth in traffic volumes and a wide range of QoS requirements. The Fifth generation (5G) heterogeneous cellular networks (HetNets) have been developed by different mobile operators to achieve the growing mass data capacity and to reconnoiter the energy efficiency guaranteed trade-off between throughput QoS requirements and latency performance. However, existing energy efficiency algorithms do not satisfy the throughput QoS requirements such as reduced latency and packet loss, longer battery lifetime, reliability, and high data rates with regards to the three components of energy consumption of the 5G radio access network (RANs) that dominate the overall mobile communication networks. In addition, real-time traffic types such as voice and video require a high computational load at the terminal side which has an undesirable impact on energy/battery lifetime which further affects the throughput QoS performance such as reduced packet loss, longer battery lifetime, reliability, and high data rates. As a result, this paper proposed an Intelligent Throughput-based Sleep Control (ITSC) algorithm for throughput QoS and energy efficiency enhancement in 5G dense HetNets. In the proposed ITSC algorithm, a deep neural network (DNN) was used to determine the cell capacity ratio for the small base stations (SBSs).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12081v1"
    ],
    "publication_venue": null
}