{
    "arxiv_id": "2303.08980",
    "paper_title": "Dynamically tunable moiré Rydberg excitons in a monolayer semiconductor on twisted bilayer graphene",
    "authors": [
        "Minhao He",
        "Jiaqi Cai",
        "Huiyuan Zheng",
        "Eric Seewald",
        "Takashi Taniguchi",
        "Kenji Watanabe",
        "Jiaqiang Yan",
        "Matthew Yankowitz",
        "Abhay Pasupathy",
        "Wang Yao",
        "Xiaodong Xu"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Moiré excitons are emergent optical excitations in 2D semiconductors with deep moiré superlattice potentials. While these excitations have been realized in several platforms, a system with dynamically tunable moiré potential to tailor the moiré exciton properties is yet to be realized. Here, we present a continuously tunable moiré potential in a monolayer WSe2 that is enabled by its proximity to twisted bilayer graphene (TBG) near the magic-angle. Due to its flat electronic bands, charge distribution is highly localized and forms a triangular lattice in TBG. Tuning the local charge density via electrostatic gating, TBG thus provides a spatially varying and dynamically tunable dielectric superlattice for modulating monolayer exciton wavefunctions. By performing optical reflection spectroscopy, we observe emergent moiré exciton Rydberg branches in monolayer WSe2 with increased energy splitting upon doping TBG. The twist-angle dependence reveals that the observation is due to a hybridization between bright and dark Rydberg states enabled by the moiré potential. Further, at the magic-angle near 1.1°, the moiré Rydberg excitons form a sawtooth pattern with doping owing to the formation of strongly correlated states in the TBG. Our study provides a new platform for engineering moiré excitons as well as optical accessibility to the electronic states with small correlation gaps in TBG.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08980v1"
    ],
    "publication_venue": null
}