{
    "arxiv_id": "2303.16732",
    "paper_title": "Dimensional reduction of the Luttinger-Ward functional for spin-degenerate $D$-dimensional electron gases",
    "authors": [
        "D. Miserev",
        "J. Klinovaja",
        "D. Loss"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2024-02-27"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el"
    ],
    "abstract": "We consider an isotropic spin-degenerate interacting uniform $D$-dimensional electron gas (DDEG) with $D > 1$ within the Luttinger-Ward (LW) formalism. We derive the asymptotically exact semiclassical/infrared limit of the LW functional at large distances, $r \\gg λ_F$, and large times, $τ\\gg 1/E_F$, where $λ_F$ and $E_F$ are the Fermi wavelength and the Fermi energy, respectively. The LW functional is represented by skeleton diagrams, each skeleton diagram consists of appropriately connected dressed fermion loops. First, we prove that every $D$-dimensional skeleton diagram consisting of a single fermion loop is reduced to a one-dimensional (1D) fermion loop with the same diagrammatic structure, which justifies the name dimensional reduction. This statement, combined with the fermion loop cancellation theorem (FLCT), agrees with results of multidimensional bosonization. Here we show that the backscattering and the spectral curvature, both explicitly violate the FLCT and both are irrelevant for a 1DEG, become relevant at $D > 1$ and $D > 2$, respectively. The reason for this is a strong infrared divergence of the skeleton diagrams containing multiple fermion loops at $D > 1$. These diagrams, which are omitted within the multidimensional bosonization approaches, account for the non-collinear scattering processes. Thus, the dimensional reduction provides the framework to go beyond predictions of the multidimensional bosonization. A simple diagrammatic structure of the reduced LW functional is another advantage of our approach. The dimensional reduction technique is also applicable to the thermodynamic potential and various approximations, from perturbation theory to self-consistent approaches.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16732v1"
    ],
    "publication_venue": "15 pages, 4 figures",
    "doi": "10.1103/PhysRevB.108.235116"
}