{
    "arxiv_id": "2303.16088",
    "paper_title": "GNN-Assisted Phase Space Integration with Application to Atomistics",
    "authors": [
        "Shashank Saxena",
        "Jan-Hendrik Bastek",
        "Miguel Spinola",
        "Prateek Gupta",
        "Dennis M. Kochmann"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "physics.comp-ph",
        "cond-mat.stat-mech",
        "cs.LG"
    ],
    "abstract": "Overcoming the time scale limitations of atomistics can be achieved by switching from the state-space representation of Molecular Dynamics (MD) to a statistical-mechanics-based representation in phase space, where approximations such as maximum-entropy or Gaussian phase packets (GPP) evolve the atomistic ensemble in a time-coarsened fashion. In practice, this requires the computation of expensive high-dimensional integrals over all of phase space of an atomistic ensemble. This, in turn, is commonly accomplished efficiently by low-order numerical quadrature. We show that numerical quadrature in this context, unfortunately, comes with a set of inherent problems, which corrupt the accuracy of simulations -- especially when dealing with crystal lattices with imperfections. As a remedy, we demonstrate that Graph Neural Networks, trained on Monte-Carlo data, can serve as a replacement for commonly used numerical quadrature rules, overcoming their deficiencies and significantly improving the accuracy. This is showcased by three benchmarks: the thermal expansion of copper, the martensitic phase transition of iron, and the energy of grain boundaries. We illustrate the benefits of the proposed technique over classically used third- and fifth-order Gaussian quadrature, we highlight the impact on time-coarsened atomistic predictions, and we discuss the computational efficiency. The latter is of general importance when performing frequent evaluation of phase space or other high-dimensional integrals, which is why the proposed framework promises applications beyond the scope of atomistics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16088v1"
    ],
    "publication_venue": null
}