{
    "arxiv_id": "2303.15557",
    "paper_title": "Extended Line Emission in the BCG of Abell 2390",
    "authors": [
        "Leo Y. Alcorn",
        "H. K. C Yee",
        "Laurent Drissen",
        "Carter Rhea",
        "Suresh Sivanandam",
        "Julie Hlavacek-Larrondo",
        "Bau-Ching Hsieh",
        "Lihwai Lin",
        "Yen-Ting Lin",
        "Qing Liu",
        "Adam Muzzin",
        "Allison Noble",
        "Irene Pintos-Castro"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We report CFHT/SITELLE imaging Fourier Transform Spectrograph observations of the Brightest Cluster Galaxy (BCG) of galaxy cluster Abell 2390 at z=0.228. The BCG displays a prominent cone of emission in H$α$, H$β$, [NII], and [OII] to the North-West with PA = 42$^o$, 4.4 arcsec in length (15.9 kpc), which is associated with elongated and asymmetric Chandra soft X-ray emission. The H$α$ flux map also contains a \"hook\" of H$α$ and [NII] emission resulting in a broadened northern edge to the cone. Using SITELLE/LUCI software we extract emission line flux, velocity, velocity dispersion, and continuum maps, and utilize them to derive flux ratio maps to determine ionization mechanisms and dynamical information in the BCG's emission line region. The Baldwin-Phillips-Terlevich diagnostics on the BCG cone indicate a composite ionization origin of photoionization due to star formation and shock. Strong LINER-like emission is seen in the nuclear region which hosts an AGN. As Abell 2390 is a cool-core cluster, we suggest that the cooling flow is falling onto the central BCG and interacting with the central AGN. The AGN produces jets that inflate \"bubbles\" of plasma in the ICM, as is often observed in local galaxy clusters. Furthermore, combining signs of AGN activities from radio, optical emission line and X-ray data over a large range of physical scale, we find evidence for three possible episodes of AGN activity in different epochs associated with the Abell 2390 BCG.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15557v1"
    ],
    "publication_venue": "15 pages, 13 figures, accepted by MNRAS",
    "doi": "10.1093/mnras/stad948"
}