{
    "arxiv_id": "2303.16020",
    "paper_title": "The SAMI-Fornax Dwarfs Survey III: Evolution of [$α$/Fe] in dwarfs, from Galaxy Clusters to the Local Group",
    "authors": [
        "J. Romero-Gómez",
        "Reynier F. Peletier",
        "J. A. L. Aguerri",
        "Steffen Mieske",
        "Nicholas Scott",
        "Joss Bland-Hawthorn",
        "Julia J. Bryant",
        "Scott M. Croom",
        "F. Sara Eftekhari",
        "Jesús Falcón-Barroso",
        "Michael Hilker",
        "Glenn van de Ven",
        "Aku Venhola"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Using very deep, high spectral resolution data from the SAMI Integral Field Spectrograph we study the stellar population properties of a sample of dwarf galaxies in the Fornax Cluster, down to a stellar mass of $10^{7}$ M$_{\\odot}$, which has never been done outside the Local Group. We use full spectral fitting to obtain stellar population parameters. Adding massive galaxies from the ATLAS$^{3D}$ project, which we re-analysed, and the satellite galaxies of the Milky Way, we obtained a galaxy sample that covers the stellar mass range $10^{4}$ to $10^{12} M_{\\odot}$. Using this large range we find that the mass - metallicity relation is not linear. We also find that the [$α$/Fe]-stellar mass relation of the full sample shows a U-shape, with a minimum in [$α$/Fe] for masses between $10^{9}-10^{10} M_{\\odot}$. The relation between [$α$/Fe] and stellar mass can be understood in the following way: When the faintest galaxies enter the cluster environment, a rapid burst of star formation is induced, after which the gas content is blown away by various quenching mechanisms. This fast star formation causes high [$α$/Fe] values, like in the Galactic halo. More massive galaxies will manage to keep their gas longer and form several bursts of star formation, with lower [$α$/Fe] as a result. For massive galaxies, stellar populations are regulated by internal processes, leading to [$α$/Fe] increasing with mass. We confirm this model by showing that [$α$/Fe] correlates with clustercentric distance in three nearby clusters, and also in the halo of the Milky Way.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16020v1"
    ],
    "publication_venue": "Accepted for publication in MNRAS. (17 pages, 11 figures)",
    "doi": "10.1093/mnras/stad953"
}