{
    "arxiv_id": "2303.12075",
    "paper_title": "On the clustering of low-aspect-ratio oblate spheroids settling in ambient fluid",
    "authors": [
        "Manuel Moriche",
        "Daniel Hettmann",
        "Manuel García-Villalba",
        "Markus Uhlmann"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "We have performed particle-resolved direct numerical simulations of many heavy non-spherical particles settling under gravity in the dilute regime. The particles are oblate spheroids of aspect ratio 1.5 and density ratio 1.5. Two Galileo numbers are considered, namely 111 and 152, for which a single oblate spheroid follows a steady vertical and a steady oblique path, respectively. In both cases, a strongly inhomogeneous spatial distribution of the disperse phase in the form of columnar clusters is observed, with a significantly enhanced average settling velocity as a consequence. Thus, in contrast to previous results for spheres, the qualitative difference in the single particle regime does not result in a qualitatively different behavior of the many-particle cases. In addition, we have carried out an analysis of pairwise interactions of particles in the well-known drafting-kissing-tumbling setup, for oblate spheroids of aspect ratio 1.5 and for spheres. We have varied systematically the relative initial position between the particle pair and we have considered free-to-rotate particles and rotationally-locked ones. We have found that the region of attraction for both particle shapes, with and without rotation, is very similar. However, significant differences occur during the drafting and tumbling phases. In particular, free-to-rotate spheres present longer drafting phases and separate quickly after the collision. Spheroids remain close to each other for longer times after the collision, and free-to-rotate ones experience two or more collision events. Therefore, we have observed a shape-induced increase in the interaction which might explain the increased tendency to cluster of the many-particle cases.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12075v1"
    ],
    "publication_venue": "40 pages, 24 figures",
    "doi": "10.1017/jfm.2023.261"
}