{
    "arxiv_id": "2303.17160",
    "paper_title": "Investigating the effect of solar ambient and data characteristics on Ca II K observations and line profile measurements",
    "authors": [
        "M. Murabito",
        "I. Ermolli",
        "T. Chatzistergos",
        "S. Jafarzadeh",
        "F. Giorgi",
        "L. Rouppe van der Voort"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "We analysed state-of-the-art observations of the solar atmosphere to investigate the dependence of the \\ca brightness of several solar features on spectral bandwidth and spatial resolution of the data. Specifically, we study data obtained at the Swedish Solar Telescope with the CRiSP and CHROMIS instruments. The analyzed data, which are characterized by spectral bandwidth of 0.12 Å\\ and spatial resolution of 0.078\\arcsec, were acquired close to disc center by targeting a quiet Sun area and an active region. We convolved the original observations with Gaussian kernels to degrade their spectral bandwidth and spatial resolution to the instrumental characteristics of the most prominent series of \\ca observations available to date. We then studied the effect of data degradation on the observed regions and on parameters derived from \\ca line measurements that are largely employed as diagnostics of the solar and stellar chromospheres. We find that the effect of degrading the spectral resolution of \\ca observations and line profiles depends on both the employed bandwidth and observed solar region. Besides, we found that the spatial degradation impacts the data characterized by a broad bandwidth to a larger extent compared to those acquired with a narrow band. However, the appearance of the observed solar regions is only slightly affected by the spatial resolution of data with bandwidths up to 1 Å\\ and in the range [3,10] Å. Finally, we derived relationships that can be used to intercalibrate results from observations taken with different instruments in diverse regions of the solar atmosphere.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17160v1"
    ],
    "publication_venue": "26 pages, 17 figures, ApJ accepted",
    "doi": "10.3847/1538-4357/acc529"
}