{
    "arxiv_id": "2303.13736",
    "paper_title": "Transport and localization properties of excitations in one-dimensional lattices with diagonal disordered mosaic modulations",
    "authors": [
        "Ba Phi Nguyen",
        "Kihong Kim"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.dis-nn",
        "physics.optics"
    ],
    "abstract": "We present a numerical study of the transport and localization properties of excitations in one-dimensional lattices with diagonal disordered mosaic modulations. The model is characterized by the modulation period $κ$ and the disorder strength $W$. We calculate the disorder averages $\\langle T\\rangle$, $\\langle \\ln T\\rangle$, and $\\langle P\\rangle$, where $T$ is the transmittance and $P$ is the participation ratio, as a function of energy $E$ and system size $L$, for different values of $κ$ and $W$. For excitations at quasiresonance energies determined by $κ$, we find power-law scaling behaviors of the form $\\langle T \\rangle \\propto L^{-γ_{a}}$, $\\langle \\ln T \\rangle \\approx -γ_g \\ln L$, and $\\langle P \\rangle \\propto L^β$, as $L$ increases to a large value. This behavior is in contrast to the exponential localization behavior occurring at all other energies. The appearance of sharp peaks in the participation ratio spectrum at quasiresonance energies provides additional evidence for the existence of an anomalous power-law localization phenomenon. The corresponding eigenstates demonstrate multifractal behavior and exhibit unique node structures. In addition, we investigate the time-dependent wave packet dynamics and calculate the mean square displacement $\\langle m^2(t) \\rangle$, spatial probability distribution, participation number, and return probability. When the wave packet's initial momentum satisfies the quasiresonance condition, we observe a subdiffusive spreading of the wave packet, characterized by $\\langle m^2(t) \\rangle\\propto t^η$ where $η$ is always less than 1. We also note the occurrence of partial localization at quasiresonance energies, as indicated by the saturation of the participation number and a nonzero value for the return probability at long times.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13736v1"
    ],
    "publication_venue": "12 pages, 9 figures"
}