{
    "arxiv_id": "2303.08287",
    "paper_title": "An alternative approach to optimal wire cutting without ancilla qubits",
    "authors": [
        "Edwin Pednault"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Wire cutting is a technique for partitioning large quantum circuits into smaller subcircuits in such a way that observables for the original circuits can be estimated from measurements on the smaller subcircuits. Such techniques provide workarounds for the limited numbers of qubits that are available on near-term quantum devices. Wire cutting, however, introduces multiplicative factors in the number of times such subcircuits need to be executed in order to estimate desired quantum observables to desired levels of statistical accuracy. An optimal wire-cutting methodology has recently been reported that uses ancilla qubits to minimize the multiplicative factors involved as a function of the number of wire cuts. Until just recently, the best-known wire-cutting technique that did not employ ancillas asymptotically converged to the same multiplicative factors, but performed significantly worse for small numbers of cuts. This latter technique also requires inserting measurement and state-preparation subcircuits that are randomly sampled from Clifford 2-designs on a per-shot basis. This paper presents a modified wire-cutting approach for pairs of subcircuits that achieves the same optimal multiplicative factors as wire cutting aided by ancilla qubits, but without requiring ancillas. The paper also shows that, while unitary 2-designs provide a sufficient basis for satisfying the decomposition, 2-designs are not mathematically necessary and alternative unitary designs can be constructed for the decompositions that are substantially smaller in size than 2-designs. As this paper was just about to be released, a similar result was published, so we also include a comparison of the two approaches.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08287v1"
    ],
    "publication_venue": "23 pages, 1 figure, 2 appendices"
}