{
    "arxiv_id": "2303.16329",
    "paper_title": "Quantum state engineering by steering in the presence of errors",
    "authors": [
        "E. Medina-Guerra",
        "Parveen Kumar",
        "I. V. Gornyi",
        "Yuval Gefen"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2024-01-02"
    ],
    "latest_version": 3,
    "categories": [
        "quant-ph",
        "cond-mat.mes-hall"
    ],
    "abstract": "Quantum state engineering plays a vital role in various applications in the field of quantum information. Different strategies, including drive-and-dissipation, adiabatic cooling, and measurement-based steering, have been proposed in the past for state generation and manipulation, each with its upsides and downsides. Here, we address a class of measurement-based state engineering protocols where a sequence of generalized measurements is employed to steer a quantum system toward a desired target state. Previously studied measurement-based protocols relied on idealized procedures and avoided exploration of the effects of various errors stemming from imperfections of experimental realizations and external noise. We employ the quantum trajectory formalism to provide a detailed analysis of the robustness of these steering protocols against various errors. We study a set of errors that can be classified as dynamic or static, depending on whether they remain unchanged while running the protocol. More specifically, we investigate the impact of erroneous choice of system-detector coupling, re-initialization of the detector state following a measurement step, fluctuating steering directions, and environmentally induced errors in the system-detector interaction. We show that the protocol remains fully robust against the erroneous choice of system-detector coupling parameters and presents reasonable robustness against other errors. We employ various quantifiers such as fidelity, trace distance, and linear entropy to characterize the protocol's robustness and provide analytical results. Subsequently, we demonstrate the commutation between the classical expectation value and the time-ordering operator of the exponential of a Hamiltonian with multiplicative white noise, as well as the commutation of the expectation value and the partial trace with respect to detector outcomes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16329v1",
        "http://arxiv.org/pdf/2303.16329v2",
        "http://arxiv.org/pdf/2303.16329v3"
    ],
    "publication_venue": "31 pages of main text + 17 pages of appendices, 13 figures"
}