{
    "arxiv_id": "2303.13037",
    "paper_title": "Universal Linear Intensity Transformations Using Spatially-Incoherent Diffractive Processors",
    "authors": [
        "Md Sadman Sakib Rahman",
        "Xilin Yang",
        "Jingxi Li",
        "Bijie Bai",
        "Aydogan Ozcan"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-08-17"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics",
        "cs.NE"
    ],
    "abstract": "Under spatially-coherent light, a diffractive optical network composed of structured surfaces can be designed to perform any arbitrary complex-valued linear transformation between its input and output fields-of-view (FOVs) if the total number (N) of optimizable phase-only diffractive features is greater than or equal to ~2 Ni x No, where Ni and No refer to the number of useful pixels at the input and the output FOVs, respectively. Here we report the design of a spatially-incoherent diffractive optical processor that can approximate any arbitrary linear transformation in time-averaged intensity between its input and output FOVs. Under spatially-incoherent monochromatic light, the spatially-varying intensity point spread functon(H) of a diffractive network, corresponding to a given, arbitrarily-selected linear intensity transformation, can be written as H(m,n;m',n')=|h(m,n;m',n')|^2, where h is the spatially-coherent point-spread function of the same diffractive network, and (m,n) and (m',n') define the coordinates of the output and input FOVs, respectively. Using deep learning, supervised through examples of input-output profiles, we numerically demonstrate that a spatially-incoherent diffractive network can be trained to all-optically perform any arbitrary linear intensity transformation between its input and output if N is greater than or equal to ~2 Ni x No. These results constitute the first demonstration of universal linear intensity transformations performed on an input FOV under spatially-incoherent illumination and will be useful for designing all-optical visual processors that can work with incoherent, natural light.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13037v1"
    ],
    "publication_venue": "29 Pages, 10 Figures",
    "doi": "10.1038/s41377-023-01234-y"
}