{
    "arxiv_id": "2303.08393",
    "paper_title": "A multiphase study of theoretical and observed light curves of classical Cepheids in the Magellanic Clouds",
    "authors": [
        "Kerdaris Kurbah",
        "Sukanta Deb",
        "Shashi M. Kanbur",
        "Susmita Das",
        "Mami Deka",
        "Anupam Bhardwaj",
        "Hugh Riley Randall",
        "Selim Kalici"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "We present an analysis of the theoretical and observed light curve parameters of the fundamental mode (FU) classical Cepheids in the Magellanic Clouds in $V$- and $I$- photometric bands. The state-of-the-art 1D non-linear radial stellar pulsation (RSP) code in MESA (\\textsc{mesa-rsp}) has been utilized to generate the theoretical light curves using four sets of convection parameters. Theoretical light curves with two chemical compositions: $Z=0.008$ and $Z=0.004$ appropriate for the Large Magellanic Cloud (LMC) and Small Magellanic Cloud (SMC), respectively, covered a wide range of periods ($3<P (\\rm{d})<32$). The observed light curves are taken from the OGLE-IV database. We compare theoretical and observed Fourier parameters (FPs), and investigate the period-luminosity (PL), period-colour (PC), and amplitude-colour (AC) relations as a function of pulsation phase for short ($\\log{P}<1$), long ($\\log{P}>1$) and all periods. The multiphase relations obtained from theoretical and observed light curves in the PL/PC/AC plane are found to be dynamic in nature, with the effect more pronounced at $Φ\\sim 0.75-0.85$. Furthermore, a contrasting behaviour of the theoretical/observed multiphase PL and PC relations between the short and long periods has been found for both LMC and SMC. The analysis shows that multiphase PL relations are more stringent to test the models with observations over the FPs. Distances to the LMC/SMC determined using long period Cepheids are found to be in good agreement with the literature values when the term $R_{21}$ is added to the PL relation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08393v1"
    ],
    "publication_venue": "17 pages, 11 Figures and 9 Tables. Accepted for publication by MNRAS",
    "doi": "10.1093/mnras/stad806"
}