{
    "arxiv_id": "2303.08154",
    "paper_title": "Training variational quantum algorithms with random gate activation",
    "authors": [
        "Shuo Liu",
        "Shi-Xin Zhang",
        "Shao-Kai Jian",
        "Hong Yao"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-09-27"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Variational quantum algorithms (VQAs) hold great potentials for near-term applications and are promising to achieve quantum advantage on practical tasks. However, VQAs suffer from severe barren plateau problem as well as have a large probability of being trapped in local minima. In this Letter, we propose a novel training algorithm with random quantum gate activation for VQAs to efficiently address these two issues. This new algorithm processes effectively much fewer training parameters than the conventional plain optimization strategy, which efficiently mitigates barren plateaus with the same expressive capability. Additionally, by randomly adding two-qubit gates to the circuit ansatz, the optimization trajectories can escape from local minima and reach the global minimum more frequently due to more sources of randomness. In real quantum experiments, the new training algorithm can also reduce the quantum computational resources required and be more quantum noise resilient. We apply our training algorithm to solve variational quantum simulation problems for ground states and present convincing results that showcase the advantages of our novel strategy where better performance is achieved by the combination of mitigating barren plateaus, escaping from local minima, and reducing the effect of quantum noises. We further propose that the entanglement phase transition could be one underlying reason why our RA training is so effective.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08154v1"
    ],
    "publication_venue": "4.5 pages + references + supplemental, 4 figures",
    "doi": "10.1103/PhysRevResearch.5.L032040"
}