{
    "arxiv_id": "2303.12759",
    "paper_title": "How does the audience affect the way we express our gender roles?",
    "authors": [
        "Melody Sepahpour-Fard",
        "Michael Quayle",
        "Maria Schuld",
        "Taha Yasseri"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 2,
    "categories": [
        "cs.SI",
        "cs.CY"
    ],
    "abstract": "Human beings adapt their language to suit their audience when interacting. While audience effects have been studied in theory and small-scale research, there is a lack of large-scale studies on naturally occurring audience effects. In this study, we examine audience effects in interactions with gendered contexts that emphasize different social identities (e.g. mother, father, and parent) by analyzing interactions on Reddit. We collected posts from three popular parenting subreddits (r/Daddit, r/Mommit, and r/Parenting), which cater to self-identified fathers and mothers (ostensibly single-gender) and parents (explicitly mixed-gender) respectively. By selecting a sample of users who have published on both single-gender and mixed-gender subreddits, we are able to explore both audience and gender effects. To analyze the posts, we used word embeddings and added the user as a token in the corpus. This allowed us to compare user-tokens to word-tokens and measure their similarity. Our results show that mothers and fathers behave similarly and discuss a diverse range of topics in a mixed-gender context, focusing more on advising each other on educational and family matters. In single-gender subreddits, mothers and fathers are more focused on specific topics. Mothers in r/Mommit distinguish themselves from other groups by discussing topics such as medical care, sleep and potty training, and food. Both mothers and fathers celebrate parenting events and describe or comment on the physical appearance of their children in front of a single-gender audience. In conclusion, this study demonstrates how mothers and fathers express different concerns and adapt their behaviour to different group-based audiences. It also highlights the potential of using Reddit and word embeddings to better understand the dynamics of audience and gender in a natural setting.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12759v1",
        "http://arxiv.org/pdf/2303.12759v2"
    ],
    "publication_venue": null
}