{
    "arxiv_id": "2303.11441",
    "paper_title": "The bar rotation rate as a diagnostic of dark matter content in the centre of disc galaxies",
    "authors": [
        "C. Buttitta",
        "E. M. Corsini",
        "J. A. L. Aguerri",
        "L. Coccato",
        "L. Costantin",
        "V. Cuomo",
        "V. P. Debattista",
        "L. Morelli",
        "A. Pizzella"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We investigate the link between the bar rotation rate and dark matter content in barred galaxies by concentrating on the cases of the lenticular galaxies NGC4264 and NGC4277. These two gas-poor galaxies have similar morphologies, sizes, and luminosities. But, NGC4264 hosts a fast bar, which extends to nearly the corotation, while the bar embedded in NGC4277 is slow and falls short of corotation. We derive the fraction of dark matter $f_{\\rm DM, bar}$ within the bar region from Jeans axisymmetric dynamical models by matching the stellar kinematics obtained with the MUSE integral-field spectrograph and using SDSS images to recover the stellar mass distribution. We build mass-follows-light models as well as mass models with a spherical halo of dark matter, which is not tied to the stars. We find that the inner regions of NGC4277 host a larger fraction of dark matter ($f_{\\rm DM, bar} = 0.53 \\pm 0.02$) with respect to NGC4264 ($f_{\\rm DM, bar} = 0.33 \\pm 0.04$) in agreement with the predictions of theoretical works and the findings of numerical simulations, which have found that fast bars live in baryon-dominated discs, whereas slow bars experienced a strong drag from the dynamical friction due to a dense DM halo. This is the first time that the bar rotation rate is coupled to $f_{\\rm DM, bar}$ derived from dynamical modelling.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11441v1"
    ],
    "publication_venue": "Accepted for publication on MNRAS, 12 pages",
    "doi": "10.1093/mnras/stad646"
}