{
    "arxiv_id": "2303.13266",
    "paper_title": "Optimal temperature distribution for a nonisothermal Cahn-Hilliard system in two dimensions with source term and double obstacle potential",
    "authors": [
        "Pierluigi Colli",
        "Gianni Gilardi",
        "Andrea Signori",
        "Jürgen Sprekels"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "math.OC",
        "math.AP"
    ],
    "abstract": "In this note, we study the optimal control of a nonisothermal phase field system of Cahn-Hilliard type that constitutes an extension of the classical Caginalp model for nonisothermal phase transitions with a conserved order parameter. It couples a Cahn-Hilliard type equation with source term for the order parameter with the universal balance law of internal energy. In place of the standard Fourier form, the constitutive law of the heat flux is assumed in the form given by the theory developed by Green and Naghdi, which accounts for a possible thermal memory of the evolution. This has the consequence that the balance law of internal energy becomes a second-order in time equation for the thermal displacement or freezing index, that is, a primitive with respect to time of the temperature. Another particular feature of our system is the presence of the source term in the equation for the order parameter, which entails further mathematical difficulties because the mass conservation of the order parameter is no longer satisfied. We study the case that the double-well potential driving the evolution of the phase transition is given by the nondifferentiable double obstacle potential, thereby complementing recent results obtained for the differentiable cases of regular and logarithmic potentials. We derive first-order necessary optimality conditions for the control problem. The analysis is carried out by employing the so-called deep quench approximation in which the nondifferentiable double obstacle potential is approximated by a family of logarithmic potentials for which meaningful first-order necessary optimality conditions are available. Since the results for the logarithmic potentials crucially depend on the validity of the so-called strict separation property which is only available in the spatially two-dimensional situation, our whole analysis is restricted to the two-dimensional case.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13266v1"
    ],
    "publication_venue": "Keywords: optimal control, nonisothermal Cahn-Hilliard equation, thermal memory, Cahn-Hilliard equation with source term, Cahn-Hilliard-Oono equation. arXiv admin note: text overlap with arXiv:2207.00375, arXiv:2303.00488"
}