{
    "arxiv_id": "2303.16712",
    "paper_title": "Near-IR and optical radial velocities of the active M dwarf star Gl 388 (AD Leo) with SPIRou at CFHT and SOPHIE at OHP: A 2.23 day rotation period and no evidence for a corotating planet",
    "authors": [
        "A. Carmona",
        "X. Delfosse",
        "S. Bellotti",
        "P. Cortés-Zuleta",
        "M. Ould-Elhkim",
        "N. Heidari",
        "L. Mignon",
        "J. F. Donati",
        "C. Moutou",
        "N. Cook",
        "E. Artigau",
        "P. Fouqué",
        "E. Martioli",
        "C. Cadieux",
        "J. Morin",
        "T. Forveille",
        "I. Boisse",
        "G. Hébrard",
        "R. F. Díaz",
        "D. Lafrenière",
        "F. Kiefer",
        "P. Petit",
        "R. Doyon",
        "L. Acuña",
        "L. Arnold",
        "X. Bonfils",
        "F. Bouchy",
        "V. Bourrier",
        "S. Dalal",
        "M. Deleuil",
        "O. Demangeon",
        "X. Dumusque",
        "N. Hara",
        "S. Hoyer",
        "O. Mousis",
        "A. Santerne",
        "D. Ségrasan",
        "M. Stalport",
        "S. Udry"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-04-19"
    ],
    "latest_version": 3,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
    ],
    "abstract": "Context: The search for extrasolar planets around the nearest M dwarfs is a crucial step towards identifying the nearest Earth-like planets. One of the main challenges in this search is that M dwarfs can be magnetically active and stellar activity can produce radial velocity (RV) signals that could mimic those of a planet.\n  Aims: We aim to investigate whether the 2.2 day period observed in optical RVs of the nearby active M dwarf star Gl 388 (AD Leo) is due to stellar activity or to a planet that corotates with the star as suggested in the past.\n  Methods: We obtained quasi-simultaneous optical RVs of Gl 388 from 2019 to 2021 with SOPHIE (R~75k) at the OHP in France, and near-IR RV and Stokes V measurements with SPIRou at the CFHT (R~70k).\n  Results: The SOPHIE RV time series displays a periodic signal with a 2.23+-0.01 day period and 23.6+-0.5 m/s amplitude, which is consistent with previous HARPS observations obtained in 2005-2006. The SPIRou RV time series is flat at 5 m/s rms and displays no periodic signals. RV signals of amplitude higher than 5.3 m/s at a period of 2.23 days can be excluded with a confidence level higher than 99%. Using the modulation of the longitudinal magnetic field (Bl) measured with SPIRou, we derive a stellar rotation period of 2.2305+-0.0016 days.\n  Conclusions: SPIRou RV measurements provide solid evidence that the periodic variability of the optical RVs of Gl 388 is due to stellar activity rather than to a corotating planet. The magnetic activity nature of the optical RV signal is further confirmed by the modulation of Bl with the same period. The SPIRou campaign on Gl 388 demonstrates the power of near-IR RV to confirm or infirm planet candidates discovered in the optical around active stars. SPIRou observations reiterate how effective spectropolarimetry is at determining the stellar rotation period.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16712v1",
        "http://arxiv.org/pdf/2303.16712v2",
        "http://arxiv.org/pdf/2303.16712v3"
    ],
    "publication_venue": "25 pages, 23 figures, Accepted by Astronomy and Astrophysics; [v2] version implementing A&A language editor suggestions; [v3] improved ascii characters for ADS metadata visualization"
}