{
    "arxiv_id": "2303.11450",
    "paper_title": "Path integrals, saddle points and the beginning of the universe",
    "authors": [
        "Alice Di Tucci"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc",
        "hep-th"
    ],
    "abstract": "The very early universe is understood in terms of quantum field theories on curved spacetime, where the classical background spacetime is typically an FLRW cosmology and the quantum fields which propagate on it include gravitational waves and energy density fluctuations. Many open questions seem to relate to the fact that we very little understand this regime, where part of the gravitational degrees of freedom, and only part of them, are quantized. In this work we study this limit by assigning quantum properties both to the background universe and the fluctuations and then focusing on the limit where the background universe behaves nearly classically. The quantization is realized in the framework of quantum general relativity through Feymann's path integrals. We study the saddle point approximation of gravitational path integrals in the cases of a positive and a negative cosmological constant making use of the minisuperspace approximation focusing on the impact of different classes boundary conditions. Our main finding is that, both for the no boundary proposal and black holes in Euclidean anti-de Sitter space, the path integral needs to be defined with Neumann initial conditions. The Neumann condition is in fact necessary to recover sensible black holes thermodynamics and to stabilize the no boundary proposal. At the same time, it can be seen, in both cases, as a regularity requirement on the geometries entering the sum. The need for Neumann conditions implies that the interpretation of the no boundary wavefunction is very different from Hartle and Hawking's original intuition, since the initial expansion rate of the universe is fixed rather than its size. Our results for black holes stand in support of this implementation of the no boundary proposal, where regularity is the primary requirement and allows for a well-defined QFT in curved spacetime limit.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11450v1"
    ],
    "publication_venue": "237 pages Thesis: PhD Humboldt U., Berlin, Humboldt U., Berlin (defense: August 10, 2021)"
}