{
    "arxiv_id": "2303.09577",
    "paper_title": "NGC 4388: A Test Case for Relativistic Disk Reflection and Fe K Fluorescence Features",
    "authors": [
        "Tahir Yaqoob",
        "P. Tzanavaris",
        "S. LaMassa"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "We present a new analysis of the Suzaku X-ray spectrum of the Compton-thin Seyfert 2 galaxy NGC 4388. The spectrum above $\\sim$2 keV can be described by a remarkably simple and rather mundane model, consisting of a uniform, neutral spherical distribution of matter, with a radial column density of $2.58 \\pm 0.02 \\times 10^{23}$ cm$^{-2}$, and an Fe abundance of $1.102^{0.024}_{-0.021}$ relative to solar. The model does not require any phenomenological adjustments to self-consistently account for the low-energy extinction, the Fe K$α$ and Fe K$β$ fluorescent emission lines, the Fe K edge, and the Compton-scattered continuum from the obscuring material. The spherical geometry is not a unique description, however, and the self-consistent, solar abundance MYTORUS model, applied with toroidal and non-toroidal geometries, gives equally good descriptions of the data. In all cases, the key features of the spectrum are so tightly locked together that for a wide range of parameters, a relativistic disk-reflection component contributes no more than $\\sim$2% to the net spectrum in the 2-20 keV band. We show that the commonly invoked explanations for weak X-ray reflection features, namely a truncated and/or very highly ionized disk, do not work for NGC 4388. If relativistically-broadened Fe K$α$ lines and reflection are ubiquitous in Seyfert 1 galaxies, they should also be ubiquitous in Compton-thin Seyfert 2 galaxies. The case of NGC 4388 shows the need for similar studies of more Compton-thin AGN to ascertain whether this is true.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09577v1"
    ],
    "publication_venue": "MNRAS accepted. 21 pages, 7 figures, 4 tables; Appendix with historical notes and 1 table"
}