{
    "arxiv_id": "2303.16785",
    "paper_title": "Equivariant toric geometry and Euler-Maclaurin formulae",
    "authors": [
        "Sylvain E. Cappell",
        "Laurenţiu Maxim",
        "Jörg Schürmann",
        "Julius L. Shaneson"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-07-24"
    ],
    "latest_version": 2,
    "categories": [
        "math.AG",
        "math.AT"
    ],
    "abstract": "We consider equivariant versions of the motivic Chern and Hirzebruch characteristic classes of a quasi-projective toric variety, and extend many known results from non-equivariant to the equivariant setting. The corresponding generalized equivariant Hirzebruch genus of a torus-invariant Cartier divisor is also calculated. Further global formulae for equivariant Hirzebruch classes are obtained in the simplicial context by using the Cox construction and the equivariant Lefschetz-Riemann-Roch theorem. Alternative proofs of all these results are given via localization at the torus fixed points in equivariant $K$- and homology theories. In localized equivariant $K$-theory, we prove a weighted version of a classical formula of Brion for a full-dimensional lattice polytope. We also generalize to the context of motivic Chern classes the Molien formula of Brion-Vergne. Similarly, we compute the localized Hirzebruch class, extending results of Brylinski-Zhang for the localized Todd class.\n  We also elaborate on the relation between the equivariant toric geometry via the equivariant Hirzebruch-Riemann-Roch and Euler-Maclaurin type formulae for full-dimensional simple lattice polytopes. Our results provide generalizations to arbitrary coherent sheaf coefficients, and algebraic geometric proofs of (weighted versions of) the Euler-Maclaurin formulae of Cappell-Shaneson, Brion-Vergne, Guillemin, etc., via the equivariant Hirzebruch-Riemann-Roch formalism. Our approach, based on motivic characteristic classes, allows us to obtain such Euler-Maclaurin formulae also for (the interior of) a face, or for the polytope with several facets removed. We also prove such results in the weighted context, and for Minkovski summands of the given full-dimensional lattice polytope. Some of these results are extended to local Euler-Maclaurin formulas for the tangent cones at the vertices of the given lattice polytope.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16785v1",
        "http://arxiv.org/pdf/2303.16785v2"
    ],
    "publication_venue": "96 pages, comments are very welcome; minor additions in v2"
}