{
    "arxiv_id": "2303.08121",
    "paper_title": "Enhancing Measurements of the CMB Blackbody Temperature Power Spectrum by Removing CIB and Thermal Sunyaev-Zel'dovich Contamination Using External Galaxy Catalogs",
    "authors": [
        "Aleksandra Kusiak",
        "Kristen M. Surrao",
        "J. Colin Hill"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "Extracting the CMB blackbody temperature power spectrum -- which is dominated by the primary CMB signal and the kinematic Sunyaev-Zel'dovich (kSZ) effect -- from mm-wave sky maps requires cleaning other sky components. In this work, we develop new methods to use large-scale structure (LSS) tracers to remove cosmic infrared background (CIB) and thermal Sunyaev-Zel'dovich (tSZ) contamination in such measurements. Our methods rely on the fact that LSS tracers are correlated with the CIB and tSZ signals, but their two-point correlations with the CMB and kSZ signals vanish on small scales, thus leaving the CMB blackbody power spectrum unbiased after cleaning. We develop methods analogous to delensing ($\\textit{de-CIB}$ or $\\textit{de-(CIB+tSZ)}$) to clean CIB and tSZ contaminants using these tracers. We compare these methods to internal linear combination (ILC) methods, including novel approaches that incorporate the tracer maps in the ILC procedure itself, without requiring exact assumptions about the CIB SED. As a concrete example, we use the $\\textit{unWISE}$ galaxy samples as tracers. We provide calculations for a combined Simons Observatory and $\\textit{Planck}$-like experiment, with our simulated sky model comprising eight frequencies from 93 to 353 GHz. Using $\\textit{unWISE}$ tracers, improvements with our methods over current approaches are already non-negligible: we find improvements up to 20% in the kSZ power spectrum signal-to-noise ratio (SNR) when applying the de-CIB method to a tSZ-deprojected ILC map. These gains could be more significant when using additional LSS tracers from current surveys, and will become even larger with future LSS surveys, with improvements in the kSZ power spectrum SNR up to 50%. For the total CMB blackbody power spectrum, these improvements stand at 4% and 7%, respectively. Our code is publicly available at https://github.com/olakusiak/deCIBing.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08121v1"
    ],
    "publication_venue": "35+21 pages, 20+11 figures; code is available at https://github.com/olakusiak/deCIBing"
}