{
    "arxiv_id": "2303.11344",
    "paper_title": "Absorption of Vector Dark Matter Beyond Kinetic Mixing",
    "authors": [
        "Gordan Krnjaic",
        "Tanner Trickle"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-08-02"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph",
        "astro-ph.CO"
    ],
    "abstract": "Massive vector particles are minimal dark matter candidates that motivate a wide range of laboratory searches, primarily exploiting a postulated kinetic mixing with the photon. However, depending on the high energy field content, the dominant vector dark matter (VDM) coupling to visible particles may arise at higher operator dimension, motivating efforts to predict direct detection rates for more general interactions. Here we present the first calculation of VDM absorption through its coupling to electron electric (EDM) or magnetic (MDM) dipole moments, which can be realized in minimal extensions to the Standard Model and yield the observed abundance through a variety of mechanisms across the eV\\,-\\,MeV mass range. We compute the absorption rate of the MDM and EDM models for a general target, and then derive direct detection constraints from targets currently in use: Si and Ge crystals and Xe and Ar atoms. We find that current experiments are already sensitive to VDM parameter space corresponding to a cosmological freeze-in scenario, and future experiments will be able to completely exclude MDM and EDM freeze-in models with reheat temperatures below the electroweak scale. Additionally, we find that while constraints on the MDM interaction can be related to constraints on axion-like particles, the same is not true for the EDM model, so the latter absorption rate must be computed from first principles. To achieve this, we update the publicly available program EXCEED-DM to perform these new calculations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11344v1"
    ],
    "publication_venue": "23 pages, 3 figures",
    "doi": "10.1103/PhysRevD.108.015024"
}