{
    "arxiv_id": "2303.15171",
    "paper_title": "Quantum Operations in Algebraic QFT",
    "authors": [
        "Luca Giorgetti"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-10-10"
    ],
    "latest_version": 1,
    "categories": [
        "math.OA",
        "math-ph",
        "math.FA",
        "math.QA"
    ],
    "abstract": "Conformal Quantum Field Theories (CFT) in 1 or 1+1 spacetime dimensions (respectively called chiral and full CFTs) admit several \"axiomatic\" (mathematically rigorous and model-independent) formulations. In this note, we deal with the von Neumann algebraic formulation due to Haag and Kastler, mainly restricted to the chiral CFT setting. Irrespectively of the chosen formulation, one can ask the questions: given a theory $\\mathcal{A}$, how many and which are the possible extensions $\\mathcal{B} \\supset \\mathcal{A}$ or subtheories $\\mathcal{B} \\subset \\mathcal{A}$? How to construct and classify them, and study their properties? Extensions are typically described in the language of algebra objects in the braided tensor category of representations of $\\mathcal{A}$, while subtheories require different ideas.\n  In this paper, we review recent structural results on the study of subtheories in the von Neumann algebraic formulation (conformal subnets) of a given chiral CFT (conformal net). Furthermore, building on [BDG23], we provide a \"quantum Galois theory\" for conformal nets analogous to the one for Vertex Operator Algebras (VOA). We also outline the case of 3+1 dimensional Algebraic Quantum Field Theories (AQFT). The aforementioned results make use of families of (extreme) vacuum state preserving unital completely positive maps acting on the net of von Neumann algebras, hereafter called quantum operations. These are natural generalizations of the ordinary vacuum preserving gauge automorphisms, hence they play the role of \"generalized global gauge symmetries\". Quantum operations suffice to describe all possible conformal subnets of a given conformal net with the same central charge.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15171v1"
    ],
    "publication_venue": "Invited contribution to the conference proceedings of Functional Analysis, Approximation Theory and Numerical Analysis, FAATNA20>22, Matera, Italy, 2022",
    "doi": "10.1285/i15900932v43n1p41"
}