{
    "arxiv_id": "2303.14690",
    "paper_title": "TOPress: a MATLAB implementation for topology optimization of structures subjected to design-dependent pressure loads",
    "authors": [
        "Prabhat Kumar"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-04-14"
    ],
    "latest_version": 3,
    "categories": [
        "cs.MS",
        "cs.CE"
    ],
    "abstract": "In a topology optimization setting, design-dependent fluidic pressure loads pose several challenges as their direction, magnitude, and location alter with topology evolution. This paper offers a compact 100-line MATLAB code, TOPress, for topology optimization of structures subjected to fluidic pressure loads using the method of moving asymptotes. The code is intended for pedagogical purposes and aims to ease the beginners' and students' learning toward topology optimization with design-dependent fluidic pressure loads. TOPress is developed per the approach first reported in Kumar et al. (Struct Multidisc Optim 61(4):1637-1655, 2020). The Darcy law, in conjunction with the drainage term, is used to model the applied pressure load. The consistent nodal loads are determined from the obtained pressure field. The employed approach facilitates inexpensive computation of the load sensitivities using the adjoint-variable method. Compliance minimization subject to volume constraint optimization problems are solved. The success and efficacy of the code are demonstrated by solving benchmark numerical examples involving pressure loads, wherein the importance of load sensitivities is also demonstrated. TOPress contains six main parts, is described in detail, and is extended to solve different problems. Steps to include a projection filter are provided to achieve loadbearing designs close to~0-1. The code is provided in Appendix~B and can also be downloaded along with its extensions from \\url{https://github.com/PrabhatIn/TOPress}.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14690v1",
        "http://arxiv.org/pdf/2303.14690v2",
        "http://arxiv.org/pdf/2303.14690v3"
    ],
    "publication_venue": "19 Figures, MATLAB codes",
    "doi": "10.1007/s00158-023-03533-9"
}