{
    "arxiv_id": "2303.10657",
    "paper_title": "STGIC: a graph and image convolution-based method for spatial transcriptomic clustering",
    "authors": [
        "Chen Zhang",
        "Junhui Gao",
        "Guangshuo cao",
        "Wei Liu"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.QM"
    ],
    "abstract": "Spatial transcriptomic (ST) clustering requires dividing spots into spatial domains, each of which are constituted by continuously distributed spots sharing similar gene transcription profile. Adjacency and feature matrix being derived respectively from 2D spatial coordinates and gene transcription quantity, the problem is amenable to graph network. The existing graph network methods often employ self-supervision or contrastive learning to construct training objectives, which as such are not directly related to smoothing embedding of spots and thus hard to perform well. Herein, we propose a graph and image-based method (STGIC) which adopts AGC, an existing graph-based method not depending on any trainable parameters for generating pseudo-labels for clustering by our dilated convolution network (CNN)-based frameworks which are fed with virtual image also transformed from spatial and transcription information of spots. The pre-defined graph convolution kernel in AGC plays a key role as a low-pass filter in smoothing, which can be further guaranteed by our training loss demanding embedding similarity between neighboring pixels. Our dilated CNN-based frameworks are featured by two parallel components respectively with convolution kernel size of 3 and 2, besides some constraints are made on the convolution kernel weights. These fancied designs ensure spots information updates by aggregating only that from neighboring spots with the weights depending on the distance from kernel center. Apart from the above tricks, self-supervision and contrastive learning are also adopted in STGIC to construct our training objective. Tests with the generally recognized dataset DLPFC demonstrates STGIC outperforms the state-of-the-art methods.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10657v1"
    ],
    "publication_venue": null
}