{
    "arxiv_id": "2303.09574",
    "paper_title": "3D Radiative Transfer Modelling and Virial Analysis of Starless Cores in the B10 Region of the Taurus Molecular Cloud",
    "authors": [
        "Samantha Scibelli",
        "Yancy Shirley",
        "Anika Schmiedeke",
        "Brian Svoboda",
        "Ayushi Singh",
        "James Lilly",
        "Paola Caselli"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Low-mass stars like our Sun begin their evolution within cold (10 K) and dense ($\\sim 10^5$ cm$^{-3}$) cores of gas and dust. The physical structure of starless cores is best probed by thermal emission of dust grains. We present a high resolution dust continuum study of the starless cores in the B10 region of the Taurus Molecular Cloud. New observations at 1.2mm and 2.0mm ($12^{\"}$ and $18^{\"}$ resolution) with the NIKA2 instrument on the IRAM 30m have probed the inner regions of 14 low-mass starless cores. We perform sophisticated 3D radiative transfer modelling for each of these cores through the radiative transfer framework $\\textit{pandora}$, which utilizes RADMC-3D. Model best-fits constrain each cores' central density, density slope, aspect ratio, opacity, and interstellar radiation field strength. These `typical' cores in B10 span central densities from $5 \\times 10^4 - 1 \\times 10^6$ cm$^{-3}$, with a mean value of $2.6 \\times 10^5$ cm$^{-3}$. We find the dust opacity laws assumed in the 3D modelling, as well as the estimates from $\\textit{Herschel}$, have dust emissivity indices, $β$'s, on the lower end of the distribution constrained directly from the NIKA2 maps, which averages to $β= 2.01\\pm0.48$. From our 3D density structures and archival NH$_3$ data, we perform a self-consistent virial analysis to assess each core's stability. Ignoring magnetic field contributions, we find 9 out of the 14 cores ($64\\%$) are either in virial equilibrium or are bound by gravity and external pressure. To push the bounded cores back to equilibrium, an effective magnetic field difference of only $\\sim 15 μ$G is needed.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09574v1"
    ],
    "publication_venue": "Accepted to MNRAS. 19 pages, 20 figures",
    "doi": "10.1093/mnras/stad827"
}