{
    "arxiv_id": "2303.09374",
    "paper_title": "Extinction towards the cluster R136 in the Large Magellanic Cloud: An extinction law from the near-infrared to the ultraviolet",
    "authors": [
        "Sarah A. Brands",
        "Alex de Koter",
        "Joachim M. Bestenlehner",
        "Paul A. Crowther",
        "Lex Kaper",
        "Saida M. Caballero-Nieves",
        "Götz Gräfener"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "The cluster R136 in the giant star-forming region 30 Doradus in the Large Magellanic Cloud (LMC) offers a unique opportunity to resolve a stellar population in a starburst-like environment. We obtain the near-infrared to ultraviolet extinction towards 50 stars in the core of R136, employing the `extinction without standards' method. To assure good fits over the full wavelength range, we combine and modify existing extinction laws. We detect a strong spatial gradient in the extinction properties across the core of R136, coinciding with a gradient in density of cold gas that is part of a molecular cloud lying northeast of the cluster. In line with previous measurements of R136 and the 30 Doradus region, we obtain a high total-to-relative extinction ($R_V = 4.38 \\pm 0.87$). However, the high values of $R_V$ are accompanied by relatively strong extinction in the ultraviolet, contrary to what is observed for Galactic sightlines. The relatively strong ultraviolet extinction suggests that the properties of the dust towards R136 differ from those in the Milky Way. For $R_{V} \\sim 4.4$, about three times fewer ultraviolet photons can escape from the ambient dust environment relative to the canonical Galactic value of $R_{V} \\sim 3.1$ at the same $A_{V}$. Therefore, if dust in the R136 star-bursting environment is characteristic for cosmologically distant star-bursting regions, the escape fraction of ultraviolet photons from such regions is overestimated by a factor of three relative to the standard Milky Way assumption for the total-to-selective extinction. Furthermore, a comparison with average curves tailored to other regions of the LMC shows that large differences in ultraviolet extinction exist within this galaxy. Further investigation is required in order to decipher whether or not there is a relation between $R_V$ and ultraviolet extinction in the LMC.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09374v1"
    ],
    "publication_venue": "Accepted for publication in A&A (18 pages, 12 figures)",
    "doi": "10.1051/0004-6361/202245536"
}