{
    "arxiv_id": "2303.13878",
    "paper_title": "Overcoming water diffusion limitations in hydrogels via microtubular graphene networks for soft actuators",
    "authors": [
        "Margarethe Hauck",
        "Lena M. Saure",
        "Berit Zeller-Plumhoff",
        "Sören Kaps",
        "Jörg Hammel",
        "Caprice Mohr",
        "Lena Rieck",
        "Ali Shaygan Nia",
        "Xinliang Feng",
        "Nicola M. Pugno",
        "Rainer Adelung",
        "Fabian Schütt"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-09-01"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "cond-mat.soft",
        "physics.app-ph"
    ],
    "abstract": "Hydrogel-based soft actuators can operate in sensitive environments, bridging the gap of rigid machines interacting with soft matter. However, while stimuli-responsive hydrogels can undergo extreme reversible volume changes of up to ~90%, water transport in hydrogel actuators is in general limited by their poroelastic behavior. For poly(N-isopropylacrylamide) (PNIPAM) the actuation performance is even further compromised by the formation of a dense skin layer. Here we show, that incorporating a bioinspired microtube graphene network into a PNIPAM matrix with a total porosity of only 5.4 % dramatically enhances actuation dynamics by up to ~400 % and actuation stress by ~4000 % without sacrificing the mechanical stability, overcoming the water transport limitations. The graphene network provides both untethered light-controlled and electrically-powered actuation. We anticipate that the concept provides a versatile platform for enhancing the functionality of soft matter by combining responsive and two-dimensional materials, paving the way towards designing soft intelligent matter.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13878v1"
    ],
    "publication_venue": "Shared First-authorship: Margarethe Hauck and Lena Marie Saure",
    "doi": "10.1002/adma.202302816"
}