{
    "arxiv_id": "2303.09939",
    "paper_title": "Comprehensive Analysis of Maximum Power Association Policy for Cellular Networks Using Distance and Angular Coordinates",
    "authors": [
        "Harris K. Armeniakos",
        "Athanasios G. Kanatas",
        "Harpreet S. Dhillon"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2024-04-03"
    ],
    "latest_version": 2,
    "categories": [
        "cs.IT",
        "eess.SP"
    ],
    "abstract": "A novel stochastic geometry framework is proposed in this paper to study the downlink coverage performance in a millimeter wave (mmWave) cellular network by jointly considering the polar coordinates of the Base Stations (BSs) with respect to the typical user located at the origin. Specifically, both the Euclidean and the angular distances of the BSs in a maximum power-based association policy for the UE are considered to account for realistic beam management considerations, which have been largely ignored in the literature, especially in the cell association phase. For completeness, two other association schemes are considered and exact-form expressions for the coverage probability are derived. Subsequently, the key role of angular distances is highlighted by defining the dominant interferer using angular distance-based criteria instead of Euclidean distance-based, and conducting a dominant interferer-based coverage probability analysis. Among others, the numerical results revealed that considering angular distance-based criteria for determining both the serving and the dominant interfering BS, can approximate the coverage performance more accurately as compared to utilizing Euclidean distance-based criteria. To the best of the authors$'$ knowledge, this is the first work that rigorously explores the role of angular distances in the association policy and analysis of cellular networks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09939v1",
        "http://arxiv.org/pdf/2303.09939v2"
    ],
    "publication_venue": "Double Column, accepted by IEEE Transactions on Wireless Communications"
}