{
    "arxiv_id": "2303.12967",
    "paper_title": "Initial-state dependent quantum speed limit for dissipative state preparation: Framework and optimization",
    "authors": [
        "Junjie Liu",
        "Hamlin Nie"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "cond-mat.mes-hall"
    ],
    "abstract": "Dissipation has traditionally been considered a hindrance to quantum information processing, but recent studies have shown that it can be harnessed to generate desired quantum states. To be useful for practical applications, the ability to speed up the dissipative evolution is crucial. In this study, we focus on a Markovian dissipative state preparation scheme where the prepared state is one of the energy eigenstates. We derive an initial-state-dependent quantum speed limit (QSL) that offers a more refined measure of the actual evolution time compared to the commonly used initial-state-independent relaxation time. This allows for a passive optimization of dissipative evolution across different initial states. By minimizing the dissipated heat during the preparation process, conditioned on the minimization of evolution time using the QSL, we find that the preferred initial state has a specific permutation of diagonal elements with respect to an ordered energy eigenbasis of increasing eigenvalues. In this configuration, the population on the prepared state is the largest, and the remaining diagonal elements are sorted in an order resembling that of a passive state in the same ordered energy eigenbasis. We demonstrate the effectiveness of our strategy in a dissipative Rydberg atom system for preparing the Bell state. Our work provides new insights into the optimization of dissipative state preparation processes and could have significant implications for practical quantum technologies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12967v1"
    ],
    "publication_venue": "9 pages, 2 figures. Comments are welcome"
}