{
    "arxiv_id": "2303.10939",
    "paper_title": "Tighter upper bounds on the critical temperature of two-dimensional superconductors and superfluids from the BCS to the Bose regime",
    "authors": [
        "Tingting Shi",
        "Wei Zhang",
        "C. A. R. Sá de Melo"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con"
    ],
    "abstract": "We discuss standard and tighter upper bounds on the critical temperature $T_c$ of two-dimensional (2D) superconductors and superfluids versus particle density $n$ or filling factor $ν$ for continuum and lattice systems from the Bardeen-Cooper-Schrieffer (BCS) to Bose regime. We discuss only one-band Hamiltonians, where the transition from the normal to superconducting (superfluid) phase is governed by Berezinskii-Kosterlitz-Thouless (BKT) mechanism of vortex-antivortex binding, such that a direct relation between the superfluid density tensor and $T_c$ exists. We demonstrate that it is imperative to consider at least the full effect of phase fluctuations of order parameter for superconductivity (superfluidity) to establish tighter bounds. Using the renormalization group, we obtain phase-fluctuation critical temperature $T_c^θ$, a much tighter upper bound to critical temperature supremum $T_c^{\\rm sup}$ than standard critical temperature upper bound $T_c^{\\rm up1}$ from Ferrell-Glover-Tinkham sum rule. We go beyond textbook phase-fluctuation theories and show that chemical potential renormalization, order parameter equation, and Nelson-Kosterlitz relation need to be solved self-consistently and simultaneously with renormalization group flow equation to produce $T_c^θ$ over the entire BCS-Bose crossover. We note that an analytic theory including modulus fluctuations of the order parameter valid throughout the BCS-Bose evolution is still lacking, but the inclusion of modulus fluctuations can only produce a critical temperature lower than $T_c^θ$ and thus produce an even tighter bound to $T_c^{\\rm sup}$. We conclude by indicating that if the measured critical temperature exceeds $T_c^θ$ in experiments involving 2D single-band systems, then a non-BKT mechanism must be invoked to describe the superconducting (superfluid) transition.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10939v1"
    ],
    "publication_venue": "12 pages, 5 figures, a long version of the short paper listed on arXiv:2203.05478"
}