{
    "arxiv_id": "2303.08627",
    "paper_title": "From Images to Features: Unbiased Morphology Classification via Variational Auto-Encoders and Domain Adaptation",
    "authors": [
        "Quanfeng Xu",
        "Shiyin Shen",
        "Rafael S. de Souza",
        "Mi Chen",
        "Renhao Ye",
        "Yumei She",
        "Zhu Chen",
        "Emille E. O. Ishida",
        "Alberto Krone-Martins",
        "Rupesh Durgesh"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "cs.LG"
    ],
    "abstract": "We present a novel approach for the dimensionality reduction of galaxy images by leveraging a combination of variational auto-encoders (VAE) and domain adaptation (DA). We demonstrate the effectiveness of this approach using a sample of low redshift galaxies with detailed morphological type labels from the Galaxy-Zoo DECaLS project. We show that 40-dimensional latent variables can effectively reproduce most morphological features in galaxy images. To further validate the effectiveness of our approach, we utilised a classical random forest (RF) classifier on the 40-dimensional latent variables to make detailed morphology feature classifications. This approach performs similarly to a direct neural network application on galaxy images. We further enhance our model by tuning the VAE network via DA using galaxies in the overlapping footprint of DECaLS and BASS+MzLS, enabling the unbiased application of our model to galaxy images in both surveys. We observed that noise suppression during DA led to even better morphological feature extraction and classification performance. Overall, this combination of VAE and DA can be applied to achieve image dimensionality reduction, defect image identification, and morphology classification in large optical surveys.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08627v1"
    ],
    "publication_venue": "10 pages, 8 figures"
}