{
    "arxiv_id": "2303.15664",
    "paper_title": "Synthetic Population of Binary Cepheids. II. The effect of companion light on the extragalactic distance scale",
    "authors": [
        "Paulina Karczmarek",
        "Gergely Hajdu",
        "Grzegorz Pietrzyński",
        "Wolfgang Gieren",
        "Weronika Narloch",
        "Radosław Smolec",
        "Grzegorz Wiktorowicz",
        "Krzysztof Belczynski"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-07-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Because of their period-luminosity relation (PLR), classical Cepheids play a key role in the calibration of the extragalactic distance scale and the determination of the Hubble-Lemaître constant $H_0$. Recent findings show that the majority of classical Cepheids should be in binary or multiple systems, which might undermine their accuracy, as the extra -- and unaccounted for -- light from the companions of Cepheids causes a shift in the PLR. We quantify this shift using synthetic populations of binary Cepheids that we developed for this purpose, as described in Paper I of this series. We find that while all PLRs are shifted toward brighter values due to the excess light from the companions, the bias in the relative distance modulus between two galaxies hosting binary Cepheids can be either positive or negative, depending on the percentage of binary Cepheids in them. If the binarity percentage in the two galaxies is similar, the effect of binarity is canceled. Otherwise, it introduces a shift in the distance modulus of the order of millimags in the near-infrared passbands and Wesenheit indices, and tens of millimags in the visual domain; its exact value depends on the variant of the synthetic population (a unique combination of metallicity, star formation history, shape and location of the instability strip, and initial parameter distributions). Such shifts in distance moduli to type Ia supernova host galaxies introduce an additional statistical error on $H_0$, which however does not prevent measuring $H_0$ with a precision of 1%.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15664v1"
    ],
    "publication_venue": "16 pages, 11 figures, accepted for publication in The Astrophysical Journal",
    "doi": "10.3847/1538-4357/acc845"
}