{
    "arxiv_id": "2303.14784",
    "paper_title": "A spatial measure-valued model for radiation-induced DNA damage kinetics and repair under protracted irradiation condition",
    "authors": [
        "Francesco G. Cordoni"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "math.PR",
        "physics.bio-ph"
    ],
    "abstract": "In the present work, we develop a general spatial stochastic model to describe the formation and repair of radiation-induced DNA damage. The model is described mathematically as a measure-valued particle-based stochastic system and extends in several directions the model developed in Cordoni et.al. 2021, Cordoni et.al. 2022a, Cordoni et.al. 2022b. In this new spatial formulation, radiation-induced DNA damage in the cell nucleus can undergo different pathways to either repair or lead to cell inactivation. The main novelty of the work is to rigorously define a spatial model that considers the pairwise interaction of lesions and continuous protracted irradiation. The former is relevant from a biological point of view as clustered lesions are less likely to be repaired, leading thus to cell inactivation. The latter instead describes the effects of a continuous radiation field on biological tissue. We prove the existence and uniqueness of a solution to the above stochastic systems, characterizing its probabilistic properties. We further couple the model describing the biological system to a set of reaction-diffusion equations with random discontinuity that model the chemical environment. At last, we study the large system limit of the process. The developed model can be applied to different contexts, with radiotherapy and space radioprotection being the most relevant. Further, the biochemical system derived can play a crucial role in understanding an extremely promising novel radiotherapy treatment modality, named in the community FLASH radiotherapy, whose mechanism is today largely unknown.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14784v1"
    ],
    "publication_venue": null
}