{
    "arxiv_id": "2303.07998",
    "paper_title": "Regularity Preserving Sum of Squares Decompositions",
    "authors": [
        "Sullivan F. MacDonald"
    ],
    "submission_date": "2023-03-12",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "math.FA"
    ],
    "abstract": "In the process of proving a sharpened form of Gårding's inequality, Fefferman & Phong demonstrated that every non-negative function $f\\in C^{3,1}(\\mathbb{R}^n)$ can be written as a finite sum of squares of functions in $C^{1,1}(\\mathbb{R}^n)$. In this thesis, we generalize their decomposition result to show that if $f\\in C^{k,α}(\\mathbb{R}^n)$ is non-negative for $0\\leq k\\leq 3$ and $0<α\\leq 1$, then $f$ can be written as a finite sum of squares of functions that are each `half' as regular as $f$, in the sense that they belong to the Hölder space \\[\n  C^\\frac{k+α}{2}(\\mathbb{R}^n)=\\begin{cases}\\hfil C^{\\frac{k}{2},\\fracα{2}}(\\mathbb{R}^n) & k\\textrm{ even}, \\\\ C^{\\frac{k-1}{2},\\frac{1+α}{2}}(\\mathbb{R}^n) & k\\textrm{ odd}.\n  \\end{cases} \\] We also investigate sufficient conditions for such regularity preserving decompositions to exist when $k\\geq 4$, and we construct examples of functions which cannot be decomposed into finite sums of half-regular squares.\n  The aforementioned result of Fefferman & Phong, as well as its subsequent refinements by Tataru, Sawyer & Korobenko, and many other authors, have been repeatedly used to investigate the properties of certain differential operators. We discuss similar applications of our generalized decomposition result to several problems in partial differential equations. In addition, we develop techniques for constructing non-negative polynomials which are not sums of squares of polynomials, and we prove related results which could not be found in a review of the literature.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07998v1"
    ],
    "publication_venue": "MSc Thesis"
}