{
    "arxiv_id": "2303.17159",
    "paper_title": "Thermodynamic and Transport Properties Modeling of Deep Eutectic Solvents: A review on gE-models, equations of state and molecular dynamics",
    "authors": [
        "Andrés González de Castilla",
        "Jan Philipp Bittner",
        "Simon Müller",
        "Sven Jakobtorweihen",
        "Irina Smirnova"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph",
        "cond-mat.stat-mech",
        "physics.comp-ph"
    ],
    "abstract": "Deep eutectic solvents (DESs) have gained attention in recent years as attractive alternatives to traditional solvents. There is a growing number of publications dealing with the thermodynamic modeling of DESs highlighting the importance of modeling the solutions' properties. In this review, we summarize the state-of-the-art in DES modeling as well as its current challenges. We also summarize the various modeling approaches to phase equilibria and properties of DESs with gE-models, EOS and molecular dynamics (MD) simulations. The current gE-model and EOS-based approaches handle DESs as pseudo-components in order to simplify the parameterizations and calculation strategies. However, for the models to become more transferable and predictive, it would be preferable to model the individual DES constituents instead of using the pseudo-components. This implies that validation with more detailed experimental data that includes the distribution of the DES components is also required. MD simulations, in contrast to gE-models and EOS, are capable of providing information about the liquid structure and can predict dynamic properties although, the latter quantities still show some imprecisions. Therefore, insights into the liquid structure of DES systems from MD could also aid in improving present modeling strategies in addition to a better understanding. Finally, the latest developments for DES force fields are discussed as the quality of the applied force fields determine the results of MD simulations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17159v1"
    ],
    "publication_venue": null,
    "doi": "10.1021/acs.jced.9b00548"
}