{
    "arxiv_id": "2303.09908",
    "paper_title": "How Charge Carrier Exchange between Absorber and Contact influences Time Constants in the Frequency Domain Response of Perovskite Solar Cells",
    "authors": [
        "Sandheep Ravishankar",
        "Zhifa Liu",
        "Yueming Wang",
        "Thomas Kirchartz",
        "Uwe Rau"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-11-10"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.app-ph"
    ],
    "abstract": "A model is derived for the frequency- and time-domain opto-electronic response of perovskite solar cells (PSCs) that emphasizes the role of charge carrier exchange, .i.e. extraction and injection, from (to) the perovskite through the transport layer to (from) the collecting electrode. This process is described by a charge carrier exchange velocity that depends on the mobility and electric field inside the transport layer. The losses implied by this process are modelled in an equivalent circuit model in the form of a voltage-dependent transport layer resistance. The analysis of the model predicts that the voltage dependence of the measured time constants allows discriminating situations where the transport layer properties dominate the experimental response. Application of this method to experimental impedance spectroscopy data identifies charge extraction velocities between 1-100 cm/s at 1 sun open-circuit conditions for p-i-n PSCs with PTAA as the hole transport layer, that corresponds to transport layer mobilities between 10^-4 - 3 x 10^-3 cm^2V^-1s^-1. The model paves the way for accurate estimation of photocurrent and fill factor losses in PSCs caused by the low mobilities in the transport layers, using small perturbation measurements in the time and frequency domain.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09908v1"
    ],
    "publication_venue": "26 pages, 10 figures",
    "doi": "10.1103/PRXEnergy.2.033006"
}