{
    "arxiv_id": "2303.14741",
    "paper_title": "Gauge Invariance and Anomalies in Condensed Matter Physics",
    "authors": [
        "Jürg Fröhlich"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el",
        "math-ph",
        "quant-ph"
    ],
    "abstract": "This paper begins with a summary of a powerful formalism for the study of electronic states in condensed matter physics called \"Gauge Theory of States/Phases of Matter.\" The chiral anomaly, which plays quite a prominent role in that formalism, is recalled. I then sketch an application of the chiral anomaly in 1+1 dimensions to quantum wires. Subsequently, some elements of the quantum Hall effect in two-dimensional (2D) gapped (\"incompressible\") electron liquids are reviewed. In particular, I discuss the role of anomalous chiral edge currents and of anomaly inflow in 2D gapped electron liquids with explicitly or spontaneously broken time reversal, i.e., in Hall- and Chern insulators. The topological Chern-Simons action yielding the transport equations valid in the bulk of such systems and the associated anomalous edge action are derived. The results of a general classification of \"abelian\" Hall insulators are outlined. After some remarks on induced Chern-Simons actions, I sketch results on certain 2D chiral photonic wave guides. I then continue with an analysis of chiral edge spin-currents and the bulk response equations in time-reversal invariant 2D topological insulators of electron gases with spin-orbit interactions. The \"chiral magnetic effect\" in 3D systems and axion-electrodynamics are reviewed next. This prepares the ground for an outline of a general theory of 3D topological insulators, including \"axionic insulators\". Some remarks on Weyl semi-metals, which exhibit the chiral magnetic effect, and on Mott transitions in 3D systems with dynamical axion-like degrees of freedom conclude this review.}",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14741v1"
    ],
    "publication_venue": "4 figures, 42 pages; will appear in 'Journal of Mathematical Physics' (AIP publishing)",
    "doi": "10.1063/5.0135142"
}