{
    "arxiv_id": "2303.14841",
    "paper_title": "Driver Drowsiness Detection with Commercial EEG Headsets",
    "authors": [
        "Qazal Rezaee",
        "Mehdi Delrobaei",
        "Ashkan Giveki",
        "Nasireh Dayarian",
        "Sahar Javaher Haghighi"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.HC",
        "eess.SY"
    ],
    "abstract": "Driver Drowsiness is one of the leading causes of road accidents. Electroencephalography (EEG) is highly affected by drowsiness; hence, EEG-based methods detect drowsiness with the highest accuracy. Developments in manufacturing dry electrodes and headsets have made recording EEG more convenient. Vehicle-based features used for detecting drowsiness are easy to capture but do not have the best performance. In this paper, we investigated the performance of EEG signals recorded in 4 channels with commercial headsets against the vehicle-based technique in drowsiness detection. We recorded EEG signals of 50 volunteers driving a simulator in drowsy and alert states by commercial devices. The observer rating of the drowsiness method was used to determine the drowsiness level of the subjects. The meaningful separation of vehicle-based features, recorded by the simulator, and EEG-based features of the two states of drowsiness and alertness have been investigated. The comparison results indicated that the EEG-based features are separated with lower p-values than the vehicle-based ones in the two states. It is concluded that EEG headsets can be feasible alternatives with better performance compared to vehicle-based methods for detecting drowsiness.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14841v1"
    ],
    "publication_venue": "546 Preprint version of the manuscript published in the proceedings of the 10th RSI International Conference on Robotics and Mechatronics (ICRoM 2022), Nov. 15-18, 2022, Tehran, Iran",
    "doi": "10.1109/ICRoM57054.2022.10025070"
}