{
    "arxiv_id": "2303.07970",
    "paper_title": "Study with WhoSGlAd of the acoustic depth of the helium glitch across the seismic HR diagram and its impact on the inferred helium abundance",
    "authors": [
        "Martin Farnir",
        "Angelo Valentino",
        "Marc-Antoine Dupret",
        "Anne-Marie Broomhall"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "The acoustic glitches' signature present in solar-like stars holds invaluable information. Indeed, it is caused by a sharp variation in the sound speed, therefore carrying localised information. One such glitch is the helium glitch caused by the hydrogen and first and second partial helium ionisation region, allowing us to constrain the surface helium abundance. However, the function adjusted to the glitch signature depends non-linearly on the acoustic depth at which it occurs, He. Retrieving the faint glitch signature and estimating $τ_{\\textrm{He}}$ are difficult but crucial tasks to accurately measure the glitch parameters and, ultimately, accurately infer the helium abundance.\n  In the present paper, we aim at providing a way to estimate $τ_{\\textrm{He}}$ using precise seismic indicators, independent of stellar modelling. Consequently, we aim at improving the WhoSGlAd (Whole Spectrum and Glitches Adjustment) method by automatically providing a model independent measure of the glitch's parameters.\n  We compute the evolution of $T_{\\textrm{He}}$, a dimensionless form of the acoustic depth, along a grid of models and adjust an empirical linear relation between $T_{\\textrm{He}}$ and the mean large separation and frequency ratio as defined in WhoSGlAd. We further optimise over the value of this estimate to ensure the stability and accuracy of the approach.\n  The proposed approach provides an excellent estimate of the acoustic depth and allows us to swiftly retrieve the glitch signature of observed spectra. We demonstrate that the we can accurately model the helium abundance of four Kepler targets by comparing model (both versions of WhoSGlAd) and literature values.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07970v1"
    ],
    "publication_venue": "9 pages, accepted for publication in MNRAS on the 14/03/2023",
    "doi": "10.1093/mnras/stad788"
}