{
    "arxiv_id": "2303.13583",
    "paper_title": "Precise Measurements of Self-absorbed Rising Reverse Shock Emission from Gamma-ray Burst 221009A",
    "authors": [
        "Joe S. Bright",
        "Lauren Rhodes",
        "Wael Farah",
        "Rob Fender",
        "Alexander J. van der Horst",
        "James K. Leung",
        "David R. A. Williams",
        "Gemma E. Anderson",
        "Pikky Atri",
        "David R. DeBoer",
        "Stefano Giarratana",
        "David A. Green",
        "Ian Heywood",
        "Emil Lenc",
        "Tara Murphy",
        "Alexander W. Pollak",
        "Pranav H. Premnath",
        "Paul F. Scott",
        "Sofia Z. Sheikh",
        "Andrew Siemion",
        "David J. Titterington"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The deaths of massive stars are sometimes accompanied by the launch of highly relativistic and collimated jets. If the jet is pointed towards Earth, we observe a \"prompt\" gamma-ray burst due to internal shocks or magnetic reconnection events within the jet, followed by a long-lived broadband synchrotron afterglow as the jet interacts with the circum-burst material. While there is solid observational evidence that emission from multiple shocks contributes to the afterglow signature, detailed studies of the reverse shock, which travels back into the explosion ejecta, are hampered by a lack of early-time observations, particularly in the radio band. We present rapid follow-up radio observations of the exceptionally bright gamma-ray burst GRB 221009A which reveal an optically thick rising component from the reverse shock in unprecedented detail both temporally and in frequency space. From this, we are able to constrain the size, Lorentz factor, and internal energy of the outflow while providing accurate predictions for the location of the peak frequency of the reverse shock in the first few hours after the burst.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13583v1"
    ],
    "publication_venue": "11 figures, 4 tables"
}