{
    "arxiv_id": "2303.10526",
    "paper_title": "Efficient deadlock avoidance for 2D mesh NoCs that use OQ or VOQ routers",
    "authors": [
        "Philippos Papaphilippou",
        "Thiem Van Chu"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-12-29"
    ],
    "latest_version": 3,
    "categories": [
        "cs.AR",
        "cs.DC"
    ],
    "abstract": "Network-on-chips (NoCs) are currently a widely used approach for achieving scalability of multi-cores to many-cores, as well as for interconnecting other vital system-on-chip (SoC) components. Each entity in 2D mesh-based NoCs has a router responsible for forwarding packets between the dimensions as well as the entity itself, and it is essentially a 5-port switch. With respect to the routing algorithm, there are important trade-offs between routing performance and the efficiency of overcoming potential deadlocks. Common deadlock avoidance techniques including the turn model usually involve restrictions of certain paths a packet can take at the cost of a higher probability for network congestion. In contrast, deadlock resolution techniques, as well as some avoidance schemes, provide more path flexibility at the expense of hardware complexity, such as by incorporating (or assuming) dedicated buffers.\n  This paper provides a deadlock avoidance algorithm for NoC routers based on output-queues (OQs) or virtual-output queues (VOQs), with a focus on their use on field-programmable gate-arrays (FPGAs). The proposed approach features fewer path restrictions than common techniques, and can be based on existing routing algorithms as a baseline, deadlock-free or not. This requires no modification to the queueing topology, and the required logic is minimal. Our algorithm approaches the performance of fully-adaptive algorithms, while maintaining deadlock freedom.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10526v1",
        "http://arxiv.org/pdf/2303.10526v2",
        "http://arxiv.org/pdf/2303.10526v3"
    ],
    "publication_venue": null
}