{
    "arxiv_id": "2303.10740",
    "paper_title": "Artificial diffusion for convective and acoustic low Mach number flows II: Application to Liou-Steffen, Zha-Bilgen and Toro-Vasquez convection-pressure flux splittings",
    "authors": [
        "Joshua Hope-Collins",
        "Luca di Mare"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn",
        "math.NA",
        "physics.comp-ph"
    ],
    "abstract": "Liou-Steffen splitting (AUSM) schemes are popular for low Mach number simulations, however, like many numerical schemes for compressible flow they require careful modification to accurately resolve convective features in this regime. Previous analyses of these schemes usually focus only on a single discrete scheme at the convective limit, only considering flow with acoustic effects empirically, if at all. In our recent paper Hope-Collins & di Mare, 2023 we derived constraints on the artificial diffusion scaling of low Mach number schemes for flows both with and without acoustic effects, and applied this analysis to Roe-type finite-volume schemes. In this paper we form approximate diffusion matrices for the Liou-Steffen splitting, as well as the closely related Zha-Bilgen and Toro-Vasquez splittings. We use the constraints found in Hope-Collins & di Mare, 2023 to derive and analyse the required scaling of each splitting at low Mach number. By transforming the diffusion matrices to the entropy variables we can identify erroneous diffusion terms compared to the ideal form used in Hope-Collins & di Mare, 2023. These terms vanish asymptotically for the Liou-Steffen splitting, but result in spurious entropy generation for the Zha-Bilgen and Toro-Vasquez splittings unless a particular form of the interface pressure is used. Numerical examples for acoustic and convective flow verify the results of the analysis, and show the importance of considering the resolution of the entropy field when assessing schemes of this type.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10740v1"
    ],
    "publication_venue": "34 pages, 17 figures, submitted to journal"
}