{
    "arxiv_id": "2303.14275",
    "paper_title": "TIC 219006972: A Compact, Coplanar Quadruple Star System Consisting of Two Eclipsing Binaries with an Outer Period of 168 days",
    "authors": [
        "Veselin B. Kostov",
        "Tamas Borkovits",
        "Saul A. Rappaport",
        "Brian P. Powell",
        "Andras Pal",
        "Thomas L. Jacobs",
        "Robert Gagliano",
        "Martti H. Kristiansen",
        "Daryll M. LaCourse",
        "Maxwell Moe",
        "Mark Omohundro",
        "Allan R. Schmitt",
        "Hans M. Schwengeler",
        "Ivan A. Terentev",
        "Andrew Vanderburg"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "We present the discovery of a new highly compact quadruple star system, TIC 219006972, consisting of two eclipsing binary stars with orbital periods of 8.3 days and 13.7 days, and an outer orbital period of only 168 days. This period is a full factor of 2 shorter than the quadruple with the shortest outer period reported previously, VW LMi, where the two binary components orbit each other every 355 days. The target was observed by TESS in Full-Frame Images in sectors 14-16, 21-23, 41, 48 and 49, and produced two sets of primary and secondary eclipses. These show strongly non-linear eclipse timing variations (ETVs) with an amplitude of $\\sim$0.1 days, where the ETVs of the primary and secondary eclipses, and of the two binaries are all largely positively correlated. This highlights the strong dynamical interactions between the two binaries and confirms the compact quadruple configuration of TIC 219006972. The two eclipsing binaries are nearly circular whereas the quadruple system has an outer eccentricity of about 0.25. The entire system is nearly edge-on, with a mutual orbital inclination between the two eclipsing binary star systems of about 1 degree.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14275v1"
    ],
    "publication_venue": "16 pages, 13 figures, 4 tables, MNRAS accepted",
    "doi": "10.1093/mnras/stad941"
}