{
    "arxiv_id": "2303.16357",
    "paper_title": "Iron-rich Metal-poor Stars and the Astrophysics of Thermonuclear Events Observationally Classified as Type Ia Supernovae. I. Establishing the Connection",
    "authors": [
        "Henrique Reggiani",
        "Kevin C. Schlaufman",
        "Andrew R. Casey"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "The progenitor systems and explosion mechanisms responsible for the thermonuclear events observationally classified as Type Ia supernovae are uncertain and difficult to uniquely constrain using traditional observations of Type Ia supernova host galaxies, progenitors, light curves, and remnants. For the subset of thermonuclear events that are prolific producers of iron, we use published theoretical nucleosynthetic yields to identify a set of elemental abundance ratios infrequently observed in metal-poor stars but shared across a range of progenitor systems and explosion mechanisms: [Na,Mg,Co/Fe]<0. We label stars with this abundance signature ``iron-rich metal-poor'' or IRMP stars. We suggest that IRMP stars formed in environments dominated by thermonuclear nucleosynthesis and consequently that their elemental abundances can be used to constrain both the progenitor systems and explosion mechanisms responsible for thermonuclear explosions. We identify three IRMP in the literature and homogeneously infer their elemental abundances. We find that the elemental abundances of BD+80 245, HE 0533--5340, and SMSS J034249.53--284216.0 are best explained by the (double) detonations of sub-Chandrasekhar mass CO white dwarfs. If our interpretation of IRMP stars is accurate, then they should be very rare in globular clusters and more common in the Magellanic Clouds and dwarf spheroidal galaxies than in the Milky Way's halo. We propose that future studies of IRMP stars will quantify the relative occurrences of different thermonuclear event progenitor systems and explosion mechanisms.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16357v1"
    ],
    "publication_venue": "Accepted for publication at AJ"
}