{
    "arxiv_id": "2303.17095",
    "paper_title": "Small scale clustering of BOSS galaxies: dependence on luminosity, color, age, stellar mass, specific star formation rate and other properties",
    "authors": [
        "Zhongxu Zhai",
        "Will J. Percival",
        "Hong Guo"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
    ],
    "abstract": "We measure and analyze galaxy clustering and the dependence on luminosity, color, age, stellar mass and specific star formation rate using Baryon Oscillation Spectroscopic Survey (BOSS) galaxies at $0.48<z<0.62$. We fit the monopole and quadrupole moments of the two-point correlation function (2PCF) and its projection on scales of $0.1$ -- $60.2h^{-1}$Mpc, after having split the catalog in a variety of ways. We find that the clustering dependence is consistent with previous well-established results showing the broad trends expected: For example, that brighter, redder, older, more massive and quenched galaxies are more strongly clustered. We also investigate the dependence on additional parameters previously derived from stellar population synthesis model fits to the spectra. We find that galaxy clustering depends on look-back formation time at a low level, while it has little dependence on metallicity. To understand the physics behind these trends, we fit the clustering with a simulation-based emulator to simultaneously model cosmology and galaxy bias using a Halo Occupation Distribution framework. After marginalizing parameters determining the background cosmology, galaxy bias, and a scaling parameter to decouple halo velocity field, we find that the growth rate of large scale structure as determined by the redshift-space distortions is consistent with previous analysis using the full sample and is independent of the galaxy selection. This demonstrates that cosmological inference using small scale clustering measurements is robust to changes in the catalog selection.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17095v1"
    ],
    "publication_venue": "16 pages, 13+2 figures, comments welcome",
    "doi": "10.1093/mnras/stad1793"
}