{
    "arxiv_id": "2303.14765",
    "paper_title": "A Survey on Dual-Quaternions",
    "authors": [
        "Benjamin Kenwright"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "math.OC",
        "cs.RO"
    ],
    "abstract": "Over the past few years, the applications of dual-quaternions have not only developed in many different directions but has also evolved in exciting ways in several areas. As dual-quaternions offer an efficient and compact symbolic form with unique mathematical properties. While dual-quaternions are now common place in many aspects of research and implementation, such as, robotics and engineering through to computer graphics and animation, there are still a large number of avenues for exploration with huge potential benefits. This article is the first to provide a comprehensive review of the dual-quaternion landscape. In this survey, we present a review of dual-quaternion techniques and applications developed over the years while providing insights into current and future directions. The article starts with the definition of dual-quaternions, their mathematical formulation, while explaining key aspects of importance (e.g., compression and ambiguities). The literature review in this article is divided into categories to help manage and visualize the application of dual-quaternions for solving specific problems. A timeline illustrating key methods is presented, explaining how dual-quaternion approaches have progressed over the years. The most popular dual-quaternion methods are discussed with regard to their impact in the literature, performance, computational cost and their real-world results (compared to associated models). Finally, we indicate the limitations of dual-quaternion methodologies and propose future research directions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14765v1"
    ],
    "publication_venue": "arXiv admin note: text overlap with arXiv:2303.13395"
}