{
    "arxiv_id": "2303.14237",
    "paper_title": "Decoding quantum color codes with MaxSAT",
    "authors": [
        "Lucas Berent",
        "Lukas Burgholzer",
        "Peter-Jan H. S. Derks",
        "Jens Eisert",
        "Robert Wille"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-07-17"
    ],
    "latest_version": 2,
    "categories": [
        "quant-ph"
    ],
    "abstract": "In classical computing, error-correcting codes are well established and are ubiquitous both in theory and practical applications. For quantum computing, error-correction is essential as well, but harder to realize, coming along with substantial resource overheads and being concomitant with needs for substantial classical computing. Quantum error-correcting codes play a central role on the avenue towards fault-tolerant quantum computation beyond presumed near-term applications. Among those, color codes constitute a particularly important class of quantum codes that have gained interest in recent years due to favourable properties over other codes. As in classical computing, decoding is the problem of inferring an operation to restore an uncorrupted state from a corrupted one and is central in the development of fault-tolerant quantum devices. In this work, we show how the decoding problem for color codes can be reduced to a slight variation of the well-known LightsOut puzzle. We propose a novel decoder for quantum color codes using a formulation as a MaxSAT problem based on this analogy. Furthermore, we optimize the MaxSAT construction and show numerically that the decoding performance of the proposed decoder achieves state-of-the-art decoding performance on color codes. The implementation of the decoder as well as tools to automatically conduct numerical experiments are publicly available as part of the Munich Quantum Toolkit (MQT) on GitHub.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14237v1",
        "http://arxiv.org/pdf/2303.14237v2"
    ],
    "publication_venue": "17 pages, 10 figures"
}