{
    "arxiv_id": "2303.10876",
    "paper_title": "EqMotion: Equivariant Multi-agent Motion Prediction with Invariant Interaction Reasoning",
    "authors": [
        "Chenxin Xu",
        "Robby T. Tan",
        "Yuhong Tan",
        "Siheng Chen",
        "Yu Guang Wang",
        "Xinchao Wang",
        "Yanfeng Wang"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV",
        "cs.MA"
    ],
    "abstract": "Learning to predict agent motions with relationship reasoning is important for many applications. In motion prediction tasks, maintaining motion equivariance under Euclidean geometric transformations and invariance of agent interaction is a critical and fundamental principle. However, such equivariance and invariance properties are overlooked by most existing methods. To fill this gap, we propose EqMotion, an efficient equivariant motion prediction model with invariant interaction reasoning. To achieve motion equivariance, we propose an equivariant geometric feature learning module to learn a Euclidean transformable feature through dedicated designs of equivariant operations. To reason agent's interactions, we propose an invariant interaction reasoning module to achieve a more stable interaction modeling. To further promote more comprehensive motion features, we propose an invariant pattern feature learning module to learn an invariant pattern feature, which cooperates with the equivariant geometric feature to enhance network expressiveness. We conduct experiments for the proposed model on four distinct scenarios: particle dynamics, molecule dynamics, human skeleton motion prediction and pedestrian trajectory prediction. Experimental results show that our method is not only generally applicable, but also achieves state-of-the-art prediction performances on all the four tasks, improving by 24.0/30.1/8.6/9.2%. Code is available at https://github.com/MediaBrain-SJTU/EqMotion.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10876v1"
    ],
    "publication_venue": "Accepted by CVPR 2023"
}