{
    "arxiv_id": "2303.08910",
    "paper_title": "Convergence and Quantum Advantage of Trotterized MERA for Strongly-Correlated Systems",
    "authors": [
        "Qiang Miao",
        "Thomas Barthel"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2024-10-01"
    ],
    "latest_version": 2,
    "categories": [
        "quant-ph",
        "cond-mat.str-el",
        "physics.comp-ph"
    ],
    "abstract": "Strongly-correlated quantum many-body systems are difficult to study and simulate classically. Our recent work [arXiv:2108.13401] proposed a variational quantum eigensolver (VQE) based on the multiscale entanglement renormalization ansatz (MERA) with tensors constrained to certain Trotter circuits. Here, we determine the scaling of computation costs for various critical spin chains which substantiates a polynomial quantum advantage in comparison to classical MERA simulations based on exact energy gradients or variational Monte Carlo. Algorithmic phase diagrams suggest an even greater separation for higher-dimensional systems. Hence, the Trotterized MERA VQE is a promising route for the efficient investigation of strongly-correlated quantum many-body systems on quantum computers. Furthermore, we show how the convergence can be substantially improved by building up the MERA layer by layer in the initialization stage and by scanning through the phase diagram during optimization. For the Trotter circuits being composed of single-qubit and two-qubit rotations, it is experimentally advantageous to have small rotation angles. We find that the average angle amplitude can be reduced considerably with negligible effect on the energy accuracy. Benchmark simulations suggest that the structure of the Trotter circuits for the TMERA tensors is not decisive; in particular, brick-wall circuits and parallel random-pair circuits yield very similar energy accuracies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08910v1",
        "http://arxiv.org/pdf/2303.08910v2"
    ],
    "publication_venue": "11 pages, 7 figures, 2 tables; substantial extension of the part on a quantum advantage, in addition to the common classical fMERA optimization based on exact energy gradients (EEG), we now also compare the TMERA VQE to fMERA VMC, TMERA EEG, and TMERA VMC and discuss alternative classical algorithms; further minor improvements"
}