{
    "arxiv_id": "2303.15314",
    "paper_title": "Development of a thorium coating on an aluminium substrate by using electrodeposition method and alpha spectroscopy",
    "authors": [
        "Dal-Ho Moon",
        "Vivek Chavan",
        "Vasant Bhoraskar",
        "Yeong Hoon Jeong",
        "Jung Ho Park",
        "Su-Jeong Suh",
        "Seung-Woo Hong"
    ],
    "submission_date": "2023-03-11",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ins-det",
        "nucl-ex"
    ],
    "abstract": "A thin coating of thorium on aluminium substrates with the areal density of 110 to 130 $μg/cm^2$ is developed over a circular area of 22 mm diameter by using the electrodeposition method. An electrodeposition system is fabricated to consist of three components; an anode made of a platinum mesh, a cylindrical-shape vessel to contain the thorium solution, and a cathode in the form of a circular aluminium plate. The aluminium plate is mounted horizontally, and the platinum mesh is connected to an axial rod of an electric motor, mounted vertically and normal to the plane of the aluminium. The electrolyte solution is prepared by dissolving a known-weight thorium nitrate powder in 0.8 M HNO3 and isopropanol. The system is operated either in constant voltage (CV) or constant current (CC) mode. Under the electric field between the anode and cathode, thorium ions were deposited on the aluminium substrate mounted on the cathode. In the CV mode at 320, 360, and 400 V and in the CC mode at 15 mA, thorium films were formed over a circular area of the aluminium substrate. The areal density of thorium coating was measured by detecting emitted alpha particles. The areal density of thorium varied from 80 to 130 $μg/cm^2$ by changing the deposition time from 10 to 60 min. The results from the CV mode and CC mode are compared, and the radial dependence in the measured areal density is discussed for different modes of the electric field. The developed thorium coatings are to be used in the in-house development of particle detectors, fast neutron converters, targets for thorium fission experiments, and other purposes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15314v1"
    ],
    "publication_venue": "11 pages, 5 figures, 1 table"
}