{
    "arxiv_id": "2303.17129",
    "paper_title": "Spin and Orbital Angular Momentum of Coherent Photons in a Waveguide",
    "authors": [
        "Shinichi Saito"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2024-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics",
        "quant-ph"
    ],
    "abstract": "Spin angular momentum of a photon corresponds to a polarisation degree of freedom of lights, and such that various polarisation properties are coming from macroscopic manifestation of quantum-mechanical properties of lights. An orbital degree of freedom of lights is also manipulated to form a vortex of lights with orbital angular momentum, which is also quantised. However, it is considered that spin and orbital angular momentum of a photon cannot be split from the total orbital angular momentum in a gauge-invariant way. Here, we revisit this issue for a coherent monochromatic ray from a laser source, propagating in a waveguide. We obtained the helical components of spin and orbital angular momentum by the correspondence with the classical Ponyting vector. By applying a standard quantum field theory using a coherent state, we obtained the gauge-independent expressions of spin and orbital angular momentum operators. During the derivations, it was essential to take a finite cross-sectional area into account, which leads the finite longitudinal component along the direction of the propagation, which allows the splitting. Therefore, the finite mode profile was responsible to justify the splitting, which was not possible as far as we are using plane-wave expansions in a standard theory of quantum-electrodynamics (QED). Our results suggest spin and orbital angular momentum are well-defined quantum-mechanical freedoms at least for coherent photons propagating in a waveguide and in a vacuum with a finite mode profile.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17129v1"
    ],
    "publication_venue": null,
    "doi": "10.3389/fphy.2023.1225360"
}