{
    "arxiv_id": "2303.12108",
    "paper_title": "Diverse Molecular Structures Across The Whole Star-Forming Disk of M83: High fidelity Imaging at 40pc Resolution",
    "authors": [
        "Jin Koda",
        "Akihiko Hirota",
        "Fumi Egusa",
        "Kazushi Sakamoto",
        "Tsuyoshi Sawada",
        "Mark Heyer",
        "Junichi Baba",
        "Samuel Boissier",
        "Daniela Calzetti",
        "Jennifer Donovan Meyer",
        "Bruce G. Elmegreen",
        "Armando Gil de Paz",
        "Nanase Harada",
        "Luis C. Ho",
        "Masato I. N. Kobayashi",
        "Nario Kuno",
        "Amanda M Lee",
        "Barry F. Madore",
        "Fumiya Maeda",
        "Sergio Martin",
        "Kazuyuki Muraoka",
        "Kouichiro Nakanishi",
        "Sachiko Onodera",
        "Jorge L. Pineda",
        "Nick Scoville",
        "Yoshimasa Watanabe"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-06-14"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
    ],
    "abstract": "We present high-fidelity CO(1-0) imaging of molecular gas across the full star-forming disk of M83, using ALMA's 12m, 7m, and TP arrays and the MIRIAD package. The data have a mass sensitivity and resolution of 10^4Msun and 40 pc. The full disk coverage shows that the characteristics of molecular gas change radially from the center to outer disk. The molecular gas distribution shows coherent large-scale structures in the inner part, including the central concentration, bar offset ridges, and prominent molecular spiral arms. In the outer disk, the spiral arms appear less spatially coherent, and even flocculent. Massive filamentary gas concentrations are abundant even in the interarm regions. Building up these structures in the interarm regions would require a very long time (~>100Myr). Instead, they must have formed within stellar spiral arms and been released into the interarm regions. For such structures to survive through the dynamical processes, the lifetimes of these structures and their constituent molecules and molecular clouds must be long (~>100Myr). These interarm structures host little or no star formation traced by Halpha. The new map also shows extended CO emission, which likely represents an ensemble of unresolved molecular clouds.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12108v1"
    ],
    "publication_venue": "Accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc65e"
}