{
    "arxiv_id": "2303.17562",
    "paper_title": "Comprehensive study of forced convection over a heated elliptical cylinder with varying angle of incidences to uniform free stream",
    "authors": [
        "Raghav Singhal",
        "Sailen Dutta",
        "Jiten C. Kalita"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-08-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn",
        "math.NA"
    ],
    "abstract": "In this paper we carry out a numerical investigation of forced convection heat transfer from a heated elliptical cylinder in a uniform free stream with angle of inclination $θ^{\\circ}$. Numerical simulations were carried out for $10 \\leq Re \\leq 120$, $0^{\\circ} \\leq θ\\leq 180^{\\circ}$, and $Pr = 0.71$. Results are reported for both steady and unsteady state regime in terms of streamlines, vorticity contours, isotherms, drag and lift coefficients, Strouhal number, and Nusselt number. In the process, we also propose a novel method of computing the Nusselt number by merely gathering flow information along the normal to the ellipse boundary. The critical $Re$ at which which flow becomes unsteady, $Re_c$ is reported for all the values of $θ$ considered and found to be the same for $θ$ and $180^\\circ -θ$ for $0^\\circ \\leq θ\\leq 90^\\circ$. In the steady regime, the $Re$ at which flow separation occurs progressively decreases as $θ$ increases. The surface averaged Nusselt number ($Nu_{\\text{av}}$) increases with $Re$, whereas the drag force experienced by the cylinder decreases with $Re$. The transient regime is characterized by periodic vortex shedding, which is quantified by the Strouhal number ($St$). Vortex shedding frequency increases with $Re$ and decreases with $θ$ for a given $Re$. $Nu_{\\text{av}}$ also exhibits a time-varying oscillatory behaviour with a time period which is half the time period of vortex shedding. The amplitude of oscillation of $Nu_{\\text{av}}$ increases with $θ$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17562v1"
    ],
    "publication_venue": null,
    "doi": "10.1016/j.ijthermalsci.2023.108588"
}