{
    "arxiv_id": "2303.08635",
    "paper_title": "Electronic Structure and Optical Properties of Tin Iodide Solution Complexes",
    "authors": [
        "Freerk Schütt",
        "Ana M. Valencia",
        "Caterina Cocchi"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "The emerging interest in tin-halide perovskites demands a robust understanding of the fundamental properties of these materials starting from the earliest steps of their synthesis. In a first-principles work based on time-dependent density-functional theory, we investigate the structural, energetic, electronic, and optical properties of 14 tin-iodide solution complexes formed by the SnI$_2$ unit tetracoordinated with molecules of common solvents, which we classify according to their Gutmann's donor number. We find that all considered complexes are energetically stable and their formation energy expectedly increases with the donating ability of the solvent. The energies of the frontier states are affected by the choice of the solvent with their absolute values decreasing with the donor number. The occupied orbitals are predominantly localized on the tin-iodide unit while the unoccupied ones are distributed also on the solvent molecules. Owing to this partial wave-function overlap, the first optical excitation is generally weak, although the spectral weight is red-shifted by the solvent molecules being coordinated to SnI$_2$ in comparison to the reference obtained for this molecule alone. Comparisons with results obtained on the same level of theory on Pb-based counterparts corroborate our analysis. The outcomes of this study provide quantum-mechanical insight into the fundamental properties of tin-iodide solution complexes. This knowledge is valuable in the research on lead-free halide perovskites and their precursors.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08635v1"
    ],
    "publication_venue": null
}