{
    "arxiv_id": "2303.12119",
    "paper_title": "Precise description of medium-induced emissions",
    "authors": [
        "Johannes Hamre Isaksen",
        "Konrad Tywoniuk"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph",
        "hep-th",
        "nucl-th"
    ],
    "abstract": "We study jet fragmentation via final-state parton splittings in the medium. These processes are usually calculated theoretically by invoking the large-$N_c$ limit. In this paper we perform the first computation of a $1\\to2$ parton splitting in a thermal medium at finite numbers of colors $N_c$, for arbitrary momentum-sharing fraction $z$ and with full transverse dynamics. We show how the problem can be transformed into a system of coupled Schrödinger equations, that we solve numerically. The novel numerical results are used to estimate the accuracy of several widely used approximations. We check the error introduced while going from finite $N_c$ (i.e. $N_c =3$) to the large-$N_c$ limit, which we find to be small. For unbalanced splittings, e.g. when $z\\to 0$, only one of the partons is affected by transverse momentum exchanges with the medium. The emission process then separates into a term responsible for the $1 \\to 2$ splitting and the subsequent independent broadening of the daughter partons. This is also referred to as the factorizable term. For finite $z$, further contributions arise that are responsible for the coherent color dynamics of the two-parton system, and these are referred to as non-factorizable terms. These were argued to be small for soft (unbalanced) splittings and for large media. In this work we therefore determine the accuracy of keeping only the factorizable term of the large-$N_c$ solution. We find that the error is insignificant at a small splitting fraction $z \\sim 0$, but can be sizable in a more balanced splitting with $z\\sim 0.5$. Finally, we also examine the eikonal approximation, which amounts to approximating the partons' paths through the medium as straight lines. We find that it is associated with a substantial error for the parameter values we explored in this work.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12119v1"
    ],
    "publication_venue": "50 pages, 14 figures"
}