{
    "arxiv_id": "2303.13152",
    "paper_title": "LOFAR Deep Fields: Probing faint Galactic polarised emission in ELAIS-N1",
    "authors": [
        "Iva Šnidarić",
        "Vibor Jelić",
        "Maaijke Mevius",
        "Michiel Brentjens",
        "Ana Erceg",
        "Timothy W. Shimwell",
        "Sara Piras",
        "Cathy Horellou",
        "Jose Sabater",
        "Philip N. Best",
        "Andrea Bracco",
        "Lana Ceraj",
        "Marijke Haverkorn",
        "Shane P. O'Sullivan",
        "Luka Turić",
        "Valentina Vacca"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-06-14"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
    ],
    "abstract": "We present the first deep polarimetric study of Galactic synchrotron emission at low radio frequencies. Our study is based on 21 observations of the European Large Area Infrared Space Observatory Survey-North 1 (ELAIS-N1) field using the Low-Frequency Array (LOFAR) at frequencies from 114.9 to 177.4 MHz. These data are a part of the LOFAR Two-metre Sky Survey Deep Fields Data Release 1. We used very low-resolution ($4.3'$) Stokes QU data cubes of this release. We applied rotation measure (RM) synthesis to decompose the distribution of polarised structures in Faraday depth, and cross-correlation RM synthesis to align different observations in Faraday depth. We stacked images of about 150 hours of the ELAIS-N1 observations to produce the deepest Faraday cube at low radio frequencies to date, tailored to studies of Galactic synchrotron emission and the intervening magneto-ionic interstellar medium. This Faraday cube covers $\\sim36~{\\rm deg^{2}}$ of the sky and has a noise of $27~{\\rm μJy~PSF^{-1}~RMSF^{-1}}$ in polarised intensity. This is an improvement in noise by a factor of approximately the square root of the number of stacked data cubes ($\\sim\\sqrt{20}$), as expected, compared to the one in a single data cube based on five-to-eight-hour observations. We detect a faint component of diffuse polarised emission in the stacked cube, which was not detected previously. Additionally, we verify the reliability of the ionospheric Faraday rotation corrections estimated from the satellite-based total electron content measurements to be of $~\\sim0.05~{\\rm rad~m^{-2}}$. We also demonstrate that diffuse polarised emission itself can be used to account for the relative ionospheric Faraday rotation corrections with respect to a reference observation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13152v1"
    ],
    "publication_venue": "15 pages, 15 figures, accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202245124"
}