{
    "arxiv_id": "2303.13907",
    "paper_title": "Soliciting opinions and solutions on the \"Q Zhang's Problem\"",
    "authors": [
        "Zhong Wang"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ed-ph",
        "q-bio.NC"
    ],
    "abstract": "\"Q Zhang's Problem\" is a teaching problem proposed by Qian Zhang, a science teacher at Dongjiao Minxiang Primary School in Dongcheng District, Beijing. In 2022, she proposed that: (1) when explaining the knowledge points of frequency in the \"Sound\" unit, experiments on the vibration of objects such as rubber bands and steel rulers were used to assist students in learning, but the effect was not obvious, because it was difficult for the naked eye to distinguish the speed of vibration of objects such as rubber bands, and it was difficult to correspond to the high and low frequencies; (2) Students seem to be confused about the difference between frequency and amplitude. When guiding them to make the rubber band vibrate faster, they tend to tug harder at the rubber band, but this actually changes the amplitude rather than the frequency (changing the frequency should be to control its vibrating chord length, similar to the tuning method of a stringed instrument). Therefore, demonstration experiments using objects such as rubber bands as frequencies do not seem suitable and cannot effectively assist students in establishing the concept of frequency. We hope to solicit opinions and solutions (research ideas) on this problem, with a focus on two points: (1) the mathematical/physical explanation of the problem. That is, does simply changing the amplitude really not affect the original vibration frequency of the object (except when the amplitude is 0) (2) explanation from a cognitive perspective: Why do people confuse the two concepts? What is the cognitive mechanism behind it.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13907v1"
    ],
    "publication_venue": null
}