{
    "arxiv_id": "2303.13615",
    "paper_title": "Germain Curvature: The Case for Naming the Mean Curvature of a Surface after Sophie Germain",
    "authors": [
        "Douglas P. Holmes"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "math.HO",
        "cond-mat.soft",
        "math.DG",
        "physics.hist-ph"
    ],
    "abstract": "How do we characterize the shape of a surface? It is now well understood that the shape of a surface is determined by measuring how curved it is at each point. From these measurements, one can identify the directions of largest and smallest curvature, i.e. the principal curvatures, and construct two surface invariants by taking the average and the product of the principal curvatures. The product of the principal curvatures describes the intrinsic curvature of a surface, and has profound importance in differential geometry - evidenced by the Gauss's Theorema Egregium and the Gauss-Bonnet theorem. This curvature is commonly referred to as the Gaussian Curvature after Carl Friedrich Gauss, following his significant contributions to the emerging field of differential geometry in his 1828 work. The average, or mean curvature, is an extrinsic measure of the shape of a surface - that is, the shape must be embedded in a higher dimensional space to be measured. Beginning in 1811, and culminating in efforts in 1821 and 1826, the mathematician Sophie Germain identified the mean curvature as the appropriate measure for describing the shape of vibrating plates. Her hypothesis leads directly to the equations describing the behavior of thin, elastic plates. In letters to Gauss, she described her notion of a \"sphere of mean curvature\" that can be identified at each point on the surface. This contribution stimulated a period of rapid development in elasticity and geometry, and yet Germain has not yet received due credit for deducing the mathematical and physical significance of mean curvature. It is clear from the primary source evidence that this measure of mean curvature should bear the name of Sophie Germain.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13615v1"
    ],
    "publication_venue": "6 pages, 3 figures"
}