{
    "arxiv_id": "2303.16594",
    "paper_title": "The Future of Space Activities and Preservation on Mars: A Preliminary Policy Delphi Study",
    "authors": [
        "George Profitiliotis",
        "Jacob Haqq-Misra"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2024-06-17"
    ],
    "latest_version": 1,
    "categories": [
        "physics.soc-ph",
        "physics.pop-ph"
    ],
    "abstract": "A 'planetary park' system has been suggested as a way for Mars to 'preserve' land for a multitude of purposes. These parks would represent a diverse portion of martian terrain and would be regulated to minimize human contamination and prevent excess human intervention. Such a planetary parks concept could also appeal to corporate interests as a compromise between protecting environmental interests and allowing private use of resources on Mars. This empirical study aims to help advance the core discussion of the interplay between future space activities and future preservation plans on Mars. Specifically, this work uses a particular strategic foresight method, the Policy Delphi, as a means to reveal positions on that issue and to explore alternative policy options in advance, through the collective judgment of a panel of experts. It should be noted that the goal was not strictly to promote consensus regarding the topic of interest, but to encourage structured dialogue. Consequently, the stable consensus achieved in specific areas indicated that the panel of experts foresees international cooperation on matters related to preservation plans for Mars, which, in turn, will enhance the overall international space governance. Furthermore, the panel foresees the inclusion of varying actors, both state and non-state ones, in the development of a preservation framework for Mars, especially on a national level. To this end, the panel endorses the inclusion of a diversity of values to be protected via the aforementioned framework, and suggests the advancement of broad global dialogue on this matter including academic, industrial, governmental, and public actors. The preliminary insights revealed in this work may inform relevant international discussions towards the formulation of proactive policies that will contribute to the environmental governance of future activities on Mars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16594v1"
    ],
    "publication_venue": "Accepted by Advances in Space Research",
    "doi": "10.1016/j.asr.2023.03.042"
}