{
    "arxiv_id": "2303.15767",
    "paper_title": "Dark Matter in Fractional Gravity I: Astrophysical Tests on Galactic Scales",
    "authors": [
        "Francesco Benetti",
        "Andrea Lapi",
        "Giovanni Gandolfi",
        "Paolo Salucci",
        "Luigi Danese"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "[abridged] We explore the possibility that the dark matter (DM) component in galaxies may originate fractional gravity. In such a framework, the standard law of inertia continues to hold, but the gravitational potential associated to a given DM density distribution is determined by a modified Poisson equation including fractional derivatives (i.e., derivatives of non-integer type), that are meant to describe non-local effects. We derive analytically the expression of the potential that in fractional gravity corresponds to various spherically symmetric density profiles, including the Navarro-Frenk-White (NFW) distribution that is usually exploited to describe virialized halos of collisionless DM as extracted from $N-$body cosmological simulations. We show that in fractional gravity the dynamics of a test particle moving in a cuspy NFW density distribution is substantially altered with respect to the Newtonian case (i.e., basing on the standard Poisson equation), mirroring what in Newtonian gravity would instead be sourced by a density profile with an inner core. We test the fractional gravity framework on galactic scales, showing that: (i) it can provide accurate fits to the stacked rotation curves of galaxies with different properties; (ii) it can reproduce to reasonable accuracy the observed shape and scatter of the radial acceleration relation (RAR); (iii) it can properly account for the universal surface density and the core radius vs. disk scale-length scaling relations. Finally, we discuss the possible origin of the fractional gravity behavior as a fundamental or emerging property of the elusive DM component.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15767v1"
    ],
    "publication_venue": "30 pages, 11 figures, Accepted by ApJ",
    "doi": "10.3847/1538-4357/acc8ca"
}