{
    "arxiv_id": "2303.16016",
    "paper_title": "Generation of third-harmonic spin oscillation from strong spin precession induced by terahertz magnetic near fields",
    "authors": [
        "Zhenya Zhang",
        "Fumiya Sekiguchi",
        "Takahiro Moriyama",
        "Shunsuke C. Furuya",
        "Masahiro Sato",
        "Takuya Satoh",
        "Yu Mukai",
        "Koichiro Tanaka",
        "Takafumi Yamamoto",
        "Hiroshi Kageyama",
        "Yoshihiko Kanemitsu",
        "Hideki Hirori"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-04-04"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics",
        "cond-mat.other"
    ],
    "abstract": "The ability to drive a spin system to state far from the equilibrium is indispensable for investigating spin structures of antiferromagnets and their functional nonlinearities for spintronics. While optical methods have been considered for spin excitation, terahertz (THz) pulses appear to be a more convenient means of direct spin excitation without requiring coupling between spins and orbitals or phonons. However, room-temperature responses are usually limited to small deviations from the equilibrium state because of the relatively weak THz magnetic fields in common approaches. Here, we studied the magnetization dynamics in a HoFeO3 crystal at room temperature. A custom-made spiral-shaped microstructure was used to locally generate a strong multicycle THz magnetic near field perpendicular to the crystal surface; the maximum magnetic field amplitude of about 2 T was achieved. The observed time-resolved change in the Faraday ellipticity clearly showed second- and third-order harmonics of the magnetization oscillation and an asymmetric oscillation behaviour. Not only the ferromagnetic vector M but also the antiferromagnetic vector L plays an important role in the nonlinear dynamics of spin systems far from equilibrium.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16016v1"
    ],
    "publication_venue": null,
    "doi": "10.1038/s41467-023-37473-1"
}