{
    "arxiv_id": "2303.10248",
    "paper_title": "Chemical reactions between carbon atoms confined in single-walled carbon nanotube -- a molecular dynamics study",
    "authors": [
        "Somayeh Eskandari",
        "János Koltai",
        "István László",
        "Mehran Vaezi",
        "Jenő Kürti"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Carbon nanotubes can serve as one-dimensional nanoreactors for in-tube synthesis of various nanostructures. Experimental observations have shown that chains, inner tubes or nanoribbons can grow by thermal decomposition of organic/organometallic molecules encapsulated in carbon nanotubes. The result of the process depends on the temperature, the diameter of the nanotube, and the type and amount of material introduced inside the tube. Nanoribbons are particularly promising materials for nanoelectronics. Motivated by recent experimental results observing the formation of carbon nanoribbons inside carbon nanotubes, molecular dynamics calculations were performed with the open source LAMMPS code to investigate the reactions between carbon atoms confined within a single walled carbon nanotube. Our results show that the interatomic potentials behave differently in quasi-one-dimensional simulations of nanotube-confined space than in three-dimensional simulations. In particular, the Tersoff potential performs better than the widely used ReaxFF potential, in describing the formation of carbon nanoribbons inside nanotubes. The Tersoff potential is a valuable tool for modelling reactions within the nanotubes. We also found a temperature window where the nanoribbons were formed with the fewest defects, i.e. with the largest flatness and the most hexagons, which is in agreement with the experimental temperature range.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10248v1"
    ],
    "publication_venue": "25 pages, 12 figures"
}