{
    "arxiv_id": "2303.09838",
    "paper_title": "A Computational Framework Integrating Physics-based Model and Equivalent Circuit Network Model to Simulate Li-ion batteries",
    "authors": [
        "Han Yuan",
        "Shen Li",
        "Tao Zhu",
        "Simon O'Kane",
        "Carlos Garcia",
        "Gregory Offer",
        "Monica Marinescu"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2024-07-15"
    ],
    "latest_version": 2,
    "categories": [
        "physics.app-ph"
    ],
    "abstract": "Battery models generally fall into two categories: physics-based models and ECM models. Physics-based Doyle-Fuller-Newman (DFN) models can accurately simulate the battery internal electrochemical processes, but to properly account for thermal effects requires a strong coupling between a DFN model and a 3D thermal model, which is computationally unaffordable. Distributed Equivalent Circuit Network (ECN) models can perform simulations with high speed and reasonable accuracy. However, these models rely heavily on the characterisation experiments for ECN parameter identification, which is resource-intensive and can lead to inaccurate parametrisation outcomes due to internal thermal inhomogeneity. To harness the strengths of both models, we propose a computational framework to integrate electrochemical DFN model and 3D distributed ECN model together. Using this framework, we simulate constant current discharge experiments of Kokam 7.5 Ah pouch cell (Model SLPB75106100) and compare the simulations with the commonly-used lumped DFN-thermal model. The computational model outperforms the lumped DFN model at low-temperature and/or high C-rate scenarios significantly. The largest predicting error of the framework at 3 C-rate &Tam = 25oC and at 1 C-rate &Tam = 0 oC is approximately 1/3 of that for DFN model. At 3 C-rate &Tam = 5oC, the difference between these two can rise to 377 mV. By integrating DFN and 3D-distributed ECN together, the computational framework can simulate the complicated interplay between electrochemistry, thermal process, and electricity within a cell fast and accurately. We anticipate this computational framework to be a valuable toolset to assist researchers and engineers in the design and control of Li-ion batteries.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09838v1",
        "http://arxiv.org/pdf/2303.09838v2"
    ],
    "publication_venue": null
}