{
    "arxiv_id": "2303.16771",
    "paper_title": "Magnetic fields inferred by Solar Orbiter: A comparison between SO/PHI-HRT and SDO/HMI",
    "authors": [
        "J. Sinjan",
        "D. Calchetti",
        "J. Hirzberger",
        "F. Kahil",
        "G. Valori",
        "S. K. Solanki",
        "K. Albert",
        "N. Albelo Jorge",
        "A. Alvarez-Herrero",
        "T. Appourchaux",
        "L. R. Bellot Rubio",
        "J. Blanco Rodríguez",
        "A. Feller",
        "A. Gandorfer",
        "D. Germerott",
        "L. Gizon",
        "J. M. Gómez Cama",
        "L. Guerrero",
        "P. Gutierrez-Marques",
        "M. Kolleck",
        "A. Korpi-Lagg",
        "H. Michalik",
        "A. Moreno Vacas",
        "D. Orozco Suárez",
        "I. Pérez-Grande",
        "E. Sanchis Kilders",
        "M. Balaguer Jiménez",
        "J. Schou",
        "U. Schühle",
        "J. Staub",
        "H. Strecker",
        "J. C. del Toro Iniesta",
        "R. Volkmer",
        "J. Woch"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "physics.space-ph"
    ],
    "abstract": "The High Resolution Telescope (HRT) of the Polarimetric and Helioseismic Imager on board the Solar Orbiter spacecraft (SO/PHI) and the Helioseismic and Magnetic Imager (HMI) on board the Solar Dynamics Observatory (SDO) both infer the photospheric magnetic field from polarised light images. SO/PHI is the first magnetograph to move out of the Sun--Earth line and will provide unprecedented access to the Sun's poles. This provides excellent opportunities for new research wherein the magnetic field maps from both instruments are used simultaneously. We aim to compare the magnetic field maps from these two instruments and discuss any possible differences between them. We used data from both instruments obtained during Solar Orbiter's inferior conjunction on 7 March 2022. The HRT data were additionally treated for geometric distortion and degraded to the same resolution as HMI. The HMI data were re-projected to correct for the $3^{\\circ}$ separation between the two observatories. SO/PHI-HRT and HMI produce remarkably similar line-of-sight magnetograms, with a slope coefficient of $0.97$, an offset below $1$ G, and a Pearson correlation coefficient of $0.97$. However, SO/PHI-HRT infers weaker line-of-sight fields for the strongest fields. As for the vector magnetic field, SO/PHI-HRT was compared to both the $720$-second and $90$-second HMI vector magnetic field: SO/PHI-HRT has a closer alignment with the $90$-second HMI vector. In the weak signal regime ($< 600$ G), SO/PHI-HRT measures stronger and more horizontal fields than HMI, very likely due to the greater noise in the SO/PHI-HRT data. In the strong field regime ($\\gtrsim 600$ G), HRT infers lower field strengths but with similar inclinations (a slope of $0.92$) and azimuths (a slope of $1.02$). The slope values are from the comparison with the HMI $90$-second vector.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16771v1"
    ],
    "publication_venue": "10 pages, 5 figures, accepted for publication in A&A; manuscript is a part of Astronomy & Astrophysics special issue: Solar Orbiter First Results (Nominal Mission Phase)",
    "doi": "10.1051/0004-6361/202245830"
}