{
    "arxiv_id": "2303.08083",
    "paper_title": "Secrecy Gain of Formally Unimodular Lattices from Codes over the Integers Modulo 4",
    "authors": [
        "Maiara F. Bollauf",
        "Hsuan-Yin Lin",
        "Øyvind Ytrehus"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 2,
    "categories": [
        "cs.IT"
    ],
    "abstract": "Recently, a design criterion depending on a lattice's volume and theta series, called the secrecy gain, was proposed to quantify the secrecy-goodness of the applied lattice code for the Gaussian wiretap channel. To address the secrecy gain of Construction $\\text{A}_4$ lattices from formally self-dual $\\mathbb{Z}_4$-linear codes, i.e., codes for which the symmetrized weight enumerator (swe) coincides with the swe of its dual, we present new constructions of $\\mathbb{Z}_4$-linear codes which are formally self-dual with respect to the swe. For even lengths, formally self-dual $\\mathbb{Z}_4$-linear codes are constructed from nested binary codes and double circulant matrices. For odd lengths, a novel construction called odd extension from double circulant codes is proposed. Moreover, the concepts of Type I/II formally self-dual codes/unimodular lattices are introduced. Next, we derive the theta series of the formally unimodular lattices obtained by Construction $\\text{A}_4$ from formally self-dual $\\mathbb{Z}_4$-linear codes and describe a universal approach to determine their secrecy gains. The secrecy gain of Construction $\\text{A}_4$ formally unimodular lattices obtained from formally self-dual $\\mathbb{Z}_4$-linear codes is investigated, both for even and odd dimensions. Numerical evidence shows that for some parameters, Construction $\\text{A}_4$ lattices can achieve a higher secrecy gain than the best-known formally unimodular lattices from the literature.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08083v1",
        "http://arxiv.org/pdf/2303.08083v2"
    ],
    "publication_venue": "arXiv admin note: text overlap with arXiv:2202.09236"
}