{
    "arxiv_id": "2303.16327",
    "paper_title": "Hall conductivity as the topological invariant in magnetic Brillouin zone in the presence of interactions",
    "authors": [
        "M. Selch",
        "M. Suleymanov",
        "C. X. Zhang",
        "M. A. Zubkov"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "Hall conductivity for the intrinsic anomalous quantum Hall effect in homogeneous systems is given by the topological invariant composed of the Green function depending on momentum of quasiparticle. This expression reveals correspondence with the mathematical notion of the degree of mapping. A more involved situation takes place for the quantum Hall effect in the presence of external magnetic field. In this case the mentioned expression remains valid if the Green function is taken in a specific representation, where it becomes the infinite - dimensional matrix \\cite{Imai:1990zz} or if it is replaced by its Wigner transformation while ordinary products are replaced by the Moyal products \\cite{ZW2019}. Both these expressions, unfortunately, are much more complicated and might be useless for the practical calculations. Here we represent the alternative representation for the Hall conductivity of a uniform system in the presence of constant magnetic field. The Hall conductivity is expressed through the Green function taken in Harper representation, when its nonhomogeneity is attributed to the matrix structure while functional dependence is on one momentum that belongs to magnetic Brillouin zone. Our consideration for the interacting systems is non - perturbative and is based on the Schwinger - Dyson equations truncated in a reasonable way. We demonstrate that in this approximation the expression for the Hall conductivity in Harper representation remains valid, where the interacting Green function is to be used instead of the non - interacting one. We, therefore, propose that the obtained expression may be used for the topological description of fractional quantum Hall effect.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16327v1"
    ],
    "publication_venue": "Latex, 27 pages, 4 figures. arXiv admin note: text overlap with arXiv:2112.03974",
    "doi": "10.1103/PhysRevB.107.245105"
}