{
    "arxiv_id": "2303.17746",
    "paper_title": "A Hierarchical Approach to Robust Stability of Multiclass Queueing Networks",
    "authors": [
        "Feiyang Zhao",
        "Itai Gurvich",
        "John Hasenbein"
    ],
    "submission_date": "2023-03-31",
    "revised_dates": [
        "2023-12-01"
    ],
    "latest_version": 2,
    "categories": [
        "math.OC",
        "math.PR"
    ],
    "abstract": "We re-visit the global - relative to control policies - stability of multiclass queueing networks. In these, as is known, it is generally insufficient that the nominal utilization at each server is below 100%. Certain policies, although work conserving, may destabilize a network that satisfies the nominal-load conditions; additional conditions on the primitives are needed for global stability (stability under any work-conserving policy). The global-stability region was fully characterized for two-station networks in [13], but a general framework for networks with more than two stations remains elusive. In this paper, we offer progress on this front by considering a subset of non-idling control policies, namely queue-ratio (QR) policies. These include as special cases all static-priority policies. With this restriction, we are able to introduce a complete framework that applies to networks of any size. Our framework breaks the analysis of robust QR stability (stability under any QR policy) into (i) robust state-space collapse and (ii) robust stability of the Skorohod problem (SP) representing the fluid workload. Sufficient conditions for both are specified in terms of simple optimization problems. We use these optimization problems to prove that the family of QR policies satisfies a weak form of convexity relative to policies. A direct implication of this convexity is that: if the SP is stable for all static-priority policies (the \"extreme\" QR policies), then it is also stable under any QR policy. While robust QR stability is weaker than global stability, our framework recovers necessary and sufficient conditions for global stability in specific networks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17746v1",
        "http://arxiv.org/pdf/2303.17746v2"
    ],
    "publication_venue": null
}