{
    "arxiv_id": "2303.09697",
    "paper_title": "Altmetrics can capture research evidence: a study across types of studies in COVID-19 literature",
    "authors": [
        "Pilar Valderrama-Baca",
        "Wenceslao Arroyo-Machado",
        "Daniel Torres-Salinas"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "cs.DL",
        "physics.soc-ph"
    ],
    "abstract": "There has been a proliferation of descriptive for COVID-19 papers using altmetrics. The main objective of this study is to analyse whether the altmetric mentions of COVID-19 medical studies are associated with the type of study and its level of evidence. Data were collected from PubMed and Altmetric.com databases. A total of 16,672 study types (e.g., Case reports or Clinical trials) published in the year 2021 and with at least one altmetric mention were retrieved. The altmetric indicators considered were Altmetric Attention Score (AAS), News mentions, Twitter mentions, and Mendeley readers. Once the dataset had been created, the first step was to carry out a descriptive study. Then a normality hypothesis was contrasted by means of the Kolmogorov-Smirnov test, and since it was significant in all cases, the overall comparison of groups was performed using the non-parametric Kruskal-Wallis test. When this test rejected the null hypothesis, pair-by-pair comparisons were performed with the Mann-Whitney U test, and the intensity of the possible association was measured using Cramers V coefficient. The results suggest that the data do not fit a normal distribution. The Mann-Whitney U test revealed coincidences in five groups of study types, the altmetric indicator with most coincidences being news mentions and the study types with the most coincidences were the systematic reviews together with the meta-analyses, which coincided with four altmetric indicators. Likewise, between the study types and the altmetric indicators, a weak but significant association was observed through the chi-square and Cramers V. It is concluded that the positive association between altmetrics and study types in medicine could reflect the level of the pyramid of scientific evidence.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09697v1"
    ],
    "publication_venue": null,
    "doi": "10.3145/epi.2023.mar.13"
}