{
    "arxiv_id": "2303.12414",
    "paper_title": "Delay-Aware Hierarchical Federated Learning",
    "authors": [
        "Frank Po-Chen Lin",
        "Seyyedali Hosseinalipour",
        "Nicolò Michelusi",
        "Christopher Brinton"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-08-08"
    ],
    "latest_version": 3,
    "categories": [
        "cs.LG",
        "cs.DC"
    ],
    "abstract": "Federated learning has gained popularity as a means of training models distributed across the wireless edge. The paper introduces delay-aware hierarchical federated learning (DFL) to improve the efficiency of distributed machine learning (ML) model training by accounting for communication delays between edge and cloud. Different from traditional federated learning, DFL leverages multiple stochastic gradient descent iterations on device datasets within each global aggregation period and intermittently aggregates model parameters through edge servers in local subnetworks. During global synchronization, the cloud server consolidates local models with the outdated global model using a local-global combiner, thus preserving crucial elements of both, enhancing learning efficiency under the presence of delay. A set of conditions is obtained to achieve the sub-linear convergence rate of O(1/k). Based on these findings, an adaptive control algorithm is developed for DFL, implementing policies to mitigate energy consumption and communication latency while aiming for a sublinear convergence rate. Numerical evaluations show DFL's superior performance in terms of faster global model convergence, reduced resource consumption, and robustness against communication delays compared to existing FL algorithms. In summary, this proposed method offers improved efficiency and results when dealing with both convex and non-convex loss functions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12414v1",
        "http://arxiv.org/pdf/2303.12414v2",
        "http://arxiv.org/pdf/2303.12414v3"
    ],
    "publication_venue": "A condensed version of this paper was presented at IEEE Globecom 2020"
}