{
    "arxiv_id": "2303.12800",
    "paper_title": "IoT Device Identification Based on Network Communication Analysis Using Deep Learning",
    "authors": [
        "Jaidip Kotak",
        "Yuval Elovici"
    ],
    "submission_date": "2023-03-02",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cs.NI",
        "cs.AI",
        "cs.CR",
        "cs.CV",
        "cs.LG"
    ],
    "abstract": "Attack vectors for adversaries have increased in organizations because of the growing use of less secure IoT devices. The risk of attacks on an organization's network has also increased due to the bring your own device (BYOD) policy which permits employees to bring IoT devices onto the premises and attach them to the organization's network. To tackle this threat and protect their networks, organizations generally implement security policies in which only white listed IoT devices are allowed on the organization's network. To monitor compliance with such policies, it has become essential to distinguish IoT devices permitted within an organization's network from non white listed (unknown) IoT devices. In this research, deep learning is applied to network communication for the automated identification of IoT devices permitted on the network. In contrast to existing methods, the proposed approach does not require complex feature engineering of the network communication, because the 'communication behavior' of IoT devices is represented as small images which are generated from the device's network communication payload. The proposed approach is applicable for any IoT device, regardless of the protocol used for communication. As our approach relies on the network communication payload, it is also applicable for the IoT devices behind a network address translation (NAT) enabled router. In this study, we trained various classifiers on a publicly accessible dataset to identify IoT devices in different scenarios, including the identification of known and unknown IoT devices, achieving over 99% overall average detection accuracy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12800v1"
    ],
    "publication_venue": "J Ambient Intell Human Comput (2022)",
    "doi": "10.1007/s12652-022-04415-6"
}