{
    "arxiv_id": "2303.17270",
    "paper_title": "The group of reversible Turing machines: subgroups, generators and computability",
    "authors": [
        "Sebastián Barbieri",
        "Jarkko Kari",
        "Ville Salo"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "math.GR",
        "cs.DM",
        "math.DS"
    ],
    "abstract": "We study an abstract group of reversible Turing machines. In our model, each machine is interpreted as a homeomorphism over a space which represents a tape filled with symbols and a head carrying a state. These homeomorphisms can only modify the tape at a bounded distance around the head, change the state and move the head in a bounded way. We study three natural subgroups arising in this model: the group of finite-state automata, which generalizes the topological full groups studied in topological dynamics and the theory of orbit-equivalence; the group of oblivious Turing machines whose movement is independent of tape contents, which generalizes lamplighter groups and has connections to the study of universal reversible logical gates; and the group of elementary Turing machines, which are the machines which are obtained by composing finite-state automata and oblivious Turing machines. We show that both the group of oblivious Turing machines and that of elementary Turing machines are finitely generated, while the group of finite-state automata and the group of reversible Turing machines are not. We show that the group of elementary Turing machines has undecidable torsion problem. From this, we also obtain that the group of cellular automata (more generally, the automorphism group of any uncountable one-dimensional sofic subshift) contains a finitely-generated subgroup with undecidable torsion problem. We also show that the torsion problem is undecidable for the topological full group of a full $\\mathbb{Z}^d$-shift on a non-trivial alphabet if and only if $d \\geq 2$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17270v1"
    ],
    "publication_venue": "42 pages, 9 figures. arXiv admin note: text overlap with arXiv:1603.08715"
}