{
    "arxiv_id": "2303.11092",
    "paper_title": "The kinetics of the ice-water interface from ab initio machine learning simulations",
    "authors": [
        "Pablo Montero de Hijes",
        "Salvatore Romano",
        "Alexander Gorfer",
        "Christoph Dellago"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft"
    ],
    "abstract": "Molecular simulations employing empiric force fields have provided valuable knowledge about the ice growth process in the last decade. The development of novel computational techniques allows us to study this process, which requires long simulations of relatively large systems, with ab initio accuracy. In this work, we use a neural-network potential for water trained on the Revised Perdew-Burke-Ernzerhof functional to describe the kinetics of the ice-water interface. We study both ice melting and growth processes. Our results for the ice growth rate are in reasonable agreement with previous experiments and simulations. We find that the kinetics of ice melting presents a different behavior (monotonic) than that of ice growth (non-monotonic). In particular, a maximum in the ice growth rate of 6.5 Å/ns is found at 14 K of supercooling. The effect of the surface structure is explored by investigating the basal and primary and secondary prismatic facets. We use the Wilson-Frenkel relation to explain these results in terms of the mobility of molecules and the thermodynamic driving force. Moreover, we study the effect of pressure by complementing the standard isobar with simulations at negative pressure (-1000 bar) and at high pressure (2000 bar). We find that prismatic facets grow faster than the basal one, and that pressure does not play an important role when the speed of the interface is considered as a function of the difference between the melting temperature and the actual one, i.e. to the degree of either supercooling or overheating.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11092v1"
    ],
    "publication_venue": null,
    "doi": "10.1063/5.0151011"
}