{
    "arxiv_id": "2303.13338",
    "paper_title": "A helium-burning white dwarf binary as a supersoft X-ray source",
    "authors": [
        "J. Greiner",
        "C. Maitra",
        "F. Haberl",
        "R. Willer",
        "J. M. Burgess",
        "N. Langer",
        "J. Bodensteiner",
        "D. A. H. Buckley",
        "I. M. Monageng",
        "A. Udalski",
        "H. Ritter",
        "K. Werner",
        "P. Maggi",
        "R. Jayaraman",
        "R. Vanderspek"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Type Ia supernovae are cosmic distance indicators, and the main source of iron in the Universe, but their formation paths are still debated. Several dozen supersoft X-ray sources, in which a white dwarf accretes hydrogen-rich matter from a non-degenerate donor star, have been observed and suggested as Type Ia supernovae progenitors. However, observational evidence for hydrogen, which is expected to be stripped off the donor star during the supernova explosion, is lacking. Helium-accreting white dwarfs, which would circumvent this problem, have been predicted for more than 30 years, also including their appearance as supersoft X-ray sources, but have so far escaped detection. Here we report a supersoft X-ray source with an accretion disk whose optical spectrum is completely dominated by helium, suggesting that the donor star is hydrogen-free. We interpret the luminous and supersoft X-rays as due to helium burning near the surface of the accreting white dwarf. The properties of our system provides evidence for extended pathways towards Chandrasekhar mass explosions based on helium accretion, in particular for stable burning in white dwarfs at lower accretion rates than expected so far. This may allow to recover the population of the sub-energetic so-called Type Iax supernovae, up to 30% of all Type Ia supernovae, within this scenario.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13338v1"
    ],
    "publication_venue": null,
    "doi": "10.1038/s41586-023-05714-4"
}