{
    "arxiv_id": "2303.12985",
    "paper_title": "Numerical investigations on interactions between 2D/3D conical shock wave and axisymmetric boundary layer at Ma=2.2",
    "authors": [
        "Yihui Weng",
        "Qin Li",
        "Guozhuo Tan"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "Numerical simulation and analysis are carried out on interactions between a 2D/3D conical shock wave and an axisymmetric boundary layer with reference to the experiment by Kussoy et al., in which the shock was generated by a 15-deg half-angle cone in a tube at 15-deg angle of attack (AOA). Based on the RANS equations and Menter's SST turbulence model, the present study uses the newly developed WENO3-PRM211 scheme and the PHengLEI CFD platform for the computations. First, computations are performed for the 3D interaction corresponding to the conditions of the experiment by Kussoy et al., and these are then extended to cases with AOA = 10-deg and 5-deg. For comparison, 2D axisymmetric counterparts of the 3D interactions are investigated for cones coaxial with the tube and having half-cone angles of 27.35-deg, 24.81-deg, and 20.96-deg. The shock wave structure, vortex structure, variable distributions, and wall separation topology of the interaction are computed. The results show that in 2D/3D interactions, a new Mach reflection-like event occurs and a Mach stem-like structure is generated above the front of the separation bubble, which differs from the model of Babinsky for 2D planar shock wave/boundary layer interaction. A new interaction model is established to describe this behavior. The relationship between the length of the circumferentially unseparated region in the tube and the AOA of the cone indicates the existence of a critical AOA at which the length is zero, and a prediction of this angle is obtained using an empirical fit, which is verified by computation. The occurrence of side overflow in the windward meridional plane is analyzed, and a quantitative knowledge is obtained. To elucidate the characteristics of the 3D interaction, the scale and structure of the vortex and the pressure and friction force distributions are presented and compared with those of the 2D interaction.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12985v1"
    ],
    "publication_venue": null
}