{
    "arxiv_id": "2303.14053",
    "paper_title": "Revealing contributions to conduction from transport within ordered and disordered regions in highly doped conjugated polymers through analysis of temperature-dependent Hall measurements",
    "authors": [
        "William A. Wood",
        "Ian E. Jacobs",
        "Leszek J. Spalek",
        "Yuxuan Huang",
        "Chen Chen",
        "Xinglong Ren",
        "Henning Sirringhaus"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-04-04"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Hall effect measurements in doped polymer semiconductors are widely reported, but are difficult to interpret due to screening of Hall voltages by carriers undergoing incoherent transport. Here, we propose a refined analysis for such Hall measurements, based on measuring the Hall coefficient as a function of temperature, and modelling carriers as existing in a regime of variable \"deflectability\" (i.e. how strongly they \"feel\" the magnetic part of the Lorentz force). By linearly interpolating each carrier between the extremes of no deflection and full deflection, we demonstrate that it is possible to extract the (time-averaged) concentration of deflectable charge carriers, $\\left<n_d\\right>$, the average, temperature-dependent mobility of those carriers, $\\left<μ_d\\right>(T)$, as well as the ratio of conductivity that comes from such deflectable transport, $d(T)$. Our method was enabled by the construction of an improved AC Hall measurement system, as well as an improved data extraction method. We measured Hall bar devices of ion-exchange doped films of PBTTT-C$_{14}$ from 10--300 K. Our analysis provides evidence for the proportion of conductivity arising from deflectable transport, $d(T)$, increasing with doping level, ranging between 15.4% and 16.4% at room temperature. When compared to total charge-carrier-density estimates from independent methods, the values of $\\left<n_d\\right>$ extracted suggest that carriers spend $\\sim$37% of their time of flight being deflectable in the most highly doped of the devices measured here. The extracted values of $d(T)$ being less than half this value thus suggest that the limiting factor for conductivity in such highly doped devices is carrier mobility, rather than concentration.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14053v1"
    ],
    "publication_venue": "Accepted for publication in APS Physical Review Materials",
    "doi": "10.1103/PhysRevMaterials.7.034603"
}