{
    "arxiv_id": "2303.17237",
    "paper_title": "Correlation between activity indicators: H$α$ and Ca II lines in M-dwarf stars",
    "authors": [
        "R. V. Ibañez Bustos",
        "A. P. Buccino",
        "M. Flores",
        "C. F. Martinez",
        "P. J. D. Mauas"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
    ],
    "abstract": "Different approaches have been adopted to study short- and long-term stellar magnetic activity, and although the mechanisms by which low-mass stars generate large-scale magnetic fields are not well understood, it is known that stellar rotation plays a key role. There are stars that show a cyclical behaviour in their activity which can be explained by solar dynamo or $αΩ$ dynamo models. However, when studying late-type dwarf stars, it is necessary to implement other indicators to analyse their magnetic activity. In the present work, we perform a comparative study between the best-known activity indicators so far defined from the Ca II and H$α$ lines to analyse M-dwarf stars. We studied a sample of 29 M stars with different chromospheric activity levels and spectral classes ranging from dM0 to dM6. To do so, we employed 1796 wide range spectra from different instruments with a median time span of observations of 21 yr. In addition, we complemented our data with photometric observations from the TESS space mission for better stellar characterisation and short-term analysis. We obtained a good and significant correlation ($rho = 0.91$) between the indexes defined from the two lines for the whole set of stars in the sample. However, we found that there is a deviation for faster rotators (with $P_{rot} < 4$ days) and higher flare activity (at least one flare per day). There is an overall positive correlation between Ca II and H$α$ emission in dM stars, except during flare events. In particular, we found that low-energy high-frequency flares could be responsible for the deviation in the linear trend in fast-rotator M dwarfs. This implies that the rotation period could be a fundamental parameter to study the stellar activity and that the rotation could drive the magnetic dynamo in low-mass active stars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17237v1"
    ],
    "publication_venue": null,
    "doi": "10.1051/0004-6361/202245352"
}