{
    "arxiv_id": "2303.16090",
    "paper_title": "A modified projection approach to line mixing",
    "authors": [
        "Sven Nordebo"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-06-02"
    ],
    "latest_version": 2,
    "categories": [
        "physics.comp-ph",
        "physics.ao-ph",
        "physics.optics"
    ],
    "abstract": "This paper presents a simple approach to combine the high-resolution narrowband features of some desired isolated line models together with the far wing behavior of the projection based strong collision (SC) method to line mixing which was introduced by Bulanin, Dokuchaev, Tonkov and Filippov. The method can be viewed in terms of a small diagonal perturbation of the SC relaxation matrix providing the required narrowband accuracy close to the line centers at the same time as the SC line coupling transfer rates are retained and can be optimally scaled to thermalize the radiator after impact. The method can conveniently be placed in the framework of the Boltzmann-Liouville transport equation where a rigorous diagonalization of the line mixing problem requires that molecular phase and velocity changes are assumed to be uncorrelated. A detailed analysis for the general Doppler case is given based on the first order Rosenkranz approximation, and which also provides the possibility to incorporate quadratically speed dependent parameters. Exact solutions for pure pressure broadening and explicit Rosenkranz approximations are given in the case with velocity independent parameters (line frequency, strength, width and shift) which can readily be retrieved from databases such as HITRAN for a large number of species. Numerical examples including comparisons to published measured data are provided in two specific cases concerning the absorption of carbon dioxide in its infrared band of asymmetric stretching, as well as of atmospheric water vapor and oxygen in relevant millimeter bands.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16090v1",
        "http://arxiv.org/pdf/2303.16090v2"
    ],
    "publication_venue": null
}