{
    "arxiv_id": "2303.13934",
    "paper_title": "Reversible spin-optical interface in luminescent organic radicals",
    "authors": [
        "Sebastian Gorgon",
        "Kuo Lv",
        "Jeannine Grüne",
        "Bluebell H. Drummond",
        "William K. Myers",
        "Giacomo Londi",
        "Gaetano Ricci",
        "Danillo Valverde",
        "Claire Tonnelé",
        "Petri Murto",
        "Alexander S. Romanov",
        "David Casanova",
        "Vladimir Dyakonov",
        "Andreas Sperlich",
        "David Beljonne",
        "Yoann Olivier",
        "Feng Li",
        "Richard H. Friend",
        "Emrys W. Evans"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-08-17"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.chem-ph"
    ],
    "abstract": "Molecules present a versatile platform for quantum information science, and are candidates for sensing and computation applications. Robust spin-optical interfaces are key to harnessing the quantum resources of materials. To date, carbon-based candidates have been non-luminescent, which prevents optical read-out. Here we report the first organic molecules displaying both efficient luminescence and near-unity generation yield of high-spin multiplicity excited states. This is achieved by designing an energy resonance between emissive doublet and triplet levels, here on covalently coupled tris(2,4,6-trichlorophenyl) methyl-carbazole radicals (TTM-1Cz) and anthracene. We observe the doublet photoexcitation delocalise onto the linked acene within a few picoseconds and subsequently evolve to a pure high spin state (quartet for monoradicals, quintet for biradical) of mixed radical-triplet character near 1.8 eV. These high-spin states are coherently addressable with microwaves even at 295 K, with optical read-out enabled by intersystem crossing to emissive states. Furthermore, for the biradical, on return to the ground state the previously uncorrelated radical spins either side of the anthracene show strong spin correlation. Our approach simultaneously supports a high efficiency of initialisation, spin manipulations and light-based read-out at room temperature. The integration of luminescence and high-spin states creates an organic materials platform for emerging quantum technologies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13934v1"
    ],
    "publication_venue": null,
    "doi": "10.1038/s41586-023-06222-1"
}