{
    "arxiv_id": "2303.12192",
    "paper_title": "Observational Evidence of S-Web Source of the Slow Solar Wind",
    "authors": [
        "D. Baker",
        "P. Demoulin",
        "S. L. Yardley",
        "T. Mihailescu",
        "L. van Driel-Gesztelyi",
        "R. D'Amicis",
        "D. M. Long",
        "A. S. H. To",
        "C. J. Owen",
        "T. S. Horbury",
        "D. H. Brooks",
        "D. Perrone",
        "R. J. French",
        "A. W. James",
        "M. Janvier",
        "S. Matthews",
        "M. Stangalini",
        "G. Valori",
        "P. Smith",
        "R. Anzar Cuadrado",
        "H. Peter",
        "U. Schuehle",
        "L. Harra",
        "K. Barczynski",
        "D. Berghmans",
        "A. N. Zhukov",
        "L. Rodriguez",
        "C. Verbeeck"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "From 2022 March 18-21, active region (AR) 12967 was tracked simultaneously by Solar Orbiter (SO) at 0.35 au and Hinode/EIS at Earth. During this period, strong blue-shifted plasma upflows were observed along a thin, dark corridor of open field originating at the AR's leading polarity and continuing towards the southern extension of the northern polar coronal hole. A potential field source surface (PFSS) model shows large lateral expansion of the open magnetic field along the corridor. Squashing factor Q-maps of the large scale topology further confirm super-radial expansion in support of the S-Web theory for the slow wind. The thin corridor of upflows is identified as the source region of a slow solar wind stream characterised by approx. 300 km s-1 velocities, low proton temperatures of approx. 5 eV, extremely high density over 100 cm-3, and a short interval of moderate Alfvenicity accompanied by switchback events. When connectivity changes from the corridor to the eastern side of the AR, the in situ plasma parameters of the slow wind indicate a distinctly different source region. These observations provide strong evidence that the narrow open field corridors, forming part of the S-Web, produce extreme properties in their associated solar wind streams.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12192v1"
    ],
    "publication_venue": "Accepted ApJ",
    "doi": "10.3847/1538-4357/acc653"
}