{
    "arxiv_id": "2303.15297",
    "paper_title": "On the use of Lagrange Multiplier State-Space Substructuring in dynamic substructuring analysis",
    "authors": [
        "Rafael Da Silva Oliveira Dias",
        "Milena Martarelli",
        "Paolo Chiariotti"
    ],
    "submission_date": "2023-02-06",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY"
    ],
    "abstract": "In this article, the formulation of Lagrange Multiplier State-Space Substructuring (LM-SSS) is presented and extended to directly compute coupled displacement and velocity state-space models. The LM-SSS method is applied to couple and decouple state-space models established in the modal domain. Moreover, it is used together with tailored postprocessing procedures to eliminate the redundant states originated from the coupling and decoupling operations. This specific formulation of the LM-SSS approach made it possible to develop a tailored coupling form, named Unconstrained Coupling Form (UCF). UCF just requires the computation of a nullspace and does not rely on the selection of a subspace from a nullspace. By exploiting a numerical example, LM-SSS was compared with the Lagrange Multiplier Frequency Based Substructuring (LMFBS) approach, which is currently widely recognized as a reference approach. This was done both in terms of: a)coupled FRFs derived by coupling the state-space models of two substructures and b) decoupled FRFs derived by decoupling the state-space model of a component from the coupled model. LM-SSS showed to be suitable to compute minimal order coupled models and UCF turned out to have similar performance as other coupling forms already presented to the scientific community. As for the decoupling task, the FRFs derived from the LM-SSS approach perfectly matched those obtained by LM-FBS. Moreover, it was also demonstrated that the elimination of the redundant states originated from the decoupling operation was correctly performed. The approaches discussed were exploited on an experimental substructuring application. LM-SSS resulted to be a reliable SSS technique to perform coupling and decoupling operations with state-space models estimated from measured FRFs as well as to provide accurate minimal-order models.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15297v1"
    ],
    "publication_venue": null,
    "doi": "10.1016/j.ymssp.2022.109419"
}