{
    "arxiv_id": "2303.11094",
    "paper_title": "Does gravitational confinement sustain flat galactic rotation curves without dark matter?",
    "authors": [
        "W. E. V. Barker",
        "M. P. Hobson",
        "A. N. Lasenby"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc",
        "astro-ph.GA"
    ],
    "abstract": "The short answer is $\\textit{probably no}$. Specifically, this paper considers a recent body of work which suggests that general relativity requires neither the support of dark matter halos, nor unconventional baryonic profiles, nor any infrared modification, to be consistent after all with the anomalously rapid orbits observed in many galactic discs. In particular, the gravitoelectric flux is alleged to collapse nonlinearly into regions of enhanced force, in an analogue of the colour-confining chromoelectric flux tube model which has yet to be captured by conventional post-Newtonian methods. However, we show that the scalar gravity model underpinning this proposal is wholly inconsistent with the nonlinear Einstein equations, which themselves appear to prohibit the linear confinement-type potentials which could indicate a disordered gravitational phase. Our findings challenge the fidelity of the previous Euclidean lattice analyses. We confirm by direct calculation using a number of perturbation schemes and gauges that the next-to-leading order gravitoelectric correction to the rotation curve of a reasonable baryonic profile would be imperceptible. The `gravitoelectric flux collapse' programme was also supported by using intragalactic lensing near a specific galactic baryon profile as a field strength heuristic. We recalculate this lensing effect, and conclude that it has been overstated by three orders of magnitude. As a by-product, our analysis suggests fresh approaches to (i) the fluid ball conjecture and (ii) gravitational energy localisation, both to be pursued in future work. In summary, whilst it may be interesting to consider the possibility of confinement-type effects in gravity, we may at least conclude here that confinement-type effects $\\textit{cannot play any significant part}$ in explaining flat or rising galactic rotation curves without dark matter halos.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11094v1"
    ],
    "publication_venue": "33 pages, 19 figures"
}