{
    "arxiv_id": "2303.10693",
    "paper_title": "Dark siren cosmology with binary black holes in the era of third-generation gravitational wave detectors",
    "authors": [
        "Niccolò Muttoni",
        "Danny Laghi",
        "Nicola Tamanini",
        "Sylvain Marsat",
        "David Izquierdo-Villalba"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "gr-qc"
    ],
    "abstract": "Third-generation (3G) gravitational wave detectors, in particular Einstein Telescope (ET) and Cosmic Explorer (CE), will explore unprecedented cosmic volumes in search for compact binary mergers, providing us with tens of thousands of detections per year. In this study, we simulate and employ binary black holes detected by 3G interferometers as dark sirens, to extract and infer cosmological parameters by cross-matching gravitational wave data with electromagnetic information retrieved from a simulated galaxy catalog. Considering a standard $Λ$CDM model, we apply a suitable Bayesian framework to obtain joint posterior distributions for the Hubble constant $H_0$ and the matter energy density parameter $Ω_m$ in different scenarios. Assuming a galaxy catalog complete up to $z=1$ and dark sirens detected with a network signal-to-noise ratio greater than 300, we show that a network made of ET and two CEs can constrain $H_0$ ($Ω_m$) to a promising $0.7\\%$ ($9.0\\%$) at $90\\%$ confidence interval within one year of continuous observations. Additionally, we find that most of the information on $H_0$ is contained in local, single-host dark sirens, and that dark sirens at $z>1$ do not substantially improve these estimates. Our results imply that a sub-percent measure of $H_0$ can confidently be attained by a network of 3G detectors, highlighting the need for characterising all systematic effects to a higher accuracy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10693v1"
    ],
    "publication_venue": "22 pages, 7 figures. Submitted to PRD"
}