{
    "arxiv_id": "2303.10185",
    "paper_title": "SPT-CL J2215-3537: A Massive Starburst at the Center of the Most Distant Relaxed Galaxy Cluster",
    "authors": [
        "Michael S. Calzadilla",
        "Lindsey E. Bleem",
        "Michael McDonald",
        "Michael D. Gladders",
        "Adam B. Mantz",
        "Steven W. Allen",
        "Matthew B. Bayliss",
        "Anna-Christina Eilers",
        "Benjamin Floyd",
        "Julie Hlavacek-Larrondo",
        "Gourav Khullar",
        "Keunho J. Kim",
        "Guillaume Mahler",
        "Keren Sharon",
        "Taweewat Somboonpanyakul",
        "Brian Stalder",
        "Antony A. Stark"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-04-26"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
    ],
    "abstract": "We present the discovery of the most distant, dynamically relaxed cool core cluster, SPT-CL J2215-3537 (SPT2215) and its central brightest cluster galaxy (BCG) at z=1.16. Using new X-ray observations, we demonstrate that SPT2215 harbors a strong cool core, with a central cooling time of 200 Myr (at 10 kpc) and a maximal intracluster medium cooling rate of 1900+/-400 Msun/yr. This prodigious cooling may be responsible for fueling extended, star-forming filaments observed in Hubble Space Telescope imaging. Based on new spectrophotometric data, we detect bright [O II] emission in the BCG, implying an unobscured star formation rate (SFR) of 320^{+230}_{-140} Msun/yr. The detection of a weak radio source (2.0+/-0.8 mJy at 0.8 GHz) suggests ongoing feedback from an active galactic nucleus (AGN), though the implied jet power is less than half the cooling luminosity of the hot gas, consistent with cooling overpowering heating. The extreme cooling and SFR of SPT2215 is rare among known cool core clusters, and it is even more remarkable that we observe these at such high redshift, when most clusters are still dynamically disturbed. The high mass of this cluster, coupled with the fact that it is dynamically relaxed with a highly-isolated BCG, suggests that it is an exceptionally rare system that must have formed very rapidly in the early Universe. Combined with the high SFR, SPT2215 may be a high-z analog of the Phoenix cluster, potentially providing insight into the limits of AGN feedback and star formation in the most massive galaxies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10185v1"
    ],
    "publication_venue": "14 pages, 5 figures, 1 table. Accepted in ApJ",
    "doi": "10.3847/1538-4357/acc6c2"
}