{
    "arxiv_id": "2303.08198",
    "paper_title": "Dynamical Masses and Ages of Sirius-like Systems",
    "authors": [
        "Hengyue Zhang",
        "Timothy D. Brandt",
        "Rocio Kiman",
        "Alexander Venner",
        "Qier An",
        "Minghan Chen",
        "Yiting Li"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "We measure precise orbits and dynamical masses and derive age constraints for six confirmed and one candidate Sirius-like systems, including the Hyades member HD 27483. Our orbital analysis incorporates radial velocities, relative astrometry, and Hipparcos-Gaia astrometric accelerations. We constrain the main-sequence lifetime of a white dwarf's progenitor from the remnant's dynamical mass and semi-empirical initial-final mass relations and infer the cooling age from mass and effective temperature. We present new relative astrometry of HD 27483 B from Keck/NIRC2 observations and archival HST data, and obtain the first dynamical mass of ${0.798}_{-0.041}^{+0.10}$ $M_{\\odot}$, and an age of ${450}_{-180}^{+570}$ Myr, consistent with previous age estimates of Hyades. We also measure precise dynamical masses for HD 114174 B ($0.591 \\pm 0.011$ $M_{\\odot}$) and HD 169889 B (${0.526}_{-0.037}^{+0.039}$ $M_{\\odot}$), but their age precisions are limited by their uncertain temperatures. For HD 27786 B, the unusually small mass of $0.443 \\pm 0.012$ $M_{\\odot}$ suggests a history of rapid mass loss, possibly due to binary interaction in its progenitor's AGB phase. The orbits of HD 118475 and HD 136138 from our RV fitting are overall in good agreement with Gaia DR3 astrometric two-body solutions, despite moderate differences in the eccentricity and period of HD 136138. The mass of ${0.580}_{-0.039}^{+0.052}$ $M_{\\odot}$ for HD 118475 B and a speckle imaging non-detection confirms that the companion is a white dwarf. Our analysis shows examples of a rich number of precise WD dynamical mass measurements enabled by Gaia DR3 and later releases, which will improve empirical calibrations of the white dwarf initial-final mass relation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08198v1",
        "http://arxiv.org/pdf/2303.08198v2"
    ],
    "publication_venue": "21 pages, 7 figures. Submitted to MNRAS",
    "doi": "10.1093/mnras/stad1849"
}