{
    "arxiv_id": "2303.11670",
    "paper_title": "Asymmetric distribution of data products from WALLABY, an SKA precursor neutral hydrogen survey",
    "authors": [
        "Manuel Parra-Royon",
        "Austin Shen",
        "Tristan Reynolds",
        "Parthasarathy Venkataraman",
        "María Angeles Mendoza",
        "Susana Sánchez-Exposito",
        "Julian Garrido",
        "Slava Kitaeff",
        "Lourdes Verdes-Montenegro"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM",
        "cs.DB",
        "cs.DC"
    ],
    "abstract": "The Widefield ASKAP L-band Legacy All-sky Blind surveY (WALLABY) is a neutral hydrogen survey (HI) that is running on the Australian SKA Pathfinder (ASKAP), a precursor telescope for the Square Kilometre Array (SKA). The goal of WALLABY is to use ASKAP's powerful wide-field phased array feed technology to observe three quarters of the entire sky at the 21 cm neutral hydrogen line with an angular resolution of 30 arcseconds. Post-processing activities at the Australian SKA Regional Centre (AusSRC), Canadian Initiative for Radio Astronomy Data Analysis (CIRADA) and Spanish SKA Regional Centre prototype (SPSRC) will then produce publicly available advanced data products in the form of source catalogues, kinematic models and image cutouts, respectively. These advanced data products will be generated locally at each site and distributed across the network. Over the course of the full survey we expect to replicate data up to 10 MB per source detection, which could imply an ingestion of tens of GB to be consolidated in the other locations near real time. Here, we explore the use of an asymmetric database replication model and strategy, using PostgreSQL as the engine and Bucardo as the asynchronous replication service to enable robust multi-source pools operations with data products from WALLABY. This work would serve to evaluate this type of data distribution solution across globally distributed sites. Furthermore, a set of benchmarks have been developed to confirm that the deployed model is sufficient for future scalability and remote collaboration needs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11670v1"
    ],
    "publication_venue": null
}