{
    "arxiv_id": "2303.10187",
    "paper_title": "Modelling stellar evolution in mass-transferring binaries and gravitational-wave progenitors with METISSE",
    "authors": [
        "Poojan Agrawal",
        "Jarrod Hurley",
        "Simon Stevenson",
        "Carl L. Rodriguez",
        "Dorottya Szecsi",
        "Alex Kemp"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Massive binaries are vital sources of various transient processes, including gravitational-wave mergers. However, large uncertainties in the evolution of massive stars, both physical and numerical, present a major challenge to the understanding of their binary evolution. In this paper, we upgrade our interpolation-based stellar evolution code METISSE to include the effects of mass changes, such as binary mass transfer or wind-driven mass loss, not already included within the input stellar tracks. METISSE's implementation of mass loss (applied to tracks without mass loss) shows excellent agreement with the SSE fitting formulae and with detailed MESA tracks, except in cases where the mass transfer is too rapid for the star to maintain equilibrium. We use this updated version of METISSE within the binary population synthesis code BSE to demonstrate the impact of varying stellar evolution parameters, particularly core overshooting, on the evolution of a massive (25M$_\\odot$ and 15M$_\\odot$) binary system with an orbital period of 1800 days. Depending on the input tracks, we find that the binary system can form a binary black hole or a black hole-neutron star system, with primary(secondary) remnant masses ranging between 4.47(1.36)M$_\\odot$ and 12.30(10.89)M$_\\odot$, and orbital periods ranging from 6 days to the binary becoming unbound. Extending this analysis to a population of isolated binaries uniformly distributed in mass and orbital period, we show that the input stellar models play an important role in determining which regions of the binary parameter space can produce compact binary mergers, paving the way for current and future gravitational-wave progenitor predictions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10187v1"
    ],
    "publication_venue": "19 pages, 14 figures, submitted to MNRAS. Comments welcomed"
}