{
    "arxiv_id": "2303.16490",
    "paper_title": "Quantum algorithm for collisionless Boltzmann simulation of self-gravitating systems",
    "authors": [
        "Soichiro Yamazaki",
        "Fumio Uchida",
        "Kotaro Fujisawa",
        "Koichi Miyamoto",
        "Naoki Yoshida"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2024-05-24"
    ],
    "latest_version": 2,
    "categories": [
        "quant-ph",
        "astro-ph.CO",
        "physics.comp-ph",
        "physics.plasm-ph"
    ],
    "abstract": "The collisionless Boltzmann equation (CBE) is a fundamental equation that governs the dynamics of a broad range of astrophysical systems from space plasma to star clusters and galaxies. It is computationally expensive to integrate the CBE directly in a multi-dimensional phase space, and thus the applications to realistic astrophysical problems have been limited so far. Recently, Todorova & Steijl (2020) proposed an efficient quantum algorithm to solve the CBE with significantly reduced computational complexity. We extend the algorithm to perform quantum simulations of self-gravitating systems, incorporating the method to calculate gravity with the major Fourier modes of the density distribution extracted from the solution-encoding quantum state. Our method improves the dependency of time and space complexities on Nv , the number of grid points in each velocity coordinate, compared to the classical simulation methods. We then conduct some numerical demonstrations of our method. We first run a 1+1 dimensional test calculation of free streaming motion on 64*64 grids using 13 simulated qubits and validate our method. We then perform simulations of Jeans collapse, and compare the result with analytic and linear theory calculations. It will thus allow us to perform large-scale CBE simulations on future quantum computers.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16490v1",
        "http://arxiv.org/pdf/2303.16490v2"
    ],
    "publication_venue": "12 pages, 10 figures"
}