{
    "arxiv_id": "2303.17714",
    "paper_title": "The Error Reconstruction and Compiled Calibration of Quantum Computing Cycles",
    "authors": [
        "Arnaud Carignan-Dugas",
        "Dar Dahlen",
        "Ian Hincks",
        "Egor Ospadov",
        "Stefanie J. Beale",
        "Samuele Ferracin",
        "Joshua Skanes-Norman",
        "Joseph Emerson",
        "Joel J. Wallman"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Quantum computers are inhibited by physical errors that occur during computation. For this reason, the development of increasingly sophisticated error characterization and error suppression techniques is central to the progress of quantum computing. Error distributions are considerably influenced by the precise gate scheduling across the entire quantum processing unit. To account for this holistic feature, we may ascribe each error profile to a (clock) cycle, which is a scheduled list of instructions over an arbitrarily large fraction of the chip. A celebrated technique known as randomized compiling introduces some randomness within cycles' instructions, which yields effective cycles with simpler, stochastic error profiles. In the present work, we leverage the structure of cycle benchmarking (CB) circuits as well as known Pauli channel estimation techniques to derive a method, which we refer to as cycle error reconstruction (CER), to estimate with multiplicative precision the marginal error distribution associated with any effective cycle of interest. The CER protocol is designed to scale for an arbitrarily large number of qubits. Furthermore, we develop a fast compilation-based calibration method, referred to as stochastic calibration (SC), to identify and suppress local coherent error sources occurring in any effective cycle of interest. We performed both protocols on IBM-Q 5-qubit devices. Via our calibration scheme, we obtained up to a 5-fold improvement of the circuit performance.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17714v1"
    ],
    "publication_venue": "35 pages, 9 figures"
}