{
    "arxiv_id": "2303.13984",
    "paper_title": "Monitoring biodiversity loss in rapidly changing Afrotropical ecosystems: An emerging imperative for governance and research",
    "authors": [
        "Alfred O. Achieng",
        "George B. Arhonditsis",
        "Nicholas E. Mandrack",
        "Catherine M. Febria",
        "Bernard Opaa",
        "Tracey J. Coffey",
        "Ken Irvine",
        "Frank O. Masese",
        "Zeph M. Ajode",
        "James E. Barasa",
        "Kevin Obiero",
        "Boaz Kaunda-Arara"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-06-01"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.OT"
    ],
    "abstract": "Africa is experiencing extensive biodiversity loss due to rapid changes in the environment, where natural resources constitute the main instrument for socioeconomic development and a mainstay source of livelihoods for an increasing population. Lack of data and information deficiency on biodiversity, but also budget constraints and insufficient financial and technical capacity, impede sound policy design and effective implementation of conservation and management measures. The problem is further exacerbated by the lack of harmonized indicators and databases to assess conservation needs and monitor biodiversity losses. We review challenges with biodiversity data (availability, quality, usability, and database access) as a key limiting factor that impact funding and governance. We also evaluate the drivers of both ecosystems change and biodiversity loss as a central piece of knowledge to develop and implement effective policies. While the continent focuses more on the latter, we argue that the two are complementary in shaping restoration and management solutions. We thus underscore the importance of establishing monitoring programs focusing on biodiversity-ecosystem linkages in order to inform evidence-based decisions in ecosystem conservation and restoration in Africa.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13984v1"
    ],
    "publication_venue": "12 pages, 2 figures and 1 Table and a supplementary table. Accepted for publication in a special issue with Philosophical Transactions of the Royal Society B 2023",
    "doi": "10.1098/rstb.2022.0271"
}