{
    "arxiv_id": "2303.12318",
    "paper_title": "Thermofield theory for finite-temperature electronic structure",
    "authors": [
        "Gaurav Harsha",
        "Thomas M. Henderson",
        "Gustavo E. Scuseria"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el",
        "physics.chem-ph"
    ],
    "abstract": "Wave-function methods have offered a robust, systematically improvable means to study ground-state properties in quantum many-body systems. Theories like coupled cluster and their derivatives provide highly accurate approximations to the energy landscape at a reasonable computational cost. Analogs of such methods to study thermal properties, though highly desirable, have been lacking because evaluating thermal properties involve a trace over the entire Hilbert space, which is a formidable task. Besides, excited-state theories are generally not as well studied as ground-state ones. In this mini-review, we present an overview of a finite-temperature wave function formalism based on thermofield dynamics to overcome these difficulties. Thermofield dynamics allows us to map the equilibrium thermal density matrix to a pure state, i.e., a single wave function, albeit in an expanded Hilbert space. Ensemble averages become expectation values over this so-called thermal state. Around this thermal state, we have developed a procedure to generalize ground-state wave function theories to finite temperatures. As explicit examples, we highlight formulations of mean-field, configuration interaction, and coupled cluster theories for thermal properties of fermions in the grand-canonical ensemble. To assess the quality of these approximations, we also show benchmark studies for the one-dimensional Hubbard model, while comparing against exact results. We will see that the thermal methods perform similarly to their ground-state counterparts, while merely adding a pre-factor to the asymptotic computational cost. They also inherit all the properties, good or bad, from the ground-state methods, signifying the robustness of our formalism and the scope for future development.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12318v1"
    ],
    "publication_venue": "10 pages, 5 figures, mini-review",
    "doi": "10.1021/acs.jpca.2c08418"
}