{
    "arxiv_id": "2303.08030",
    "paper_title": "Improving information retrieval through correspondence analysis instead of latent semantic analysis",
    "authors": [
        "Qianqian Qi",
        "David J. Hessen",
        "Peter G. M. van der Heijden"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-09-15"
    ],
    "latest_version": 1,
    "categories": [
        "cs.IR"
    ],
    "abstract": "Both latent semantic analysis (LSA) and correspondence analysis (CA) are dimensionality reduction techniques that use singular value decomposition (SVD) for information retrieval. Theoretically, the results of LSA display both the association between documents and terms, and marginal effects; in comparison, CA only focuses on the associations between documents and terms. Marginal effects are usually not relevant for information retrieval, and therefore, from a theoretical perspective CA is more suitable for information retrieval.\n  In this paper, we empirically compare LSA and CA. The elements of the raw document-term matrix are weighted, and the weighting exponent of singular values is adjusted to improve the performance of LSA. We explore whether these two weightings also improve the performance of CA. In addition, we compare the optimal singular value weighting exponents for LSA and CA to identify what the initial dimensions in LSA correspond to.\n  The results for four empirical datasets show that CA always performs better than LSA. Weighting the elements of the raw data matrix can improve CA; however, it is data dependent and the improvement is small. Adjusting the singular value weighting exponent usually improves the performance of CA; however, the extent of the improved performance depends on the dataset and number of dimensions. In general, CA needs a larger singular value weighting exponent than LSA to obtain the optimal performance. This indicates that CA emphasizes initial dimensions more than LSA, and thus, margins play an important role in the initial dimensions in LSA.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08030v1"
    ],
    "publication_venue": null,
    "doi": "10.1007/s10844-023-00815-y"
}