{
    "arxiv_id": "2303.14447",
    "paper_title": "Foreign participation in federal biddings: A quantitative approach using the procurement panel",
    "authors": [
        "Carlos Ferreira"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "econ.GN"
    ],
    "abstract": "The bidding is the Public Administration's administrative process and other designated persons by law to select the best proposal, through objective and impersonal criteria, for contracting services and purchasing goods. In times of globalization, it is common for companies seeking to expand their business by participating in biddings. Brazilian legislation allows the participation of foreign suppliers in bids held in the country. Through a quantitative approach, this article discusses the weight of foreign suppliers' involvement in federal bidding between 2011 and 2018. To this end, a literature review was conducted on public procurement and international biddings. Besides, an extensive data search was achieved through the Federal Government Procurement Panel. The results showed that between 2011 and 2018, more than R\\$ 422.6 billion was confirmed in public procurement processes, and of this total, about R\\$ 28.9 billion was confirmed to foreign suppliers. The Ministry of Health accounted for approximately 88.67% of these confirmations. The Invitation, Competition and International Competition modalities accounted for 0.83% of the amounts confirmed to foreign suppliers. Impossible Bidding, Waived Bidding, and Reverse Auction modalities accounted for 99.17% of the confirmed quantities to foreign suppliers. Based on the discussion of the results and the limitations found, some directions for further studies and measures to increase public resources expenditures' effectiveness and efficiency are suggested.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14447v1"
    ],
    "publication_venue": "12 pages, 7 figures, 2 tables",
    "doi": "10.21874/rsp.v72.i4.4628"
}