{
    "arxiv_id": "2303.15914",
    "paper_title": "Characterization of harmonic modes and parasitic resonances in multi-mode superconducting coplanar resonators",
    "authors": [
        "Cenk Beydeda",
        "Konstantin Nikolaou",
        "Marius Tochtermann",
        "Nikolaj G. Ebensperger",
        "Gabriele Untereiner",
        "Ahmed Farag",
        "Philipp Karl",
        "Monika Ubl",
        "Harald Giessen",
        "Martin Dressel",
        "Marc Scheffler"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-11-27"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con"
    ],
    "abstract": "Planar superconducting microwave transmission line resonators can be operated at multiple harmonic resonance frequencies. This allows covering wide spectral regimes with high sensitivity, as it is desired e.g. for cryogenic microwave spectroscopy. A common complication of such experiments is the presence of undesired 'spurious' additional resonances, which are due to standing waves within the resonator substrate or housing box. Identifying the nature of individual resonances ('designed' vs. 'spurious') can become challenging for higher frequencies or if elements with unknown material properties are included, as is common for microwave spectroscopy. Here we discuss various experimental strategies to distinguish designed and spurious modes in coplanar superconducting resonators that are operated in a broad frequency range up to 20 GHz. These strategies include tracking resonance evolution as a function of temperature, magnetic field, and microwave power. We also demonstrate that local modification of the resonator, by applying minute amounts of dielectric or ESR-active materials, lead to characteristic signatures in the various resonance modes, depending on the local strength of the electric or magnetic microwave fields.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15914v1"
    ],
    "publication_venue": null,
    "doi": "10.1063/5.0152461"
}