{
    "arxiv_id": "2303.12009",
    "paper_title": "Hasselmann's Program and Beyond: New Theoretical Tools for Understanding the Climate Crisis",
    "authors": [
        "Valerio Lucarini",
        "Mickaël Chekroun"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-07-28"
    ],
    "latest_version": 2,
    "categories": [
        "physics.ao-ph",
        "cond-mat.stat-mech",
        "nlin.CD",
        "physics.geo-ph",
        "physics.soc-ph"
    ],
    "abstract": "Klaus Hasselmann's revolutionary intuition in climate science was to take advantage of the stochasticity associated with fast weather processes to probe the slow dynamics of the climate system. This has led to fundamentally new ways to study the response of climate models to perturbations, and to perform detection and attribution for climate change signals. Hasselmann's program has been extremely influential in climate science and beyond. We first summarise the main aspects of such a program using modern concepts and tools of statistical physics and applied mathematics. We then provide an overview of some promising scientific perspectives that might better clarify the science behind the climate crisis and that stem from Hasselmann's ideas. We show how to perform rigorous model reduction by constructing parametrizations in systems that do not necessarily feature a time-scale separation between unresolved and resolved processes. We propose a general framework for explaining the relationship between climate variability and climate change, and for performing climate change projections. This leads us seamlessly to explain some key general aspects of climatic tipping points. Finally, we show that response theory provides a solid framework supporting optimal fingerprinting methods for detection and attribution.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12009v1",
        "http://arxiv.org/pdf/2303.12009v2"
    ],
    "publication_venue": "16 pages, 5 figures; final accepted version"
}