{
    "arxiv_id": "2303.08750",
    "paper_title": "Simulating image coaddition with the Nancy Grace Roman Space Telescope: II. Analysis of the simulated images and implications for weak lensing",
    "authors": [
        "Masaya Yamamoto",
        "Katherine Laliotis",
        "Emily Macbeth",
        "Tianqing Zhang",
        "Christopher M. Hirata",
        "M. A. Troxel",
        "Ami Choi",
        "Jahmour Givans",
        "Katrin Heitmann",
        "Mustapha Ishak",
        "Mike Jarvis",
        "Eve Kovacs",
        "Heyang Long",
        "Rachel Mandelbaum",
        "Andy Park",
        "Anna Porredon",
        "Christopher W. Walter",
        "W. Michael Wood-Vasey"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
    ],
    "abstract": "One challenge for applying current weak lensing analysis tools to the Nancy Grace Roman Space Telescope is that individual images will be undersampled. Our companion paper presented an initial application of Imcom - an algorithm that builds an optimal mapping from input to output pixels to reconstruct a fully sampled combined image - on the Roman image simulations. In this paper, we measure the output noise power spectra, identify the sources of the major features in the power spectra, and show that simple analytic models that ignore sampling effects underestimate the power spectra of the coadded noise images. We compute the moments of both idealized injected stars and fully simulated stars in the coadded images, and their 1- and 2-point statistics. We show that the idealized injected stars have root-mean-square ellipticity errors (1 - 6) x 10-4 per component depending on the band; the correlation functions are >= 2 orders of magnitude below requirements, indicating that the image combination step itself is using a small fraction of the overall Roman 2nd moment error budget, although the 4th moments are larger and warrant further investigation. The stars in the simulated sky images, which include blending and chromaticity effects, have correlation functions near the requirement level (and below the requirement level in a wide-band image constructed by stacking all 4 filters). We evaluate the noise-induced biases in the ellipticities of injected stars, and explain the resulting trends with an analytical model. We conclude by enumerating the next steps in developing an image coaddition pipeline for Roman.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08750v1"
    ],
    "publication_venue": "25 pages, 20 figures. To be submitted to MNRAS"
}