{
    "arxiv_id": "2303.17788",
    "paper_title": "Exploratory analysis of injury severity under different levels of driving automation (SAE Level 2-5) using multi-source data",
    "authors": [
        "Shengxuan Ding",
        "Mohamed Abdel-Aty",
        "Dongdong Wang",
        "Natalia Barbour",
        "Zijin Wang",
        "Ou Zheng"
    ],
    "submission_date": "2023-03-31",
    "revised_dates": [
        "2023-07-06"
    ],
    "latest_version": 6,
    "categories": [
        "stat.AP",
        "stat.OT"
    ],
    "abstract": "Vehicles equipped with automated driving capabilities have shown the potential to improve safety and operations. Advanced driver assistance systems (ADAS) and automated driving systems (ADS) have been widely developed to support vehicular automation. Although the studies on the injury severity outcomes that involve automated driving systems are ongoing, there is limited research investigating the difference between injury severity outcomes of the ADAS and ADS vehicles using real-world crash data. To ensure comprehensive analysis, a multi-source dataset that includes the NHTSA crash database (752 cases), CA DMV crash reports (498 cases), and news outlet data (30 cases) is used. Two random parameters multinomial logit models with heterogeneity in the means and variances are estimated to gain a better understanding of the variables impacting the crash injury severity outcome for the ADAS (SAE Level 2) and ADS (SAE Levels 3-5) vehicles. We found that while 56 percent of crashes involving ADAS vehicles took place on a highway, 84 percent of crashes involving ADS took place in more urban settings. The model estimation results indicate that the weather indicators, traffic incident or work zone indicator, differences in the system sophistication that are captured by both manufacture year and high or low mileage, type of collision, as well as rear and front impact indicators all play a significant role in the crash injury severity. The results offer an exploratory assessment of the safety performance of the ADAS and ADS equipped vehicles in the real-world environment and can be used by the manufacturers and other stakeholder to dictate the direction of their deployment and usage.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17788v1",
        "http://arxiv.org/pdf/2303.17788v2",
        "http://arxiv.org/pdf/2303.17788v3",
        "http://arxiv.org/pdf/2303.17788v4",
        "http://arxiv.org/pdf/2303.17788v5",
        "http://arxiv.org/pdf/2303.17788v6"
    ],
    "publication_venue": null
}