{
    "arxiv_id": "2303.15607",
    "paper_title": "On Secular Gravitational Instability in Vertically Stratified Disks",
    "authors": [
        "Ryosuke T. Tominaga",
        "Shu-ichiro Inutsuka",
        "Sanemichi Z. Takahashi"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
    ],
    "abstract": "Secular gravitational instability (GI) is one promising mechanism for explaining planetesimal formation. The previous studies on secular GI utilized a razor-thin disk model and derived the growth condition in terms of the vertically integrated physical values such as dust-to-gas surface density ratio. However, in weakly turbulent disks where secular GI can operate, a dust disk can be orders of magnitude thinner than a gas disk, and analyses treating the vertical structures are necessary to clarify the interplay of the midplane dust motion and the upper gas motion. In this work, we perform vertically global linear analyses of secular GI with the vertical domain size of a few gas scale heights. We find that dust grains accumulate radially around the midplane while gas circulates over the whole vertical region. We obtain well-converged growth rates when the outer gas boundary is above two gas scale heights. The growth rates are underestimated if we assume the upper gas to be steady and regard it just as the source of external pressure to the dusty lower layer. Therefore, treating the upper gas motion is important even when the dust disk is much thinner than the gas disk. Conducting a parameter survey, we represent the growth condition in terms of the Toomre's $Q$ value for dust and dust-to-gas surface density ratio. The critical dust disk mass for secular GI is $\\sim10^{-4}$ stellar mass for the dust-to-gas surface density ratio of 0.01, the Stokes number of 0.1, and dimensionless radial dust diffusivity of $10^{-4}$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15607v1"
    ],
    "publication_venue": "23 pages, 17 figures; Submitted to ApJ"
}