{
    "arxiv_id": "2303.10029",
    "paper_title": "Quantum advantages in timekeeping: dimensional advantage, entropic advantage and how to realise them via Berry phases and ultra-regular spontaneous emission",
    "authors": [
        "Arman Pour Tak Dost",
        "Mischa P. Woods"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "When an atom is in an excited state, after some amount of time, it will decay to a lower energy state emitting a photon in the process. This is known as spontaneous emission. It is one of the three elementary light-matter interactions. If it has not decayed at time $t$, then the probability that it does so in the next infinitesimal time step $[t, t+δt]$, is $t$-independent. So there is no preferred time at which to decay -- in this sense it is a random process. Here we show, by carefully engineering this light-matter interaction, that we can associate it with a clock, where the matter constitutes the clockwork and the spontaneous emission constitutes the ticking of the clock. In particular, we show how to realise the quasi-ideal clock. Said clock has been proven -- in an abstract and theoretic sense -- to be the most accurate clock permissible by quantum theory, with a polynomial enhancement in precision over the best stochastic clock of the same size. Our results thus demonstrate that the seemingly random process of spontaneous emission can in actual fact, under the right circumstances, be the most regular one permissible by quantum theory. To achieve this we use geometric features and flux-loop insertions to induce symmetry and Berry phases into the light-matter coupling. We also study the entropy the clock produces per tick and show that it also possesses a quantum advantage over that generated from the previously known semi-classical clocks in the literature.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10029v1"
    ],
    "publication_venue": "10 + 13"
}