{
    "arxiv_id": "2303.08151",
    "paper_title": "Spectroscopic identification of rapidly rotating red giant stars in APOKASC-3 and APOGEE DR16",
    "authors": [
        "Rachel A. Patton",
        "Marc H. Pinsonneault",
        "Lyra Cao",
        "Mathieu Vrard",
        "Savita Mathur",
        "Rafael A. Garcia",
        "Jamie Tayar",
        "Christine Mazzola Daher",
        "Paul G. Beck"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "Rapidly rotating red giant stars are astrophysically interesting but rare. In this paper we present a catalog of 3217 active red giant candidates in the APOGEE DR16 survey. We use a control sample in the well-studied Kepler fields to demonstrate a strong relationship between rotation and anomalies in the spectroscopic solution relative to typical giants. Stars in the full survey with similar solutions are identified as candidates. We use vsin\\textiti measurements to confirm 50+/- 1.2% of our candidates as definite rapid rotators, compared to 4.9+/-0.2% in the Kepler control sample. In both the Kepler control sample and a control sample from DR16, we find that there are 3-4 times as many giants rotating with 5 < vsini < 10 km s$^{-1}$ compared to vsini > 10 km s$^{-1}$, the traditional threshold for anomalous rotation for red giants. The vast majority of intermediate rotators are not spectroscopically anomalous. We use binary diagnostics from APOGEE and \\textit{Gaia} to infer a binary fraction of 73+/-2.4%. We identify a significant bias in the reported metallicity for candidates with complete spectroscopic solutions, with median offsets of 0.37 dex in [M/H] from a control sample. As such, up to 10% of stars with reported [M/H]<-1 are not truly metal poor. Finally, we use Gaia data to identify a sub-population of main sequence photometric binaries erroneously classified as giants.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08151v1"
    ],
    "publication_venue": "17 pages, 15 figures submitted to MNRAS"
}