{
    "arxiv_id": "2303.09622",
    "paper_title": "Distorted stability pattern and chaotic features for quantized prey-predator-like dynamics",
    "authors": [
        "Alex E. Bernardini",
        "Orfeu Bertolami"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-04-19"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "q-bio.PE"
    ],
    "abstract": "Non-equilibrium and instability features of prey-predator-like systems associated to topological quantum domains emerging from a quantum phase-space description are investigated in the framework of the Weyl-Wigner quantum mechanics. Reporting about the generalized Wigner flow for one-dimensional Hamiltonian systems, $\\mathcal{H}(x,\\,k)$, constrained by $\\partial^2 \\mathcal{H} / \\partial x \\, \\partial k = 0$, the prey-predator dynamics driven by Lotka-Volterra (LV) equations is mapped onto the Heisenberg-Weyl non-commutative algebra, $[x,\\,k] = i$, where the canonical variables $x$ and $k$ are related to the two-dimensional LV parameters, $y = e^{-x}$ and $z = e^{-k}$. From the non-Liouvillian pattern driven by the associated Wigner currents, hyperbolic equilibrium and stability parameters for the prey-predator-like dynamics are then shown to be affected by quantum distortions over the classical background, in correspondence with non-stationarity and non-Liouvillianity properties quantified in terms of Wigner currents and Gaussian ensemble parameters. As an extension, considering the hypothesis of discretizing the time parameter, non-hyperbolic bifurcation regimes are identified and quantified in terms of $z-y$ anisotropy and Gaussian parameters. The bifurcation diagrams exhibit, for quantum regimes, chaotic patterns highly dependent on Gaussian localization. Besides exemplifying a broad range of applications of the generalized Wigner information flow framework, our results extend, from the continuous (hyperbolic regime) to discrete (chaotic regime) domains, the procedure for quantifying the influence of quantum fluctuations over equilibrium and stability scenarios of LV driven systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09622v1"
    ],
    "publication_venue": "23 pages, 6 figures",
    "doi": "10.1103/PhysRevE.107.044201"
}