{
    "arxiv_id": "2303.08876",
    "paper_title": "OGLE-2016-BLG-1195 AO: Lens, Companion to Lens or Source, or None of the Above?",
    "authors": [
        "Andrew Gould",
        "Yossi Shvartzvald",
        "Jiyuan Zhang",
        "Jennifer C. Yee",
        "Sebastiano Calchi Novati",
        "Weicheng Zang",
        "Eran O. Ofek"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
    ],
    "abstract": "We systematically investigate the claim by Vandorou et al. (2023) to have detected the host star of the low mass-ratio ($q<10^{-4}$) microlensing planet OGLE-2016-BLG-1195Lb, via Keck adaptive optics (AO) measurements $Δt=4.12\\,$yr after the peak of the event ($t_0$). If correct, this measurement would contradict the microlens parallax measurement derived from Spitzer observations in solar orbit taken near $t_0$. We show that this host identification would be in $4\\,σ$ conflict with the original ground-based lens-source relative proper-motion measurements. By contrast, Gould (2022) estimated a probability $p=10\\%$ that the ``other star'' resolved by single-epoch late-time AO would be a companion to the host or the microlensed source, which is much more probable than a 4$\\,σ$ statistical fluctuation. In addition, independent of this proper-motion discrepancy, the kinematics of this host-identification are substantially less probable than those of the Spitzer solution. Hence, this identification should not be accepted, pending additional observations that would either confirm or contradict it, which could be taken in 2023. Motivated by this tension, we present two additional investigations. We explore the possibility that Vandorou et al. (2023) identified the wrong ``star'' (or stellar asterism) on which to conduct their analysis. We find that astrometry of KMT and Keck images favors a star (or asterism) lying about 175 mas northwest of the one that they chose. We also present event parameters from a combined fit to all survey data, which yields, in particular, a more precise mass ratio, $q=(4.6\\pm 0.4)\\times 10^{-5}$. Finally, we discuss the broader implications of minimizing such false positives for the first measurement of the planet mass function, which will become possible when AO on next-generation telescopes are applied to microlensing planets.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08876v1"
    ],
    "publication_venue": "31 pages, 7 figures, 3 tables, 2 appendices, submitted to AAS Journals"
}