{
    "arxiv_id": "2303.13747",
    "paper_title": "Breakdown of effective-medium theory beyond the critical angle",
    "authors": [
        "Shuaijie Yuan",
        "Xinxing Zhou",
        "Yu Chen",
        "Yuhan Zhong",
        "Lijuan Sheng",
        "Hao Hu",
        "Hongsheng Chen",
        "Ido Kaminer",
        "Xiao Lin"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics"
    ],
    "abstract": "Effective-medium theory pertains to the theoretical modelling of homogenization, which aims to replace an inhomogeneous structure of subwavelength-scale constituents with a homogeneous effective medium. The effective-medium theory is fundamental to various realms, including electromagnetics and material science, since it can largely decrease the complexity in the exploration of light-matter interactions by providing simple acceptable approximation. Generally, the effective-medium theory is thought to be applicable to any all-dielectric system with deep-subwavelength constituents, under the condition that the effective medium does not have a critical angle, at which the total internal reflection occurs. Here we reveal a fundamental breakdown of the effective-medium theory that can be applied in very general conditions: showing it for deep-subwavelength all-dielectric multilayers even without critical angle. Our finding relies on an exotic photonic spin Hall effect, which is shown to be ultra-sensitive to the stacking order of deep-subwavelength dielectric layers, since the spin-orbit interaction of light is dependent on slight phase accumulations during the wave propagation. Our results indicate that the photonic spin Hall effect could provide a promising and powerful tool for measuring structural defects for all-dielectric systems even in the extreme nanometer scale.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13747v1"
    ],
    "publication_venue": "17 pages, 4 figures"
}