{
    "arxiv_id": "2303.14923",
    "paper_title": "All-photonic GKP-qubit repeater using analog-information-assisted multiplexed entanglement ranking",
    "authors": [
        "Filip Rozpędek",
        "Kaushik P. Seshadreesan",
        "Paul Polakos",
        "Liang Jiang",
        "Saikat Guha"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-11-29"
    ],
    "latest_version": 2,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Long distance quantum communication will require the use of quantum repeaters to overcome the exponential attenuation of signal with distance. One class of such repeaters utilizes quantum error correction to overcome losses in the communication channel. Here we propose a novel strategy of using the bosonic Gottesman-Kitaev-Preskill (GKP) code in a two-way repeater architecture with multiplexing. The crucial feature of the GKP code that we make use of is the fact that GKP qubits easily admit deterministic two-qubit gates, hence allowing for multiplexing without the need for generating large cluster states as required in previous all-photonic architectures based on discrete-variable codes. Moreover, alleviating the need for such clique-clusters entails that we are no longer limited to extraction of at most one end-to-end entangled pair from a single protocol run. In fact, thanks to the availability of the analog information generated during the measurements of the GKP qubits, we can design better entanglement swapping procedures in which we connect links based on their estimated quality. This enables us to use all the multiplexed links so that large number of links from a single protocol run can contribute to the generation of the end-to-end entanglement. We find that our architecture allows for high-rate end-to-end entanglement generation and is resilient to imperfections arising from finite squeezing in the GKP state preparation and homodyne detection inefficiency. In particular we show that long-distance quantum communication over more than 1000 km is possible even with less than 13 dB of GKP squeezing. We also quantify the number of GKP qubits needed for the implementation of our scheme and find that for good hardware parameters our scheme requires around $10^3-10^4$ GKP qubits per repeater per protocol run.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14923v1",
        "http://arxiv.org/pdf/2303.14923v2"
    ],
    "publication_venue": "v2 as published, 34 + 24 pages, 40 figures",
    "doi": "10.1103/PhysRevResearch.5.043056"
}