{
    "arxiv_id": "2303.08472",
    "paper_title": "Equalizing the Pixel Response of the Imaging Photoelectric Polarimeter On-Board the IXPE Mission",
    "authors": [
        "John Rankin",
        "Fabio Muleri",
        "Alessandro Di Marco",
        "Sergio Fabiani",
        "Fabio La Monaca",
        "Paolo Soffitta",
        "Matteo Bachetti",
        "Luca Baldini",
        "Enrico Costa",
        "Niccolò Di Lalla",
        "Alberto Manfreda",
        "Stephen L. O'Dell",
        "Matteo Perri",
        "Simonetta Puccetti",
        "Brian D. Ramsey",
        "Carmelo Sgrò",
        "Allyn F. Tennant",
        "Antonino Tobia",
        "Alessio Trois",
        "Martin C. Weisskopf",
        "Fei Xie"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM",
        "physics.ins-det"
    ],
    "abstract": "The Gas Pixel Detector is a gas detector, sensitive to the polarization of X-rays, currently flying on-board IXPE - the first observatory dedicated to X-ray polarimetry. It detects X-rays and their polarization by imaging the ionization tracks generated by photoelectrons absorbed in the sensitive volume, and then reconstructing the initial direction of the photoelectrons. The primary ionization charge is multiplied and ultimately collected on a finely-pixellated ASIC specifically developed for X-ray polarimetry. The signal of individual pixels is processed independently and gain variations can be substantial, of the order of 20%. Such variations need to be equalized to correctly reconstruct the track shape, and therefore its polarization direction. The method to do such equalization is presented here and is based on the comparison between the mean charge of a pixel with respect to the other pixels for equivalent events. The method is shown to finely equalize the response of the detectors on board IXPE, allowing a better track reconstruction and energy resolution, and can in principle be applied to any imaging detector based on tracks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08472v1"
    ],
    "publication_venue": "Accepted for publication in The Astronomical Journal. 10 pages, 19 figures",
    "doi": "10.3847/1538-3881/acc38e"
}