{
    "arxiv_id": "2303.14239",
    "paper_title": "Warm dark matter constraints from the JWST",
    "authors": [
        "Pratika Dayal",
        "Sambit K. Giri"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
    ],
    "abstract": "Warm Dark Matter (WDM) particles with masses ($\\sim$ kilo electronvolt) offer an attractive solution to the small-scale issues faced by the Cold Dark Matter (CDM) paradigm. The delay of structure formation in WDM models and the associated dearth of low-mass systems at high-redshifts makes this an ideal time to revisit WDM constraints in light of the unprecedented data-sets from the James Webb Space Telescope (JWST). Developing a phenomenological model based on the halo mass functions in CDM and WDM models, we calculate high-redshift ($z \\gt 6$) the stellar mass functions (SMF) and the associated stellar mass density (SMD) and the maximum stellar mass allowed in a given volume. We find that: (i) WDM as light as 1.5 keV is already disfavoured by the low-mass end of the SMF (stellar mass $M_* \\sim 10^7 \\rm{M_\\odot}$) although caution must be exerted given the impact of lensing uncertainties; (ii) 1.5 keV WDM models predict SMD values that show a steep decrease from $10^{8.8}$ to $10^{2} ~{\\rm M_\\odot ~cMpc^{-3}}$ from $z \\sim 4$ to 17 for $M_* \\gt 10^8 \\rm{M_\\odot}$; (iii) the 1.5 keV WDM model predicts a sharp and earlier cut-off in the maximum stellar masses for a given number density (or volume) as compared to CDM or heavier WDM models. For example, with a number density of $10^{-3} \\rm {cMpc^{-3}}$, 1.5 (3) KeV WDM models do not predict bound objects at $z \\gt 12$ (18). Forthcoming JWST observations of multiple blank fields can therefore be used as a strong probe of WDM at an epoch inaccessible by other means.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14239v1"
    ],
    "publication_venue": "Submitted to MNRAS; comments welcome"
}