{
    "arxiv_id": "2303.15510",
    "paper_title": "GEO-FPT: a model of the galaxy bispectrum at mildly non-linear scales",
    "authors": [
        "Sergi Novell-Masot",
        "Davide Gualdi",
        "Héctor Gil-Marín",
        "Licia Verde"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-11-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "We present GEO-FPT (Geometric Fitted Perturbation Theory), a new model for the galaxy bispectrum anisotropic signal in redshift space, with functional form rooted in perturbation theory. It also models the dependence of the bispectrum with the geometric properties of the triangles in Fourier space, and has a broader regime of validity than state-of-the-art theoretical models based on perturbation theory. We calibrate the free parameters of this model using high-resolution dark matter simulations and perform stringent tests to show that GEO-FPT describes the galaxy bispectrum accurately up to scales of $k\\simeq0.12 h{\\rm Mpc}^{-1}$ for different cosmological models, as well as for biased tracers of the dark matter field, considering a survey volume of $100$ (Gpc $h^{-1})^3$. In particular, a joint analysis of the power spectrum and bispectrum anisotropic signals, taking into account their full covariance matrix, reveals that the relevant physical quantities -- the BAO peak position (along and across the line-of-sight), and the growth of structure parameters times the amplitude of dark matter fluctuations, $fσ_8$-- are recovered in an unbiased way, with an accuracy better than $0.4\\%$ and $2\\%$ respectively (which is our $2σ$ statistical limit of the systematic error estimate). In addition, the bispectrum signal breaks the $fσ_8$ degeneracy without detectable bias: $f$ and $σ_8$ are recovered with better than $2.7\\%$ and $3.8\\%$ accuracy respectively (which is our $2σ$ statistical limit of the systematic error estimate).\n  GEO-FPT boosts the applicability of the bispectrum signal of galaxy surveys beyond the current limitation of $k\\lesssim 0.08\\,h$ Mpc$^{-1}$ % and makes the bispectrum a key statistic to unlock the information content from the mildly non-linear regime in the on-going and forthcoming galaxy redshift surveys.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15510v1"
    ],
    "publication_venue": "37 pages, 14 figures. To be submitted to JCAP, comments welcome",
    "doi": "10.1088/1475-7516/2023/11/044"
}