{
    "arxiv_id": "2303.08191",
    "paper_title": "Stacking order effects on the energetic stability and electronic properties of $n$-doped graphene/h-BN van der Waals heterostructures on SiC(0001)",
    "authors": [
        "D. P. de Andrade Deus",
        "J. M. J. Lopes",
        "Roberto H. Miwa"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Heterostructures made of stacked 2D materials with different electronic properties are studied for their potential in creating multifunctional devices. Graphene (G) and hexagonal boron nitride (h-BN) van der Waals (vdW) systems have been extensively researched, including recent studies on synthesizing h-BN on graphene/SiC(0001) templates. These studies suggest that h-BN encapsulation could occur in addition to vdW epitaxy. This work presents theoretical research on G/h-BN heterostructures on SiC(0001) with a carbon buffer layer. The results show an energetic preference for h-BN encapsulation below a single layer of graphene: G/h-BN/SiC in bilayer systems and G/h-BN/G/SiC in trilayer systems. Electronic structure calculations reveal that the linear energy band dispersion of graphene is maintained in bilayer systems but with Dirac points at different energy positions due to the varied electron doping level of graphene. In trilayer systems, the doping level of graphene also depends on the stacking order. The electronic band structure of G/h-BN/G/SiC features two Dirac points below the Fermi level but with different energies. Less stable systems like G/G/h-BN/ and h-BN/G/G/SiC display parabolic bands near the Fermi level. Additional structural characterizations were performed based on simulations of C-1s core-level-shift (CLS) and carbon K-edge X-ray absorption near-edge spectroscopy (XANES) to aid future experimental spectroscopy in these graphene/h-BN vdW systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08191v1"
    ],
    "publication_venue": "11 pages, 10 figures"
}