{
    "arxiv_id": "2303.12142",
    "paper_title": "Transient dynamics and quantum phase diagram for the square lattice Rashba-Hubbard model at arbitrary hole doping",
    "authors": [
        "Erik Wegner Hodt",
        "Jabir Ali Ouassou",
        "Jacob Linder"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el"
    ],
    "abstract": "Adding a Rashba term to the Hubbard Hamiltonian produces a model which can be used to learn how spin-orbit interactions impact correlated electrons on a lattice. Previous works have studied such a model using a variety of theoretical frameworks, mainly close to half-filling. In this work, we determine the magnetic phase-diagram for the Rashba-Hubbard model for arbitrary hole doping using a sine square deformed lattice mean-field model with an unrestricted ansatz, thus suppressing finite size effects. We find that the introduction of Rashba spin-orbit coupling significantly alters the ground state properties of the Hubbard model and we observe an increasing complexity of the ground state phase composition for increasing spin-orbit strength. We also introduce a gradual deformed envelope (GDE) technique building on the sine square methodology to facilitate convergence towards ordered and defect-free ground state configurations which is a challenge with the unrestricted ansatz at high interaction strengths. We observe that the use of the GDE technique significantly lowers the free energy of the obtained configurations. Moreover, we consider transient dynamics in the Rashba-Hubbard model by quenching the interaction strength. We find that the quench dynamics within a sine-square methodology allows for the simulation of quasi-open systems by using the zero-energy edge states as a particle reservoir. Interaction quenches at half-filling show a tendency towards quench-induced spatial spin-magnitude inhomogeneity and a non-equilibrium system magnetization lower than equilibrium predictions, possibly related to a build-up of non-local correlations on the lattice.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12142v1"
    ],
    "publication_venue": "17 pages, 12 figures"
}