{
    "arxiv_id": "2303.16873",
    "paper_title": "Channel Phase Processing in Wireless Networks for Human Activity Recognition",
    "authors": [
        "Guillermo Diaz",
        "Iker Sobron",
        "Iñaki Eizmendi",
        "Iratxe landa",
        "Manuel Velez"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SP"
    ],
    "abstract": "The phase of the channel state information (CSI) is underutilized as a source of information in wireless sensing due to its sensitivity to synchronization errors of the signal reception. A linear transformation of the phase is commonly applied to correct linear offsets and, in a few cases, some filtering in time or frequency is carried out to smooth the data. This paper presents a novel processing method of the CSI phase to improve the accuracy of human activity recognition (HAR) in indoor environments. This new method, coined Time Smoothing and Frequency Rebuild (TSFR), consists of performing a CSI phase sanitization method to remove phase impairments based on a linear regression and rotation method, then a time domain filtering stage with a Savitzy-Golay (SG) filter for denoising purposes and, finally, the phase is rebuilt, eliminating distortions in frequency caused by SG filtering. The TSFR method has been tested on five datasets obtained from experimental measurements, using three different deep learning algorithms, and compared against five other types of CSI phase processing. The results show an accuracy improvement using TSFR in all the cases. Concretely, accuracy performance higher than 90\\% in most of the studied scenarios has been achieved with the proposed solution. In few-shot learning strategies, TSFR outperforms the state-of-the-art performance from 35\\% to 85\\%.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16873v1"
    ],
    "publication_venue": "submitted to IEEE Transactions on Mobile Computing (under review)"
}