{
    "arxiv_id": "2303.17624",
    "paper_title": "A First Look at Spatially Resolved Balmer Decrements at $1.0<z<2.4$ from JWST NIRISS Slitless Spectroscopy",
    "authors": [
        "Jasleen Matharu",
        "Adam Muzzin",
        "Ghassan Sarrouh",
        "Gabriel Brammer",
        "Roberto Abraham",
        "Yoshihisa Asada",
        "Maruša Bradač",
        "Guillaume Desprez",
        "Nicholas Martis",
        "Lamiya Mowla",
        "Gaël Noirot",
        "Marcin Sawicki",
        "Victoria Strait",
        "Chris J. Willott",
        "Katriona M. L. Gould",
        "Tess Grindlay",
        "Anishya T. Harshan"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-05-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present the first results on the spatial distribution of dust attenuation at $1.0<z<2.4$ traced by the Balmer Decrement, H$α$/H$β$, in emission-line galaxies using deep JWST NIRISS slitless spectroscopy from the CAnadian NIRISS Unbiased Cluster Survey (CANUCS). H$α$ and H$β$ emission line maps of emission-line galaxies are extracted and stacked in bins of stellar mass for two grism redshift bins, $1.0<z_{grism}<1.7$ and $1.7<z_{grism}<2.4$. Surface brightness profiles for the Balmer Decrement are measured and radial profiles of the dust attenuation towards H$α$, $A_{\\mathrm{H}α}$, are derived. In both redshift bins, the integrated Balmer Decrement increases with stellar mass. Lower mass ($7.6\\leqslant$Log($M_{*}$/M$_{\\odot}$)$<10.0$) galaxies have centrally concentrated, negative dust attenuation profiles whereas higher mass galaxies ($10.0\\leqslant$Log($M_{*}$/M$_{\\odot}$)$<11.1$) have flat dust attenuation profiles. The total dust obscuration is mild, with on average $0.07\\pm0.07$ and $0.14\\pm0.07$ mag in the low and high redshift bins respectively. We model the typical light profiles of star-forming galaxies at these redshifts and stellar masses with GALFIT and apply both uniform and radially varying dust attenuation corrections based on our integrated Balmer Decrements and radial dust attenuation profiles. If these galaxies were observed with typical JWST NIRSpec slit spectroscopy ($0.2\\times0.5^{\\prime\\prime}$ shutters), on average, H$α$ star formation rates (SFRs) measured after slit-loss corrections assuming uniform dust attenuation will overestimate the total SFR by $6\\pm21 \\%$ and $26\\pm9 \\%$ at $1.0\\leqslant z < 1.7$ and $1.7\\leqslant z < 2.4$ respectively.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17624v1"
    ],
    "publication_venue": "7 pages, 5 figures, submitted to ApJL",
    "doi": "10.3847/2041-8213/acd1db"
}