{
    "arxiv_id": "2303.12674",
    "paper_title": "Constraining f(Q) Cosmology with Standard Sirens",
    "authors": [
        "José Ferreira"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "In this dissertation, we study two cosmological models based on $f(Q)$ gravity. We resort to mock catalogs of standard siren (SS) events to see whether data from future gravitational wave (GWs) observatories will be able to distinguish these models from $Λ$CDM.\n  The first model is the most general $f(Q)$ formulation that replicates a $Λ$CDM background, with deviations appearing only at the perturbative level. It has one additional free parameter compared to $Λ$CDM, $α$, which when set to zero falls back to $Λ$CDM. We show that LIGO-Virgo is unable to constrain $α$, due to the high error and low redshift of the measurements, whereas LISA and the ET will, with the ET outperforming LISA. The catalogs for both LISA and LIGO-Virgo show non-negligible statistical fluctuations, where we consider three representative catalogs (the best, median and worst), whereas for the ET, only a single catalog is considered, as the number of events is large enough for statistical fluctuations to be neglected. The best LISA catalog is the one with more low redshift events, while the worst LISA catalog features fewer low redshift events. Additionally, if we are to observe a bad LISA catalog, we can rely on data from LIGO-Virgo to improve the quality of the constrains, bringing it closer to a median LISA catalog.\n  The second model attempts to replace dark energy by making use of a specific form of the function $f(Q)$. We study this model resorting to dynamical system techniques to show the regions in parameter space with viable cosmologies. Using model selection criteria, we show that no number of SS events is, by itself, able to tell this model and $Λ$CDM apart. We then show that if we add current type Ia Supernova (SnIa) data, tensions in this model arise when compared to the constrains set by the SS events.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12674v1"
    ],
    "publication_venue": "58 pages, 25 figures"
}