{
    "arxiv_id": "2303.08749",
    "paper_title": "Simulating image coaddition with the Nancy Grace Roman Space Telescope: I. Simulation methodology and general results",
    "authors": [
        "Christopher M. Hirata",
        "Masaya Yamamoto",
        "Katherine Laliotis",
        "Emily Macbeth",
        "M. A. Troxel",
        "Tianqing Zhang",
        "Ami Choi",
        "Jahmour Givans",
        "Katrin Heitmann",
        "Mustapha Ishak",
        "Mike Jarvis",
        "Eve Kovacs",
        "Heyang Long",
        "Rachel Mandelbaum",
        "Andy Park",
        "Anna Porredon",
        "Christopher W. Walter",
        "W. Michael Wood-Vasey"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
    ],
    "abstract": "The upcoming Nancy Grace Roman Space Telescope will carry out a wide-area survey in the near infrared. A key science objective is the measurement of cosmic structure via weak gravitational lensing. Roman data will be undersampled, which introduces new challenges in the measurement of source galaxy shapes; a potential solution is to use linear algebra-based coaddition techniques such as Imcom that combine multiple undersampled images to produce a single oversampled output mosaic with a desired \"target\" point spread function (PSF). We present here an initial application of Imcom to 0.64 square degrees of simulated Roman data, based on the Roman branch of the Legacy Survey of Space and Time (LSST) Dark Energy Science Collaboration (DESC) Data Challenge 2 (DC2) simulation. We show that Imcom runs successfully on simulated data that includes features such as plate scale distortions, chip gaps, detector defects, and cosmic ray masks. We simultaneously propagate grids of injected sources and simulated noise fields as well as the full simulation. We quantify the residual deviations of the PSF from the target (the \"fidelity\"), as well as noise properties of the output images; we discuss how the overall tiling pattern as well as Moiré patterns appear in the final fidelity and noise maps. We include appendices on interpolation algorithms and the interaction of undersampling with image processing operations that may be of broader applicability. The companion paper (\"Paper II\") explores the implications for weak lensing analyses.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08749v1"
    ],
    "publication_venue": "28 pages, 19 figures, to be submitted to MNRAS"
}