{
    "arxiv_id": "2303.17468",
    "paper_title": "Surrogate Neural Networks for Efficient Simulation-based Trajectory Planning Optimization",
    "authors": [
        "Evelyn Ruff",
        "Rebecca Russell",
        "Matthew Stoeckle",
        "Piero Miotto",
        "Jonathan P. How"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "math.OC",
        "cs.LG"
    ],
    "abstract": "This paper presents a novel methodology that uses surrogate models in the form of neural networks to reduce the computation time of simulation-based optimization of a reference trajectory. Simulation-based optimization is necessary when there is no analytical form of the system accessible, only input-output data that can be used to create a surrogate model of the simulation. Like many high-fidelity simulations, this trajectory planning simulation is very nonlinear and computationally expensive, making it challenging to optimize iteratively. Through gradient descent optimization, our approach finds the optimal reference trajectory for landing a hypersonic vehicle. In contrast to the large datasets used to create the surrogate models in prior literature, our methodology is specifically designed to minimize the number of simulation executions required by the gradient descent optimizer. We demonstrated this methodology to be more efficient than the standard practice of hand-tuning the inputs through trial-and-error or randomly sampling the input parameter space. Due to the intelligently selected input values to the simulation, our approach yields better simulation outcomes that are achieved more rapidly and to a higher degree of accuracy. Optimizing the hypersonic vehicle's reference trajectory is very challenging due to the simulation's extreme nonlinearity, but even so, this novel approach found a 74% better-performing reference trajectory compared to nominal, and the numerical results clearly show a substantial reduction in computation time for designing future trajectories.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17468v1"
    ],
    "publication_venue": "8 pages, 11 figures, submitted to the IEEE Conference of Decision and Control 2023"
}