{
    "arxiv_id": "2303.17282",
    "paper_title": "Diagnosis of 3D magnetic field and modes composition in MHD turbulence with Y-parameter",
    "authors": [
        "Sunil Malik",
        "Ka Ho Yuen",
        "Huirong Yan"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
    ],
    "abstract": "Magnetic field is ubiquitous in interstellar media and channels turbulent flow from kilo-parsec to sub-parsec scales in both diffuse ISM and molecular clouds. The determination of magnetohydrodynamic (MHD) turbulence and 3D magnetic field properties in ISM is notoriously difficult. In this study, we establish a statistical recipe `Y-parameter' based on the recent development of turbulence statistical theory, namely the turbulence anisotropy analysis, to reconstruct 3D magnetic fields in MHD simulations and understand the mode-decomposition of MHD turbulence. In our analysis, we used 25 MHD turbulence datacubes simulated using ZEUS-MP and Athena++ codes. We found that the anisotropy of Stokes parameters can act as a diagnostic for retrieving the magnetic field inclination in ISM and identifying dominating mode. It is supported by the value space separation of the Y-parameter for decomposed Alfvenic and compressible MHD cubes and which is decreasing and increasing with mean field inclination angle, $θ_λ$, respectively. In the total cube analysis, Y$\\sim 1.5$ (with Y$>1.5$ for A-mode and Y$<1.5$ for C-mode) provides a statistical demarcation to obtain the dominant fraction of MHD turbulence modes. Furthermore, we have found that the (i) if Y$\\gtrsim 2.5$, $10^\\circ<θ_λ< 30^\\circ$ and A mode or $5^\\circ<θ_λ< 10^\\circ$ and C-mode (ii) if Y$ \\lesssim 1.0 $, $θ_λ \\lesssim 5^\\circ$ and C-mode or $θ_λ \\gtrsim 60^\\circ$ and A-mode (iii) $40^\\circ \\lesssim θ_λ \\lesssim 60^\\circ$ with A-mode or $θ_λ \\gtrsim 70^\\circ$ with C-mode, if Y-parameter is in the intermediate range. As a consequence, in the future with the availability of vast radio polarisation surveys, this technique can play a leading role in detecting 3D magnetic field in ISM and characterizing the nature of the interstellar turbulence.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17282v1"
    ],
    "publication_venue": "12 pages, 9 figures, 1 table"
}