{
    "arxiv_id": "2303.14405",
    "paper_title": "On the Efficiency of An Election Game of Two or More Parties: How Bad Can It Be?",
    "authors": [
        "Chuang-Chieh Lin",
        "Chi-Jen Lu",
        "Po-An Chen"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-05-23"
    ],
    "latest_version": 4,
    "categories": [
        "cs.GT",
        "cs.CC"
    ],
    "abstract": "We extend our previous work on two-party election competition [Lin, Lu & Chen 2021] to the setting of three or more parties. An election campaign among two or more parties is viewed as a game of two or more players. Each of them has its own candidates as the pure strategies to play. People, as voters, comprise supporters for each party, and a candidate brings utility for the the supporters of each party. Each player nominates exactly one of its candidates to compete against the other party's. A candidate is assumed to win the election with higher odds if it brings more utility for all the people. The payoff of each player is the expected utility its supporters get. The game is egoistic if every candidate benefits her party's supporters more than any candidate from the competing party does. In this work, we first argue that the election game always has a pure Nash equilibrium when the winner is chosen by the hardmax function, while there exist game instances in the three-party election game such that no pure Nash equilibrium exists even the game is egoistic. Next, we propose two sufficient conditions for the egoistic election game to have a pure Nash equilibrium. Based on these conditions, we propose a fixed-parameter tractable algorithm to compute a pure Nash equilibrium of the egoistic election game. Finally, perhaps surprisingly, we show that the price of anarchy of the egoistic election game is upper bounded by the number of parties. Our findings suggest that the election becomes unpredictable when more than two parties are involved and, moreover, the social welfare deteriorates with the number of participating parties in terms of possibly increasing price of anarchy. This work alternatively explains why the two-party system is prevalent in democratic countries.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14405v1",
        "http://arxiv.org/pdf/2303.14405v2",
        "http://arxiv.org/pdf/2303.14405v3",
        "http://arxiv.org/pdf/2303.14405v4"
    ],
    "publication_venue": "Submitted to SAGT 2023"
}