{
    "arxiv_id": "2303.14350",
    "paper_title": "Nitrogen-Based Magneto-Ionic Manipulation of Exchange Bias in CoFe/MnN Heterostructures",
    "authors": [
        "Christopher J. Jensen",
        "Alberto Quintana",
        "Patrick Quarterman",
        "Alexander J. Grutter",
        "Purnima P. Balakrishnan",
        "Huairuo Zhang",
        "Albert V. Davydov",
        "Xixiang Zhang",
        "Kai Liu"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Electric field control of the exchange bias effect across ferromagnet/antiferromagnet (FM/AF) interfaces has offered exciting potentials for low-energy-dissipation spintronics. In particular, the solid state magneto-ionic means is highly appealing as it may allow reconfigurable electronics by transforming the all-important FM/AF interfaces through ionic migration. In this work, we demonstrate an approach that combines the chemically induced magneto-ionic effect with the electric field driving of nitrogen in the Ta/Co$_{0.7}$Fe$_{0.3}$/MnN/Ta structure to electrically manipulate exchange bias. Upon field-cooling the heterostructure, ionic diffusion of nitrogen from MnN into the Ta layers occurs. A significant exchange bias of 618 Oe at 300 K and 1484 Oe at 10 K is observed, which can be further enhanced after a voltage conditioning by 5% and 19%, respectively. This enhancement can be reversed by voltage conditioning with an opposite polarity. Nitrogen migration within the MnN layer and into the Ta capping layer cause the enhancement in exchange bias, which is observed in polarized neutron reflectometry studies. These results demonstrate an effective nitrogen-ion based magneto-ionic manipulation of exchange bias in solid-state devices.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14350v1"
    ],
    "publication_venue": "28 pages, 4 figures; supporting information: 17 pages, 11 figures",
    "doi": "10.1021/acsnano.2c12702"
}