{
    "arxiv_id": "2303.12828",
    "paper_title": "Stellar cluster formation in a Milky Way-sized galaxy at z>4 -- II. A hybrid formation scenario for the nuclear star cluster and its connection to the nuclear stellar ring",
    "authors": [
        "Floor van Donkelaar",
        "Lucio Mayer",
        "Pedro R. Capelo",
        "Tomas Tamfal",
        "Thomas R. Quinn",
        "Piero Madau"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2024-03-19"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Nuclear star clusters (NSCs) are massive star clusters found in the innermost region of most galaxies. While recent studies suggest that low-mass NSCs in dwarf galaxies form largely out of the merger of globular clusters and NSCs in massive galaxies accumulate mass primarily through central star formation, the formation channel of the Milky Way's NSC is still uncertain. In this work, we use GigaEris, a high resolution N-body, hydrodynamical, cosmological ``zoom-in'' simulation, to investigate a possible formation path of the NSC in the progenitor of a Milky Way-sized galaxy, as well as its relation to the assembly and evolution of the galactic nuclear region. We study the possibility that bound, young, gas-rich, stellar clusters within a radius of 1.5 kpc of the main galaxy's centre at z>4 are the predecessors of the old, metal-poor stellar population of the Milky Way's NSC. We identify 47 systems which satisfy our criteria, with a total stellar mass of $10^{7.5}$ M$_{\\odot}$. We demonstrate that both stellar cluster accretion and in-situ star formation will contribute to the formation of the NSC, providing evidence for a hybrid formation scenario for the first time in an N-body, hydrodynamical, cosmological ``zoom-in'' simulation. Additionally, we find that the gas required for in-situ star formation can originate from two pathways: gas-rich stellar clusters and gas influx driven by large-scale non-axisymmetric structures within the galaxy. This is partly supported by the presence of a stellar ring, resulting from gas dynamics, with properties similar to those of the Milky Way's nuclear stellar disc.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12828v1",
        "http://arxiv.org/pdf/2303.12828v2"
    ],
    "publication_venue": "13 pages, 10 figures, Accepted by MNRAS"
}