{
    "arxiv_id": "2303.11779",
    "paper_title": "Online Hitting of Unit Balls and Hypercubes in $\\mathbb{R}^d$ using Points from $\\mathbb{Z}^d$",
    "authors": [
        "Minati De",
        "Satyam Singh"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CG"
    ],
    "abstract": "We consider the online hitting set problem for the range space $Σ=(\\cal X,\\cal R)$, where the point set $\\cal X$ is known beforehand, but the set $\\cal R$ of geometric objects is not known in advance. Here, geometric objects arrive one by one, the objective is to maintain a hitting set of minimum cardinality by taking irrevocable decisions. In this paper, we have considered the problem when the objects are unit balls or unit hypercubes in $\\mathbb{R}^d$, and the points from $\\mathbb{Z}^d$ are used for hitting them. First, we consider the problem for objects (unit balls and unit hypercubes) in lower dimensions. We obtain $4$ and $8$-competitive deterministic online algorithms for hitting unit hypercubes in $\\mathbb{R}^2$ and $\\mathbb{R}^3$, respectively. On the other hand, we present $4$ and $14$-competitive deterministic online algorithms for hitting unit balls in $\\mathbb{R}^2$ and $\\mathbb{R}^3$, respectively. Next, we consider the problem for objects (unit balls and unit hypercubes) in the higher dimension. For hitting unit hypercubes in $\\mathbb{R}^d$, we present a $O(d^2)$-competitive randomized online algorithm for $d\\geq 3$ and prove the competitive ratio of any deterministic algorithm for the problem is at least $d+1$ for any $d\\in\\mathbb{N}$. Then, for hitting unit balls in $\\mathbb{R}^d$, we propose a $O(d^4)$-competitive deterministic algorithm, and for $d<4$, we establish that the competitive ratio of any deterministic algorithm is at least $d+1$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11779v1"
    ],
    "publication_venue": "18 pages, 4 figures"
}