{
    "arxiv_id": "2303.12151",
    "paper_title": "Universal chaotic dynamics from Krylov space",
    "authors": [
        "Johanna Erdmenger",
        "Shao-Kai Jian",
        "Zhuo-Yu Xian"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-08-31"
    ],
    "latest_version": 2,
    "categories": [
        "hep-th",
        "cond-mat.stat-mech",
        "cond-mat.str-el",
        "nlin.CD"
    ],
    "abstract": "Krylov state complexity measures the spread of the wavefunction in the Krylov basis, a particular basis that is uniquely constructed using the Hamiltonian of a given physical system. Viewing each basis vector as one site, this basis naturally constitutes a one-dimensional chain, so that the state evolution can be mapped to a particle propagating on the chain, and its position is the Krylov state complexity. Based on this interpretation, we derive an Ehrenfest theorem for the Krylov complexity, which reveals its close relation to the spectrum. In particular, we find that the Krylov state complexity is directly driven by the properly normalized spectral form factor. This allows us to give an analytical expression for Krylov state complexity in random matrix theory. We also study the time evolution of the wavefunction in the Krylov basis. This provides the transition probability associated to the evolution of the initial state to the basis vector at a given site. For chaotic systems, including random matrix theories and the Sachdev-Ye-Kitaev model, we numerically observe a universal rise-slope-ramp-plateau behavior of the transition probability, with a long linear ramp. For the Gaussian unitary ensemble, we analytically explain this universal behavior for the sites located on the first half of the chain. The long linear ramp in the transition probability at each site leads to a peak in the Krylov complexity at late times. For non-chaotic systems, the transition probability shows a different behavior without the linear ramp. Our results clarify which features of the wave function time evolution in Krylov space characterize chaos.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12151v1",
        "http://arxiv.org/pdf/2303.12151v2"
    ],
    "publication_venue": "46+16 pages, 19 figures, template changed, references added, typos fixed"
}