{
    "arxiv_id": "2303.16618",
    "paper_title": "Personalised Language Modelling of Screen Characters Using Rich Metadata Annotations",
    "authors": [
        "Sebastian Vincent",
        "Rowanne Sumner",
        "Alice Dowek",
        "Charlotte Blundell",
        "Emily Preston",
        "Chris Bayliss",
        "Chris Oakley",
        "Carolina Scarton"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-08-14"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
    ],
    "abstract": "Language models that are sensitive to external context can more effectively capture the speaking patterns of individuals with specific characteristics or in particular environments. However, obtaining and leveraging such annotations can be challenging. In this work, we show how to leverage rich character and film annotations to personalise language models in a scalable manner. Our best model can reduce perplexity by up to 6.5% compared to a parameter-matched language model. Our approach performs on par with speaker-specific fine-tuning when the fine-tuning data (i.e. past dialogue) for individual speakers is available. On top of that, it also generalises well to a scenario with no such data, relying on combinations of demographic characteristics expressed via metadata. Our findings are consistent across two corpora, one of which is also a contribution of this paper: Cornell-rich contains rich manual annotations for 863 speaking characters from the Cornell Movie Dialog Corpus, including features such as characteristic quotes and character descriptions, along with six automatically extracted metadata features for over 95% of the featured films. Finally, we also present a cost-benefit analysis highlighting which annotations are most cost-effective in reducing perplexity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16618v1",
        "http://arxiv.org/pdf/2303.16618v2"
    ],
    "publication_venue": "9 pages; 4 figures; 6 tables. Preprint"
}