{
    "arxiv_id": "2303.10624",
    "paper_title": "PFSL: Personalized & Fair Split Learning with Data & Label Privacy for thin clients",
    "authors": [
        "Manas Wadhwa",
        "Gagan Raj Gupta",
        "Ashutosh Sahu",
        "Rahul Saini",
        "Vidhi Mittal"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cs.DC"
    ],
    "abstract": "The traditional framework of federated learning (FL) requires each client to re-train their models in every iteration, making it infeasible for resource-constrained mobile devices to train deep-learning (DL) models. Split learning (SL) provides an alternative by using a centralized server to offload the computation of activations and gradients for a subset of the model but suffers from problems of slow convergence and lower accuracy. In this paper, we implement PFSL, a new framework of distributed split learning where a large number of thin clients perform transfer learning in parallel, starting with a pre-trained DL model without sharing their data or labels with a central server. We implement a lightweight step of personalization of client models to provide high performance for their respective data distributions. Furthermore, we evaluate performance fairness amongst clients under a work fairness constraint for various scenarios of non-i.i.d. data distributions and unequal sample sizes. Our accuracy far exceeds that of current SL algorithms and is very close to that of centralized learning on several real-life benchmarks. It has a very low computation cost compared to FL variants and promises to deliver the full benefits of DL to extremely thin, resource-constrained clients.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10624v1"
    ],
    "publication_venue": "To be published in : THE 23RD IEEE/ACM INTERNATIONAL SYMPOSIUM ON Cluster, Cloud and Internet Computing. Granted: Open Research Objects (ORO) and Research Objects Reviewed (ROR) badges. See https://www.niso.org/publications/rp-31-2021-badging for definitions of the badges. Code available at: https://github.com/mnswdhw/PFSL"
}