{
    "arxiv_id": "2303.09814",
    "paper_title": "Sub-10 nm Probing of Ferroelectricity in Heterogeneous Materials by Machine Learning Enabled Contact Kelvin Probe Force Microscopy",
    "authors": [
        "Sebastian W. Schmitt",
        "Rama K. Vasudevan",
        "Maurice Seifert",
        "Albina Y. Borisevich",
        "Veeresh Deshpande",
        "Sergei V. Kalinin",
        "Catherine Dubourdieu"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Reducing the dimensions of ferroelectric materials down to the nanoscale has strong implications on the ferroelectric polarization pattern and on the ability to switch the polarization. As the size of ferroelectric domains shrinks to nanometer scale, the heterogeneity of the polarization pattern becomes increasingly pronounced, enabling a large variety of possible polar textures in nanocrystalline and nanocomposite materials. Critical to the understanding of fundamental physics of such materials and hence their applications in electronic nanodevices, is the ability to investigate their ferroelectric polarization at the nanoscale in a non-destructive way. We show that contact Kelvin probe force microscopy (cKPFM) combined with a k-means response clustering algorithm enables to measure the ferroelectric response at a mapping resolution of 8 nm. In a BaTiO3 thin film on silicon composed of tetragonal and hexagonal nanocrystals, we determine a nanoscale lateral distribution of discrete ferroelectric response clusters, fully consistent with the nanostructure determined by transmission electron microscopy. Moreover, we apply this data clustering method to the cKPFM responses measured at different temperatures, which allows us to follow the corresponding change in polarization pattern as the Curie temperature is approached and across the phase transition. This work opens up perspectives for mapping complex ferroelectric polarization textures such as curled/swirled polar textures that can be stabilized in epitaxial heterostructures and more generally mapping the polar domain distribution of any spatially-highly-heterogeneous ferroelectric materials.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09814v1"
    ],
    "publication_venue": null,
    "doi": "10.1021/acsaelm.1c00569"
}