{
    "arxiv_id": "2303.08399",
    "paper_title": "Odd-parity perturbations of the wormhole-like geometries and quasi-normal modes in Einstein-Æther theory",
    "authors": [
        "Chao Zhang",
        "Anzhong Wang",
        "Tao Zhu"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc"
    ],
    "abstract": "The Einstein-$Æ$ther theory has drawn a lot of attentions in recent years. As a representative case of gravitational theories that break the Lorentz symmetry, it plays an important role in testing the Lorentz-violating effects and shedding light on the attempts to construct quantum gravity. Since the first detection to the gravitational wave, the event GW150914, a brand new window has been opened to testing the theory of gravity with gravitational wave observations. At the same time, the study of gravitational waves itself also provides us a serendipity of accessing the nature of a theory. In this paper, we focus on the odd-parity gravitational perturbations to a background that describes a wormhole-like geometry under the Einstein-$Æ$ther theory. Taking advantage of this set of analytic background solutions, we are able to simplify the Lagrangian and construct a set of coupled single-parameter dependent master equations, from which we solve for the quasi-normal modes that carry the physical information of the emitted gravitational waves. Basically, the results reflect a consistency between Einstein-$Æ$ther theory and general relativity. More importantly, as long as the no-ghost condition and the latest observational constraints are concerned, we notice that the resultant quasi-normal mode solutions intimate a kind of dynamical instability. Thus, the solutions are ruled out based on their stability against small linear perturbations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08399v1"
    ],
    "publication_venue": "14 pages, 12 figures. arXiv admin note: substantial text overlap with arXiv:2209.04735"
}