{
    "arxiv_id": "2303.15063",
    "paper_title": "Nonlocal dynamics of secondary electrons in capacitively coupled radio frequency discharges",
    "authors": [
        "Katharina Noesges",
        "Maximilian Klich",
        "Aranka Derzsi",
        "Benedek Horváth",
        "Julian Schulze",
        "Ralf Peter Brinkmann",
        "Thomas Mussenbrock",
        "Sebastian Wilczek"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.plasm-ph"
    ],
    "abstract": "In capacitively coupled radio frequency (CCRF) discharges, the interaction of the plasma and the surface boundaries is linked to a variety of highly relevant phenomena for technological processes. One possible plasma-surface interaction is the generation of secondary electrons (SEs), which significantly influence the discharge when accelerated in the sheath electric field. However, SEs, in particular electron-induced SEs ($\\updelta$-electrons), are frequently neglected in theory and simulations. Due to the relatively high threshold energy for the effective generation of $\\updelta$-electrons at surfaces, their dynamics are closely connected and entangled with the dynamics of the ion-induced SEs ($\\upgamma$-electrons). Thus, a fundamental understanding of the electron dynamics has to be achieved on a nanosecond timescale, and the effects of the different electron groups have to be segregated. This work utilizes $1d3v$ Particle-in-Cell/Monte Carlo Collisions (PIC/MCC) simulations of a symmetric discharge in the low-pressure regime ($p\\,=\\, 1\\,\\rm{Pa}$) with the inclusion of realistic electron-surface interactions for silicon dioxide. A diagnostic framework is introduced that segregates the electrons into three groups (\"bulk-electrons\", \"$\\upgamma$-electrons\", and \"$\\updelta$-electrons\") in order to analyze and discuss their dynamics. A variation of the electrode gap size $L_\\mathrm{gap}$ is then presented as a control tool to alter the dynamics of the discharge significantly. It is demonstrated that this control results in two different regimes of low and high plasma density, respectively. The fundamental electron dynamics of both regimes are explained, which requires a complete analysis starting at global parameters (e.g., densities) down to single electron trajectories.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15063v1"
    ],
    "publication_venue": null
}