{
    "arxiv_id": "2303.14788",
    "paper_title": "Testing Model Predictions of Depth of Air-Shower Maximum and Signals in Surface Detectors using Hybrid Data of the Pierre Auger Observatory",
    "authors": [
        "Jakub Vícha"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "We present a method for testing the predictions of hadronic interaction models and improving their consistency with observed two-dimensional distributions of the depth of shower maximum, $X_\\text{max}$, and signal at the ground level as a function of zenith angle. The method relies on the assumption that the mass composition is the same at all zenith angles, while the atmospheric shower development and attenuation depend on composition in a correlated way. In the present work, for each of the three leading LHC-tuned hadronic interaction models, we allow a global shift $ΔX_\\text{max}$ of the predicted shower maximum, which is the same for every mass and energy, and a rescaling $R_\\text{Had}$ of the hadronic component at the ground level which is constant with the zenith angle.\n  We apply the analysis to 2297 events reconstructed with both the fluorescence and surface detectors of the Pierre Auger Observatory with energies $10^{18.5-19.0}$ eV and zenith angles below 60$^\\circ$. Given the modeling assumptions made in this analysis, the best fit reaches its optimum value when shifting the $X_\\text{max}$ predictions of hadronic interaction models to deeper values and increasing the hadronic signal. This change in the predicted $X_\\text{max}$ scale alleviates the previously identified model deficit in the hadronic signal (commonly called the muon puzzle) but does not fully remove it. Because of the size of the adjustments $ΔX_\\text{max}$ and $R_\\text{Had}$ and the large number of events in the sample, the statistical significance of need for these adjustments is large, greater than 5$σ_\\text{stat}$, even for the combination of the systematic experimental shifts within 1$σ_\\text{sys}$ that are the most favorable for the models.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14788v1"
    ],
    "publication_venue": "Proceedings of the 6th International Symposium on Ultra High Energy Cosmic Rays (UHECR 2022), Oct 3-7, 2022, Gran Sasso Science Institute, L'Aquila, Italy. Accepted for publications in EPJ Web of Conferences series",
    "doi": "10.1051/epjconf/202328302012"
}