{
    "arxiv_id": "2303.13517",
    "paper_title": "The Brighter-Fatter Effect in the JWST MIRI Si:As IBC detectors I. Observations, impact on science, and modelling",
    "authors": [
        "Ioannis Argyriou",
        "Craig Lage",
        "George H. Rieke",
        "Danny Gasman",
        "Jeroen Bouwman",
        "Jane Morrison",
        "Mattia Libralato",
        "Daniel Dicken",
        "Bernhard R. Brandl",
        "Javier Álvarez-Márquez",
        "Alvaro Labiano",
        "Michael Regan",
        "Michael E. Ressler"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM"
    ],
    "abstract": "The Mid-Infrared Instrument (MIRI) on board the James Webb Space Telescope (JWST) uses three Si:As impurity band conduction (IBC) detector arrays. The output voltage level of each MIRI detector pixel is digitally recorded by sampling-up-the-ramp. For uniform or low-contrast illumination, the pixel ramps become non-linear in a predictable way, but in areas of high contrast, the non-linearity curve becomes much more complex. We provide observational evidence of the Brighter-Fatter Effect (BFE) in MIRI conventional and high-contrast coronographic imaging, low-resolution spectroscopy, and medium-resolution spectroscopy data and investigate the physical mechanism that gives rise to the effect on the detector pixel raw voltage integration ramps. We use public data from the JWST/MIRI commissioning and Cycle 1 phase. We also develop a numerical electrostatic model of the MIRI detectors using a modified version of the public Poisson_CCD code. The physical mechanism behind the MIRI BFE is fundamentally different to that of CCDs and Hawaii-2RG (H2RG) detectors. This is due to the largest majority of the MIRI photo-excited electric charges not being stored at the pixels but at the input to the MIRI detector unit cell buffer amplifier capacitance. The resulting detector voltage debiasing alters the electrostatic potential inside the infrared-active layer and causes new photo-excited electrons, generated at a bright pixel, to be guided to the neighboring fainter pixels. Observationally, the debiasing-induced BFE makes the JWST MIRI data yield 10-25 % larger and 0.5-8 % brighter point sources and spectral line profiles as a function of the output level covered by the detector pixels. We find that the profile of the shrinking detector depletion region has implications for developing a pixel ramp non-linearity model for point sources observed with MIRI.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13517v1"
    ],
    "publication_venue": "14 pages, 11 figures"
}