{
    "arxiv_id": "2303.16885",
    "paper_title": "Multi-ensemble metrology by programming local rotations with atom movements",
    "authors": [
        "Adam L. Shaw",
        "Ran Finkelstein",
        "Richard Bing-Shiun Tsai",
        "Pascal Scholl",
        "Tai Hyun Yoon",
        "Joonhee Choi",
        "Manuel Endres"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "physics.atom-ph"
    ],
    "abstract": "Current optical atomic clocks do not utilize their resources optimally. In particular, an exponential gain could be achieved if multiple atomic ensembles were to be controlled or read-out individually, even without entanglement. However, controlling optical transitions locally remains an outstanding challenge for neutral atom based clocks and quantum computing platforms. Here we show arbitrary, single-site addressing for an optical transition via sub-wavelength controlled moves of tweezer-trapped atoms, which we perform with $99.84(5)\\%$ fidelity and with $0.1(2)\\%$ crosstalk to non-addressed atoms. The scheme is highly robust as it relies only on relative position changes of tweezers and requires no additional addressing beams. Using this technique, we implement single-shot, dual-quadrature readout of Ramsey interferometry using two atomic ensembles simultaneously, and show an enhancement of the usable interrogation time at a given phase-slip error probability, yielding a 2.55(9) dB gain over standard, single-ensemble methods. Finally, we program a sequence which performs local dynamical decoupling during Ramsey evolution to evolve three ensembles with variable phase sensitivities, a key ingredient of optimal clock interrogation. Our results demonstrate the potential of fully programmable quantum optical clocks even without entanglement and could be combined with metrologically useful entangled states in the future.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16885v1"
    ],
    "publication_venue": null
}