{
    "arxiv_id": "2303.11363",
    "paper_title": "The Strong Force meets the Dark Sector: a robust estimate of QCD uncertainties for anti-matter dark matter searches",
    "authors": [
        "Adil Jueid",
        "Jochem Kip",
        "Roberto Ruiz de Austri",
        "Peter Skands"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph",
        "astro-ph.HE"
    ],
    "abstract": "In dark-matter annihilation channels to hadronic final states, stable particles -- such as positrons, photons, antiprotons, and antineutrinos -- are produced via complex sequences of phenomena including QED/QCD radiation, hadronisation, and hadron decays. These processes are normally modelled by Monte Carlo event generators whose limited accuracy imply intrinsic QCD uncertainties on the predictions for indirect-detection experiments like Fermi-LAT, Pamela, IceCube or AMS-02. In this article, we perform a complete analysis of QCD uncertainties in antimatter spectra from dark-matter annihilation, based on parametric variations of the Pythia 8 event generator. After performing several retunings of light-quark fragmentation functions, we define a set of variations that span a conservative estimate of the QCD uncertainties. We estimate the effects on antimatter spectra for various annihilation channels and final-state particle species, and discuss their impact on fitted values for the dark-matter mass and thermally-averaged annihilation cross section. We find dramatic impacts which can go up to $\\mathcal{O}(40)$ GeV for uncertainties on the dark-matter mass and up to $\\mathcal{O}(10\\%)$ for the annihilation cross section. We provide the spectra in tabulated form including QCD uncertainties and code snippets to perform fast dark-matter fits, in this https://github.com/ajueid/qcd-dm.github.io.git repository.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11363v1"
    ],
    "publication_venue": "v1: 52 pages, 21 figures, and 9 tables"
}