{
    "arxiv_id": "2303.11626",
    "paper_title": "Numerical Fractional Optimal Control of Respiratory Syncytial Virus Infection in Octave/MATLAB",
    "authors": [
        "Silverio Rosa",
        "Delfim F. M. Torres"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "math.OC",
        "q-bio.PE"
    ],
    "abstract": "In this article, we develop a simple mathematical GNU Octave/MATLAB code that is easy to modify for the simulation of mathematical models governed by fractional-order differential equations, and for the resolution of fractional-order optimal control problems through Pontryagin's maximum principle (indirect approach to optimal control). For this purpose, a fractional-order model for the respiratory syncytial virus (RSV) infection is considered. The model is an improvement of one first proposed by the authors in [Chaos Solitons Fractals 117 (2018), 142--149]. The initial value problem associated with the RSV infection fractional model is numerically solved using Garrapa's fde12 solver and two simple methods coded here in Octave/MATLAB: the fractional forward {Euler's} method and the predict-evaluate-correct-evaluate (PECE) method of Adams--Bashforth--Moulton. A fractional optimal control problem is then formulated having treatment as the control. The fractional Pontryagin maximum principle is used to characterize the fractional optimal control and the extremals of the problem are determined numerically through the implementation of the forward-backward PECE method. The implemented algorithms are available on GitHub and, at the end of the paper, in appendixes, both for the uncontrolled initial value problem as well as for the fractional optimal control problem, using the free GNU Octave computing software and assuring compatibility with~MATLAB.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11626v1"
    ],
    "publication_venue": "This is a preprint of a paper whose final and definite form is published Open Access in 'Mathematics' at [https://doi.org/10.3390/math11061511]. The developed Octave/Matlab code is available at [https://github.com/SilverioRosa/numres-focp]",
    "doi": "10.3390/math11061511"
}