{
    "arxiv_id": "2303.08495",
    "paper_title": "Pesticide Mediated Critical Transition in Plant-Pollinator Networks",
    "authors": [
        "Arnab Chattopadhyay",
        "Amit Samadder",
        "Sabyasachi Bhattacharya"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.PE"
    ],
    "abstract": "Mutually beneficial interactions between plant and pollinators play an essential role in the biodiversity, stability of the ecosystem and crop production. Despite their immense importance, rapid decline events of pollinators are common worldwide in past decades. Excessive use of chemical pesticides is one of the most important threat to pollination in the current era of anthropogenic changes. Pesticides are applied to the plants to increase their growth by killing harmful pests and pollinators accumulates toxic pesticides from the interacting plants directly from the nectar and pollen. This has a significant adverse effect on the pollinator growth and the mutualism which in turn can cause an abrupt collapse of the community however predicting the fate of such community dynamics remains a blur under the alarming rise in the dependency of chemical pesticides. We mathematically modeled the influence of pesticides in a multispecies mutualistic community and used 105 real plant-pollinator networks sampled worldwide as well as simulated networks, to assess its detrimental effect on the plant-pollinator mutualistic networks. Our results indicate that the persistence of the community is strongly influenced by the level of pesticide and catastrophic and irreversible community collapse may occur due to pesticide. Furthermore, a species rich, highly nested community with low connectance and modularity has greater potential to function under the influence of pesticide. We finally proposed a realistic intervention strategy which involves the management of the pesticide level of one targeted plant from the community. We show that our intervention strategy can significantly delay the collapse of the community. Overall our study can be considered as the first attempt to understand the consequences of the chemical pesticide on a plant-pollinator mutualistic community.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08495v1"
    ],
    "publication_venue": null
}