{
    "arxiv_id": "2303.08089",
    "paper_title": "Retrieval of material properties of monolayer transition-metal dichalcogenides from magnetoexciton energy spectra",
    "authors": [
        "Duy-Nhat Ly",
        "Dai-Nam Le",
        "Duy-Anh P. Nguyen",
        "Ngoc-Tram D. Hoang",
        "Ngoc-Hung Phan",
        "Hoang-Minh L. Nguyen",
        "Van-Hoang Le"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "cond-mat.mtrl-sci",
        "cond-mat.str-el",
        "physics.comp-ph"
    ],
    "abstract": "Reduced exciton mass, polarizability, and dielectric constant of the surrounding medium are essential properties for semiconduction materials, and they can be extracted recently from the magnetoexciton energies. However, the acceptable accuracy of the previously suggested method requires very high magnetic intensity. Therefore, in the present paper, we propose an alternative method of extracting these material properties from recently available experimental magnetoexciton s-state energies in monolayer transition-metal dichalcogenides (TMDCs). The method is based on the high sensitivity of exciton energies to the material parameters in the Rytova-Keldysh model. It allows us to vary the considered material parameters to get the best fit of the theoretical calculation to the experimental exciton energies for the $1s$, $2s$, and $3s$ states. This procedure gives values of the exciton reduced mass and 2D polarizability. Then, the experimental magnetoexciton spectra compared to the theoretical calculation gives also the average dielectric constant. Concrete applications are presented only for monolayers WSe$_2$ and WS$_2$ from the recently available experimental data. However, the presented approach is universal and can be applied to other monolayer TMDCs. The mentioned fitting procedure requires a fast and effective method of solving the Schrödinger of an exciton in monolayer TMDCs with a magnetic field. Therefore, we also develop such a method in this study for highly accurate magnetoexciton energies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08089v1"
    ],
    "publication_venue": "8 pages, 4 figures, 4 tables"
}