{
    "arxiv_id": "2303.14494",
    "paper_title": "Combined field-only boundary integral equations for PEC electromagnetic scattering problem in spherical geometries",
    "authors": [
        "Luiz Faria",
        "Carlos Perez-arancibia",
        "Catalin Turc"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "math.NA"
    ],
    "abstract": "We analyze the well posedness of certain field-only boundary integral equations (BIE) for frequency domain electromagnetic scattering from perfectly conducting spheres. Starting from the observations that (1) the three components of the scattered electric field $\\mathbf{E}^s(\\mathbf{x})$ and (2) scalar quantity $\\mathbf{E}^s(\\mathbf{x})\\cdot\\mathbf{x}$ are radiative solutions of the Helmholtz equation, novel boundary integral equation formulations of electromagnetic scattering from perfectly conducting obstacles can be derived using Green's identities applied to the aforementioned quantities and the boundary conditions on the surface of the scatterer. The unknowns of these formulations are the normal derivatives of the three components of the scattered electric field and the normal component of the scattered electric field on the surface of the scatterer, and thus these formulations are referred to as field-only BIE. In this paper we use the Combined Field methodology of Burton and Miller within the field-only BIE approach and we derive new boundary integral formulations that feature only Helmholtz boundary integral operators, which we subsequently show to be well posed for all positive frequencies in the case of spherical scatterers. Relying on the spectral properties of Helmholtz boundary integral operators in spherical geometries, we show that the combined field-only boundary integral operators are diagonalizable in the case of spherical geometries and their eigenvalues are non zero for all frequencies. Furthermore, we show that for spherical geometries one of the field-only integral formulations considered in this paper exhibits eigenvalues clustering at one -- a property similar to second kind integral equations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14494v1"
    ],
    "publication_venue": null
}