{
    "arxiv_id": "2303.14564",
    "paper_title": "Compositional Neural Certificates for Networked Dynamical Systems",
    "authors": [
        "Songyuan Zhang",
        "Yumeng Xiu",
        "Guannan Qu",
        "Chuchu Fan"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 2,
    "categories": [
        "eess.SY"
    ],
    "abstract": "Developing stable controllers for large-scale networked dynamical systems is crucial but has long been challenging due to two key obstacles: certifiability and scalability. In this paper, we present a general framework to solve these challenges using compositional neural certificates based on ISS (Input-to-State Stability) Lyapunov functions. Specifically, we treat a large networked dynamical system as an interconnection of smaller subsystems and develop methods that can find each subsystem a decentralized controller and an ISS Lyapunov function; the latter can be collectively composed to prove the global stability of the system. To ensure the scalability of our approach, we develop generalizable and robust ISS Lyapunov functions where a single function can be used across different subsystems and the certificates we produced for small systems can be generalized to be used on large systems with similar structures. We encode both ISS Lyapunov functions and controllers as neural networks and propose a novel training methodology to handle the logic in ISS Lyapunov conditions that encodes the interconnection with neighboring subsystems. We demonstrate our approach in systems including Platoon, Drone formation control, and Power systems. Experimental results show that our framework can reduce the tracking error up to 75% compared with RL algorithms when applied to large-scale networked systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14564v1",
        "http://arxiv.org/pdf/2303.14564v2"
    ],
    "publication_venue": "25 pages, 8 figures; Accepted by 5th Annual Learning for Dynamics & Control Conference (L4DC) 2023"
}