{
    "arxiv_id": "2303.13180",
    "paper_title": "Prospective Dark Matter Annihilation Signals From the Sagittarius Dwarf Spheroidal",
    "authors": [
        "Thomas A. A. Venville",
        "Alan R. Duffy",
        "Roland M. Crocker",
        "Oscar Macias",
        "Thor Tepper-García"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The Sagittarius Dwarf Spheroidal galaxy (Sgr) is investigated as a target for DM annihilation searches utilizing J-factor distributions calculated directly from a high-resolution hydrodynamic simulation of the infall and tidal disruption of Sgr around the Milky Way. In contrast to past studies, the simulation incorporates DM, stellar and gaseous components for both the Milky Way and the Sgr progenitor galaxy. The simulated distributions account for significant tidal disruption affecting the DM density profile. Our estimate of the J-factor value for Sgr, $J_{\\text{Sgr}}=1.48\\times 10^{10}\\ \\text{M}^2_\\odot\\ \\text{kpc}^{-5}$ ($6.46\\times10^{16}\\ \\text{GeV}\\ \\text{cm}^{-5}$), is significantly lower than found in prior studies. This value, while formally a lower limit, is likely close to the true J-factor value for Sgr. It implies a DM cross-section incompatibly large in comparison with existing constraints would be required to attribute recently observed $γ$-ray emission from Sgr (Crocker, Macias et al. 2022; arXiv:2204.12054) to DM annihilation. We also calculate a J-factor value using an NFW profile fitted to the simulated DM density distribution to facilitate comparison with past studies. This NFW J-factor value supports the conclusion that most past studies have overestimated the dark matter density of Sgr on small scales. This, together with the fact that the Sgr has recently been shown to emit $γ$-rays of astrophysical origin, complicate the use of Sgr in indirect DM detection searches.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13180v1"
    ],
    "publication_venue": "13 pages, 20 figures. Submitted to MNRAS. Comments welcome"
}