{
    "arxiv_id": "2303.13108",
    "paper_title": "Adaptive wave-particle decomposition in UGKWP method for high-speed flow simulations",
    "authors": [
        "Yufeng Wei",
        "Junzhe Cao",
        "Xing Ji",
        "Kun Xu"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn",
        "physics.comp-ph"
    ],
    "abstract": "With wave-particle decomposition, a unified gas-kinetic wave-particle (UGKWP) method has been developed for the multiscale flow simulations. The UGKWP method captures the transport process in all flow regimes without kinetic solver's constraint on the numerical mesh size and time step being less than the particle mean free path and collision time. In the current UGKWP method, the cell's Knudsen number, defined as the ratio of collision time to numerical time step, is used to distribute the components in the wave-particle decomposition. However, the adaptation of particle in UGKWP is mainly for the capturing of the non-equilibrium transport, and the cell's Knudsen number alone is not enough to identify the non-equilibrium state. For example, in the equilibrium flow regime with a Maxwellian distribution function, even at a large cell's Knudsen number, the flow evolution can be still modelled by the Navier-Stokes solver. Therefore, to further improve the efficiency, an adaptive UGKWP (AUGKWP) method will be developed with the introduction of an additional local flow variable gradient-dependent Knudsen number. As a result, the wave-particle decomposition in UGKWP will be determined by both cell's and gradient's Knudsen numbers, and the particle in UGKWP is solely used to capture the non-equilibrium flow transport. The AUGKWP becomes much more efficient than the previous one with the cell's Knudsen number only in the determination of wave-particle composition. Many numerical tests, including Sod tube, shock structure, flow around a cylinder, flow around a reentry capsule, and an unsteady nozzle plume flow, have been conducted to validate the accuracy and efficiency of AUGKWP. Compared with the original UGKWP, the AUGKWP achieves the same accuracy but has advantages in memory reduction and computational efficiency in the simulation for the flow with the co-existing of multiple regimes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13108v1"
    ],
    "publication_venue": "arXiv admin note: substantial text overlap with arXiv:2211.12922"
}