{
    "arxiv_id": "2303.09369",
    "paper_title": "Earth tomography with supernova neutrinos at future neutrino detectors",
    "authors": [
        "Rasmi Hajjar",
        "Olga Mena",
        "Sergio Palomares-Ruiz"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph",
        "astro-ph.EP"
    ],
    "abstract": "Earth neutrino tomography is a realistic possibility with current and future neutrino detectors, complementary to geophysics methods. The two main approaches are based on either partial absorption of the neutrino flux as it propagates through the Earth (at energies about a few TeV) or on coherent Earth matter effects affecting the neutrino oscillations pattern (at energies below a few tens of GeV). In this work, we consider the latter approach focusing on supernova neutrinos with tens of MeV. Whereas at GeV energies, Earth matter effects are driven by the atmospheric mass-squared difference, at energies below $\\sim 100$~MeV, it is the solar mass-squared difference what controls them. Unlike solar neutrinos, which suffer from significant weakening of the contribution to the oscillatory effect from remote structures due to the neutrino energy reconstruction capabilities of detectors, supernova neutrinos can have higher energies and thus, can better probe the Earth's interior. We shall revisit this possibility, using the most recent neutrino oscillation parameters and up-to-date supernova neutrino spectra. The capabilities of future neutrino detectors, such as DUNE, Hyper-Kamiokande and JUNO are presented, including the impact of the energy resolution and other factors. Assuming a supernova burst at 10~kpc, we show that the average Earth's core density could be determined within $\\lesssim 10\\%$ at $1σ$ confidence level, being Hyper-Kamiokande, with its largest mass, the most promising detector to achieve this goal.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09369v1"
    ],
    "publication_venue": "25 pages, 9 figures"
}