{
    "arxiv_id": "2303.08490",
    "paper_title": "Strong Baseline and Bag of Tricks for COVID-19 Detection of CT Scans",
    "authors": [
        "Chih-Chung Hsu",
        "Chih-Yu Jian",
        "Chia-Ming Lee",
        "Chi-Han Tsai",
        "Sheng-Chieh Dai"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "eess.IV",
        "cs.CV"
    ],
    "abstract": "This paper investigates the application of deep learning models for lung Computed Tomography (CT) image analysis. Traditional deep learning frameworks encounter compatibility issues due to variations in slice numbers and resolutions in CT images, which stem from the use of different machines. Commonly, individual slices are predicted and subsequently merged to obtain the final result; however, this approach lacks slice-wise feature learning and consequently results in decreased performance. We propose a novel slice selection method for each CT dataset to address this limitation, effectively filtering out uncertain slices and enhancing the model's performance. Furthermore, we introduce a spatial-slice feature learning (SSFL) technique\\cite{hsu2022} that employs a conventional and efficient backbone model for slice feature training, followed by extracting one-dimensional data from the trained model for COVID and non-COVID classification using a dedicated classification model. Leveraging these experimental steps, we integrate one-dimensional features with multiple slices for channel merging and employ a 2D convolutional neural network (CNN) model for classification. In addition to the aforementioned methods, we explore various high-performance classification models, ultimately achieving promising results.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08490v1"
    ],
    "publication_venue": "technical report. Keywords: Spatial-Slice correlation, COVID-19 classification, convolutional neural networks, computed tomography"
}