{
    "arxiv_id": "2303.17249",
    "paper_title": "Model-agnostic explainable artificial intelligence for object detection in image data",
    "authors": [
        "Milad Moradi",
        "Ke Yan",
        "David Colwell",
        "Matthias Samwald",
        "Rhona Asgari"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2024-04-29"
    ],
    "latest_version": 3,
    "categories": [
        "cs.CV",
        "cs.AI"
    ],
    "abstract": "In recent years, deep neural networks have been widely used for building high-performance Artificial Intelligence (AI) systems for computer vision applications. Object detection is a fundamental task in computer vision, which has been greatly progressed through developing large and intricate deep learning models. However, the lack of transparency is a big challenge that may not allow the widespread adoption of these models. Explainable artificial intelligence is a field of research where methods are developed to help users understand the behavior, decision logics, and vulnerabilities of AI systems. Previously, few explanation methods were developed for object detection, based on the idea of random masks. However, random masks may raise some issues regarding the actual importance of pixels within an image. In this paper, we design and implement a black-box explanation method named Black-box Object Detection Explanation by Masking (BODEM) through adopting a hierarchical random masking approach for AI-based object detection systems. We propose a hierarchical random masking framework in which coarse-grained masks are used in lower levels to find salient regions within an image, and fine-grained mask are used to refine the salient regions in higher levels. Experimentations on various object detection datasets and models showed that BODEM can be effectively used to explain the behavior of object detectors. Moreover, our method outperformed Detector Randomized Input Sampling for Explanation (D-RISE) with respect to different quantitative measures of explanation effectiveness. The experimental results demonstrate that BODEM can be an effective method for explaining and validating object detection systems in black-box testing scenarios.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17249v1",
        "http://arxiv.org/pdf/2303.17249v2",
        "http://arxiv.org/pdf/2303.17249v3"
    ],
    "publication_venue": null
}