{
    "arxiv_id": "2303.10252",
    "paper_title": "Large-area synthesis of ferromagnetic Fe$_{5-x}$GeTe$_{2}$/graphene van der Waals heterostructures with Curie temperature above room temperature",
    "authors": [
        "H. Lv",
        "A. da Silva",
        "A. I. Figueroa",
        "C. Guillemard",
        "I. Fernández Aguirre",
        "L. Camosi",
        "L. Aballe",
        "M. Valvidares",
        "S. O. Valenzuela",
        "J. Schubert",
        "M. Schmidbauer",
        "J. Herfort",
        "M. Hanke",
        "A. Trampert",
        "R. Engel-Herbert",
        "M. Ramsteiner",
        "J. M. J. Lopes"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-07-14"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.app-ph"
    ],
    "abstract": "Van der Waals (vdW) heterostructures combining layered ferromagnets and other two-dimensional (2D) crystals are promising building blocks for the realization of ultra-compact devices with integrated magnetic, electronic and optical functionalities. Their implementation in various technologies depends strongly on the development of a bottom-up scalable synthesis approach allowing to realize highly uniform heterostructures with well-defined interfaces between different 2D layered materials. It also requires that each material component of the heterostructure remains functional, which ideally includes ferromagnetic order above room temperature for 2D ferromagnets. Here, we demonstrate large-area growth of Fe$_{5-x}$GeTe$_{2}$/graphene heterostructures achieved by vdW epitaxy of Fe$_{5-x}$GeTe$_{2}$ on epitaxial graphene. Structural characterization confirmed the realization of a continuous vdW heterostructure film with a sharp interface between Fe$_{5-x}$GeTe$_{2}$ and graphene. Magnetic and transport studies revealed that the ferromagnetic order persists well above 300 K with a perpendicular magnetic anisotropy. In addition, epitaxial graphene on SiC(0001) continues to exhibit a high electronic quality. These results represent an important advance beyond non-scalable flake exfoliation and stacking methods, thus marking a crucial step toward the implementation of ferromagnetic 2D materials in practical applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10252v1"
    ],
    "publication_venue": null,
    "doi": "10.1002/smll.202302387"
}