{
    "arxiv_id": "2303.10886",
    "paper_title": "A physical and concise halo model based on the depletion radius",
    "authors": [
        "Yifeng Zhou",
        "Jiaxin Han"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-08-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "We develop a self-consistent and accurate halo model by partitioning matter according to the depletion radii of haloes. Unlike conventional models that define haloes with the virial radius while relying on a separate exclusion radius or ad-hoc fixes to account for halo exclusion, our model distributes mass across all scales self-consistently. Using a cosmological simulation, we show that our halo definition leads to very simple and intuitive model components, with the one-halo term given by the Einasto profile with no truncation needed, and the halo-halo correlation function following a universal power-law form down to the halo boundary. The universal halo-halo correlation also allows us to easily model the distribution of unresolved haloes as well as diffuse matter. Convolving the halo profile with the halo-halo correlation function, we obtain a complete description of the halo-matter correlation across all scales, which self-consistently accounts for halo exclusion on the transition scale. Mass conservation is explicitly maintained in our model, and the scale dependence of the classical halo bias is easily reproduced. Our model can successfully reconstruct the halo-matter correlation function with percent level accuracy for halo virial masses in the range of $10^{11.5}h^{-1}{\\rm M}_{\\odot}<M_{\\rm vir}<10^{15.35}h^{-1}{\\rm M}_{\\odot}$ at $z=0$, and covers the radial range of $0.01h^{-1}{\\rm Mpc}<r<20h^{-1}{\\rm Mpc}$. We also show that our model profile can accurately predict the characteristic depletion radius at the minimum bias and the splash-back radius at the steepest density slope locations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10886v1"
    ],
    "publication_venue": "19 pages, 19 figures",
    "doi": "10.1093/mnras/stad2375"
}