{
    "arxiv_id": "2303.12549",
    "paper_title": "Flat Mittag-Leffler modules, and their relative and restricted versions",
    "authors": [
        "Jan Trlifaj"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2025-04-25"
    ],
    "latest_version": 1,
    "categories": [
        "math.RT",
        "math.AG"
    ],
    "abstract": "Assume that $R$ is a non-right perfect ring. Then there is a proper class of classes of (right $R$-) modules closed under transfinite extensions lying between the classes $\\mathcal P _0$ of projective modules, and $\\mathcal F _0$ of flat modules. These classes can be defined as variants of the class $\\mathcal F \\mathcal M$ of absolute flat Mittag-Leffler modules: either as their restricted versions (lying between $\\mathcal P _0$ and $\\mathcal F \\mathcal M$), or their relative versions (between $\\mathcal F \\mathcal M$ and $\\mathcal F _0$). In this survey, we will deal with applications of these classes in relative homological algebra and algebraic geometry.\n  The classes $\\mathcal P _0$ and $\\mathcal F _0$ are known to provide for approximations, and minimal approximations, respectively. We will show that the classes of restricted flat relative Mittag-Leffler modules, and flat relative Mittag-Leffler modules, have rather different approximation properties: the former classes always provide for approximations, but the latter do not, except for the boundary case of $\\mathcal F _0$.\n  The notion of an (infinite dimensional) vector bundle is known to be Zariski local for all schemes, the key point of the proof being that projectivity ascends and descends along flat and faithfully flat ring homomorphisms, respectively. We will see that the same holds for the properties of being a $κ$-restricted flat Mittag-Leffler module for each cardinal $κ\\geq \\aleph_0$, and also a flat $\\mathcal Q$-Mittag-Leffler module whenever $\\mathcal Q$ is a definable class of finite type. Thus, as in the model case of vector bundles, Zariski locality holds for flat quasi-coherent sheaves induced by each of these classes of modules. Moreover, we will see that the notion of a locally $n$-tilting quasi-coherent sheaf is Zariski local for all $n \\geq 0$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12549v1"
    ],
    "publication_venue": null,
    "doi": "10.1007/978-3-031-53063-0_7"
}