{
    "arxiv_id": "2303.12101",
    "paper_title": "Stellar associations powering HII regions $\\unicode{x2013}$ I. Defining an evolutionary sequence",
    "authors": [
        "Fabian Scheuermann",
        "Kathryn Kreckel",
        "Ashley T. Barnes",
        "Francesco Belfiore",
        "Brent Groves",
        "Stephen Hannon",
        "Janice C. Lee",
        "Rebecca Minsley",
        "Erik Rosolowsky",
        "Frank Bigiel",
        "Guillermo A. Blanc",
        "Médéric Boquien",
        "Daniel A. Dale",
        "Sinan Deger",
        "Oleg V. Egorov",
        "Eric Emsellem",
        "Simon C. O. Glover",
        "Kathryn Grasha",
        "Hamid Hassani",
        "Sarah Jeffreson",
        "Ralf S. Klessen",
        "J. M. Diederik Kruijssen",
        "Kirsten L. Larson",
        "Adam K. Leroy",
        "Laura Lopez",
        "Hsi-An Pan",
        "Patricia Sánchez-Blázquez",
        "Francesco Santoro",
        "Eva Schinnerer",
        "David A. Thilker",
        "Brad C. Whitmore",
        "Elizabeth J. Watkins",
        "Thomas G. Williams"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Connecting the gas in HII regions to the underlying source of the ionizing radiation can help us constrain the physical processes of stellar feedback and how HII regions evolve over time. With PHANGS$\\unicode{x2013}$MUSE we detect nearly 24,000 HII regions across 19 galaxies and measure the physical properties of the ionized gas (e.g. metallicity, ionization parameter, density). We use catalogues of multi-scale stellar associations from PHANGS$\\unicode{x2013}$HST to obtain constraints on the age of the ionizing sources. We construct a matched catalogue of 4,177 HII regions that are clearly linked to a single ionizing association. A weak anti-correlation is observed between the association ages and the H$α$ equivalent width EW(H$α$), the H$α$/FUV flux ratio and the ionization parameter, log q. As all three are expected to decrease as the stellar population ages, this could indicate that we observe an evolutionary sequence. This interpretation is further supported by correlations between all three properties. Interpreting these as evolutionary tracers, we find younger nebulae to be more attenuated by dust and closer to giant molecular clouds, in line with recent models of feedback-regulated star formation. We also observe strong correlations with the local metallicity variations and all three proposed age tracers, suggestive of star formation preferentially occurring in locations of locally enhanced metallicity. Overall, EW(H$α$) and log q show the most consistent trends and appear to be most reliable tracers for the age of an HII region.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12101v1"
    ],
    "publication_venue": "15 pages, 12 figures. Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad878"
}