{
    "arxiv_id": "2303.08555",
    "paper_title": "Tuning energy dissipation via topologically electro-convoluted lipid-membrane boundary layers",
    "authors": [
        "Di Jin",
        "Jacob Klein"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-06-27"
    ],
    "latest_version": 4,
    "categories": [
        "cond-mat.soft",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "It was recently discovered that friction between surfaces bearing phosphatidylcholine (PC) lipid bilayers can be increased by two orders of magnitude or more via an externally-applied electric field, and that this increase is fully reversible when the field is switched off. While this striking effect holds promising application potential, its molecular origin remains unknown due to difficulty in experimentally probing confined membrane structure at a molecular level. Our earlier molecular dynamics simulations revealed the equilibrium electroporated structure of such confined lipid membranes under an electric field; here we extend this approach to study the associated sliding friction between two solid surfaces across such PC bilayers. We identify the enhanced friction in the field as arising from membrane undulations due to the electroporation; this leads to some dehydration at the lipid-water interfaces, leading to closer contact and thus increased attraction between the zwitterionic headgroups, which results in increased frictional dissipation between the bilayers as they slide past each other. Additionally, the electric field facilitates formation of lipid bridges spanning the intersurface gap; at the sliding velocities of the experiments, these bridges increase the friction by topologically-forcing the slip-plane to pass through the acyl tail-tail interface, associated with higher dissipation during sliding. Our results account quantitatively for the experimentally-observed electro-modulated friction with boundary lipid bilayers, and indicate more generally how they may affect interactions between contacting surfaces, where high local transverse fields may be ubiquitous.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08555v1",
        "http://arxiv.org/pdf/2303.08555v2",
        "http://arxiv.org/pdf/2303.08555v3",
        "http://arxiv.org/pdf/2303.08555v4"
    ],
    "publication_venue": null
}