{
    "arxiv_id": "2303.16217",
    "paper_title": "Milky Way and Andromeda analogs from the TNG50 simulation",
    "authors": [
        "Annalisa Pillepich",
        "Diego Sotillo-Ramos",
        "Rahul Ramesh",
        "Dylan Nelson",
        "Christoph Engler",
        "Vicente Rodriguez-Gomez",
        "Martin Fournier",
        "Martina Donnari",
        "Volker Springel",
        "Lars Hernquist"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present the properties of Milky Way- and Andromeda-like (MW/M31-like) galaxies simulated within TNG50, the highest-resolution run of the IllustrisTNG suite of $Λ$CDM magneto-hydrodynamical simulations. We introduce our fiducial selection for MW/M31 analogs, which we propose for direct usage as well as for reference in future analyses. TNG50 contains 198 MW/M31 analogs, i.e. galaxies with stellar disky morphology, with a stellar mass in the range of $M_* = 10^{10.5 - 11.2}$ Msun, and within a MW-like Mpc-scale environment at z=0. These are resolved with baryonic (dark matter) mass resolution of $8.5\\times10^4$ Msun ($4.5\\times10^5$ Msun) and $\\sim150$ pc of average spatial resolution in the star-forming regions: we therefore expand by many factors (2 orders of magnitude) the sample size of cosmologically-simulated analogs with similar ($\\times 10$ better) numerical resolution. The majority of TNG50 MW/M31 analogs at $z=0$ exhibit a bar, 60 per cent are star-forming, the sample includes 3 Local Group (LG)-like systems, and a number of galaxies host one or more satellites as massive as e.g. the Magellanic Clouds. Even within such a relatively narrow selection, TNG50 reveals a great diversity in galaxy and halo properties, as well as in past histories. Within the TNG50 sample, it is possible to identify several simulated galaxies whose integral and structural properties are consistent, one or more at a time, with those measured for the Galaxy and Andromeda. With this paper, we document and release a series of broadly applicable data products that build upon the IllustrisTNG public release and aim to facilitate easy access and analysis by public users. These include datacubes across snapshots ($0 \\le z \\le 7$) for each TNG50 MW/M31-like galaxy, and a series of value-added catalogs that will be continually expanded to provide a convenient and up to date community resource.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16217v1"
    ],
    "publication_venue": "Submitted to MNRAS. Feedback from the community encouraged. This is also a data-release paper: see visuals and documentation at https://www.tng-project.org/data/milkyway+andromeda/. See other TNG50 MW/M31-based papers also on astro-ph today: Ramesh+ and Sotillo-Ramos+"
}