{
    "arxiv_id": "2303.17759",
    "paper_title": "Classical Novae in the ASKAP Pilot Surveys",
    "authors": [
        "Ashna Gulati",
        "Tara Murphy",
        "David L. Kaplan",
        "Roberto Soria",
        "James K. Leung",
        "Yuanming Wang",
        "Joshua Pritchard",
        "Emil Lenc",
        "Stefan W. Duchesne",
        "Andrew O'Brien"
    ],
    "submission_date": "2023-03-31",
    "revised_dates": [
        "2023-05-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE"
    ],
    "abstract": "We present a systematic search for radio counterparts of novae using the Australian Square Kilometer Array Pathfinder (ASKAP). Our search used the Rapid ASKAP Continuum Survey, which covered the entire sky south of declination $+41^{\\circ}$ ($\\sim34,000$ square degrees) at a central frequency of 887.5 MHz, the Variables and Slow Transients Pilot Survey, which covered $\\sim5,000$ square degrees per epoch (887.5 MHz), and other ASKAP pilot surveys, which covered $\\sim200-2000$ square degrees with 2-12 hour integration times. We crossmatched radio sources found in these surveys over a two-year period, from April 2019 to August 2021, with 440 previously identified optical novae, and found radio counterparts for four novae: V5668 Sgr, V1369 Cen, YZ Ret, and RR Tel. Follow-up observations with the Australian Telescope Compact Array confirm the ejecta thinning across all observed bands with spectral analysis indicative of synchrotron emission in V1369 Cen and YZ Ret. Our light-curve fit with the Hubble Flow model yields a value of $1.65\\pm 0.17 \\times 10^{-4} \\rm \\:M_\\odot$ for the mass ejected in V1369 Cen. We also derive a peak surface brightness temperature of $250\\pm80$ K for YZ Ret. Using Hubble Flow model simulated radio lightcurves for novae, we demonstrate that with a 5$σ$ sensitivity limit of 1.5 mJy in 15-min survey observations, we can detect radio emission up to a distance of 4 kpc if ejecta mass is in the range $10^{-3}\\rm \\:M_\\odot$, and upto 1 kpc if ejecta mass is in the range $10^{-5}-10^{-3}\\rm \\:M_\\odot$. Our study highlights ASKAP's ability to contribute to future radio observations for novae within a distance of 1 kpc hosted on white dwarfs with masses $0.4-1.25\\:\\rm M_\\odot$ , and within a distance of 4 kpc hosted on white dwarfs with masses $0.4-1.0\\:\\rm M_\\odot$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17759v1"
    ],
    "publication_venue": "This paper has been accepted for publication in PASA. It consists of 13 pages, 5 figures and 4 tables",
    "doi": "10.1017/pasa.2023.21"
}