{
    "arxiv_id": "2303.15979",
    "paper_title": "Imaging and spectroscopic observations of extreme-ultraviolet brightenings using EUI and SPICE on board Solar Orbiter",
    "authors": [
        "Ziwen Huang",
        "L. Teriaca",
        "R. Aznar Cuadrado",
        "L. P. Chitta",
        "S. Mandal",
        "H. Peter",
        "U. Schühle",
        "S. K. Solanki",
        "F. Auchère",
        "D. Berghmans",
        "É. Buchlin",
        "M. Carlsson",
        "A. Fludra",
        "T. Fredvik",
        "A. Giunta",
        "T. Grundy",
        "D. Hassler",
        "S. Parenti",
        "F. Plaschke"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "The smallest extreme-ultraviolet (EUV) brightening events that were detected so far, called campfires, have recently been uncovered by the High Resolution EUV telescope (HRIEUV), which is part of the Extreme Ultraviolet Imager (EUI) on board Solar Orbiter. HRIEUV has a broad bandpass centered at 17.4 nm that is dominated by Fe ix and Fe x emission at about 1 MK. We study the thermal properties of EUI brightening events by simultaneously observing their responses at different wavelengths using spectral data from the Spectral Imaging of the Coronal Environment (SPICE) also on board Solar Orbiter and imaging data from EUI. We studied three EUI brightenings that were identified in HRIEUV data that lie within the small areas covered by the slit of the SPICE EUV spectrometer. We obtained the line intensities of the spectral profiles by Gaussian fitting. These diagnostics were used to study the evolution of the EUI brightenings over time at the different line-formation temperatures. We find that (i) the detection of these EUI brightenings is at the limit of the SPICE capabilities. They could not have been independently identified in the data without the aid of HRIEUV observations. (ii) Two of these EUI brightenings with longer lifetimes are observed up to Ne viii temperatures (0.6 MK). (iii) All of the events are detectable in O vi (0.3 MK), and the two longer-lived events are also detected in other transition region (TR) lines. (iv) In one case, we observe two peaks in the intensity light curve of the TR lines that are separated by 2.7 min for C iii and 1.2 min for O vi. The Ne viii intensity shows a single peak between the two peak times of the TR line intensity. Spectral data from SPICE allow us to follow the thermal properties of EUI brightenings. Our results indicate that at least some EUI brightenings barely reach coronal temperatures.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15979v1"
    ],
    "publication_venue": "13 pages, 16 figures, language editing, accepted in A&A",
    "doi": "10.1051/0004-6361/202345988"
}