{
    "arxiv_id": "2303.11244",
    "paper_title": "Machine learning assisted phase and size-controlled synthesis of iron oxides",
    "authors": [
        "Juejing Liu",
        "Zimeng Zhang",
        "Xiaoxu Li",
        "Meirong Zong",
        "Yining Wang",
        "Suyun Wang",
        "Ping Chen",
        "Zaoyan Wan",
        "yatong Zhao",
        "Lili Liu",
        "Yangang Liang",
        "Wei Wang",
        "Zheming Wang",
        "Shiren Wang",
        "Xiaofeng Guo",
        "Emily G. Saldanha",
        "Kevin M. Rosso",
        "Xin Zhang"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-08-10"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "The controllable synthesis of iron oxides particles is a critical issue for materials science, energy storage, biomedical applications, environmental science, and earth science. However, synthesis of iron oxides with desired phase and size are still a time-consuming and trial-and-error process. This study presents solutions for two fundamental challenges in materials synthesis: predicting the outcome of a synthesis from specified reaction parameters and correlating sets of parameters to obtain products with desired outcomes. Four machine learning algorithms, including random forest, logistic regression, support vector machine, and k-nearest neighbor, were trained to predict the phase and particle size of iron oxide based on experimental conditions. Among the models, random forest exhibited the best performance, achieving 96% and 81% accuracy when predicting the phase and size of iron oxides in the test dataset. Premutation feature importance analysis shows that most models (except logistic regression) rely on known features such as precursor concentration, pH, and temperature to predict the phases from synthesis conditions. The robustness of the random forest models was further verified by comparing prediction and experimental results based on 24 randomly generated methods in additive and non-additive systems not included in the datasets. The predictions of product phase and particle size from the models are in good agreement with the experimental results. Additionally, a searching and ranking algorithm was developed to recommend potential synthesis parameters for obtaining iron oxide products with desired phase and particle size from previous studies in the dataset.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11244v1"
    ],
    "publication_venue": "See link below for Supporting Information. https://docs.google.com/document/d/1boiUQtlBoc4nvXPoVDMkc4RCg2isWtZ5/edit?usp=sharing&ouid=108731997922646321851&rtpof=true&sd=true",
    "doi": "10.1016/j.cej.2023.145216"
}