{
    "arxiv_id": "2303.08547",
    "paper_title": "Simultaneous Quantum Squeezing of Light Polarizations and Atomic Spins in a Cold Atomic Gas",
    "authors": [
        "Jinzhong Zhu",
        "Yue Mu",
        "Guoxiang Huang"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "physics.optics"
    ],
    "abstract": "We present a scheme to realize simultaneous quantum squeezing of light polarizations and atomic spins via a perturbed double electromagnetically induced transparency (DEIT) in a cold four-level atomic ensemble coupled with a probe laser pulse of two polarization components. We derive two coupled quantum nonlinear Schrödinger equations from Maxwell-Heisenberg-Langevin equations describing the quantum dynamics of the atoms and the probe pulse, and develop a quantum theory of vector optical soliton (VOS), which have ultraslow propagation velocity and extremely low generation power. We solve the non-Hermitian eigenvalue problem describing the quantum fluctuations on the background of the VOS, and rigorously prove that all fluctuation eigenmodes (including continuous modes and four zero modes) obtained constitute a bi-orthonormal and complete set. We find that, due to the giant self- and cross-Kerr nonlinearities contributed by the perturbed DEIT, a large polarization squeezing of the probe pulse can be realized. We also find that, together with the polarization squeezing of the probe pulses, a significant squeezing of atomic spins also occurs simultaneously. The results of the simultaneous squeezing of light polarizations and atomic spins by using only a coherent probe pulse reported here opens a route for uncovering the unique property of the quantum interface between light and atomic ensembles, and also for applications in quantum information and precision measurement.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08547v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevA.107.033517"
}