{
    "arxiv_id": "2303.12805",
    "paper_title": "Digital Twins for Trust Building in Autonomous Drones through Dynamic Safety Evaluation",
    "authors": [
        "Danish Iqbal",
        "Barbora Buhnova",
        "Emilia Cioroaica"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cs.OH",
        "cs.RO",
        "eess.SY"
    ],
    "abstract": "The adoption process of innovative software-intensive technologies leverages complex trust concerns in different forms and shapes. Perceived safety plays a fundamental role in technology adoption, being especially crucial in the case of those innovative software-driven technologies characterized by a high degree of dynamism and unpredictability, like collaborating autonomous systems. These systems need to synchronize their maneuvers in order to collaboratively engage in reactions to unpredictable incoming hazardous situations. That is however only possible in the presence of mutual trust.\n  In this paper, we propose an approach for machine-to-machine dynamic trust assessment for collaborating autonomous systems that supports trust-building based on the concept of dynamic safety assurance within the collaborative process among the software-intensive autonomous systems. In our approach, we leverage the concept of digital twins which are abstract models fed with real-time data used in the run-time dynamic exchange of information. The information exchange is performed through the execution of specialized models that embed the necessary safety properties. More particularly, we examine the possible role of the Digital Twins in machine-to-machine trust building and present their design in supporting dynamic trust assessment of autonomous drones. Ultimately, we present a proof of concept of direct and indirect trust assessment by employing the Digital Twin in a use case involving two autonomous collaborating drones.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12805v1"
    ],
    "publication_venue": "Proceedings of ENASE 2023"
}