{
    "arxiv_id": "2303.15113",
    "paper_title": "Describing and Organizing Semantic Web and Machine Learning Systems in the SWeMLS-KG",
    "authors": [
        "Fajar J. Ekaputra",
        "Majlinda Llugiqi",
        "Marta Sabou",
        "Andreas Ekelhart",
        "Heiko Paulheim",
        "Anna Breit",
        "Artem Revenko",
        "Laura Waltersdorfer",
        "Kheir Eddine Farfar",
        "Sören Auer"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.AI"
    ],
    "abstract": "In line with the general trend in artificial intelligence research to create intelligent systems that combine learning and symbolic components, a new sub-area has emerged that focuses on combining machine learning (ML) components with techniques developed by the Semantic Web (SW) community - Semantic Web Machine Learning (SWeML for short). Due to its rapid growth and impact on several communities in the last two decades, there is a need to better understand the space of these SWeML Systems, their characteristics, and trends. Yet, surveys that adopt principled and unbiased approaches are missing. To fill this gap, we performed a systematic study and analyzed nearly 500 papers published in the last decade in this area, where we focused on evaluating architectural, and application-specific features. Our analysis identified a rapidly growing interest in SWeML Systems, with a high impact on several application domains and tasks. Catalysts for this rapid growth are the increased application of deep learning and knowledge graph technologies. By leveraging the in-depth understanding of this area acquired through this study, a further key contribution of this paper is a classification system for SWeML Systems which we publish as ontology.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15113v1"
    ],
    "publication_venue": "Preprint of a paper in the resource track of the 20th Extended Semantic Web Conference (ESWC'23)"
}