{
    "arxiv_id": "2303.14141",
    "paper_title": "\"Water to the ropes\": a predictive model for the supercontraction stress of spider silks",
    "authors": [
        "Vincenzo Fazio",
        "Nicola Maria Pugno",
        "Giuseppe Puglisi"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft"
    ],
    "abstract": "When humidified at different moisture conditions, restrained spider silk fibers can exhibit a very high supercontraction phenomenon. The hydration water molecules induce a Hydrogen-bonds disruption process that, due to entropic effects, decreases the natural -- zero force -- end-to-end chains length. By considering a bundle of macromolecules, we describe supercontraction as a possible actuation system and determine the maximum actuation force depending on the silk properties at the molecular scale and on the constraining system representing other silk threads or the actuated device. The comparison with experimental results of Argiope trifasciata silk fibers show the effectiveness of the proposed model in quantitatively predicting the experimental actuation properties. The considered historical case study of obelisk rescue in Saint Peter's Square (Rome) through ropes hydration is discussed evidencing the optimal performances of this natural material adopted as moisture powered actuator: we obtain a work density of 2.19 kJ/m3 making spider silk the most performant hydration driven active material. Moreover we obtain a power density of the order of 730 W/kg about three times the most performant carbon nanotube actuators making such material very competitive as compared with all types of actuator. The analytic description of the macroscopic actuation parameters from microscale properties shows the possibility of adopting our approach also in the field of bioinspired artificial silks design, possibly considering also important non-linear effects in the actuated system.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14141v1"
    ],
    "publication_venue": null
}