{
    "arxiv_id": "2303.11662",
    "paper_title": "Seeing through the CO2 plume: joint inversion-segmentation of the Sleipner 4D Seismic Dataset",
    "authors": [
        "Juan Romero",
        "Nick Luiken",
        "Matteo Ravasi"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-10-25"
    ],
    "latest_version": 1,
    "categories": [
        "physics.geo-ph"
    ],
    "abstract": "4D seismic inversion is the leading method to quantitatively monitor fluid flow dynamics in the subsurface, with applications ranging from enhanced oil recovery to subsurface CO2 storage. The process of inverting seismic data for reservoir properties is, however, a notoriously ill-posed inverse problem due to the band-limited and noisy nature of seismic data. This comes with additional challenges for 4D applications, given inaccuracies in the repeatability of the time-lapse acquisition surveys. Consequently, adding prior information to the inversion process in the form of properly crafted regularization terms is essential to obtain geologically meaningful subsurface models. Motivated by recent advances in the field of convex optimization, we propose a joint inversion-segmentation algorithm for 4D seismic inversion, which integrates Total-Variation and segmentation priors as a way to counteract the missing frequencies and noise present in 4D seismic data. The proposed inversion framework is applied to a pair of surveys from the open Sleipner 4D Seismic Dataset. Our method presents three main advantages over state-of-the-art least-squares inversion methods: 1. it produces high-resolution baseline and monitor acoustic models, 2. by leveraging similarities between multiple data, it mitigates the non-repeatable noise and better highlights the real time-lapse changes, and 3. it provides a volumetric classification of the acoustic impedance 4D difference model (time-lapse changes) based on user-defined classes. Such advantages may enable more robust stratigraphic and quantitative 4D seismic interpretation and provide more accurate inputs for dynamic reservoir simulations. Alongside our novel inversion method, in this work, we introduce a streamlined data pre-processing sequence for the 4D Sleipner post-stack seismic dataset, which includes time-shift estimation and well-to-seismic tie.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11662v1"
    ],
    "publication_venue": "This paper proposes a novel algorithm to jointly regularize a 4D seismic inversion problem and segment the 4D difference volume into percentages of acoustic impedance changes. We validate our algorithm with the 4D Sleipner seismic dataset. Furthermore, this paper comprehensively explains the data preparation workflow for 4D seismic inversion",
    "doi": "10.1190/tle42070457.1"
}