{
    "arxiv_id": "2303.09997",
    "paper_title": "Banach algebras associated to twisted étale groupoids: inverse semigroup disintegration and representations on $L^p$-spaces",
    "authors": [
        "Krzysztof Bardadyn",
        "Bartosz K. Kwaśniewski",
        "Andrew McKee"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2024-01-29"
    ],
    "latest_version": 3,
    "categories": [
        "math.FA",
        "math.OA"
    ],
    "abstract": "We introduce Banach algebras associated to a twisted étale groupoid $(\\mathcal{G},\\mathcal{L})$ and to twisted inverse semigroup actions. This provides a unifying framework for numerous recent papers on $L^p$-operator algebras and the theory of groupoid $C^*$-algebras. We prove a disintegration theorem that allows us to study Banach algebras associated to $(\\mathcal{G},\\mathcal{L})$ as universal Banach algebras generated by $C_0(X)$ and a twisted inverse semigroup $S$ of partial isometries subject to some relations. Our theory works best when the groupoid is ample or when the target of a representation is a dual Banach algebra $B$, so for instance $B=B(E)$ where $E$ is a reflexive Banach space. In particular, it implies that in the constructions of $L^p$-analogues of Cuntz or graph algebras, by Phillips and Cortiñas--Rodríguez, the use of \\emph{spatial partial isometries} is not an assumption, in fact it is forced by the relations.\n  We establish fundamental norm estimates and hierarchy for full and reduced $L^p$-operator algebras for $(\\mathcal{G},\\mathcal{L})$ and $p \\in [1,\\infty]$, whose special cases have been studied recently by Gardella--Lupini, Choi--Gardella--Thiel and Hetland--Ortega. We also introduce tight inverse semigroup Banach algebras that cover ample groupoid Banach algebras, and we discuss Banach algebras associated to twisted partial group actions, twisted Renault--Deaconu groupoids and directed graphs. Our Banach Cuntz algebras are related to the construction of Daws--Horváth.\n  We aim for a high degree of generality throughout: our results cover non-Hausdorff étale groupoids and both real and complex algebras. Some of our results seem to be absent from the literature even for $C^*$-algebras.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09997v1",
        "http://arxiv.org/pdf/2303.09997v2",
        "http://arxiv.org/pdf/2303.09997v3"
    ],
    "publication_venue": "The definition of a groupoid Banach algebra now involves a specified inverse semigroup, which allows us to correct a problem in Proposition 4.21 of the previous version. A question concerning the real case (Remark 2.13 of the previous version) is now solved. Updates to the rest of the manuscript reflect these two main changes"
}