{
    "arxiv_id": "2303.14436",
    "paper_title": "Design of a Smart Waste Management System for the City of Johannesburg",
    "authors": [
        "Beauty L. Komane",
        "Topside E. Mathonsi"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.GT",
        "cs.AI"
    ],
    "abstract": "Every human being in this world produces waste. South Africa is a developing country with many townships that have limited waste resources. Over-increasing population growth overpowers the volume of most municipal authorities to provide even the most essential services. Waste in townships is produced via littering, dumping of bins, cutting of trees, dumping of waste near rivers, and overrunning of waste bins. Waste increases diseases, air pollution, and environmental pollution, and lastly increases gas emissions that contribute to the release of greenhouse gases. The ungathered waste is dumped widely in the streets and drains contributing to flooding, breeding of insects, rodent vectors, and spreading of diseases. Therefore, the aim of this paper is to design a smart waste management system for the city of Johannesburg. The city of Johannesburg contains waste municipality workers and has provided some areas with waste resources such as waste bins and trucks for collecting waste. But the problem is that the resources only are not enough to solve the problem of waste in the city. The waste municipality uses traditional ways of collecting waste such as going to each street and picking up waste bins. The traditional way has worked for years but as the population is increasing more waste is produced which causes various problems for the waste municipalities and the public at large. The proposed system consists of sensors, user applications, and a real-time monitoring system. This paper adopts the experimental methodology.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14436v1"
    ],
    "publication_venue": null
}