{
    "arxiv_id": "2303.13498",
    "paper_title": "Sign structure of the $t$-$t^\\prime$-$J$ model and its physical consequences",
    "authors": [
        "Xin Lu",
        "Jia-Xin Zhang",
        "Shou-Shu Gong",
        "D. N. Sheng",
        "Zheng-Yu Weng"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2024-10-14"
    ],
    "latest_version": 4,
    "categories": [
        "cond-mat.str-el",
        "cond-mat.supr-con"
    ],
    "abstract": "Understanding the doped Mott insulator is a central challenge in condensed matter physics. In this work, we first explicitly identify a new sign structure in the $t$-$t'$-$J$ model on the square lattice that replaces the conventional Fermi statistics for weakly interacting electrons. Then we show that the singular, i.e., the phase-string part of the sign structure in the partition function can be precisely turned off in a modified model. The density matrix renormalization group method is then employed to study these two models comparatively on finite-size systems, which is designed to unveil the consequences of the phase-string component. We find that the hole pairing is present not only in the quasi-long-range superconducting phase but also in the stripe phase of the $t$-$t'$-$J$ model. However, once the phase-string is switched off, both the superconducting and stripe orders together with the underlying hole pairing disappear. The corresponding ground state reduces to a trivial Fermi-liquid-like state with small hole Fermi pockets that is decoupled from the antiferromagnetic spin background. It is in sharp contrast to the original $t$-$t'$-$J$ model where large Fermi surfaces can be restored in the stripe phase found at $t'/t<0$ or the superconducting phase at $t'/t>0$ in the six-leg ladder calculation. Our study clearly demonstrates that the strong correlation effect in doped Mott insulator should be mainly attributed to the long-range quantum entanglement between the spin and charge, which is, non-perturbatively, beyond a simple spin-charge separation under the no double occupancy constraint.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13498v1",
        "http://arxiv.org/pdf/2303.13498v2",
        "http://arxiv.org/pdf/2303.13498v3",
        "http://arxiv.org/pdf/2303.13498v4"
    ],
    "publication_venue": "19 pages, 16 figures",
    "doi": "10.1103/PhysRevB.110.165127"
}