{
    "arxiv_id": "2303.10710",
    "paper_title": "Parity-Odd 3-Point Functions from CFT in Momentum Space and the Chiral Anomaly",
    "authors": [
        "Claudio Corianò",
        "Stefano Lionetti",
        "Matteo Maria Maglio"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-07-10"
    ],
    "latest_version": 3,
    "categories": [
        "hep-th",
        "hep-ph"
    ],
    "abstract": "We illustrate how the Conformal Ward Identities (CWI) in momentum space for parity-odd correlators determine the structure of a chiral anomaly interaction, taking the example of the AVV (axial-vector/vector/vector) and AAA correlators in momentum space. Only the conservation and the anomalous WIs, together with the Bose symmetry, are imposed from the outset for the determination of the correlators. We use a longitudinal/transverse decomposition of tensor structures and form factors. The longitudinal (L) component is fixed by the anomaly content and the anomaly pole, while in the transverse (T) sector we define a new parameterization. We relate the latter both to the Rosenberg original representation of the AVV and to the longitudinal/transverse (L/T) one, first introduced in the analysis of $g-2$ of the muon in the investigation of the diagram in the chiral limit of QCD. The correlators are completely identified by the conformal constraints whose solutions are fixed only by the anomaly coefficient, the residue of the anomaly pole. In both cases, our CFT result matches the one-loop perturbative expression, as expected. The CWIs for correlators of mixed chirality $J_L J_R J$ generate solutions in agreement with the all-orders nonrenormalization theorems of perturbative QCD and in the chiral limit.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10710v1",
        "http://arxiv.org/pdf/2303.10710v2",
        "http://arxiv.org/pdf/2303.10710v3"
    ],
    "publication_venue": "33 pages, 2 figures, published version",
    "doi": "10.1140/epjc/s10052-023-11661-1"
}