{
    "arxiv_id": "2303.16230",
    "paper_title": "Spin-induced offset stream self-crossing shocks in tidal disruption events",
    "authors": [
        "Taj Jankovič",
        "Clément Bonnerot",
        "Andreja Gomboc"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Tidal disruption events occur when a star is disrupted by a supermassive black hole, resulting in an elongated stream of gas that partly falls back to pericenter. Due to apsidal precession, the returning stream may collide with itself, leading to a self-crossing shock that launches an outflow. If the black hole spins, this collision may additionally be affected by Lense-Thirring precession that can cause an offset between the two stream components. We study the impact of this effect on the outflow properties by carrying out local simulations of collisions between offset streams. As the offset increases, we find that the geometry of the outflow becomes less spherical and more collimated along the directions of the incoming streams, with less gas getting unbound by the interaction. However, even the most grazing collisions we consider significantly affect the trajectories of the colliding gas, likely promoting subsequent strong interactions near the black hole and rapid disc formation. We analytically compute the dependence of the offset to stream width ratio, finding that even slowly spinning black holes can cause both strong and grazing collisions. We propose that the deviation from outflow sphericity may enhance the self-crossing shock luminosity due to a reduction of adiabatic losses, and cause significant variations of the efficiency at which X-ray radiation from the disc is reprocessed to the optical band depending on the viewing angle. These potentially observable features hold the promise of constraining the black hole spin from tidal disruption events.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16230v1"
    ],
    "publication_venue": "14 pages, 11 figures, submitted to MNRAS. Movies from the simulations are available at https://github.com/tajjankovic/Spin-induced-offset-stream-self-crossing-shocks-in-TDEs/tree/main/Movies. Comments welcome!\""
}