{
    "arxiv_id": "2303.10054",
    "paper_title": "Scaling of fronts and entanglement spreading during a domain wall melting",
    "authors": [
        "Stefano Scopa",
        "Dragi Karevski"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-09-27"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.stat-mech",
        "quant-ph"
    ],
    "abstract": "We revisit the out-of-equilibrium physics arising during the unitary evolution of a one-dimensional XXZ spin chain initially prepared in a domain wall state $\\vertψ_0\\rangle=\\vert\\dots \\uparrow\\uparrow\\downarrow\\downarrow\\dots\\rangle$. In absence of interactions, we review the exact lattice calculation of several conserved quantities, including e.g. the magnetization and the spin current profiles. At large distances $x$ and times $t$, we show how these quantities allow for a ballistic scaling behavior in terms of the scaling variable $ζ= x/t$, with exactly computable scaling functions. In such a limit of large space-time scales, we show that the asymptotic behavior of the system is suitably captured by the local occupation function of spinless fermionic modes, whose semi-classical evolution in phase space is given by a Euler hydrodynamic equation. Similarly, analytical results for the asymptotic fronts dynamics are obtained for the interacting chain via Generalized Hydrodynamics. In the last part of the work, we include large-scale quantum fluctuations on top of the semi-classical hydrodynamic background in the form of a conformal field theory that lives along the evolving Fermi contour. With this procedure, dubbed quantum generalized hydrodynamics, it is possible to obtain exact asymptotic results for the entanglement spreading during the melting dynamics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10054v1"
    ],
    "publication_venue": "40 pages, 9 figures; To appear in Eur. Phys. J. Spec. Top",
    "doi": "10.1140/epjs/s11734-023-00845-1"
}