{
    "arxiv_id": "2303.12105",
    "paper_title": "Noise analysis in the Indian Pulsar Timing Array Data Release I",
    "authors": [
        "Aman Srivastava",
        "Shantanu Desai",
        "Neel Kolhe",
        "Mayuresh Surnis",
        "Bhal Chandra Joshi",
        "Abhimanyu Susobhanan",
        "Aurélien Chalumeau",
        "Shinnosuke Hisano",
        "Nobleson K.",
        "Swetha Arumugam",
        "Divyansh Kharbanda",
        "Jaikhomba Singha",
        "Pratik Tarafdar",
        "P Arumugam",
        "Manjari Bagchi",
        "Adarsh Bathula",
        "Subhajit Dandapat",
        "Lankeswar Dey",
        "Churchil Dwivedi",
        "Raghav Girgaonkar",
        "A. Gopakumar",
        "Yashwant Gupta",
        "Tomonosuke Kikunaga",
        "M. A. Krishnakumar",
        "Kuo Liu",
        "Yogesh Maan",
        "P K Manoharan",
        "Avinash Kumar Paladi",
        "Prerna Rana",
        "Golam M. Shaifullah",
        "Keitaro Takahashi"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
    ],
    "abstract": "The Indian Pulsar Timing Array (InPTA) collaboration has recently made its first official data release (DR1) for a sample of 14 pulsars using 3.5 years of uGMRT observations. We present the results of single-pulsar noise analysis for each of these 14 pulsars using the InPTA DR1. For this purpose, we consider white noise, achromatic red noise, dispersion measure (DM) variations, and scattering variations in our analysis. We apply Bayesian model selection to obtain the preferred noise models among these for each pulsar. For PSR J1600$-$3053, we find no evidence of DM and scattering variations, while for PSR J1909$-$3744, we find no significant scattering variations. Properties vary dramatically among pulsars. For example, we find a strong chromatic noise with chromatic index $\\sim$ 2.9 for PSR J1939+2134, indicating the possibility of a scattering index that doesn't agree with that expected for a Kolmogorov scattering medium consistent with similar results for millisecond pulsars in past studies. Despite the relatively short time baseline, the noise models broadly agree with the other PTAs and provide, at the same time, well-constrained DM and scattering variations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12105v1"
    ],
    "publication_venue": "30 pages, 17 figures, 4 tables"
}