{
    "arxiv_id": "2303.10969",
    "paper_title": "The 17 April 2021 widespread solar energetic particle event",
    "authors": [
        "N. Dresing",
        "L. Rodríguez-García",
        "I. C. Jebaraj",
        "A. Warmuth",
        "S. Wallace",
        "L. Balmaceda",
        "T. Podladchikova",
        "R. D. Strauss",
        "A. Kouloumvakos",
        "C. Palmroos",
        "V. Krupar",
        "J. Gieseler",
        "Z. Xu",
        "J. G. Mitchell",
        "C. M. S. Cohen",
        "G. A. de Nolfo",
        "E. Palmerio",
        "F. Carcaboso",
        "E. K. J. Kilpua",
        "D. Trotta",
        "U. Auster",
        "E. Asvestari",
        "D. da Silva",
        "W. Dröge",
        "T. Getachew",
        "R. Gómez-Herrero",
        "M. Grande",
        "D. Heyner",
        "M. Holmström",
        "J. Huovelin",
        "Y. Kartavykh",
        "M. Laurenza",
        "C. O. Lee",
        "G. Mason",
        "M. Maksimovic",
        "J. Mieth",
        "G. Murakami",
        "P. Oleynik",
        "M. Pinto",
        "M. Pulupa",
        "I. Richter",
        "J. Rodríguez-Pacheco",
        "B. Sánchez-Cano",
        "F. Schuller",
        "H. Ueno",
        "R. Vainio",
        "A. Vecchio",
        "A. M. Veronig",
        "N. Wijsen"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-06-14"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "physics.space-ph"
    ],
    "abstract": "Context. A solar eruption on 17 April 2021 produced a widespread Solar Energetic Particle (SEP) event that was observed by five longitudinally well-separated observers in the inner heliosphere at heliocentric distances of 0.42 to 1 au: BepiColombo, Parker Solar Probe, Solar Orbiter, STEREO A, and near-Earth spacecraft. The event produced relativistic electrons and protons. It was associated with a long-lasting solar hard X-ray flare and a medium fast Coronal Mass Ejection (CME) with a speed of 880 km/s driving a shock, an EUV wave as well as long-lasting radio burst activity showing four distinct type III burst. Methods. A multi-spacecraft analysis of remote-sensing and in-situ observations is applied to attribute the SEP observations at the different locations to the various potential source regions at the Sun. An ENLIL simulation is used to characterize the interplanetary state and its role for the energetic particle transport. The magnetic connection between each spacecraft and the Sun is determined. Based on a reconstruction of the coronal shock front we determine the times when the shock establishes magnetic connections with the different observers. Radio observations are used to characterize the directivity of the four main injection episodes, which are then employed in a 2D SEP transport simulation. Results. Timing analysis of the inferred SEP solar injection suggests different source processes being important for the electron and the proton event. Comparison among the characteristics and timing of the potential particle sources, such as the CME-driven shock or the flare, suggests a stronger shock contribution for the proton event and a more likely flare-related source of the electron event. Conclusions. We find that in this event an important ingredient for the wide SEP spread was the wide longitudinal range of about 110 degrees covered by distinct SEP injections.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10969v1"
    ],
    "publication_venue": null,
    "doi": "10.1051/0004-6361/202345938"
}