{
    "arxiv_id": "2303.14118",
    "paper_title": "Fault-tolerant quantum computation of molecular observables",
    "authors": [
        "Mark Steudtner",
        "Sam Morley-Short",
        "William Pol",
        "Sukin Sim",
        "Cristian L. Cortes",
        "Matthias Loipersberger",
        "Robert M. Parrish",
        "Matthias Degroote",
        "Nikolaj Moll",
        "Raffaele Santagati",
        "Michael Streif"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Over the past three decades significant reductions have been made to the cost of estimating ground-state energies of molecular Hamiltonians with quantum computers. However, comparatively little attention has been paid to estimating the expectation values of other observables with respect to said ground states, which is important for many industrial applications. In this work we present a novel expectation value estimation (EVE) quantum algorithm which can be applied to estimate the expectation values of arbitrary observables with respect to any of the system's eigenstates. In particular, we consider two variants of EVE: std-EVE, based on standard quantum phase estimation, and QSP-EVE, which utilizes quantum signal processing (QSP) techniques. We provide rigorous error analysis for both both variants and minimize the number of individual phase factors for QSPEVE. These error analyses enable us to produce constant-factor quantum resource estimates for both std-EVE and QSP-EVE across a variety of molecular systems and observables. For the systems considered, we show that QSP-EVE reduces (Toffoli) gate counts by up to three orders of magnitude and reduces qubit width by up to 25% compared to std-EVE. While estimated resource counts remain far too high for the first generations of fault-tolerant quantum computers, our estimates mark a first of their kind for both the application of expectation value estimation and modern QSP-based techniques.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14118v1"
    ],
    "publication_venue": "29 pages, 9 figures"
}