{
    "arxiv_id": "2303.10064",
    "paper_title": "On the Hinch-Kim dualism between singularity and Faxén operators in the hydromechanics of arbitrary bodies in Stokes flows",
    "authors": [
        "Giuseppe Procopio",
        "Massimiliano Giona"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "We generalize the multipole expansion and the structure of the Faxén operator in Stokes flows obtained for bodies with no-slip to generic boundary conditions, addressing the assumptions under which this generalization is conceivable. We show that a disturbance field generated by a body immersed in an ambient flow can be expressed as a multipole expansion the coefficients of which are the moments of the volume forces, independently on the boundary conditions. We find that the dualism between the operator giving the disturbance field of an $n$-th order ambient flow and the $n$-th order Faxén operator, referred to as the Hinch-Kim dualism, holds only if the boundary conditions satisfy a property that we call \\textit{Boundary-Condition reciprocity} (BC-reciprocity). If this property is fulfilled, the Faxén operators can be expressed in terms of the $(m,n)$-th order geometrical moments of the volume forces (defined in the article), thus generalizing the Brenner's expression for the Faxén operators for forces and torques on rigid bodies with no-slip boundary conditions. Finally, classical boundary conditions of hydrodynamic practice are investigated in the light of this property: boundary conditions for rigid bodies, Newtonian drops at the mechanical equilibrium, porous bodies modeled by the Brinkman equations are BC-reciprocal, while deforming linear elastic bodies, deforming Newtonian drops, non-Newtonian drops and porous bodies modeled by the Darcy equations do not have this property. For Navier-slip boundary conditions on a rigid body, we find that $n$-th order Faxén operator are determined by the $n$-th order surface tractions, and the analytical expression for the $0$-th, $1$-st and $2$-nd Faxén operators for a sphere with Navier-slip boundary conditions is provided.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10064v1"
    ],
    "publication_venue": null
}