{
    "arxiv_id": "2303.17570",
    "paper_title": "Generating functions and large-charge expansion of integrated correlators in $\\mathcal{N}=4$ supersymmetric Yang-Mills theory",
    "authors": [
        "Augustus Brown",
        "Congkao Wen",
        "Haitian Xie"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 2,
    "categories": [
        "hep-th"
    ],
    "abstract": "We recently proved that, when integrating out spacetime dependence with a certain measure, four-point correlators $\\langle \\mathcal{O}_2\\mathcal{O}_2\\mathcal{O}^{(i)}_p \\mathcal{O}^{(j)}_p \\rangle$ in $SU(N)$ $\\mathcal{N}=4$ super Yang-Mills are governed by a universal Laplace-difference equation. Here $\\mathcal{O}^{(i)}_p$ is a superconformal primary with charge $p$ and degeneracy $i$. These observables, called integrated correlators, are modular functions of coupling $τ$. The Laplace-difference equation relates integrated correlators of different charges recursively. In this paper, we introduce generating functions for the integrated correlators that sum over the charge. By utilising the Laplace-difference equation, we determine the generating functions given initial data. We show that the transseries of the integrated correlators in the large-$p$ (large-charge) expansion consists of three parts: 1) is independent of $τ$ as a power series in $1/p$, plus an additional $\\log(p)$ term if $i=j$; 2) is a power series in $1/p$, with coefficients given by a sum of the non-holomorphic Eisenstein series; 3) is a sum of exponentially decayed modular functions in the large-$p$ limit, which can be viewed as a generalisation of the non-holomorphic Eisenstein series. When $i=j$, there is an additional modular function that is independent of $p$ and is determined by the integrated correlator with $p=2$. The Laplace-difference equation was obtained with a reorganisation of the operators that means the large-charge limit is taken in a particular way here. From the $SL(2,\\mathbb{Z})$-invariant results, we also determine the generalised 't Hooft genus expansion and associated large-$p$ non-perturbative corrections of the integrated correlators by introducing $λ= pg^2_{YM}$. The generating functions have subtle differences between even and odd $N$ with important consequences in resurgence.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17570v1",
        "http://arxiv.org/pdf/2303.17570v2"
    ],
    "publication_venue": "43 pages + appendices, 1 figure; v2: typos corrected"
}