{
    "arxiv_id": "2303.14573",
    "paper_title": "Relay-based identification of Aerodynamic and Delay Sensor Dynamics with applications for Unmanned Aerial Vehicles",
    "authors": [
        "Anees Peringal",
        "Mohamad Chehadeh",
        "Igor Boiko",
        "Yahya Zweiri"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2024-10-28"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY"
    ],
    "abstract": "In this paper, we present a real-time system identification method based on relay feedback testing with applications to multirotor unmanned aerial vehicles. The proposed identification method provides an alternative to the expensive lab testing of certain UAV dynamic parameters. Moreover, it has the advantage of identifying the parameters that get changed throughout the operation of the UAV, which requires onboard identification methods. The modified relay feedback test (MRFT) is used to generate stable limit cycles at frequency points that reveal the underlying UAV dynamics. The locus of the perturbed relay system (LPRS) is used to predict the exact amplitude and frequency of these limit cycles. Real-time identification is achieved by using the homogeneity properties of the MRFT and the LPRS which are proven in this paper. The proposed identification method was tested experimentally to estimate the aerodynamic parameters as well as the onboard sensor's time delay parameters. The MRFT testing takes a few seconds to perform, and the identification computations take an average of 0.2 seconds to complete in modern embedded computers. The proposed identification method is compared against state-of-the-art alternatives. Advantages in identification accuracy and quantification of uncertainty in estimated parameters are shown.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14573v1"
    ],
    "publication_venue": "9 pages, 5 figures, This work has been submitted to the IEEE for possible publication",
    "doi": "10.1109/JSEN.2024.3374058"
}