{
    "arxiv_id": "2303.13104",
    "paper_title": "Non-Hermitian scattering symmetry revealed by diffusive channels",
    "authors": [
        "Dong Wang",
        "Hongsheng Chen",
        "Chengwei Qiu",
        "Ying Li"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph"
    ],
    "abstract": "The Hamiltonian interprets how the system evolves, while the scattering coefficients describe how the system responds to inputs. Recent studies on non-Hermitian physics have revealed many unconventional effects. However, in all cases, the non-Hermiticity such as material loss is only considered for the Hamiltonian, even when studying scattering properties. Another important component-the scattering channel, is always assumed to be lossless and time-reversal symmetric. This assumption hinders the exploration on the more general and fundamental properties of non-Hermitian scattering. Here, we identify a novel kind of scattering channel that obeys time-reversal anti-symmetry. Such diffusive scattering channels overturn the conventional understanding about scattering symmetry by linking the positive and negative frequencies. By probing non-Hermitian systems with the diffusive channels, we reveal a hidden anti-parity-time (APT) scattering symmetry, which is distinct from the APT symmetry of Hamiltonians studied before. The symmetric and symmetry broken scattering phases are observed for the first time as the collapse and revival of temperature oscillation. Our work highlights the overlooked role of scattering channels in the symmetry and phase transition of non-Hermitian systems, thereby gives the diffusion the new life as a signal carrier. Our findings can be utilized to the analysis and control of strongly dissipative phenomena such as heat transfer and charge diffusion.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13104v1"
    ],
    "publication_venue": null
}