{
    "arxiv_id": "2303.12286",
    "paper_title": "Task-Oriented Explainable Semantic Communication Based on Semantic Triplets",
    "authors": [
        "Chuanhong Liu"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SP"
    ],
    "abstract": "Task-oriented semantic communication has garnered increasing attention due to its ability to reduce the amount of transmitted data without sacrificing task performance. While existing works have focused on designing advanced semantic communication architectures and efficient semantic codecs, challenges such as explainable and efficient semantic representation methods, and knowledge-based semantic compression algorithms have yet to be explored. These challenges have hindered the widespread adoption of semantic communication. To address these challenges, this paper proposes a novel Semantic Communication system based on Semantic Triplets (SCST), in which semantics are represented through explainable semantic triplets. A novel semantic extraction method is proposed to convert transmitted text into semantic triplets, where syntactic dependency analysis is introduced to improve semantic completeness. Furthermore, a semantic filtering method is designed to compress duplicate and task-irrelevant semantic triplets, making use of prior knowledge from the knowledge base. The filtered semantic triplets are then encoded and transmitted wirelessly to complete intelligent tasks at the receiver. To verify the effectiveness of the proposed SCST, it is applied to sentiment analysis and question-answering tasks, with semantic encoders and decoders designed for each task. Experimental results show that the proposed SCST achieves at least 43.5% and 52% accuracy gains, respectively, compared to traditional communication method. These results demonstrate that the proposed SCST can significantly improve semantic communication performance.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12286v1"
    ],
    "publication_venue": null
}