{
    "arxiv_id": "2303.09387",
    "paper_title": "Characterizing Manipulation from AI Systems",
    "authors": [
        "Micah Carroll",
        "Alan Chan",
        "Henry Ashton",
        "David Krueger"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CY"
    ],
    "abstract": "Manipulation is a common concern in many domains, such as social media, advertising, and chatbots. As AI systems mediate more of our interactions with the world, it is important to understand the degree to which AI systems might manipulate humans \\textit{without the intent of the system designers}. Our work clarifies challenges in defining and measuring manipulation in the context of AI systems. Firstly, we build upon prior literature on manipulation from other fields and characterize the space of possible notions of manipulation, which we find to depend upon the concepts of incentives, intent, harm, and covertness. We review proposals on how to operationalize each factor. Second, we propose a definition of manipulation based on our characterization: a system is manipulative \\textit{if it acts as if it were pursuing an incentive to change a human (or another agent) intentionally and covertly}. Third, we discuss the connections between manipulation and related concepts, such as deception and coercion. Finally, we contextualize our operationalization of manipulation in some applications. Our overall assessment is that while some progress has been made in defining and measuring manipulation from AI systems, many gaps remain. In the absence of a consensus definition and reliable tools for measurement, we cannot rule out the possibility that AI systems learn to manipulate humans without the intent of the system designers. We argue that such manipulation poses a significant threat to human autonomy, suggesting that precautionary actions to mitigate it are warranted.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09387v1",
        "http://arxiv.org/pdf/2303.09387v2"
    ],
    "publication_venue": "Under review. The first two authors contributed equally; author order was decided with a coin flip"
}