{
    "arxiv_id": "2303.09264",
    "paper_title": "Portable MRI for major sporting events -- a case study on the MotoGP World Championship",
    "authors": [
        "J. M. Algarín",
        "T. Guallart-Naval",
        "E. Gastalda-Orquín",
        "R. Bosch",
        "F. J. Lloris",
        "E. Pallás",
        "J. P. Rigla",
        "P. Martínez",
        "J. Borreguero",
        "R. Alamar",
        "L. Martí-Bonmatí",
        "J. M. Benlloch",
        "F. Galve",
        "J. Alonso"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "physics.med-ph"
    ],
    "abstract": "The goal of this work is to showcase the clinical value that portable MRI can provide in crowded events and major sports competitions. We temporarily installed a low-field and low-cost portable MRI system for extremity imaging in the medical facilities of the Ricardo Tormo Motor Racing Circuit during the four days of the Motorcycle Grand Prix held in Valencia (Spain), which closed the 2022 season of the MotoGP. During this time, we scanned 14 subjects, running a total of 21 protocols for wrist, knee and ankle imaging. Each protocol included a minimum of one T1-weighted 3D-RARE sequence for general anatomical information, and one 3D-STIR sequence to highlight fluid accumulation and inflammation. The circuit medical staff were able to visualize a number of lesions and conditions in the low-field reconstructions, including gonarthrosis, effusion, or Haglund's syndrome, as well as metallic implants and tissue changes due to surgical interventions. Out of eight low-field acquisitions on previously diagnosed lesions, only two (a meniscus tear and a Baker cyst) were not detected by the experts that evaluated our images. The main highlight was that a low-field MRI scan on a subject reporting pain in a wrist revealed a traumatic arthritis which an X-ray radiograph and visual inspection had missed. We have operated in a scenario where high-field MRI is unlikely to play a role but where a low-field system can lead to improved medical attention. In the case reported here, system transport, installation in the circuit facilities and calibration were all uncomplicated. The images presented to the medical staff were mostly unprocessed and there is thus room for improvement. In conclusion, this work supports the claim that low-field MRI can likely provide added value whenever concepts such as accessibility, portability and low-cost outweigh exquisite detail in images.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09264v1"
    ],
    "publication_venue": null
}