{
    "arxiv_id": "2303.16330",
    "paper_title": "Disk or Companion: Characterizing Excess Infrared Flux in Seven White Dwarf Systems with Near-Infrared Spectroscopy",
    "authors": [
        "Dylan Owens",
        "Siyi Xu",
        "Elena Manjavacas",
        "S. K. Leggett",
        "S. L. Casewell",
        "Erik Dennihy",
        "Patrick Dufour",
        "Beth L. Klein",
        "Sherry Yeh",
        "B. Zuckerman"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-06-14"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
    ],
    "abstract": "Excess infrared flux from white dwarf stars is likely to arise from a dusty debris disk or a cool companion. In this work, we present near-infrared spectroscopic observations with Keck/MOSFIRE, Gemini/GNIRS, and Gemini/Flamingos-2 of seven white dwarfs with infrared excesses identified in previous studies. We confirmed the presence of dust disks around four white dwarfs (Gaia J0611-6931, Gaia J0006+2858, Gaia J2100+2122, and WD 0145+234) as well as two new white dwarf brown dwarf pairs (Gaia J0052+4505 and Gaia J0603+4518). In three of the dust disk systems, we detected for the first time near-infrared metal emissions (Mg I, Fe I, and Si I) from a gaseous component of the disk. We developed a new Markov Chain Monte Carlo framework to constrain the geometric properties of each dust disk. In three systems, the dust disk and the gas disk appear to coincide spatially. For the two brown dwarf white dwarf pairs, we identified broad molecular absorption features typically seen in L dwarfs. The origin of the infrared excess around Gaia J0723+6301 remains a mystery. Our study underlines how near-infrared spectroscopy can be used to determine sources of infrared excess around white dwarfs, which has now been detected in hundreds of systems photometrically.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16330v1"
    ],
    "publication_venue": "23 pages, 10 figures, 5 tables, AJ, in press",
    "doi": "10.3847/1538-3881/accc25"
}