{
    "arxiv_id": "2303.15551",
    "paper_title": "Electron-K-Phonon Interaction In Twisted Bilayer Graphene",
    "authors": [
        "Chao-Xing Liu",
        "Yulin Chen",
        "Ali Yazdani",
        "B. Andrei Bernevig"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2024-09-10"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con",
        "cond-mat.mes-hall"
    ],
    "abstract": "We develop an analytic theory to describe the interaction between electrons and K-phonons and study its influence on superconductivity in the bare bands of twisted bilayer graphene (TBG). We find that, due to symmetry and the two-center approximation, only one optical K-phonon (~ 160meV) of graphene is responsible for inter-valley electron-phonon interaction. This phonon has recently been found in angular-resolved photo-emission spectroscopy to be responsible for replicas of the TBG flat bands. By projecting the interaction to the TBG flat bands, we perform the full symmetry analysis of phonon-mediated attractive interaction and pairing channels in the Chern basis, and show that several channels are guaranteed to have gapless order parameters. From the linearized gap equations, we find that the highest Tc pairing induced by this phonon is a singlet gapped s-wave inter-Chern-band order parameter, followed closely by a gapless nematic d-wave intra-Chern-band order parameter. We justify these results analytically, using the topological heavy fermion mapping of TBG which has allowed us to obtain an analytic form of phonon-mediated attractive interaction and to analytically solve the linearized and T=0 gap equations. For the intra-Chern-band channel, the nematic state with nodes is shown to be stabilized in the chiral flat band limit. While the flat band Coulomb interaction can be screened sufficiently enough - around Van-Hove singularities - to allow for electron-phonon based superconductivity, it is unlikely that this effect can be maintained in the lower density of states excitation bands around the correlated insulator states.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15551v1"
    ],
    "publication_venue": "72 pages, 20 figures,",
    "doi": "10.1103/PhysRevB.110.045133"
}