{
    "arxiv_id": "2303.16285",
    "paper_title": "Optimal Scheduling Policies for Remote Estimation of Autoregressive Markov Processes over Time-Correlated Fading Channel",
    "authors": [
        "Manali Dutta",
        "Rahul Singh"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "math.OC"
    ],
    "abstract": "We consider the problem of transmission scheduling for the remote estimation of a discrete-time autoregressive Markov process that is driven by white Gaussian noise. A sensor observes this process, and then decides to either encode the current state of this process into a data packet and attempts to transmit it to the estimator over an unreliable wireless channel modeled as a Gilbert-Elliott channel, or does not send any update. Each transmission attempt consumes $λ$ units of transmission power, and the remote estimator is assumed to be linear. The channel state is revealed only via the feedback (ACK\\slash NACK) of a transmission, and hence the channel state is not revealed if no transmission occurs. The goal of the scheduler is to minimize the expected value of an infinite-horizon cumulative discounted cost, in which the instantaneous cost is composed of the following two quantities: (i)~squared estimation error, (ii) transmission power. We show that this problem can equivalently be posed as a partially observable Markov decision process (POMDP), in which the scheduler maintains a belief about the current state of the channel, and makes decisions on the basis of the current value of the estimation error, and the belief state.~We then show that the optimal policy is of threshold-type, i.e. for each value of the estimation error $e$, there is a threshold $b\\ust(e)$ such that when the error is equal to $e$, then it is optimal to transmit only when the current belief state is greater than $b\\ust(e)$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16285v1"
    ],
    "publication_venue": null
}