{
    "arxiv_id": "2303.17638",
    "paper_title": "Investigating physical states of molecular gas in the overlapping region of interacting galaxies NGC4567/4568 using ALMA",
    "authors": [
        "Hiroyuki Kaneko",
        "Shoya Tokita",
        "Nario Kuno"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-26"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present ALMA observations of a diffuse gas tracer, CO(J = 1-0), and a warmer and denser gas tracer, CO(J = 3-2), in the overlapping region of interacting galaxies NGC 4567/4568, which are in the early stage of interaction. To comprehend the impact of galaxy interactions on molecular gas properties, we focus on interacting galaxies during the early stage and study their molecular gas properties. In this study, we investigate the physical states of a filamentary molecular structure at the overlapping region, which was previously reported. Utilising new higher-resolution CO(J = 1-0) data, we identify molecular clouds within overlapping and disc regions. Although the molecular clouds in the filament have a factor of two higher an average virial parameter (0.56+-0.14) than that in the overlapping region (0.28+-0.12) and in the disc region (0.26+-0.16), all identified molecular clouds are gravitationally bound. These clouds in the filament also have a larger velocity dispersion than that in the overlapping region, suggesting that molecular gas and/or atomic gas with different velocities collide there. We calculate the ratio of the integrated intensity of CO(J = 3-2) and CO(J = 1-0) (= R3-2/1-0) on the molecular cloud scale. The maximum R3-2/1-0 is 0.17+-0.04 for all identified clouds. The R3-2/1-0 of the molecular clouds in the filament is lower than that of the surrounding area. This result contradicts the predictions of previous numerical simulations, which suggested that the molecular gas on the collision front of galaxies is compressed and becomes denser. Our results imply that NGC 4567/4568 is in a very early stage of interaction; otherwise, the molecular clouds in the filament would not yet fulfil the conditions necessary to trigger star formation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17638v1"
    ],
    "publication_venue": "25 pages, 13 figures, accepted to PASJ",
    "doi": "10.1093/pasj/psad025"
}