{
    "arxiv_id": "2303.08237",
    "paper_title": "Thermally-driven phase transitions in freestanding low-buckled silicene, germanene, and stanene",
    "authors": [
        "John M. Davis",
        "Gustavo S. Orozco-Galvan",
        "Salvador Barraza-Lopez"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-06-02"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "cond-mat.soft"
    ],
    "abstract": "Low-buckled silicene, germanene, and stanene are group$-IV$ graphene allotropes. They form a honeycomb lattice out of two interpenetrating ($A$ and $B$) triangular sublattices that are vertically separated by a small distance $Δ_z$. The atomic numbers $Z$ of silicon, germanium, and tin are larger to carbon's ($Z_C=6$), making them the first experimentally viable two-dimensional topological insulators. Those materials have a twice-energy-degenerate atomistic structure characterized by the buckling direction of the $B$ sublattice with respect to the $A$ sublattice [whereby the $B-$atom either protrudes {\\em above} ($Δ_z>0$) or {\\em below} ($Δ_z<0$) the $A-$atoms], and the consequences of that energy degeneracy on their elastic and electronic properties have not been reported thus far. Here, we uncover {\\em ferroelastic, bistable} behavior on silicene, which turns into an {\\em average} planar structure at about 600 K. Further, the creation of electron and hole puddles obfuscates the zero-temperature SOC induced band gaps at temperatures as low as 200 K, which may discard silicene as a viable two-dimensional topological insulator for room temperature applications. Germanene, on the other hand, never undergoes a low-buckled to planar 2D transformation, becoming amorphous at around 675 K instead, and preserving its SOC-induced bandgap despite of band broadening. Stanene undergoes a transition onto a crystalline 3D structure at about 300 K, preserving its SOC-induced electronic band gap up to that temperature. Unlike what is observed in silicene and germanene, stanene readily develops a higher-coordinated structure with a high degree of structural order. The structural phenomena is shown to have deep-reaching consequences for the electronic and vibrational properties of those two dimensional topological insulators.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08237v1"
    ],
    "publication_venue": "16 pages, 21 figures. Originally submitted on December 5, 2022",
    "doi": "10.1103/PhysRevMaterials.7.054008"
}