{
    "arxiv_id": "2303.16945",
    "paper_title": "Urgency-aware Routing in Single Origin-destination Itineraries through Artificial Currencies",
    "authors": [
        "Leonardo Pedroso",
        "W. P. M. H. Heemels",
        "Mauro Salazar"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2024-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY",
        "cs.GT"
    ],
    "abstract": "Within mobility systems, the presence of self-interested users can lead to aggregate routing patterns that are far from the societal optimum which could be achieved by centrally controlling the users' choices. In this paper, we design a fair incentive mechanism to steer the selfish behavior of the users to align with the societally optimal aggregate routing. The proposed mechanism is based on an artificial currency that cannot be traded or bought, but only spent or received when traveling. Specifically, we consider a parallel-arc network with a single origin and destination node within a repeated game setting whereby each user chooses from one of the available arcs to reach their destination on a daily basis. In this framework, taking faster routes comes at a cost, whereas taking slower routes is incentivized by a reward. The users are thus playing against their future selves when choosing their present actions. To capture this complex behavior, we assume the users to be rational and to minimize an urgency-weighted combination of their immediate and future discomfort. To design the optimal pricing, we first derive a closed-form expression for the best individual response strategy. Second, we formulate the pricing design problem for each arc to achieve the societally optimal aggregate flows, and reformulate it so that it can be solved with gradient-free optimization methods. Our numerical simulations show that it is possible to achieve a near-optimal routing whilst significantly reducing the users' perceived discomfort when compared to a centralized optimal but urgency-unaware policy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16945v1"
    ],
    "publication_venue": null,
    "doi": "10.1109/CDC49753.2023.10383739"
}