{
    "arxiv_id": "2303.10821",
    "paper_title": "Mean-Field Cavity Effects in Quantum Electrodynamics Density Functional and Coupled-Cluster Theories",
    "authors": [
        "Marcus D. Liebenthal",
        "Nam Vu",
        "A. Eugene DePrince"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph"
    ],
    "abstract": "Cavity quantum electrodynamics (QED) generalizations of time-dependent (TD) density functional theory (DFT) and equation-of-motion (EOM) coupled-cluster (CC) theory are used to model small molecules strongly coupled to optical cavity modes. We consider two types of calculations. In the first approach (termed ``relaxed''), cavity-induced orbital relaxation effects are included through a coherent-state transformation of the Hamiltonian; this procedure guarantees origin invariance of the energy in post-self-consistent-field calculations. In the second approach (termed ``unrelaxed''), we ignore the coherent-state transformation and the associated orbital relaxation effects. In this case, ground-state unrelaxed QED-CC calculations pick up a modest origin dependence but otherwise reproduces relaxed QED-CC results within the coherent-state basis. On the other hand, a severe origin dependence manifests in ground-state unrelaxed QED mean-field energies. For excitation energies computed at experimentally realizable coupling strengths, relaxed and unrelaxed QED-EOM-CC results are similar, while significant differences emerge for unrelaxed and relaxed QED-TDDFT. First, QED-EOM-CC and relaxed QED-TDDFT both predict that electronic states that are not resonant with the cavity mode are nonetheless perturbed by the cavity. Unrelaxed QED-TDDFT, on the other hand, fails to capture this effect. Second, in the limit of large coupling strengths, relaxed QED-TDDFT tends to overestimate Rabi splittings, while unrelaxed QED-TDDFT underestimates them, given splittings from relaxed QED-EOM-CC as a reference, and relaxed QED-TDDFT generally does the better job of reproducing the QED-EOM-CC results.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10821v1"
    ],
    "publication_venue": null
}