{
    "arxiv_id": "2303.13424",
    "paper_title": "Improving the open cluster census. II. An all-sky cluster catalogue with Gaia DR3",
    "authors": [
        "Emily L. Hunt",
        "Sabine Reffert"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
    ],
    "abstract": "Data from the Gaia satellite are revolutionising our understanding of the Milky Way. With every new data release, there is a need to update the census of open clusters. We aim to conduct a blind, all-sky search for open clusters using 729 million sources from Gaia DR3 down to magnitude $G\\sim20$, creating a homogeneous catalogue of clusters including many new objects. We used the Hierarchical Density-Based Spatial Clustering of Applications with Noise (HDBSCAN) algorithm to recover clusters. We validated our clusters using a statistical density test and a Bayesian convolutional neural network for colour-magnitude diagram classification. We inferred basic astrometric parameters, ages, extinctions, and distances for the clusters in the catalogue. We recovered 7200 clusters, 2420 of which are candidate new objects and 4780 of which crossmatch to objects in the literature, including 134 globular clusters. A more stringent cut of our catalogue contains 4114 highly reliable clusters, 749 of which are new. Owing to the scope of our methodology, we are able to tentatively suggest that many of the clusters we are unable to detect may not be real, including 1152 clusters from the Milky Way Star Cluster (MWSC) catalogue that should have been detectable in Gaia data. Our cluster membership lists include many new members and often include tidal tails. Our catalogue's distribution traces the galactic warp, the spiral arm structure, and the dust distribution of the Milky Way. While much of the content of our catalogue contains bound open and globular clusters, as many as a few thousand of our clusters are more compatible with unbound moving groups, which we will classify in an upcoming work. We have conducted the largest search for open clusters to date, producing a single homogeneous star cluster catalogue which we make available with this paper.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13424v1"
    ],
    "publication_venue": "31 pages, 17 figures. Accepted in A&A. Before archiving at the CDS completes, supporting data are available at https://drive.google.com/drive/folders/1-9R9132g9FGq6xfcjYI5qMWDFYnMttUG?usp=share_link"
}