{
    "arxiv_id": "2303.12229",
    "paper_title": "Estimating the evolution of Sparks in Partially Screened Gap of Pulsars from Subpulse Drifting",
    "authors": [
        "Rahul Basu",
        "Dipanjan Mitra",
        "George I. Melikidze"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "A novel scheme has been developed to show that the observed phase behaviour associated with subpulse drifting from two pulsars, J1034$-$3224 and J1720$-$2933, can be used to obtain the magnetic field configuration in the partially screened gap (PSG). The outflowing plasma along the open magnetic field line region of pulsars is generated due to spark discharges in an inner acceleration region (IAR) above the polar cap. The IAR has been modelled as a partially screened gap (PSG) with a steady supply of positively charged ions emitted from the heated polar cap surface dominated by strong non-dipolar magnetic fields. In a PSG the sparks are tightly packed and constrained to be present along the polar cap boundary. The sparks lag behind the rotation of the star during their lifetimes. As a result the sparking pattern evolves along two different directions in the clockwise and counter-clockwise manner around a stationary central spark, and can be associated with the observed phenomenon of subpulse drifting. PSR J1034$-$3224 has four prominent components and exhibit bi-drifting where alternate components show opposite sense of drifting, while PSR J1720$-$2933 has a single component profile and shows systematic coherent drift bands. We show that the differences in their drifting behaviour can be directly linked to different natures of the non-dipolar surface magnetic field configurations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12229v1"
    ],
    "publication_venue": "11 pages, 6 figures, accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc6c6"
}