{
    "arxiv_id": "2303.09476",
    "paper_title": "Terahertz Multiple Access: A Deep Reinforcement Learning Controlled Multihop IRS Topology",
    "authors": [
        "Muhammad Shehab",
        "Abdullateef Almohamad",
        "Mohamed Elsayed",
        "Ahmed Badawy",
        "Tamer Khattab",
        "Nizar Zorba",
        "Mazen Hasna",
        "Daniele Trinchero"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "cs.IT",
        "eess.SP"
    ],
    "abstract": "We investigate THz communication uplink multiple access using cascaded intelligent reflecting surfaces (IRSs) assuming correlated channels. Two independent objectives to be achieved via adjusting the phases of the cascaded IRSs: 1) maximizing the received rate of a desired user under interference from the second user and 2) maximizing the sum rate of both users. The resulting optimization problems are non-convex. For the first objective, we devise a sub-optimal analytical solution by maximizing the received power of the desired user, however, this results in an over determined system. Approximate solutions using pseudo-inverse and block-based approaches are attempted. For the second objective, a loose upperbound is derived and an exhaustive search solution is utilized. We then use deep reinforcement learning (DRL) to solve both objectives. Results reveal the suitability of DRL for such complex configurations. For the first objective, the DRL-based solution is superior to the sub-optimal mathematical methods, while for the second objective, it produces sum rates almost close to the exhaustive search. Further, the results reveal that as the correlation-coefficient increases, the sum rate of DRL increases, since it benefits from the presence of correlation in the channel to improve statistical learning.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09476v1"
    ],
    "publication_venue": "30 Pages, 11 Figures, 2 Tables"
}