{
    "arxiv_id": "2303.10224",
    "paper_title": "A Hybrid 3D/2D Field Response Calculation for Liquid Argon Detectors with PCB Based Anode Plane",
    "authors": [
        "S. Martynenko",
        "F. Pietropaolo",
        "B. Viren",
        "X. Qian",
        "H. Chen",
        "S. Gao",
        "W. Gu",
        "J. Jo",
        "S. Kettell",
        "Y. Li",
        "H. Liu",
        "N. Nayak",
        "B. Yu",
        "H. Yu",
        "C. Zhang",
        "U. Kose",
        "F. Resnati",
        "S. Tufanli",
        "F. Boran",
        "F. Dolek"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ins-det",
        "hep-ex"
    ],
    "abstract": "Liquid Argon Time Projection Chamber (LArTPC) technology is commonly utilized in neutrino detector designs. It enables detailed reconstruction of neutrino events with high spatial precision and low energy threshold. Its field response (FR) model describes the time-dependent electric currents induced in the anode-plane electrodes when ionization electrons drift nearby. An accurate and precise FR is a crucial input to LArTPC detector simulations and charge reconstruction. Established LArTPC designs have been based on parallel wire planes. It allows accurate and computationally economic two-dimensional (2D) FR models utilizing the translational symmetry along the direction of the wires. Recently, novel LArTPC designs utilize electrodes formed on printed circuit board (PCB) in the shape of strips with through holes. The translational symmetry is no longer a good approximation near the electrodes and a new FR calculation that employs regions with three dimensions (3D) has been developed. Extending the 2D models to 3D would be computationally expensive. Fortuitously, the nature of strips with through holes allows for a computationally economic approach based on the finite-difference method (FDM). In this paper, we present a new software package \"pochoir\" that calculates LArTPC field response for these new strip-based anode designs. This package combines 3D calculations in the volume near the electrodes with 2D far-field solutions to achieve fast and precise field response computation. We apply the resulting FR to simulate and reconstruct samples of cosmic-ray muons and $^{39}$Ar decays from a Vertical Drift (VD) detector prototype operated at CERN. We find the difference between real and simulated data within 5 %. Current state-of-the-art LArTPC software requires a 2D FR which we provide by averaging over one dimension and estimate that variations lost in this average are smaller than 7 %.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10224v1"
    ],
    "publication_venue": "16 pages, 12 figures",
    "doi": "10.1088/1748-0221/18/04/P04033"
}