{
    "arxiv_id": "2303.14755",
    "paper_title": "A Torsional Two-Component Description of the Motion of Dirac Particles at Early Stages of the Cosmic Evolution",
    "authors": [
        "J. G. Cardoso"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-09-08"
    ],
    "latest_version": 3,
    "categories": [
        "gr-qc",
        "math-ph"
    ],
    "abstract": "It is assumed that the non-singular big-bang birth of the Universe as set forth by Einstein-Cartan's theory particularly brought about the appearance of the cosmic microwave and dark energy backgrounds, dark matter, gravitons as well as of Dirac particles. On account of this assumption, a two-component description of the motion of quarks and leptons prior to the occurrence of hadronization is presented within the framework of the torsionful ε-formalism of Infeld and van der Waerden. The relevant field equations are settled on the basis of the implementation of conjugate minimal coupling covariant derivative operators that carry additively typical potentials for the cosmic backgrounds such as geometrically specified in a previous work. It appears that the derivation of the wave equations which control the spacetime propagation of Dirac fields at very early stages of the cosmic evolution, must be tied up with the applicability of certain subsidiary relations. The wave equations themselves suggest that quarks and leptons interact not only with both of the cosmic backgrounds, but also with dark matter. Nevertheless, it becomes manifest that the inner structure of the framework allowed for does not give rise at all to any interaction between gravitons and Dirac particles. The overall formulation ascribes an intrinsically non-geometric character to Dirac's theory, in addition to exhibiting a formal evidence that dark energy and dark matter must have partaken of a cosmic process of hadronization.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14755v1",
        "http://arxiv.org/pdf/2303.14755v2",
        "http://arxiv.org/pdf/2303.14755v3"
    ],
    "publication_venue": "An important point concerning the work of Ref. [15] has been made in the second paragraph of Section 1 in connection with the work of the (new) reference [16]"
}