{
    "arxiv_id": "2303.15585",
    "paper_title": "Beyond Accuracy: A Critical Review of Fairness in Machine Learning for Mobile and Wearable Computing",
    "authors": [
        "Sofia Yfantidou",
        "Marios Constantinides",
        "Dimitris Spathis",
        "Athena Vakali",
        "Daniele Quercia",
        "Fahim Kawsar"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-07-20"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CY",
        "cs.HC",
        "cs.LG"
    ],
    "abstract": "The field of mobile and wearable computing is undergoing a revolutionary integration of machine learning. Devices can now diagnose diseases, predict heart irregularities, and unlock the full potential of human cognition. However, the underlying algorithms powering these predictions are not immune to biases with respect to sensitive attributes (e.g., gender, race), leading to discriminatory outcomes. The goal of this work is to explore the extent to which the mobile and wearable computing community has adopted ways of reporting information about datasets and models to surface and, eventually, counter biases. Our systematic review of papers published in the Proceedings of the ACM Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT) journal from 2018-2022 indicates that, while there has been progress made on algorithmic fairness, there is still ample room for growth. Our findings show that only a small portion (5%) of published papers adheres to modern fairness reporting, while the overwhelming majority thereof focuses on accuracy or error metrics. To generalize these results across venues of similar scope, we analyzed recent proceedings of ACM MobiCom, MobiSys, and SenSys, IEEE Pervasive, and IEEE Transactions on Mobile Computing Computing, and found no deviation from our primary result. In light of these findings, our work provides practical guidelines for the design and development of mobile and wearable technologies that not only strive for accuracy but also fairness.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15585v1",
        "http://arxiv.org/pdf/2303.15585v2"
    ],
    "publication_venue": null
}