{
    "arxiv_id": "2303.16770",
    "paper_title": "Expectations for Fast Radio Bursts in Neutron Star-Massive Star binaries",
    "authors": [
        "Kaustubh Rajwade",
        "Jakob van den Eijnden"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Recent observations of a small sample of repeating Fast Radio Bursts (FRBs) have revealed a periodicity in their bursting activity that may be suggestive of a binary origin for the modulation. We set out to explore the scenario where a subset of repeating FRBs originates in binary systems hosting a highly energetic neutron star and a massive companion star, akin to $γ$-ray binaries and young High-Mass X-ray Binaries. Firstly, we specifically focus on the host galaxy properties and binary formation rates. Subsequently, we investigate the expected evolution of the rotation and dispersion measure in this scenario, the predicted birth-site offsets, and the origin of the persistent radio emission observed in a subset of these systems. The host galaxies for repeating FRBs favour the formation of neutron star-massive star binary systems but any conclusive evidence will require future discoveries and localizations of FRBs. The birth rate of high-mass X-ray binaries, used as a proxy for all considered binaries, significantly exceeds the estimated rate of FRBs, which can be explained if only a small subset of these systems produce FRBs. We show that under simple assumptions, we can reproduce the DM and RM evolution that is seen in a subset of repeating FRBs. We also discuss the possibility of detecting a persistent radio source associated with the FRB due to an intra-binary shock between companion star wind and either the pulsar wind or giant magnetar flares. The observed long-term luminosity stability of the Persistent Radio Sources is most consistent with a giant flare-powered scenario. However, this explanation is highly dependent on the magnetic field properties of the neutron star. With these explorations, we have aimed to provide a framework to discuss future FRB observations in the context of neutron star-massive star binary scenarios.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16770v1"
    ],
    "publication_venue": "15 pages, 7 figures, 2 appendices, accepted for publication in A&A. Abstract truncated to fit the word limit on arXiv",
    "doi": "10.1051/0004-6361/202245468"
}