{
    "arxiv_id": "2303.08573",
    "paper_title": "Rapid in-situ quantification of rheo-optic evolution for cellulose spinning in ionic solvents",
    "authors": [
        "Jianyi Du",
        "Javier Paez",
        "Pablo Otero",
        "Pablo B. Sanchez"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-12-18"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "physics.flu-dyn",
        "physics.optics"
    ],
    "abstract": "It is critical to monitor the structural evolution during deformation of complex fluids for the optimization of many manufacturing processes, including textile spinning. However, in situ measurements in a textile spinning process suffer from paucity of non-destructive instruments and interpretations of the measured data. In this work, kinetic and rheo-optic properties of a cellulose/ionic liquid solution were measured simultaneously while fibers were regenerated in aqueous media from a miniature wet spinline equipped with a customized polarized microscope. This system enables to control key spinning parameters, while capturing and processing the geometrical and structural information of the spun fiber in a real-time manner. We identified complex flow kinematics of a deformed fiber during the coagulation process via feature tracking methods, and visualized its morphology and birefringent responses before and during regeneration at varying draw ratios and residence time. Meanwhile, a three-dimensional physical rheological model was applied to describe the non-linear viscoelastic behavior in a complex wet-spinning process incorporating both shear and extensional flows. We subsequently compared the birefringent responses of fibers under coagulation with the transient orientation inferred from the rheological model, and identified a superposed structure-optic relationship under varying spinning conditions. Such structural characterizations inferred from the flow dynamics of spinning dopes are readily connected with key mechanical properties of fully-regenerated fibers, thus enabling to predict the spinning performance in a non-destructive protocol.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08573v1"
    ],
    "publication_venue": "28 pages, 6 figures",
    "doi": "10.1016/j.carbpol.2023.121229"
}