{
    "arxiv_id": "2303.12884",
    "paper_title": "Frequency analysis of the first-overtone RR Lyrae stars based on the Extended Aperture Photometry from the K2 data",
    "authors": [
        "H. Netzel",
        "L. Molnar",
        "E. Plachy",
        "J. M. Benko"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-09-27"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Additional low-amplitude signals are observed in many RR Lyrae stars, beside the pulsations in radial modes. The most common ones are short-period signals forming a period ratio of around 0.60--0.65 with the first overtone, or long-period signals forming a period ratio of around 0.68. The RR Lyrae stars may also exhibit quasi-periodic modulation of the light curves, known as the Blazhko effect. We used the extensive sample of the first-overtone RR Lyrae stars observed by the Kepler telescope during the K2 mission to search for and characterize these low-amplitude additional signals. K2 data provides space-based photometry for a statistically significant sample. Hence this data is excellent to study in detail pulsation properties of RR Lyrae stars. We used K2 space-based photometry for RR Lyrae candidates from Campaigns 0-19. We selected RR Lyrae stars pulsating in the first overtone and performed a frequency analysis for each star to characterize their frequency contents. We classified 452 stars as first-overtone RR Lyrae. From that sample, we selected 281 RR$_{0.61}$ stars, 67 RR$_{0.68}$ stars, and 68 Blazhko stars. We found particularly interesting stars which show all of the above phenomena simultaneously. We detected signals in RR$_{0.61}$ stars that form period ratios lower than observed for the majority of stars. These signals likely form a new sequence in the Petersen diagram, around a period ratio of 0.60. In 32 stars we detected additional signals that form a period ratio close to that expected in RRd stars, but the classification of these stars as RRd is uncertain. We also report a discovery of additional signals in eight stars that form a new group in the Petersen diagram around the period ratio of 0.465-0.490. The nature of this periodicity remains unknown.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12884v1"
    ],
    "publication_venue": "29 pages, 29 figures, 4 tables, accepted for publication in A&A, full tables are available upon request before publication",
    "doi": "10.1051/0004-6361/202245634"
}