{
    "arxiv_id": "2303.10077",
    "paper_title": "Galaxy And Mass Assembly (GAMA): Bulge-disk decomposition of KiDS and VIKING data in the nearby universe",
    "authors": [
        "Sarah Casura"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
    ],
    "abstract": "In this thesis, we derive a catalogue of robust structural parameters for the components of a large sample of nearby GAMA galaxies while at the same time contributing to the advancement of image analysis, surface brightness fitting and post-processing routines for quality assurance in the context of automated large-scale bulge-disk decomposition studies. The sample consists of 13096 galaxies at redshifts z < 0.08 with imaging data from the Kilo-Degree Survey and the VISTA Kilo-Degree INfrared Galaxy survey spanning the optical and near-infrared. We fit three models to the surface brightness distribution of each galaxy in each band: a single Sérsic model, a Sérsic plus exponential and a point source plus exponential. The fitting is performed with a fully automated Markov-chain Monte Carlo (MCMC) analysis using the Bayesian two-dimensional profile fitting code ProFit. All preparatory work is carried out using the image analysis package ProFound. After fitting the galaxies, we perform model selection and flag galaxies for which none of our models are appropriate, mainly mergers and irregular galaxies. The fit quality is assessed by visual inspections, comparison to previous works, comparison of independent fits of galaxies in the overlap regions between KiDS tiles and bespoke simulations. The latter two are also used for a detailed investigation of systematic error sources. We find that our fit results are robust across various galaxy types and image qualities with minimal biases. Errors given by the MCMC underestimate the true errors typically by factors 2-3. Automated model selection criteria are accurate to > 90 % as calibrated by visual inspection of a subsample of galaxies. We also present g-r component colours and the corresponding colour-magnitude diagram, consistent with previous works despite our increased fit flexibility. All results are integrated into the GAMA database.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10077v1"
    ],
    "publication_venue": "Dissertation, Universität Hamburg, 2022. Parts of this thesis are also published in MNRAS 516, 942 - 974 (arxiv:2208.07608) with further parts to be included in a forthcoming paper. The thesis contains much more technical detail than either journal publication. 238 pages, 73 figures, 15 tables"
}