{
    "arxiv_id": "2303.09201",
    "paper_title": "Picture-word interference in language production studies: Exploring the roles of attention and processing times",
    "authors": [
        "Audrey Bürki",
        "Sylvain Madec"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.NC",
        "q-bio.QM"
    ],
    "abstract": "The picture-word interference paradigm (participants name target pictures while ignoring distractor words) is often used to model the planning processes involved in word production. The participants' naming times are delayed in the presence of a distractor (general interference). The size of this effect depends on the relationship between the target and distractor words. Distractors of the same semantic category create more interference (semantic interference), distractors overlapping in phonology create less interference (phonological facilitation). The present study examines the relationships between these experimental effects, processing times, and attention in order to better understand the cognitive processes underlying participants' behavior in this paradigm. Participants named pictures with a superimposed line of Xs, semantically related distractors, phonologically related distractors, or unrelated distractors. General interference, semantic interference, and phonological facilitation effects are replicated. Distributional analyses reveal that general and semantic interference effects increase with naming times, while phonological facilitation decreases. The phonological facilitation and semantic interference effects are found to depend on the synchronicity in processing times between the planning of the picture's name and the processing of the distractor word. Finally, EEG power in the alpha band before stimulus onset varied with the position of the trial in the experiment and with repetition but did not predict the size of interference or facilitation effects. Taken together, these results suggest that experimental effects in the picture-word interference paradigm depend on processing times to both the target word and distractor word and that distributional patterns could party reflect this dependency.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09201v1"
    ],
    "publication_venue": null
}