{
    "arxiv_id": "2303.09851",
    "paper_title": "Calculation of the energies of the multideterminant states of the nitrogen vacancy center in diamond with quantum Monte Carlo",
    "authors": [
        "Kristoffer Simula",
        "Ilja Makkonen"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-04-17"
    ],
    "latest_version": 3,
    "categories": [
        "physics.comp-ph"
    ],
    "abstract": "Certain point defects in solids can efficiently be used as qubits for applications in quantum technology. They have spin states that are initializable, readable, robust, and can be manipulated optically. New theoretical methods are needed to find the best host materials and defect configurations. Most methods proposed so far rely either on cluster models or restrict the many-body treatment of the defects to a subspace of single-particle orbitals. We explore best practices and theory for the use of quantum Monte Carlo to predict the excitation spectra for spin defects, by using the negatively charged nitrogen vacancy (NV$^-$) center in diamond as a test system. Quantum Monte Carlo can be used to explicitly simulate electronic correlations with larger systems and sets of orbitals than previous methods due to favourable scaling with respect to system size and computing power. We consider different trial wave functions for variational and diffusion Monte Carlo methods, explore the nodal surface errors of the ground and excited state wave functions and study whether the variational principle holds for the excited states. We compute the vertical excitation energies in different simulation cell sizes and extrapolate to infinite system size, and include backflow corrections to the extrapolated energies. The final results for vertical excitation energies are found to overestimate the experimental estimates, but the triplet-to-triplet and singlet-to-singlet transitions are accurate against experiment. Finally, we list further developments for QMC needed to address the problem of accurately predicting structural and spin properties of the solid-state defects.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09851v1",
        "http://arxiv.org/pdf/2303.09851v2",
        "http://arxiv.org/pdf/2303.09851v3"
    ],
    "publication_venue": null
}