{
    "arxiv_id": "2303.15498",
    "paper_title": "X-ray scaling relations of early-type galaxies in IllustrisTNG and a new way of identifying backsplash objects",
    "authors": [
        "Yunchong Wang",
        "Mark Vogelsberger",
        "Dong-Woo Kim",
        "Josh Borrow",
        "Aaron Smith",
        "Lars Hernquist",
        "Wenjie Lin",
        ".",
        "Stanford",
        "MIT",
        "Harvard",
        "Columbia"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE"
    ],
    "abstract": "We investigate how feedback and environment shapes the X-ray scaling relations of early-type galaxies (ETGs), especially at the low-mass end. We select central-ETGs from the IllustrisTNG-100 box that have stellar masses $\\log_{10}(M_{\\ast}/\\mathrm{M_{\\odot}})\\in[10.7, 11.9]$. We derive mock X-ray luminosity ($L_{\\mathrm{X, 500}}$) and spectroscopic-like temperature ($T_{\\mathrm{sl, 500}}$) of hot gas within $R_{500}$ of the ETG haloes using the MOCK-X pipeline. The scaling between $L_{\\mathrm{X, 500}}$ and the total mass within 5 effective radii ($M_{5R_{\\rm e}}$) agrees well with observed ETGs from Chandra. IllustrisTNG reproduces the observed increase in scatter of $L_{\\mathrm{X, 500}}$ towards lower masses, and we find that ETGs with $\\log_{10} (M_{5R_{\\rm e}}/\\mathrm{M_{\\odot}}) \\leqslant 11.5$ with above-average $L_{\\mathrm{X, 500}}$ experienced systematically lower cumulative kinetic AGN feedback energy historically (vice versa for below-average ETGs). This leads to larger gas mass fractions and younger stellar populations with stronger stellar feedback heating, concertedly resulting in the above-average $L_{\\mathrm{X, 500}}$. The $L_{\\mathrm{X, 500}}$--$T_{\\mathrm{sl, 500}}$ relation shows a similar slope to the observed ETGs but the simulation systematically underestimates the gas temperature. Three outliers that lie far below the $L_{\\rm X}$--$T_{\\rm sl}$ relation all interacted with larger galaxy clusters recently and demonstrate clear features of environmental heating. We propose that the distinct location of these backsplash ETGs in the $L_{\\rm X}$--$T_{\\rm sl}$ plane could provide a new way of identifying backsplash galaxies in future X-ray surveys.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15498v1"
    ],
    "publication_venue": "16 pages, 10 figures. Submitted to MNRAS"
}