{
    "arxiv_id": "2303.12848",
    "paper_title": "Test-time Defense against Adversarial Attacks: Detection and Reconstruction of Adversarial Examples via Masked Autoencoder",
    "authors": [
        "Yun-Yun Tsai",
        "Ju-Chin Chao",
        "Albert Wen",
        "Zhaoyuan Yang",
        "Chengzhi Mao",
        "Tapan Shah",
        "Junfeng Yang"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV",
        "cs.LG"
    ],
    "abstract": "Existing defense methods against adversarial attacks can be categorized into training time and test time defenses. Training time defense, i.e., adversarial training, requires a significant amount of extra time for training and is often not able to be generalized to unseen attacks. On the other hand, test time defense by test time weight adaptation requires access to perform gradient descent on (part of) the model weights, which could be infeasible for models with frozen weights. To address these challenges, we propose DRAM, a novel defense method to Detect and Reconstruct multiple types of Adversarial attacks via Masked autoencoder (MAE). We demonstrate how to use MAE losses to build a KS-test to detect adversarial attacks. Moreover, the MAE losses can be used to repair adversarial samples from unseen attack types. In this sense, DRAM neither requires model weight updates in test time nor augments the training set with more adversarial samples. Evaluating DRAM on the large-scale ImageNet data, we achieve the best detection rate of 82% on average on eight types of adversarial attacks compared with other detection baselines. For reconstruction, DRAM improves the robust accuracy by 6% ~ 41% for Standard ResNet50 and 3% ~ 8% for Robust ResNet50 compared with other self-supervision tasks, such as rotation prediction and contrastive learning.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12848v1",
        "http://arxiv.org/pdf/2303.12848v2"
    ],
    "publication_venue": null
}