{
    "arxiv_id": "2303.07859",
    "paper_title": "Poisson-Nernst-Planck charging dynamics of an electric double layer capacitor: symmetric and asymmetric binary electrolytes",
    "authors": [
        "Ivan Palaia",
        "Adelchi J. Asta",
        "Megh Dutta",
        "Patrick B. Warren",
        "Benjamin Rotenberg",
        "Emmanuel Trizac"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2025-06-04"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.soft",
        "physics.chem-ph"
    ],
    "abstract": "A parallel plate capacitor containing an electrolytic solution is the simplest model of a supercapacitor, or electric double layer capacitor. Using both analytical and numerical techniques, we solve the Poisson-Nernst-Planck equations for such a system, describing the mean-field charging dynamics of the capacitor, when a constant potential difference is abruptly applied to its plates. Working at constant total number of ions, we focus on the physical processes involved in the relaxation and, whenever possible, give its functional shape and exact time constants. We first review and study the case of a symmetric binary electrolyte, where we assume the two ionic species to have the same charges and diffusivities. We then relax these assumptions and present results for a generic strong (i.e. fully dissociated) binary electrolyte. At low electrolyte concentration, the relaxation is simple to understand, as the dynamics of positive and negative ions appear decoupled. At higher electrolyte concentration, we distinguish several regimes. In the linear regime (low voltages), relaxation is multi-exponential, it starts by the build-up of the equilibrium charge profile and continues with neutral mass diffusion, and the relevant time scales feature both the average and the Nernst-Hartley diffusion coefficients. In the purely nonlinear regime (intermediate voltages), the initial relaxation is slowed down exponentially due to increased capacitance, while bulk effects become more and more evident. In the fully nonlinear regime (high voltages), the dynamics of charge and mass are completely entangled and, asymptotically, the relaxation is linear in time. We finally discuss non-ideal behavior in real capacitors and provide conditions for which mean-field is expected to hold.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07859v1",
        "http://arxiv.org/pdf/2303.07859v2"
    ],
    "publication_venue": null
}