{
    "arxiv_id": "2303.15316",
    "paper_title": "XVoxel-Based Parametric Design Optimization of Feature Models",
    "authors": [
        "Ming Li",
        "Chengfeng Lin",
        "Wei Chen",
        "Yusheng Liu",
        "Shuming Gao",
        "Qiang Zou"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CE",
        "cs.CV",
        "cs.GR"
    ],
    "abstract": "Parametric optimization is an important product design technique, especially in the context of the modern parametric feature-based CAD paradigm. Realizing its full potential, however, requires a closed loop between CAD and CAE (i.e., CAD/CAE integration) with automatic design modifications and simulation updates. Conventionally the approach of model conversion is often employed to form the loop, but this way of working is hard to automate and requires manual inputs. As a result, the overall optimization process is too laborious to be acceptable. To address this issue, a new method for parametric optimization is introduced in this paper, based on a unified model representation scheme called eXtended Voxels (XVoxels). This scheme hybridizes feature models and voxel models into a new concept of semantic voxels, where the voxel part is responsible for FEM solving, and the semantic part is responsible for high-level information to capture both design and simulation intents. As such, it can establish a direct mapping between design models and analysis models, which in turn enables automatic updates on simulation results for design modifications, and vice versa -- effectively a closed loop between CAD and CAE. In addition, robust and efficient geometric algorithms for manipulating XVoxel models and efficient numerical methods (based on the recent finite cell method) for simulating XVoxel models are provided. The presented method has been validated by a series of case studies of increasing complexity to demonstrate its effectiveness. In particular, a computational efficiency improvement of up to 55.8 times the existing FCM method has been seen.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15316v1"
    ],
    "publication_venue": "22 pages"
}