{
    "arxiv_id": "2303.17585",
    "paper_title": "The He I 10830 A line: Radiative Transfer and differential illumination effects",
    "authors": [
        "Andres Vicente Arevalo",
        "Jiri Stepan",
        "Tanausu del Pino Aleman",
        "Maria Jesus Martinez Gonzalez"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "We study the formation of the Stokes profiles of the He I multiplet at 10830 A when relaxing two of the approximations that are often considered in the modeling of this multiplet, namely the lack of self-consistent radiation transfer and the assumption of equal illumination of the individual multiplet components. This He I multiplet is among the most important ones for the diagnostic of the outer solar atmosphere from spectropolarimetric observations, especially in prominences, filaments, and spicules. However, the goodness of these approximations is yet to be assessed, especially in situations where the optical thickness is of the order or larger than one, and radiation transfer has a significant impact in the local anisotropy and the ensuing spectral line polarization. This issue becomes particularly relevant in the ongoing development of new inversion tools which take into account multi-dimensional radiation transfer effects. To relax these approximations we generalize the multi-term equations for the atomic statistical equilibrium to allow for differential illumination of the multiplet components and implement them in a one-dimensional radiative transfer code. We find that, even for this simple geometry and relatively small optical thickness, both radiation transfer and differential illumination effects have a significant impact on the emerging polarization profiles. This should be taken into account in order to avoid potentially significant errors in the inference of the magnetic field vector.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17585v1"
    ],
    "publication_venue": "8 pages, 4 figures, submitted to Astronomy & Astrophysics"
}