{
    "arxiv_id": "2303.08000",
    "paper_title": "On Vector Spaces with Formal Infinite Sums",
    "authors": [
        "Pietro Freni"
    ],
    "submission_date": "2023-01-30",
    "revised_dates": [
        "2023-11-27"
    ],
    "latest_version": 2,
    "categories": [
        "math.CT",
        "math.LO"
    ],
    "abstract": "We discuss possible definitions of categories of vector spaces over a fixed field $\\mathbf{k}$ enriched with a notion of formal infinite linear combination in the likes of the formal infinite linear combinations one has in the context of generalized power series. We call these \\emph{categories of reasonable strong vector spaces} (c.r.s.v.s.). We show that, in a precise sense, the more general possible definition for a reasonable strong vector space is that of a small $\\mathbf{k}$-additive endofunctor of $\\mathrm{Vect}_\\mathbf{k}$ such that for every cardinal $λ$ there are no non-zero natural transformations from $\\mathrm{Vect}(\\mathbf{k},-)^λ/\\mathrm{Vect}(\\mathbf{k}, -)^{\\oplus λ}$ to $X$. We denote the category such functors $Σ\\mathrm{Vect}$. We compare $Σ\\mathrm{Vect}$ to the category of ``naive\" strong vector spaces $BΣ\\mathrm{Vect}$ constructed in a specific way and to the c.r.s.v.s. $K\\mathrm{TVect}_s$ of separated linearly topologized spaces that are generated by linearly compact spaces. We study the number of iterations of a natural approximate reflector on $\\mathrm{Ind}\\text{-}(\\mathrm{Vect}^{\\text{op}})$ needed to construct the orthogonal reflector onto $Σ\\mathrm{Vect}$ because it relates to the problem of constructing the smallest subspace of an $X \\in Σ\\mathrm{Vect}$ closed under taking infinite linear combinations containing a given linear subspace of $H$ of $X$. We give a complete answer in the case $X$ is $\\aleph_1$-ary. Finally we show how the natural monoidal closed structure on $\\mathrm{Ind}\\text{-}(\\mathrm{Vect}^{\\text{op}})$ induces one on $Σ\\mathrm{Vect}$ and apply this to define an infinite-sum-sensitive notion of Kähler differentials for generalized power series. Most of the technical results apply to a more general class of reflective subcategories of $\\mathrm{Ind}\\text{-}(\\mathrm{Vect}^{\\text{op}})$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08000v1",
        "http://arxiv.org/pdf/2303.08000v2"
    ],
    "publication_venue": "65 pages. Changelog: minor changes to abstract; reworked overview; minor fixes in some proofs; added Subsection 3.4; fixed a mistake in Section 7 (old Proposition 7.4 and some of its consequences were false)"
}