{
    "arxiv_id": "2303.14232",
    "paper_title": "Effects of extending residencies on the supply of family medicine practitioners; difference-in-differences evidence from the implementation of mandatory family medicine residencies in Canada",
    "authors": [
        "Stephenson Strobel"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "econ.GN"
    ],
    "abstract": "Background: There is currently interest in extending medical residency training in several countries including the United States and Canada. There is little evidence on what impacts extending medical residency has on supply of primary care practitioners.\n  Methods: I leverage the province-by-province roll-out of mandatory family medicine residencies in Canada from 1976 to 1994. This mandated that practitioners had to complete a two year residency instead of a one year internship. I use annual Canadian Institute of Health Information data on supply of physicians by specialty and province. I employ a difference-in-differences estimation strategy comparing specialties impacted by the legislation to those that had no change in their residency length (first difference). I compare before and after legislation by province (second difference).\n  Results: I find reductions in the supply of family medicine practitioners in the range of 5-10% of overall supply after implementation of a longer residency. This reduction is statistically significant lasting five years after mandate and point estimates of supply do not return to baseline until eight years after mandates. I find increases in the number of graduates of other programs that might plausibly substitute for family medicine suggestive that the policy drove medical students towards other residencies.\n  Conclusion: Extending residency length has the potential to cause declines in physician supply over the short to medium run. There are both direct effects on physician supply through delays in cohorts as well as indirect effects through substitution away from family medicine residencies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14232v1"
    ],
    "publication_venue": null
}