{
    "arxiv_id": "2303.12740",
    "paper_title": "Inverting the Fundamental Diagram and Forecasting Boundary Conditions: How Machine Learning Can Improve Macroscopic Models for Traffic Flow",
    "authors": [
        "Maya Briani",
        "Emiliano Cristiani",
        "Elia Onofri"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2024-12-06"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cs.CE"
    ],
    "abstract": "In this paper, we aim at developing new methods to join machine learning techniques and macroscopic differential models for vehicular traffic estimation and forecast. It is well known that data-driven and model-driven approaches have (sometimes complementary) advantages and drawbacks. We consider here a dataset with flux and velocity data of vehicles moving on a highway, collected by fixed sensors and classified by lane and by class of vehicle. By means of a machine learning model based on an LSTM recursive neural network, we extrapolate two important pieces of information: 1) if congestion is appearing under the sensor, and 2) the total amount of vehicles which is going to pass under the sensor in the next future (30 min). These pieces of information are then used to improve the accuracy of an LWR-based first-order multi-class model describing the dynamics of traffic flow between sensors. The first piece of information is used to invert the (concave) fundamental diagram, thus recovering the density of vehicles from the flux data, and then inject directly the density datum in the model. This allows one to better approximate the dynamics between sensors, especially if an accident happens in a not monitored stretch of the road. The second piece of information is used instead as boundary conditions for the equations underlying the traffic model, to better reconstruct the total amount of vehicles on the road at any future time. Some examples motivated by real scenarios will be discussed. Real data are provided by the Italian motorway company Autovie Venete S.p.A.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12740v1"
    ],
    "publication_venue": "38 pages",
    "doi": "10.1007/s10444-024-10206-8"
}