{
    "arxiv_id": "2303.09883",
    "paper_title": "On the propagation of Alfvén waves in the dusty interstellar medium. Can we neglect dust inertia in molecular clouds?",
    "authors": [
        "P. Hennebelle",
        "U. Lebreuilly"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Alfvén waves are fundamental magnetized modes which play an important role in the dynamics of magnetized flows such as the interstellar medium (ISM). In weakly ionised medium, their propagation critically depends on the ionisation rate but also on the charge carriers which, depending on gas density can be ions, electrons or dust grains. The latter in particular are well known to have a drastic influence on the magnetic resistivities in the dense ISM such as collapsing dense cores. Yet, in most calculations, for numerical reasons, the grain inertia is usually neglected. We investigate analytically the propagation of Alfvén waves both in a single-size and multi-size grain medium such as the ISM and we obtain exact expressions giving wavenumbers as a function of wave frequencies. These expressions are then solved analytically or numerically taking into account or neglecting grain inertia. Whereas at large wavelengths, neglecting grain inertia is a very good approximation, the situation is rather different for wavelengths shorter than a critical value, which broadly scales as $1/n$, $n$ being the gas density. More precisely, when inertia is neglected the waves do not propagate at short wavelengths or, due to the Hall effect, develop for one circular polarisation only, a whistler mode such that ${\\cal R} _e (ω) \\propto k^2$, whereas the other polarisation presents a zero group velocity, i.e. ${\\cal R} _e (ω) \\propto k^0$. When grain inertia is accounted for, the propagation of the two polarisations tend to be more symmetrical and the whistler mode is only present at density higher than $\\simeq 10^8$ cm$^{-3}$. At lower density it is replaced by a mode having ${\\cal R} _e (ω) \\propto k^{\\simeq 1.2}$. Abridged",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09883v1"
    ],
    "publication_venue": "submitted in A&A, comments welcome",
    "doi": "10.1051/0004-6361/202245120"
}