{
    "arxiv_id": "2303.09302",
    "paper_title": "On the motion of hairpin filaments in the atmospheric boundary layer",
    "authors": [
        "Abhishek Harikrishnan",
        "Marie Rodal",
        "Rupert Klein",
        "Daniel Margerit",
        "Nikki Vercauteren"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-07-25"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "A recent work of Harikrishnan et al. [arXiv:2110.02253 (2021)] has revealed an abundance of hairpin-like vortex structures, oriented in a similar direction, in the turbulent patches of a stably stratified Ekman flow. The Ekman flow over a smooth wall is a simplified configuration of the Atmospheric Boundary Layer (ABL) where effects of both stratification and rotation are present. In this study, hairpin-like structures are investigated by treating them as slender vortex filaments, i.e., a vortex filament whose diameter $d$ is small when compared to its radius of curvature $R$. The corrected thin-tube model of Klein and Knio [J. Fluid Mech. (1995)] is used to compute the motion of these filaments with the ABL as a background flow. The influence of the mean background flow on the filaments is studied for two stably stratified cases and a neutrally stratified case. Our results suggest that the orientation of the hairpin filament in the spanwise direction is linked to its initial starting height under stable stratification whereas no such dependency can be observed with the neutrally stratified background flow. An improved feature tracking scheme based on spatial overlap for tracking $Q$-criterion vortex structures on the Direct Numerical Simulation (DNS) data is also developed. It overcomes the limitation of using a constant threshold in time by dynamically adjusting the thresholds to accommodate the growth or deterioration of a feature. A comparison between the feature tracking and the filament simulation reveals qualitatively similar temporal developments. Finally, an extension of the asymptotic analysis of Callegari and Ting [J. App. Math (1978)] is carried out to include the effect of gravity. The results show that, in the regime considered here, a contribution from the gravity term occurs only when the tail of an infinitely long filament is tilted at an angle relative to the wall.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09302v1"
    ],
    "publication_venue": null,
    "doi": "10.1063/5.0151078"
}