{
    "arxiv_id": "2303.15962",
    "paper_title": "Exploring the internal rotation of the extremely low-mass He-core white dwarf GD 278 with TESS asteroseismology",
    "authors": [
        "Leila M. Calcaferro",
        "Alejandro H. Córsico",
        "Leandro G. Althaus",
        "Isaac D. Lopez",
        "J. J. Hermes"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "(Abridged) We present an exploration of the internal rotation of GD 278, the first pulsating extremely low-mass white dwarf that shows rotational splittings within its periodogram. We assess the theoretical frequency splittings expected for different rotation profiles and compare them to the observed frequency splittings of GD 278. To this aim, we employ an asteroseismological model representative of the pulsations of this star, obtained by using the LPCODE stellar evolution code. We also derive a rotation profile that results from detailed evolutionary calculations carried out with the MESA stellar evolution code and use it to infer the expected theoretical frequency splittings. We found that the best-fitting solution when assuming linear profiles for the rotation of GD 278 leads to values of the angular velocity at the surface and the center that are only slightly differential, and still compatible with rigid rotation. The values of the angular velocity at the surface and the center for the simple linear rotation profiles and for the rotation profile derived from evolutionary calculations are in very good agreement. Also, the resulting theoretical frequency splittings are compatible with the observed frequency splittings, in general, for both cases. The results obtained from the different approaches followed in this work to derive the internal rotation of GD 278 agree. The fact that they were obtained employing two independent stellar evolution codes gives robustness to our results. Our results suggest only a marginally differential behavior for the internal rotation in GD 278, and considering the uncertainties involved, very compatible with the rigid case, as has been observed previously for white dwarfs and pre-white dwarfs. The rotation periods derived for this star are also in line with the values determined asteroseismologically for white dwarfs and pre-white dwarfs in general.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15962v1"
    ],
    "publication_venue": "9 pages, 6 figures. Accepted for publication in Astronomy & Astrophysics",
    "doi": "10.1051/0004-6361/202346007"
}