{
    "arxiv_id": "2303.10374",
    "paper_title": "Constitutive theory of saturated porous media considering porosity-dependent skeleton strain and chemical activity",
    "authors": [
        "Ya-yuan Hu",
        "Shu-hang Yuan"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft",
        "physics.geo-ph"
    ],
    "abstract": "In order to reveal the coupling effect among the chemical activity and the hydraulic seepage as well as the mechanical properties, a constitutive theoretical framework considering the chemical activity for saturated porous media is derived from the mixture theory incorporated with the chemical thermodynamics. First, to highlight the important role of porosity in the hydro-mechanical-chemical multi-field coupling mechanism, the solid strain is divided into the porosity-dependent skeleton strain, the matrix strain and the mass-exchange strain. The stress and strain state variables are determined from the energy-conjugated form of the energy balance equation for establishing constitutive equations. Second, under infinitesimal case, general elastic constitutive equations including the relationship between mass fraction and its chemical potential are expressed by the free energy potential. Plastic model and the constitutive equation of thermodynamic flux and force are derived from the dissipative potential. Finally, under the guide of this theoretical framework, the complete swelling constitutive models in the confined compression are established for bentonite. The corresponding governing equations are formulated for multi-field two-phase saturated porous media. Compared with the experimental data, the proposed model can well reflect the chemical and mechanic coupling characteristics of representative elementary volume in the different NaCl concentrations of solution for saturated bentonite.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10374v1"
    ],
    "publication_venue": "64 pages, 9 figures"
}