{
    "arxiv_id": "2303.10192",
    "paper_title": "Nonlinear dynamics of small-scale Alfvén waves",
    "authors": [
        "Alfred Mallet",
        "Seth Dorfman",
        "Mel Abler",
        "Trevor Bowen",
        "Christopher H. K. Chen"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.plasm-ph",
        "physics.space-ph"
    ],
    "abstract": "We study the nonlinear evolution of very oblique small-scale Alfvén waves with $k_\\perp d_i\\gtrsim 1$. At these scales, the waves become significantly compressive, unlike in MHD, due to the Hall term in the equations. We demonstrate that when frequencies are small compared to the ion gyrofrequency and amplitudes small compared to unity, no new nonlinear interaction appears due to the Hall term alone at the lowest non-trivial order, even when $k_\\perp d_i \\sim 1$. However, at the second non-trivial order, we discover that the Hall physics leads to a slow but resonant nonlinear interaction between co-propagating Alfvén waves, an inherently 3D effect. Including the effects of finite temperature, finite frequency, and electron inertia, the two-fluid Alfvén wave also becomes dispersive once one or more of $k_\\perp ρ_s$, $k_\\perp d_e$, or $k_\\parallel d_i$ becomes significant: for oblique waves at low $β$ as studied here, this can be at a much smaller scale than $d_i$. We show that the timescale for one-dimensional steepening of two-fluid Alfven waves is only significant at these smaller dispersive scales, and also derive an expression for the amplitude of driven harmonics of a primary wave. Importantly, both new effects are absent in gyrokinetics and other commonly used reduced two-fluid models. Our calculations have relevance for the interpretation of laboratory Alfvén wave experiments, as well as shedding light on the physics of turbulence in the solar corona and inner solar wind, where the dominant nonlinear interaction between counter-propagating waves is suppressed, allowing these new effects to become important.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10192v1"
    ],
    "publication_venue": "17 pages; submitted to Physics of Plasmas"
}