{
    "arxiv_id": "2303.11410",
    "paper_title": "Targeted Analysis of High-Risk States Using an Oriented Variational Autoencoder",
    "authors": [
        "Chenguang Wang",
        "Ensieh Sharifnia",
        "Simon H. Tindemans",
        "Peter Palensky"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY",
        "cs.LG"
    ],
    "abstract": "Variational autoencoder (VAE) neural networks can be trained to generate power system states that capture both marginal distribution and multivariate dependencies of historical data. The coordinates of the latent space codes of VAEs have been shown to correlate with conceptual features of the data, which can be leveraged to synthesize targeted data with desired features. However, the locations of the VAEs' latent space codes that correspond to specific properties are not constrained. Additionally, the generation of data with specific characteristics may require data with corresponding hard-to-get labels fed into the generative model for training. In this paper, to make data generation more controllable and efficient, an oriented variation autoencoder (OVAE) is proposed to constrain the link between latent space code and generated data in the form of a Spearman correlation, which provides increased control over the data synthesis process. On this basis, an importance sampling process is used to sample data in the latent space. Two cases are considered for testing the performance of the OVAE model: the data set is fully labeled with approximate information and the data set is incompletely labeled but with more accurate information. The experimental results show that, in both cases, the OVAE model correlates latent space codes with the generated data, and the efficiency of generating targeted samples is significantly improved.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11410v1"
    ],
    "publication_venue": "10 pages, 10 figures, 1 table"
}