{
    "arxiv_id": "2303.12710",
    "paper_title": "A Unified Arbitrary Style Transfer Framework via Adaptive Contrastive Learning",
    "authors": [
        "Yuxin Zhang",
        "Fan Tang",
        "Weiming Dong",
        "Haibin Huang",
        "Chongyang Ma",
        "Tong-Yee Lee",
        "Changsheng Xu"
    ],
    "submission_date": "2023-03-09",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV",
        "cs.GR"
    ],
    "abstract": "We present Unified Contrastive Arbitrary Style Transfer (UCAST), a novel style representation learning and transfer framework, which can fit in most existing arbitrary image style transfer models, e.g., CNN-based, ViT-based, and flow-based methods. As the key component in image style transfer tasks, a suitable style representation is essential to achieve satisfactory results. Existing approaches based on deep neural network typically use second-order statistics to generate the output. However, these hand-crafted features computed from a single image cannot leverage style information sufficiently, which leads to artifacts such as local distortions and style inconsistency. To address these issues, we propose to learn style representation directly from a large amount of images based on contrastive learning, by taking the relationships between specific styles and the holistic style distribution into account. Specifically, we present an adaptive contrastive learning scheme for style transfer by introducing an input-dependent temperature. Our framework consists of three key components, i.e., a parallel contrastive learning scheme for style representation and style transfer, a domain enhancement module for effective learning of style distribution, and a generative network for style transfer. We carry out qualitative and quantitative evaluations to show that our approach produces superior results than those obtained via state-of-the-art methods.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12710v1"
    ],
    "publication_venue": "arXiv admin note: substantial text overlap with arXiv:2205.09542"
}