{
    "arxiv_id": "2303.12660",
    "paper_title": "Production Networks Resilience: Cascading Failures, Power Laws and Optimal Interventions",
    "authors": [
        "Marios Papachristou",
        "M. Amin Rahimian"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2024-01-26"
    ],
    "latest_version": 2,
    "categories": [
        "cs.SI",
        "math.PR",
        "math.ST"
    ],
    "abstract": "In this paper, we study the severity of cascading failures in supply chain networks defined by a node percolation process corresponding to product suppliers failing independently due to systemic shocks. We first show that the size of the cascades follows a power law in random directed acyclic graphs, whose topology encodes the natural ordering of products from simple raw materials to complex products. This motivates the need for a supply chain resilience metric, which we define as the maximum magnitude shock that the production network can withstand such that at least $(1 - \\varepsilon)$-fraction of the products are produced with high probability as the size of the production network grows to infinity. Next, we study the resilience of many network architectures and classify them as resilient, where large cascading failures can be avoided almost surely, and as fragile, where large cascades are inevitable. In the next step, we give bounds on the expected size of cascading failures in a given production network graph as the solution to a linear program and show that extending the node percolation process to a joint percolation process that affects the nodes and the links of the production network becomes a special instance of the well-studied financial contagion model of Eisenberg and Noe. We show that under certain assumptions, the Katz centrality of each node can be used as a measure of their vulnerability and give general lower bounds as well as optimal interventions for improving resilience as a function of Katz centralities. Finally, to validate our theoretical results, we empirically calculate the resilience metric and study interventions in a variety of real-world networks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12660v1",
        "http://arxiv.org/pdf/2303.12660v2"
    ],
    "publication_venue": "Minor edits"
}