{
    "arxiv_id": "2303.10141",
    "paper_title": "An HI story of galaxies in Abell 2626 and beyond",
    "authors": [
        "T. Deb",
        "M. A. W. Verheijen",
        "J. M. van der Hulst"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Context: To study the effects of environment on galaxies we use HI observations of galaxies in and around the cluster A2626. The cluster can effectively be divided in three different environments: the cluster itself, a group environment in the periphery of the cluster (we call it the Swarm) and substructure in the cluster itself. We use these to study the dependence of galaxy properties on environment. Aims: We have explored the relationship between HI deficiency, HI morphology, and star formation deficiency for the galaxies in and around the A2626 galaxy cluster to investigate the environmental effects on those properties. Methods: To quantify asymmetries of the outer HI disc of a galaxy, we used 1) three visual classes based on the outermost reliable HI contour (settled, disturbed, unsettled HI discs), 2) the offset between the HI centre and the optical centre of a galaxy, and 3) the modified asymmetry parameter Amod as defined by Lelli et al. (2014). Results: The HI deficiency of a galaxy is strongly correlated with the projected distance from the centre of A2626. Furthermore, substructure galaxies tend to be more asymmetric than the isolated galaxies in A2626, plausibly because of more efficient tidal interactions within substructures than outside substructures. Moreover, asymmetric, offset, and smaller HI discs are not necessarily the result of the cluster environment, as they are also observed in substructures in A2626 and in the Swarm. This signifies that \"pre-processing\" of the HI discs of galaxies in groups or substructures plays an important role, together with the \"processing\" in the cluster environment. Finally, the galaxies in all three environments have slightly lower star-formation rates (SFRs) than the typical SFR for normal galaxies as manifested by their offset from the star formation main sequence, implying effective gas removal mechanisms in all three environments.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10141v1"
    ],
    "publication_venue": "19 pages, 12 figures"
}