{
    "arxiv_id": "2303.08505",
    "paper_title": "RIS-Enabled Smart Wireless Environments: Deployment Scenarios, Network Architecture, Bandwidth and Area of Influence",
    "authors": [
        "George C. Alexandropoulos",
        "Dinh-Thuy Phan-Huy",
        "Kostantinos D. Katsanos",
        "Maurizio Crozzoli",
        "Henk Wymeersch",
        "Petar Popovski",
        "Philippe Ratajczak",
        "Yohann Bénédic",
        "Marie-Helene Hamon",
        "Sebastien Herraiz Gonzalez",
        "Placido Mursia",
        "Marco Rossanese",
        "Vincenzo Sciancalepore",
        "Jean-Baptiste Gros",
        "Sergio Terranova",
        "Gabriele Gradoni",
        "Paolo Di Lorenzo",
        "Moustafa Rahal",
        "Benoit Denis",
        "Raffaele D'Errico",
        "Antonio Clemente",
        "Emilio Calvanese Strinati"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cs.IT",
        "cs.ET"
    ],
    "abstract": "Reconfigurable Intelligent Surfaces (RISs) constitute the key enabler for programmable electromagnetic propagation environments, and are lately being considered as a candidate physical-layer technology for the demanding connectivity, reliability, localization, and sustainability requirements of next generation wireless networks. In this paper, we first present the deployment scenarios for RIS-enabled smart wireless environments that have been recently designed within the ongoing European Union Horizon 2020 RISE-6G project, as well as a network architecture integrating RISs with existing standardized interfaces. We identify various RIS deployment strategies and sketch the core architectural requirements in terms of RIS control and signaling, depending on the RIS hardware architectures and respective capabilities. Furthermore, we introduce and discuss, with the aid of simulations and reflectarray measurements, two novel metrics that emerge in the context of RIS-empowered wireless systems: the RIS bandwidth and area of influence. Their extensive investigation corroborates the need for careful deployment and planning of the RIS technology in future networks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08505v1"
    ],
    "publication_venue": "43 pages, 21 figures, sumbitted for a journal publication. arXiv admin note: text overlap with arXiv:2203.13478"
}