{
    "arxiv_id": "2303.11711",
    "paper_title": "Born-Infeld-AdS black hole phase structure: Landau theory and free energy landscape approaches",
    "authors": [
        "Md Sabir Ali",
        "Hasan El Moumni",
        "Jamal Khalloufi",
        "Karima Masmar"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2025-05-13"
    ],
    "latest_version": 1,
    "categories": [
        "hep-th"
    ],
    "abstract": "We start with a brief overview of the basic thermodynamic properties of the Born-Infeld metric in AdS spacetime. Using the concept of the enthalpy characterizing the total mass of the black hole, in our present paper, we probe the thermal phase transition structure, the dynamic and kinetic behavior of the Born-Infeld-AdS black hole. The emergence of the triple point behavior and the possible ruling out the reentrant phase transition, for a certain parametric value of the charge on the free energy landscape, we scrutinize the stochastic dynamics and the kinetic processes. We describe such processes during the black hole phase transitions in terms of the Landau functional and equivalently by the Fokker-Planck equation in the context of black hole chemistry.\n  Our analysis establishes a pertinent bridge between the thermal behavior among the different states of the Van-der-Waals-like fluids and the Born-Infeld-AdS black holes phases. To visualize the direct implications of the Landau functional of the usual Van-der-Waals-like fluids, we consistently employed the generic Landau formalism for the analysis of the black hole phase transitions of the Born-Infeld-AdS black holes. We find that such investigations are worthy of study in implementing the continuous phase transition behavior during the Hawking radiation. For more details, and in addition to the exploitation of the Landau functional, we introduce ...",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11711v1"
    ],
    "publication_venue": "56 pages, and 21 figures",
    "doi": "10.1038/s41598-025-88842-3"
}