{
    "arxiv_id": "2303.12873",
    "paper_title": "From Compact Plasma Particle Sources to Advanced Accelerators with Modeling at Exascale",
    "authors": [
        "Axel Huebl",
        "Remi Lehe",
        "Edoardo Zoni",
        "Olga Shapoval",
        "Ryan T. Sandberg",
        "Marco Garten",
        "Arianna Formenti",
        "Revathi Jambunathan",
        "Prabhat Kumar",
        "Kevin Gott",
        "Andrew Myers",
        "Weiqun Zhang",
        "Ann Almgren",
        "Chad E. Mitchell",
        "Ji Qiang",
        "David Grote",
        "Alexander Sinn",
        "Severin Diederichs",
        "Maxence Thevenet",
        "Luca Fedeli",
        "Thomas Clark",
        "Neil Zaim",
        "Henri Vincenti",
        "Jean-Luc Vay"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "physics.acc-ph",
        "cs.SE",
        "physics.plasm-ph"
    ],
    "abstract": "Developing complex, reliable advanced accelerators requires a coordinated, extensible, and comprehensive approach in modeling, from source to the end of beam lifetime. We present highlights in Exascale Computing to scale accelerator modeling software to the requirements set for contemporary science drivers. In particular, we present the first laser-plasma modeling on an exaflop supercomputer using the US DOE Exascale Computing Project WarpX. Leveraging developments for Exascale, the new DOE SCIDAC-5 Consortium for Advanced Modeling of Particle Accelerators (CAMPA) will advance numerical algorithms and accelerate community modeling codes in a cohesive manner: from beam source, over energy boost, transport, injection, storage, to application or interaction. Such start-to-end modeling will enable the exploration of hybrid accelerators, with conventional and advanced elements, as the next step for advanced accelerator modeling. Following open community standards, we seed an open ecosystem of codes that can be readily combined with each other and machine learning frameworks. These will cover ultrafast to ultraprecise modeling for future hybrid accelerator design, even enabling virtual test stands and twins of accelerators that can be used in operations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12873v1"
    ],
    "publication_venue": "4 pages, 3 figures, submitted to the 20th Advanced Accelerator Concepts Workshop (AAC22)"
}