{
    "arxiv_id": "2303.10793",
    "paper_title": "Modeling CME encounters at Parker Solar Probe with OSPREI: Dependence on photospheric and coronal conditions",
    "authors": [
        "Vincent E. Ledvina",
        "Erika Palmerio",
        "Christina Kay",
        "Nada Al-Haddad",
        "Pete Riley"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "physics.space-ph"
    ],
    "abstract": "Context: Coronal mass ejections (CMEs) are eruptions of plasma from the Sun that travel through interplanetary space and may encounter Earth. CMEs often enclose a magnetic flux rope (MFR), the orientation of which largely determines the CME's geoeffectiveness. Current operational CME models do not model MFRs, but a number of research ones do, including the Open Solar Physics Rapid Ensemble Information (OSPREI) model. Aims: We report the sensitivity of OSPREI to a range of user-selected photospheric and coronal conditions. Methods: We model four separate CMEs observed in situ by Parker Solar Probe (PSP). We vary the input photospheric conditions using four input magnetograms (HMI Synchronic, HMI Synoptic, GONG Synoptic Zero-Point Corrected, and GONG ADAPT). To vary the coronal field reconstruction, we employ the Potential-Field Source-Surface (PFSS) model and we vary its source-surface height in the range 1.5--3.0 R$_{\\odot}$ with 0.1 R$_{\\odot}$ increments. Results: We find that both the input magnetogram and PFSS source surface often affect the evolution of the CME as it propagates through the Sun's corona into interplanetary space, and therefore the accuracy of the MFR prediction compared to in-situ data at PSP. There is no obvious best combination of input magnetogram and PFSS source surface height. Conclusions: The OSPREI model is moderately sensitive to the input photospheric and coronal conditions. Based on where the source region of the CME is located on the Sun, there may be best practices when selecting an input magnetogram to use.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10793v1"
    ],
    "publication_venue": "19 pages, 10 figures, 1 table, accepted for publication in Astronomy & Astrophysics",
    "doi": "10.1051/0004-6361/202245445"
}