{
    "arxiv_id": "2303.13623",
    "paper_title": "The Gallium Neutrino Absorption Cross Section and its Uncertainty",
    "authors": [
        "W. C. Haxton",
        "E. J. Rule",
        "S. R. Elliott",
        "V. N. Gavrin",
        "T. V. Ibragimova"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-06-23"
    ],
    "latest_version": 2,
    "categories": [
        "nucl-th",
        "hep-ex",
        "hep-ph",
        "nucl-ex"
    ],
    "abstract": "In the recent Baksan Experiment on Sterile Transitions (BEST), a suppressed rate of neutrino absorption on a gallium target was observed, consistent with earlier results from neutrino source calibrations of the SAGE and GALLEX/GNO solar neutrino experiments. The BEST collaboration, utilizing a 3.4 MCi 51Cr neutrino source, found observed-to-expected counting rates at two very short baselines of R=0.791 plus/minus 0.05 and 0.766 plus/minus 0.05, respectively. Among recent neutrino experiments, BEST is notable for the simplicity of both its neutrino spectrum, line neutrinos from an electron-capture source whose intensity can be measured to a estimated precision of 0.23%, and its absorption cross section, where the precisely known rate of electron capture to the gallium ground state, 71Ge(e,nue)71Ga(g.s.), establishes a minimum value. However, the absorption cross section uncertainty is a common systematic in the BEST, SAGE, and GALLEX/GNO neutrino source experiments. Here we update that cross section, considering a variety of electroweak corrections and the role of transitions to excited states, to establish both a central value and reasonable uncertainty, thereby enabling a more accurate assessment of the statistical significance of the gallium anomalies. Results are given for 51Cr and 37Ar sources. The revised neutrino capture rates are used in a re-evaluation of the BEST and gallium anomalies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13623v1",
        "http://arxiv.org/pdf/2303.13623v2"
    ],
    "publication_venue": "21 pages, 5 figures"
}