{
    "arxiv_id": "2303.11497",
    "paper_title": "A Critique of the Spite Plateau, and the Astration of Primordial Lithium",
    "authors": [
        "J. E. Norris",
        "D. Yong",
        "A. Frebel",
        "S. G. Ryan"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "We investigate the distribution of the lithium abundances, A(Li), of metal-poor dwarf and subgiant stars within the limits 5500 K < Teff < 6700 K, -6.0 < [Fe/H] < -1.5, and logg > ~3.5 (a superset of parameters first adopted by Spite and Spite), using literature data for some 200 stars. We address the problem of the several methods that yield Teff differences up to 350 K, and hence uncertainties of 0.3 dex in [Fe/H] and A(Li), by anchoring Teff to the Infrared Flux Method. We seek to understand the behaviour of A(Li) as a function of [Fe/H] -- small dispersion at highest [Fe/H], ``meltdown'' at intermediate values (i.e. large spread in Li below the Spite Plateau), and extreme variations at lowest [Fe/H]. Decreasing A(Li) is accompanied by increasing dispersion. Insofar as [Fe/H] increases as the universe ages, the behavior of A(Li) reflects chaotic star formation involving destruction of primordial Li, which settles to the classic Spite Plateau, with A(Li) ~2.3, by the time the Galactic halo reaches [Fe/H] ~ -3.0. We consider three phases: (1) first star formation in C-rich environments ([C/Fe] > 2.3), with depleted Li; (2) silicates-dominated star formation and destruction of primordial Li during pre-main-sequence evolution; and (3) materials from these two phases co-existing and coalescing to form C-rich stars with A(Li) below the Spite Plateau, leading to a toy model with the potential to explain the ``meltdown''. We comment on the results of Mucciarelli et al. on the Lower RGB, and the suggestion of Aguado et al. favouring a lower primordial lithium abundance than generally accepted.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11497v1"
    ],
    "publication_venue": "MNRAS in press (see source file for full versions of long tables)",
    "doi": "10.1093/mnras/stad936"
}