{
    "arxiv_id": "2303.16218",
    "paper_title": "Synchronous coordinates and gauge-invariant observables in cosmological spacetimes",
    "authors": [
        "Markus B. Fröb",
        "William C. C. Lima"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
    ],
    "abstract": "We consider the relational approach to construct gauge-invariant observables in cosmological perturbation theory using synchronous coordinates. We construct dynamical synchronous coordinates as non-local scalar functionals of the metric perturbation in the fully non-linear theory in an arbitrary gauge. We show that the observables defined in this dynamical coordinate system are gauge-independent, and that the full perturbed metric has the expected form in these coordinates. Our construction generalises the familiar synchronous gauge in linearised gravity, widely used in cosmological perturbation theory, to the non-linear theory. We also work out the expressions for the gauge-invariant Einstein equations, sourced either by an ideal fluid or a scalar field up to second order in perturbation theory, and give explicit expressions for the Hubble rate -- as measured by synchronous observers or by observers co-moving with the matter field -- up to that order. Finally, we consider quantised linear perturbations around Minkowski and de Sitter backgrounds, and compute the two-point function of the gauge-invariant metric perturbation in synchronous coordinates, starting with two-point function in a general linear covariant gauge. Although the gauge-fixed two-point function contains gauge modes, we show that the resulting gauge-invariant two-point function only contains the physical tensor modes and it is thus positive, i.e., it has a spectral representation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16218v1"
    ],
    "publication_venue": "52 pages. Comments are welcome"
}