{
    "arxiv_id": "2303.10627",
    "paper_title": "Stacking and Thickness Effects on Cross-Plane Thermal Conductivity of Hexagonal Boron Nitride",
    "authors": [
        "S. G. Wang",
        "H. F. Feng",
        "Zhi-Xin Guo"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-07-11"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "cond-mat.mes-hall"
    ],
    "abstract": "Recently, the in-plane thermal transport in van der Waals (vdW) materials such as graphene, hexagonal boron nitride (h-BN), and transition metal dichalcogenides (TMDs) has been widely studied. Whereas, the cross-plane one is far from sufficient. Based on the non-equilibrium molecular dynamics simulations and Boltzmann transport equation, here we reveal the stacking and thickness effects on the cross-plane thermal conductivity (K) of h-BN. We find that K can be significantly modulated by both the stacking structure and thickness (d) of h-BN, which is unexpected from the viewpoint of its smooth in-plane structure and weak interlayer interaction. In the small thickness region (d<6 nm), K of h-BN at room temperature significantly increases with thickness, following a power law of K ~ d^b with b=0.84, 0.66, and 0.92 for AA', AB, and AB' stacking structures, respectively. Moreover, K of AB' structure reaches up to 60% larger than that of AA' and AB structures with d=5.3 nm, showing the remarkable stacking effect. We also find that the stacking effect on K changes dramatically with d increasing, where AA' stacking has the largest K with d > 200 nm. We finally clarify that such exotic stacking and thickness dependence of K is owing to the competing effect of excited number of phonons and phonon relaxation time, both of which directly affect the thermal conductivity. Our findings may provide new insights into the cross-plane thermal management in vdW materials.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10627v1"
    ],
    "publication_venue": "5 figures"
}