{
    "arxiv_id": "2303.14206",
    "paper_title": "High atmospheric metal enrichment for a Saturn-mass planet",
    "authors": [
        "Jacob L. Bean",
        "Qiao Xue",
        "Prune C. August",
        "Jonathan Lunine",
        "Michael Zhang",
        "Daniel Thorngren",
        "Shang-Min Tsai",
        "Keivan G. Stassun",
        "Everett Schlawin",
        "Eva-Maria Ahrer",
        "Jegug Ih",
        "Megan Mansfield"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Atmospheric metal enrichment (i.e., elements heavier than helium, also called \"metallicity\") is a key diagnostic of the formation of giant planets. The giant planets of the solar system exhibit an inverse relationship between mass and both their bulk metallicities and atmospheric metallicities. Extrasolar giant planets also display an inverse relationship between mass and bulk metallicity. However, there is significant scatter in the relationship and it is not known how atmospheric metallicity correlates with either planet mass or bulk metallicity. Here we show that the Saturn-mass exoplanet HD 149026b has an atmospheric metallicity 59 - 276 times solar (at 1 $σ$), which is greater than Saturn's atmospheric metallicity of ~7.5 times solar at >4 $σ$ confidence. This result is based on modeling CO$_2$ and H$_2$O absorption features in the thermal emission spectrum of the planet measured by JWST. HD 149026b is the most metal-rich giant planet known, with an estimated bulk heavy element abundance of 66 $\\pm$ 2% by mass. We find that the atmospheric metallicities of both HD 149026b and the solar system giant planets are more correlated with bulk metallicity than planet mass.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14206v1"
    ],
    "publication_venue": "Published online in Nature on March 27, 2023; a JWST thermal emission spectrum of a planet that definitely has an atmosphere ;)",
    "doi": "10.1038/s41586-023-05984-y"
}