{
    "arxiv_id": "2303.14823",
    "paper_title": "Microscopic study of the Josephson supercurrent diode effect in 2DEG-based Josephson junctions",
    "authors": [
        "Andreas Costa",
        "Jaroslav Fabian",
        "Denis Kochan"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con"
    ],
    "abstract": "Superconducting systems that simultaneously lack space-inversion and time-reversal symmetries have recently been the subject of a flurry of experimental and theoretical research activities. Their ability to carry supercurrents with magnitudes depending on the polarity (current direction) - termed supercurrent diode effect - might be practically exploited to design dissipationless counterparts of contemporary semiconductor-based diodes. Magnetic Josephson junctions realized in the two-dimensional electron gas (2DEG) within a narrow quantum well through proximity to conventional superconductors perhaps belong to the most striking and versatile platforms for such supercurrent rectifiers. Starting from the Bogoliubov-de Gennes approach, we provide a minimal theoretical model to explore the impact of the spin-orbit coupling and magnetic exchange inside the 2DEG on the Andreev bound states and Josephson current-phase relations. Assuming realistic junction parameters, we evaluate the polarity-dependent critical currents to quantify the efficiency of these Josephson junctions as supercurrent diodes, and discuss the tunability of the Josephson supercurrent diode effect in terms of spin-orbit coupling, magnetic exchange, and transparency of the nonsuperconducting weak link. Furthermore, we demonstrate that the junctions might undergo current-reversing $ 0 $-$ π$-like phase transitions at large enough magnetic exchange, which appear as sharp peaks followed by a sudden suppression in the supercurrent-diode-effect efficiency. The characteristics of the Josephson supercurrent diode effect obtained from our model convincingly reproduce many unique features observed in recent experiments, validating its robustness and suitability for further studies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14823v1"
    ],
    "publication_venue": "11+2 pages, 9 figures"
}