{
    "arxiv_id": "2303.09037",
    "paper_title": "Homography matrix based trajectory planning method for robot uncalibrated visual servoing",
    "authors": [
        "Xiaoyu Lei",
        "Zhongtao Fu",
        "Emmanouil Spyrakos-Papastavridis",
        "Jiabin Pan",
        "Miao Li",
        "Xubing Chen"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-08-30"
    ],
    "latest_version": 2,
    "categories": [
        "cs.RO"
    ],
    "abstract": "In view of the classical visual servoing trajectory planning method which only considers the camera trajectory, this paper proposes one homography matrix based trajectory planning method for robot uncalibrated visual servoing. Taking the robot-end-effector frame as one generic case, eigenvalue decomposition is utilized to calculate the infinite homography matrix of the robot-end-effector trajectory, and then the image feature-point trajectories corresponding to the camera rotation is obtained, while the image feature-point trajectories corresponding to the camera translation is obtained by the homography matrix. According to the additional image corresponding to the robot-end-effector rotation, the relationship between the robot-end-effector rotation and the variation of the image feature-points is obtained, and then the expression of the image trajectories corresponding to the optimal robot-end-effector trajectories (the rotation trajectory of the minimum geodesic and the linear translation trajectory) are obtained. Finally, the optimal image trajectories of the uncalibrated visual servoing controller is modified to track the image trajectories. Simulation experiments show that, compared with the classical IBUVS method, the proposed trajectory planning method can obtain the shortest path of any frame and complete the robot visual servoing task with large initial pose deviation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09037v1",
        "http://arxiv.org/pdf/2303.09037v2"
    ],
    "publication_venue": null
}