{
    "arxiv_id": "2303.17067",
    "paper_title": "On the computation of interstellar extinction in photoionized nebulae",
    "authors": [
        "Christophe Morisset",
        "Romano L. M. Corradi",
        "Jorge García-Rojas",
        "Antonio Mampaso",
        "David Jones",
        "Karen B. Kwitter",
        "Laura Magrini",
        "Eva Villaver"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-06-14"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
    ],
    "abstract": "Ueta & Otsuka (2021) proposed a method, named as the \"Proper Plasma Analysis Practice\", to analyze spectroscopic data of ionized nebulae. The method is based on a coherent and simultaneous determination of the reddening correction and physical conditions in the nebulae. The same authors (Ueta & Otsuka 2022, UO22) reanalyzed the results of Galera-Rosillo et al. (2022, GR22) on nine of the brightest planetary nebulae in M31. They claim that, if standard values of the physical conditions are used to compute the extinction instead of their proposed method, extinction correction is underestimated by more than 50% and hence, ionic and elemental abundance determinations, especially the N/O ratio, are incorrect. Several tests were performed to assess the accuracy of the results of GR22, when determining: i) the extinction coefficient, ii) the electron temperature and density, and iii) the ionic abundances. In the latter case, N+ /H+ ionic abundance was recalculated using both H_alpha and H_beta as the reference H I emissivity. The analysis shows that the errors introduced by adopting standard values of the plasma conditions by GR22 are small, within their quoted uncertainties. On the other hand, the interstellar extinction in UO22 is found to be overestimated for five of the nine nebulae considered. This propagates into their analysis of the properties of the nebulae and their progenitors. The python notebook used to generate all the results presented in this paper are of public access on a Github repository. The results from GR22 are proven valid and the conclusions of the paper hold firmly. Although the PPAP is, in principle, a recommended practice, we insist that it is equally important to critically assess which H I lines are to be included in the determination of the interstellar extinction coefficient, and to assert that physical results are obtained for the undereddened line ratios.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17067v1"
    ],
    "publication_venue": "Accepted for publication in A&A Letter",
    "doi": "10.1051/0004-6361/202346296"
}