{
    "arxiv_id": "2303.09045",
    "paper_title": "Web and Mobile Platforms for Managing Elections based on IoT And Machine Learning Algorithms",
    "authors": [
        "G. M. I. K. Galagoda",
        "W. M. C. A. Karunarathne",
        "R. S. Bates",
        "K. M. H. V. P. Gangathilaka",
        "Kanishka Yapa",
        "Erandika Gamage"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cs.CR"
    ],
    "abstract": "The global pandemic situation has severely affected all countries. As a result, almost all countries had to adjust to online technologies to continue their processes. In addition, Sri Lanka is yearly spending ten billion on elections. We have examined a proper way of minimizing the cost of hosting these events online. To solve the existing problems and increase the time potency and cost reduction we have used IoT and ML-based technologies. IoT-based data will identify, register, and be used to secure from fraud, while ML algorithms manipulate the election data and produce winning predictions, weather-based voters attendance, and election violence. All the data will be saved in cloud computing and a standard database to store and access the data. This study mainly focuses on four aspects of an E-voting system. The most frequent problems across the world in E-voting are the security, accuracy, and reliability of the systems. E-government systems must be secured against various cyber-attacks and ensure that only authorized users can access valuable, and sometimes sensitive information. Being able to access a system without passwords but using biometric details has been there for a while now, however, our proposed system has a different approach to taking the credentials, processing, and combining the images, reformatting and producing the output, and tracking. In addition, we ensure to enhance e-voting safety. While ML-based algorithms use different data sets and provide predictions in advance.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09045v1"
    ],
    "publication_venue": null
}