{
    "arxiv_id": "2303.10578",
    "paper_title": "Quasi One-Dimensional Ising-like Antiferromagnetism in the Rare-earth Perovskite Oxide TbScO$_3$",
    "authors": [
        "Nan Zhao",
        "Jieming Sheng",
        "Jinchen Wang",
        "Han Ge",
        "Tiantian Li",
        "Jiong Yang",
        "Shanmin Wang",
        "Ping Miao",
        "Hua He",
        "Xin Tong",
        "Wei Bao",
        "Er-Jia Guo",
        "Richard Mole",
        "Dehong Yu",
        "Andrey A. Podlesnyak",
        "Liusuo Wu"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el"
    ],
    "abstract": "The rare-earth perovskite TbScO$_3$ has been widely used as a substrate for the growth of epitaxial ferroelectric and multiferroic thin films, while its detailed low-temperature magnetic properties were rarely reported. In this paper, we performed detailed magnetization, specific heat and single crystal neutron scattering measurements, along with the crystalline electric field calculations to study the low-temperature magnetic properties of TbScO$_3$. All our results suggest the magnetic Tb$^{3+}$ has an Ising-like pseudo-doublet ground state at low temperatures. Due to the constrain of local point symmetry, these Tb$^{3+}$ Ising moments are confined in the $ab$ plane with a tilt angle of $\\varphi = \\pm48^{\\mathrm{o}}$ to the $a$ axis. In zero field, the system undergoes an antiferromagnetic phase transition at $T_{\\mathrm{N}}=2.53$ K, and forms a $G_xA_y$ noncollinear magnetic structure below $T_{\\mathrm{N}}$. We find the dipole-dipole interactions play an important role to determine the magnetic ground state, which are also responsible for the quasi-one-dimensional magnetism in TbScO$_3$. The significant anisotropic diffuse scatterings further confirm the quasi-one-dimensional magnetism along the $c$ axis. The magnetic phase diagram with the field along the easy $b$ axis is well established. In addition to the $G_xA_y$ antiferromagnetic state, there is an exotic field-induced phase emerged near the critical field $B_{\\mathrm{c}}\\simeq0.7$ T, where three-dimensional magnetic order is suppressed but strong one-dimensional correlations may still exist.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10578v1"
    ],
    "publication_venue": "10 pages, 5 figures",
    "doi": "10.1103/PhysRevMaterials.7.034401"
}