{
    "arxiv_id": "2303.10804",
    "paper_title": "GRB 221009A: An ordinary nearby GRB with extraordinary observational properties",
    "authors": [
        "Lin Lan",
        "He Gao",
        "An Li",
        "Shuo Xiao",
        "Shunke Ai",
        "Zong-Kai Peng",
        "Long Li",
        "Chen-Yu Wang",
        "Nan Xu",
        "Shijie Lin",
        "Wei-Hua Lei",
        "Bing Zhang",
        "Yan-Qiu Zhang",
        "Chao Zheng",
        "Jia-Cong Liu",
        "Wang-Chen Xue",
        "Chen-Wei Wang",
        "Wen-Jun Tan",
        "Shao-Lin Xiong"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-05-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The gamma-ray burst GRB 221009A, known as the ``brightest-of-all-time\" (BOAT), is the closest energetic burst detected so far, with an energy of $E_{γ,\\rm iso} \\sim 10^{55}$ ergs. This study aims to assess its compatibility with known GRB energy and luminosity distributions. Our analysis indicates that the energy/luminosity function of GRBs is consistent across various redshift intervals, and that the inclusion of GRB 221009A does not significantly impact the function at low redshifts. Additionally, our evaluation of the best-fitting result of the entire GRB sample suggests that the expected number of GRBs with energy greater than $10^{55}$ ergs at a low redshift is 0.2, so that the emergence of GRB 221009A is consistent with expected energy/luminosity functions within $\\sim 2σ$ Poisson fluctuation error, still adhering to the principles of small number statistics. Furthermore, we find that GRB 221009A and other energetic bursts, defined as $E_{γ,\\rm iso} \\gtrsim10^{54} {\\rm ergs}$, exhibit no significant differences in terms of distributions of $T_{90}$, minimum timescale, Amati relation, $E_{\\rm γ,iso}$-$E_{\\rm X,iso}$ relation, $L_{γ,\\rm iso}-Γ_0$ relation, $E_{γ,\\rm iso}-Γ_0$ relation, $L_{γ,\\rm iso}-E_{\\rm p,i}-Γ_0$ relation, and host galaxy properties, compared to normal long GRBs. This suggests that energetic GRBs (including GRB 221009A) and other long GRBs likely have similar progenitor systems and undergo similar energy dissipation and radiation processes. The generation of energetic GRBs may be due to more extreme central engine properties or, more likely, a rarer viewing configuration of a quasi-universal structured jet.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10804v1"
    ],
    "publication_venue": "Submitted to AAS journal",
    "doi": "10.3847/2041-8213/accf93"
}