{
    "arxiv_id": "2303.13082",
    "paper_title": "Evaluation of Boltzmann's H-function for Particles with Orientational Degrees of Freedom",
    "authors": [
        "Shubham Kumar",
        "Biman Bagchi"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-10-04"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.stat-mech"
    ],
    "abstract": "Boltzmann's H-function H(t) holds a venerable place in the history of science. However, it seems never to have been evaluated for particles with orientational degrees of freedom. We generalize Boltzmann's H-function to a gas of molecules that can both rotate and translate and on collision exchange both momentum and angular momentum, obeying conservation laws. We evaluate the time (t) evolution of single-particle joint probability distribution f (p, L, t) for linear (p) and angular (L) momenta from an initial nonequilibrium state by molecular dynamics simulations. We consider both prolate and oblate-shaped particles, interacting by well-known Gay-Berne potential that depends both on position and orientation vectors. We calculate the relaxation of the generalized molecular H(t) from several initial (t=0) nonequilibrium states. In the long-time limit, the H function saturates to its exact equilibrium value, which is the sum of translational and rotational contributions to the respective entropies. Both the translational and rotational components of H(t) decay nearly exponentially with time; the rotational component is more sensitive to the molecular shape that enters through the aspect ratio. A remarkable rapid decrease in the rotational relaxation time is observed as the spherical limit is approached, in a way tantalizingly reminiscent of Hu-Zwanzig hydrodynamic prediction with slip boundary condition. Additionally, we obtain H(t) analytically by solving the appropriate translational and rotational Fokker-Planck equation and obtain a modest agreement with simulations. We observe a remarkable signature of translation-rotation coupling as a function of molecular shape, captured through a physically meaningful differential term that quantifies the magnitude of translation-rotation coupling.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13082v1",
        "http://arxiv.org/pdf/2303.13082v2"
    ],
    "publication_venue": null
}