{
    "arxiv_id": "2303.13816",
    "paper_title": "Pi-ViMo: Physiology-inspired Robust Vital Sign Monitoring using mmWave Radars",
    "authors": [
        "Bo Zhang",
        "Boyu Jiang",
        "Rong Zheng",
        "Xiaoping Zhang",
        "Jun Li",
        "Qiang Xu"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SP",
        "cs.HC"
    ],
    "abstract": "Continuous monitoring of human vital signs using non-contact mmWave radars is attractive due to their ability to penetrate garments and operate under different lighting conditions. Unfortunately, most prior research requires subjects to stay at a fixed distance from radar sensors and to remain still during monitoring. These restrictions limit the applications of radar vital sign monitoring in real life scenarios. In this paper, we address these limitations and present \"Pi-ViMo\", a non-contact Physiology-inspired Robust Vital Sign Monitoring system, using mmWave radars. We first derive a multi-scattering point model for the human body, and introduce a coherent combining of multiple scatterings to enhance the quality of estimated chest-wall movements. It enables vital sign estimations of subjects at any location in a radar's field of view. We then propose a template matching method to extract human vital signs by adopting physical models of respiration and cardiac activities. The proposed method is capable to separate respiration and heartbeat in the presence of micro-level random body movements (RBM) when a subject is at any location within the field of view of a radar. Experiments in a radar testbed show average respiration rate errors of 6% and heart rate errors of 11.9% for the stationary subjects and average errors of 13.5% for respiration rate and 13.6% for heart rate for subjects under different RBMs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13816v1"
    ],
    "publication_venue": null
}