{
    "arxiv_id": "2303.14648",
    "paper_title": "Molecular lighting goes less powering",
    "authors": [
        "Ranjeev Kumar Parashara",
        "Suchita Kandpalb",
        "Prasanta Bandyopadhyaya",
        "Mainak Sadhukhana",
        "Rajesh Kumarb",
        "Prakash Chandra Mondala"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "The present era has seen tremendous demands for low-cost electrochromic materials for visible-region multicolor display technology, paper-based, flexible, and wearable electronic devices, smart windows, and optoelectronic applications. Towards this goal, we report large-scale polyelectrochromic devices fabricated on rigid to flexible ITO substrates comprising novel anthracene containing viologen, (1,1'-bis(anthracen-9-ylmethyl)-[4,4'-bipyridine]-1,1'-diium bromide, abbreviated as AnV2+), and polythiophene (P3HT). Inter-estingly, the devices show three states of reversible visible color in response to the applied bias, sub-second to second switching time (0.7 s/1.6 s), and high coloration efficiency (484 cm2/C), longer cycling stability up to 3000 s (103 switching cycles). Thanks to the anthracenes moieties introduced to viologen that inhibit formation of undesired dimer of cation radicals formed in response to the applied bias, other-wise it would hamper the devices reconfiguration. The devices are fully characterized, and electrochromic performances are ensured by bias-dependent UV-Vis, and Raman spectroscopy. The fabricated electro-chromic devices are tested with the commercially available low-cost cells to perform, which is highly de-sired for practical applications. The computational study facilitates the understanding of experimental re-sults. The alternating current (AC)-based electrical impedance spectroscopy reveals that P3HT facilitates reducing charge transfer resistance of the devices. Our work shows CMOS compatibility and one of the best-performing devices that could pave the way for developing cost-effective flexible, and wearable electrochromic devices.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14648v1"
    ],
    "publication_venue": "13 Pages, 7 Figures"
}