{
    "arxiv_id": "2303.09242",
    "paper_title": "The origin of optical emission lines in the soft state of X-ray binary outbursts: the case of MAXI J1820+070",
    "authors": [
        "K. I. I. Koljonen",
        "K. S. Long",
        "J. H. Matthews",
        "C. Knigge"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The optical emission line spectra of X-ray binaries (XRBs) are thought to be produced in an irradiated atmosphere, possibly the base of a wind, located above the outer accretion disc. However, the physical nature of - and physical conditions in - the line-forming region remain poorly understood. Here, we test the idea that the optical spectrum is formed in the transition region between the cool, geometrically thin part of the disc near the mid-plane and a hot, vertically extended atmosphere or outflow produced by X-ray irradiation. We first present a VLT X-Shooter spectrum of XRB MAXI J1820+070 in the soft state associated with its 2018 outburst, which displays a rich set of double-peaked hydrogen and helium recombination lines. Aided by ancillary X-ray spectra and reddening estimates, we then model this spectrum with the Monte Carlo radiative transfer code Python, using a simple biconical disc wind model inspired by radiation-hydrodynamic simulations of irradiation-driven outflows from XRB discs. Such a model can qualitatively reproduce the observed features; nearly all of the optical emission arising from the transonic 'transition region' near the base of the wind. In this region, characteristic electron densities are on the order of 10$^{12-13}$ cm$^{-3}$, in line with the observed flat Balmer decrement (H$α$/H$β\\approx 1.3$). We conclude that strong irradiation can naturally give rise to both the optical line-forming layer in XRB discs and an overlying outflow/atmosphere that produces X-ray absorption lines.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09242v1"
    ],
    "publication_venue": "17 pages, 11 figures. This article has been accepted for publication in MNRAS published by Oxford University Press on behalf of the Royal Astronomical Society",
    "doi": "10.1093/mnras/stad809"
}