{
    "arxiv_id": "2303.13475",
    "paper_title": "Learning Semantic Text Similarity to rank Hypernyms of Financial Terms",
    "authors": [
        "Sohom Ghosh",
        "Ankush Chopra",
        "Sudip Kumar Naskar"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CL"
    ],
    "abstract": "Over the years, there has been a paradigm shift in how users access financial services. With the advancement of digitalization more users have been preferring the online mode of performing financial activities. This has led to the generation of a huge volume of financial content. Most investors prefer to go through these contents before making decisions. Every industry has terms that are specific to the domain it operates in. Banking and Financial Services are not an exception to this. In order to fully comprehend these contents, one needs to have a thorough understanding of the financial terms. Getting a basic idea about a term becomes easy when it is explained with the help of the broad category to which it belongs. This broad category is referred to as hypernym. For example, \"bond\" is a hypernym of the financial term \"alternative debenture\". In this paper, we propose a system capable of extracting and ranking hypernyms for a given financial term. The system has been trained with financial text corpora obtained from various sources like DBpedia [4], Investopedia, Financial Industry Business Ontology (FIBO), prospectus and so on. Embeddings of these terms have been extracted using FinBERT [3], FinISH [1] and fine-tuned using SentenceBERT [54]. A novel approach has been used to augment the training set with negative samples. It uses the hierarchy present in FIBO. Finally, we benchmark the system performance with that of the existing ones. We establish that it performs better than the existing ones and is also scalable.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13475v1"
    ],
    "publication_venue": "Our code base: https://github.com/sohomghosh/FinSim_Financial_Hypernym_detection"
}