{
    "arxiv_id": "2303.09017",
    "paper_title": "The Geometry of Causality",
    "authors": [
        "Stefano Gogioso",
        "Nicola Pinzani"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "cs.LO",
        "gr-qc"
    ],
    "abstract": "We provide a unified operational framework for the study of causality, non-locality and contextuality, in a fully device-independent and theory-independent setting. We define causaltopes, our chosen portmanteau of \"causal polytopes\", for arbitrary spaces of input histories and arbitrary choices of input contexts. We show that causaltopes are obtained by slicing simpler polytopes of conditional probability distributions with a set of causality equations, which we fully characterise. We provide efficient linear programs to compute the maximal component of an empirical model supported by any given sub-causaltope, as well as the associated causal fraction.\n  We introduce a notion of causal separability relative to arbitrary causal constraints. We provide efficient linear programs to compute the maximal causally separable component of an empirical model, and hence its causally separable fraction, as the component jointly supported by certain sub-causaltopes.\n  We study causal fractions and causal separability for several novel examples, including a selection of quantum switches with entangled or contextual control. In the process, we demonstrate the existence of \"causal contextuality\", a phenomenon where causal inseparability is clearly correlated to, or even directly implied by, non-locality and contextuality.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09017v1"
    ],
    "publication_venue": "Originally Part 3 of arXiv:2206.08911v2, now extended and published as a stand-alone paper. Introduction shares some material with Part 1 of the trilogy, \"The Combinatorics of Causality\" [arXiv:2206.08911], and Part 2 of the trilogy, \"The Topology of Causality\" [arXiv:2303.07148]"
}