{
    "arxiv_id": "2303.15872",
    "paper_title": "Satellite Dynamics Toolbox Library: a tool to model multi-body space systems for robust control synthesis and analysis",
    "authors": [
        "Francesco Sanfedino",
        "Daniel Alazard",
        "Ervan Kassarian",
        "Franca Somers"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-11-28"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY"
    ],
    "abstract": "The level of maturity reached by robust control theory techniques nowadays contributes to a considerable minimization of the development time of an end-to-end control design of a spacecraft system. The advantage offered by this framework is twofold: all system uncertainties can be included from the very beginning of the design process; the validation and verification (V\\&V) process is improved by fast detection of worst-case configurations that could escape to a classical sample-based Monte Carlo simulation campaign. Before proceeding to the control synthesis and analysis, a proper uncertain plant model has to be available in order to push these techniques to their limits of performance. In this spirit, the Satellite Dynamics Toolbox Library (SDTlib) offers many features to model a spacecraft system in a multi-body fashion on SIMULINK. Parametric models can be easily built in a Linear Fractional Transformation (LFT) form by including uncertainties and varying parameters with minimal number of repetitions. Uncertain Linear Time Invariant (LTI) and uncertain Linear Parameter-Varying (LPV) controllers can then be synthesized and analyzed in a straightforward way. The authors present in this article a tutorial, that can be downloaded at https://nextcloud.isae.fr/index.php/s/XDfRfHntejHTmmp, to show how to deal with an end-to-end robust design of a spacecraft mission and to provide to researchers a benchmark to test their own algorithms.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15872v1"
    ],
    "publication_venue": null,
    "doi": "10.1016/j.ifacol.2023.10.154"
}