{
    "arxiv_id": "2303.15499",
    "paper_title": "Mother of Dragons: A Massive, quiescent core in the dragon cloud (IRDC G028.37+00.07)",
    "authors": [
        "A. T. Barnes",
        "J. Liu",
        "Q. Zhang",
        "J. C. Tan",
        "F. Bigiel",
        "P. Caselli",
        "G. Cosentino",
        "F. Fontani",
        "J. D. Henshaw",
        "I. Jiménez-Serra",
        "D-S. Kalb",
        "C. Y. Law",
        "S. N. Longmore",
        "R. J. Parker",
        "J. E. Pineda",
        "A. Sánchez-Monge",
        "W. Lim",
        "K. Wang"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "Context: Core accretion models of massive star formation require the existence of massive, starless cores within molecular clouds. Yet, only a small number of candidates for such truly massive, monolithic cores are currently known. Aims: Here, we analyse a massive core in the well-studied infrared dark cloud (IRDC) called the \"dragon cloud\" (G028.37+00.07 or \"Cloud C\"). This core (C2c1) sits at the end of a chain of a roughly equally spaced actively star-forming cores near the center of the IRDC. Methods: We present new high-angular resolution 1 mm ALMA dust continuum and molecular line observations of the massive core. Results: The high-angular resolution observations show that this region fragments into two cores C2c1a and C2c1b, which retain significant background subtracted masses of 23 Msun and 2 Msun (31 Msun and 6 Msun without background subtraction), respectively. The cores do not appear to fragment further on the scales of our highest angular resolution images (0.200 arcsec, 0.005 pc ~ 1000 AU). We find that these cores are very dense (nH2 > 10^6 cm-3) and have only trans-sonic non-thermal motions (Ms ~ 1). Together the mass, density and internal motions imply a virial parameter of < 1, which suggests the cores are gravitationally unstable, unless supported by strong magnetic fields with strengths of ~ 1 - 10 mG. From CO line observations, we find that there is tentative evidence for a weak molecular outflow towards the lower-mass core, yet the more massive core remains devoid of any star formation indicators. Conclusions: We have presented evidence for the existence of a massive, prestellar core, which has implications for theories of massive star formation. This source warrants follow-up higher-angular resolution observations to further assess its monolithic and prestellar nature.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15499v1"
    ],
    "publication_venue": "8+4 pages, 4+2 Figures, 2 Tables, accepted for publication in Astronomy & Astrophysics"
}