{
    "arxiv_id": "2303.16241",
    "paper_title": "Convergence of the Stochastic Heavy Ball Method With Approximate Gradients and/or Block Updating",
    "authors": [
        "Uday Kiran Reddy Tadipatri",
        "Mathukumalli Vidyasagar"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2025-04-15"
    ],
    "latest_version": 3,
    "categories": [
        "math.OC",
        "stat.ML"
    ],
    "abstract": "In this paper, we establish the convergence of the stochastic Heavy Ball (SHB) algorithm under more general conditions than in the current literature. Specifically, (i) The stochastic gradient is permitted to be biased, and also, to have conditional variance that grows over time (or iteration number). This feature is essential when applying SHB with zeroth-order methods, which use only two function evaluations to approximate the gradient. In contrast, all existing papers assume that the stochastic gradient is unbiased and/or has bounded conditional variance. (ii) The step sizes are permitted to be random, which is essential when applying SHB with block updating. The sufficient conditions for convergence are stochastic analogs of the well-known Robbins-Monro conditions. This is in contrast to existing papers where more restrictive conditions are imposed on the step size sequence. (iii) Our analysis embraces not only convex functions, but also more general functions that satisfy the PL (Polyak-Łojasiewicz) and KL (Kurdyka-Łojasiewicz) conditions. (iv) If the stochastic gradient is unbiased and has bounded variance, and the objective function satisfies (PL), then the iterations of SHB match the known best rates for convex functions. (v) We establish the almost-sure convergence of the iterations, as opposed to convergence in the mean or convergence in probability, which is the case in much of the literature. (vi) Each of the above convergence results continue to hold if full-coordinate updating is replaced by any one of three widely-used updating methods. In addition, numerical computations are carried out to illustrate the above points.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16241v1",
        "http://arxiv.org/pdf/2303.16241v2",
        "http://arxiv.org/pdf/2303.16241v3"
    ],
    "publication_venue": "37 pages, 4 figures"
}