{
    "arxiv_id": "2303.12849",
    "paper_title": "A Sensitive Search for Supernova Emission Associated with the Extremely Energetic and Nearby GRB 221009A",
    "authors": [
        "Gokul P. Srinivasaragavan",
        "Brendan O' Connor",
        "S. Bradley Cenko",
        "Alexander J. Dittmann",
        "Sheng Yang",
        "Jesper Sollerman",
        "G. C. Anupama",
        "Sudhanshu Barway",
        "Varun Bhalerao",
        "Harsh Kumar",
        "Vishwajeet Swain",
        "Erica Hammerstein",
        "Isiah Holt",
        "Shreya Anand",
        "Igor Andreoni",
        "Michael W. Coughlin",
        "Simone Dichiara",
        "Avishay Gal-Yam",
        "M. Coleman Miller",
        "Jaime Soon",
        "Roberto Soria",
        "Joseph Durbak",
        "James H. Gillanders",
        "Sibasish Laha",
        "Anna M. Moore",
        "Fabio Ragosta",
        "Eleonora Troja"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-04-25"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "We report observations of the optical counterpart of the long gamma-ray burst (LGRB) GRB 221009A. Due to the extreme rarity of being both nearby ($z = 0.151$) and highly energetic ($E_{γ,\\mathrm{iso}} \\geq 10^{54}$ erg), GRB 221009A offers a unique opportunity to probe the connection between massive star core collapse and relativistic jet formation. Adopting a phenomenological power-law model for the afterglow and host galaxy estimates from high-resolution Hubble Space Telescope imaging, we use Bayesian model comparison techniques to determine the likelihood of an associated SN contributing excess flux to the optical light curve. Though not conclusive, we find moderate evidence ($K_{\\rm{Bayes}}=10^{1.2}$) for the presence of an additional component arising from an associated supernova, SN 2022xiw, and find that it must be substantially fainter than SN 1998bw. Given the large and uncertain line-of-sight extinction, we attempt to constrain the supernova parameters ($M_{\\mathrm{Ni}}$, $M_{\\mathrm{ej}}$, and $E_{\\mathrm{KE}}$) under several different assumptions with respect to the host galaxy's extinction. We find properties that are broadly consistent with previous GRB-associated SNe: $M_{\\rm{Ni}}=0.05$ - $0.25$ ${M_\\odot}$, $M_{\\rm{ej}}=3.5$ - $11.1$ ${M_\\odot}$, and $E_{\\rm{KE}} = (1.6$ - $5.2) \\times 10^{52} \\rm{erg}$. We note that these properties are weakly constrained due to the faintness of the supernova with respect to the afterglow and host emission, but we do find a robust upper limit on the Nickel mass of $M_{\\rm{Ni}}<0.36$ $\\rm{M_\\odot}$. Given the tremendous range in isotropic gamma-ray energy release exhibited by GRBs (7 orders of magnitude), the SN emission appears to be decoupled from the central engine in these systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12849v1",
        "http://arxiv.org/pdf/2303.12849v2"
    ],
    "publication_venue": "18 pages, accepted to ApJL, 4 tables, 5 figures"
}