{
    "arxiv_id": "2303.13133",
    "paper_title": "Generative Image Inpainting with Segmentation Confusion Adversarial Training and Contrastive Learning",
    "authors": [
        "Zhiwen Zuo",
        "Lei Zhao",
        "Ailin Li",
        "Zhizhong Wang",
        "Zhanjie Zhang",
        "Jiafu Chen",
        "Wei Xing",
        "Dongming Lu"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-08-17"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV"
    ],
    "abstract": "This paper presents a new adversarial training framework for image inpainting with segmentation confusion adversarial training (SCAT) and contrastive learning. SCAT plays an adversarial game between an inpainting generator and a segmentation network, which provides pixel-level local training signals and can adapt to images with free-form holes. By combining SCAT with standard global adversarial training, the new adversarial training framework exhibits the following three advantages simultaneously: (1) the global consistency of the repaired image, (2) the local fine texture details of the repaired image, and (3) the flexibility of handling images with free-form holes. Moreover, we propose the textural and semantic contrastive learning losses to stabilize and improve our inpainting model's training by exploiting the feature representation space of the discriminator, in which the inpainting images are pulled closer to the ground truth images but pushed farther from the corrupted images. The proposed contrastive losses better guide the repaired images to move from the corrupted image data points to the real image data points in the feature representation space, resulting in more realistic completed images. We conduct extensive experiments on two benchmark datasets, demonstrating our model's effectiveness and superiority both qualitatively and quantitatively.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13133v1"
    ],
    "publication_venue": "Accepted to AAAI2023, Oral",
    "doi": "10.1609/aaai.v37i3.25502"
}