{
    "arxiv_id": "2303.07931",
    "paper_title": "The ionising photon production efficiency at z~6 for a sample of bright Lyman-alpha emitters using JEMS and MUSE",
    "authors": [
        "Charlotte Simmonds",
        "Sandro Tacchella",
        "Michael V. Maseda",
        "Christina Williams",
        "William M. Baker",
        "Callum Witten",
        "Benjamin D. Johnson",
        "Brant Robertson",
        "Aayush Saxena",
        "Fengwu Sun",
        "Joris Witstok",
        "Rachana Bhatawdekar",
        "Kristan Boyett",
        "Andrew J. Bunker",
        "Stephane Charlot",
        "Emma Curtis-Lake",
        "Eiichi Egami",
        "Daniel J. Eisenstein",
        "Zhiyuan Ji",
        "Roberto Maiolino",
        "Lester Sandles",
        "Renske Smit",
        "Hannah Übler",
        "Chris Willott"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We study the ionising photon production efficiency at the end of the Epoch of Reionisation ($z \\sim 5.4 - 6.6$) for a sample of 35 bright Lyman-$α$ emitters, this quantity is crucial to infer the ionising photon budget of the Universe. These objects were selected to have reliable spectroscopic redshifts, assigned based on the profile of their Lyman-$α$ emission line, detected in the MUSE deep fields. We exploit medium-band observations from the JWST extragalactic medium band survey (JEMS) to find the flux excess corresponding to the redshifted \\ha\\ emission line. We estimate the UV luminosity by fitting the full JEMS photometry, along with several HST photometric points, with \\texttt{Prospector}. We find a median ultra-violet continuum slope of $β= -2.21^{+0.26}_{-0.17}$ for the sample, indicating young stellar populations with little-to-no dust attenuation. Supported by this, we derive $ξ_{ion,0}$ with no dust attenuation and find a median value of log$\\frac{ξ_{ion,0}}{\\text{Hz erg}^{-1}} = 26.36^{+0.17}_{-0.14}$. If we perform dust attenuation corrections and assume a Calzetti attenuation law, our values are lowered by $\\sim 0.1$ dex. Our results suggest Lyman-$α$ emitters at the Epoch of Reionisation have enhanced $ξ_{ion,0}$ compared to previous estimations from literature, in particular, when compared to the non-Lyman-$α$ emitting population. This initial study provides a promising outlook on the characterisation of ionising photon production in the early Universe. In the future, a more extensive study will be performed on the entire dataset provided by the JWST Advanced Deep Extragalactic Survey (JADES). Thus, for the first time, allowing us to",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07931v1"
    ],
    "publication_venue": "11 pages, 5 figures in main paper. 10 pages, 30 figures in appendix. Submitted to MNRAS"
}