{
    "arxiv_id": "2303.13915",
    "paper_title": "Benchmarking the Impact of Noise on Deep Learning-based Classification of Atrial Fibrillation in 12-Lead ECG",
    "authors": [
        "Theresa Bender",
        "Philip Gemke",
        "Ennio Idrobo-Avila",
        "Henning Dathe",
        "Dagmar Krefting",
        "Nicolai Spicher"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-07-04"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SP",
        "cs.LG"
    ],
    "abstract": "Electrocardiography analysis is widely used in various clinical applications and Deep Learning models for classification tasks are currently in the focus of research. Due to their data-driven character, they bear the potential to handle signal noise efficiently, but its influence on the accuracy of these methods is still unclear. Therefore, we benchmark the influence of four types of noise on the accuracy of a Deep Learning-based method for atrial fibrillation detection in 12-lead electrocardiograms. We use a subset of a publicly available dataset (PTBXL) and use the metadata provided by human experts regarding noise for assigning a signal quality to each electrocardiogram. Furthermore, we compute a quantitative signal-to-noise ratio for each electrocardiogram. We analyze the accuracy of the Deep Learning model with respect to both metrics and observe that the method can robustly identify atrial fibrillation, even in cases signals are labelled by human experts as being noisy on multiple leads. False positive and false negative rates are slightly worse for data being labelled as noisy. Interestingly, data annotated as showing baseline drift noise results in an accuracy very similar to data without. We conclude that the issue of processing noisy electrocardiography data can be addressed successfully by Deep Learning methods that might not need preprocessing as many conventional methods do.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13915v1"
    ],
    "publication_venue": "to be published in proceedings of Medical Informatics Europe 2023",
    "doi": "10.3233/SHTI230321"
}