{
    "arxiv_id": "2303.07981",
    "paper_title": "Turbulent processing of PAHs in protoplanetary discs -- Coagulation and freeze-out leading to depletion of gas-phase PAH",
    "authors": [
        "K. Lange",
        "C. Dominik",
        "A. G. G. M. Tielens"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-07-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Polycyclic aromatic hydrocarbons (PAHs) have been detected in numerous circumstellar discs. We propose the continuous processing of PAHs through clustering, adsorption on dust grains, and their reverse-processes as key mechanisms to reduce the emission-capable PAH abundance in protoplanetary discs. This cycle of processing is driven by vertical turbulence in the disc mixing PAHs between the disc midplane and the photosphere. We used a theoretical Monte Carlo model for photodesorption and a coagulation code in the disc midplane to estimate the relevance and timescale of these processes in a Herbig Ae/Be disc environment. By combining these components in a 1D vertical model, we calculated the gas-phase depletion of PAHs that stick as clusters on dust grains. Our results show that the clustering of gas-phase PAHs is very efficient, and that clusters with more than 100 monomers can grow for years before they are able to freeze out in the disc midplane. Once a PAH cluster is frozen on the dust grain surface, the large heat capacity of these clusters prevents them from evaporating off the grains in UV-rich environments such as the photosphere. Therefore, the clustering of PAHs followed by freeze-out can lead to a depletion of gas-phase PAHs in discs. Evaluated over the lifetime of protoplanetary discs, we find a depletion of PAHs by a factor that ranges between 50 and 1000 compared to the standard ISM abundance of PAHs in the inner disc through turbulent processing. Through these processes, we favour PAHs smaller than circumovalene as the major gas-phase emitters of the disc photosphere as larger PAH monomers cannot photodesorb from the grain surface. These gas-phase PAHs co-exist with large PAH clusters sticking on dust grains. We find a close relation between the amount of PAHs frozen out on dust grains and the dust population, as well as the strength of the vertical turbulence.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07981v1"
    ],
    "publication_venue": "Accepted for Astronomy and Astrophysics. 18 pages, 14 figures",
    "doi": "10.1051/0004-6361/202245108"
}