{
    "arxiv_id": "2303.11020",
    "paper_title": "Dual-stream Time-Delay Neural Network with Dynamic Global Filter for Speaker Verification",
    "authors": [
        "Yangfu Li",
        "Xiaodan Lin"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-04-19"
    ],
    "latest_version": 2,
    "categories": [
        "cs.SD",
        "cs.AI",
        "eess.AS"
    ],
    "abstract": "The time-delay neural network (TDNN) is one of the state-of-the-art models for text-independent speaker verification. However, it is difficult for conventional TDNN to capture global context that has been proven critical for robust speaker representations and long-duration speaker verification in many recent works. Besides, the common solutions, e.g., self-attention, have quadratic complexity for input tokens, which makes them computationally unaffordable when applied to the feature maps with large sizes in TDNN. To address these issues, we propose the Global Filter for TDNN, which applies log-linear complexity FFT/IFFT and a set of differentiable frequency-domain filters to efficiently model the long-term dependencies in speech. Besides, a dynamic filtering strategy, and a sparse regularization method are specially designed to enhance the performance of the global filter and prevent it from overfitting. Furthermore, we construct a dual-stream TDNN (DS-TDNN), which splits the basic channels for complexity reduction and employs the global filter to increase recognition performance. Experiments on Voxceleb and SITW databases show that the DS-TDNN achieves approximate 10% improvement with a decline over 28% and 15% in complexity and parameters compared with the ECAPA-TDNN. Besides, it has the best trade-off between efficiency and effectiveness compared with other popular baseline systems when facing long-duration speech. Finally, visualizations and a detailed ablation study further reveal the advantages of the DS-TDNN.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11020v1",
        "http://arxiv.org/pdf/2303.11020v2"
    ],
    "publication_venue": "13 pages 4 figures"
}