{
    "arxiv_id": "2303.10202",
    "paper_title": "Exploring contrast generalisation in deep learning-based brain MRI-to-CT synthesis",
    "authors": [
        "Lotte Nijskens",
        "Cornelis",
        "AT van den Berg",
        "Joost JC Verhoeff",
        "Matteo Maspero"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-07-25"
    ],
    "latest_version": 1,
    "categories": [
        "physics.med-ph",
        "cs.AI",
        "cs.LG"
    ],
    "abstract": "Background: Synthetic computed tomography (sCT) has been proposed and increasingly clinically adopted to enable magnetic resonance imaging (MRI)-based radiotherapy. Deep learning (DL) has recently demonstrated the ability to generate accurate sCT from fixed MRI acquisitions. However, MRI protocols may change over time or differ between centres resulting in low-quality sCT due to poor model generalisation. Purpose: investigating domain randomisation (DR) to increase the generalisation of a DL model for brain sCT generation. Methods: CT and corresponding T1-weighted MRI with/without contrast, T2-weighted, and FLAIR MRI from 95 patients undergoing RT were collected, considering FLAIR the unseen sequence where to investigate generalisation. A ``Baseline'' generative adversarial network was trained with/without the FLAIR sequence to test how a model performs without DR. Image similarity and accuracy of sCT-based dose plans were assessed against CT to select the best-performing DR approach against the Baseline. Results: The Baseline model had the poorest performance on FLAIR, with mean absolute error (MAE)=106$\\pm$20.7 HU (mean$\\pmσ$). Performance on FLAIR significantly improved for the DR model with MAE=99.0$\\pm$14.9 HU, but still inferior to the performance of the Baseline+FLAIR model (MAE=72.6$\\pm$10.1 HU). Similarly, an improvement in $γ$-pass rate was obtained for DR vs Baseline. Conclusions: DR improved image similarity and dose accuracy on the unseen sequence compared to training only on acquired MRI. DR makes the model more robust, reducing the need for re-training when applying a model on sequences unseen and unavailable for retraining.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10202v1"
    ],
    "publication_venue": "Preprint submitted to Physica Medica on 2023-02-16 for review. Also published in Zenodo at https://doi.org/10.5281/zenodo.7742642",
    "doi": "10.1016/j.ejmp.2023.102642"
}