{
    "arxiv_id": "2303.12191",
    "paper_title": "The characteristic initial value problem for the conformally invariant wave equation on a Schwarzschild background",
    "authors": [
        "Jörg Hennig"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc"
    ],
    "abstract": "We resume former discussions of the conformally invariant wave equation on a Schwarzschild background, with a particular focus on the behaviour of solutions near the 'cylinder', i.e. Friedrich's representation of spacelike infinity. This analysis can be considered a toy model for the behaviour of the full Einstein equations and the resulting logarithmic singularities that appear to be characteristic for massive spacetimes. The investigation of the Cauchy problem for the conformally invariant wave equation (Frauendiener and Hennig 2018, Class. Quantum Grav. 35, 065015) showed that solutions generically develop logarithmic singularities at infinitely many expansion orders at the cylinder, but an arbitrary finite number of these singularities can be removed by appropriately restricting the initial data prescribed at $t=0$. From a physical point of view, any data at $t=0$ are determined from the earlier history of the system and hence not exactly 'free data'. Therefore, it is appropriate to ask what happens if we 'go further back in time' and prescribe initial data as early as possible, namely at a portion of past null infinity, and on a second past null hypersurface to complete the initial value problem. Will regular data at past null infinity automatically lead to a regular evolution up to future null infinity? Or does past regularity restrict the solutions too much, and regularity at both null infinities is mutually exclusive? Or do we still have suitable degrees of freedom for the data that can be chosen to influence regularity of the solutions to any desired degree? In order to answer these questions, we study the corresponding characteristic initial value problem. In particular, we investigate in detail the appearance of singularities at expansion orders $n=0,\\dots,4$ for angular modes $\\ell=0,\\dots,4$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12191v1"
    ],
    "publication_venue": "21 pages, 1 figure",
    "doi": "10.1088/1361-6382/acc2a9"
}