{
    "arxiv_id": "2303.08004",
    "paper_title": "Critical Properties of Symmetric Nuclear Matter in Low-Density Regime Using Effective-Relativistic Mean Field Formalism",
    "authors": [
        "Vishal Parmar",
        "Manoj K Sharma",
        "S K Patra"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "nucl-th"
    ],
    "abstract": "The effective field theory motivated relativistic mean-field (E-RMF) formalism is employed to study the equation of state (EoS) for the infinite symmetric nuclear matter at finite temperature using the recently developed forces FSUGarnet, IOPB-I, G3, and the well known NL3 force parameter. The EoS is then used to estimate the critical temperature $T_c$, pressure $P_c$ and density $ρ_c$ of the symmetric nuclear matter for the liquid-gas phase transition. As $T_c$ is not a constrained parameter in both experiments and theoretical calculations, there is a large uncertainty around its value. Although, the critical parameters are correlated among themselves. It is revealed that vector self-coupling $ζ_0$ of used forces play determining role in EoS in finite temperature limit. Keeping the incompressibility in acceptable limit i.e. 240$\\pm$ 20 MeV, the lower value of $ζ_0$ gives a better result of $T_c$ when compared to the several experimental data. The critical parameters however show weak correlation with the properties at saturation density at zero temperature. The compressibility factors calculated with these parameters are in agreement with the universal value of liquid-gas systems. Stability conditions are examined along with binodal and spinodal regions. Besides this, the thermodynamic properties like specific heat and latent heat are also worked out. We have carried out detailed consistency check of our calculations using critical exponents and standard scaling laws. All the exponents are well within the theoretical mean-field results.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08004v1"
    ],
    "publication_venue": null,
    "doi": "10.1088/1361-6471/abc864"
}