{
    "arxiv_id": "2303.09255",
    "paper_title": "Security of discrete-modulated continuous-variable quantum key distribution",
    "authors": [
        "Stefan Bäuml",
        "Carlos Pascual García",
        "Victoria Wright",
        "Omar Fawzi",
        "Antonio Acín"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-10-02"
    ],
    "latest_version": 3,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Continuous variable quantum key distribution with discrete modulation has the potential to provide information-theoretic security using widely available optical elements and existing telecom infrastructure. While their implementation is significantly simpler than that for protocols based on Gaussian modulation, proving their finite-size security against coherent attacks poses a challenge. In this work we apply the entropy accumulation theorem, a tool that has previously been used in the setting of discrete variables, to prove finite-size security against coherent attacks for a discrete-modulated quantum key distribution protocol involving four coherent states and heterodyne detection. To do so, and contrary to previous approaches, we consider a protocol in which all the information is discretized. We first bound its asymptotic rate under a realistic photon number cutoff assumption. This bound is then upgraded into a finite-size security proof using entropy accumulation. Our analysis provides asymptotic rates in the range of $0.1-10^{-4}$ bits per round for distances up to hundred kilometres, while in the finite case and for realistic parameters, we get of the order of $10$ Gbits of secret key after $n=10^{12}$ rounds and distances of few tens of kilometres.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09255v1",
        "http://arxiv.org/pdf/2303.09255v2",
        "http://arxiv.org/pdf/2303.09255v3"
    ],
    "publication_venue": "Improved numerical results. Added more discussion and additional references"
}