{
    "arxiv_id": "2303.09570",
    "paper_title": "CLEAR: Survey Overview, Data Analysis and Products",
    "authors": [
        "Raymond C. Simons",
        "Casey Papovich",
        "Ivelina G. Momcheva",
        "Gabriel Brammer",
        "Vicente Estrada-Carpenter",
        "Steven L. Finkelstein",
        "Catherine M. Gosmeyer",
        "Jasleen Matharu",
        "Jonathan R. Trump",
        "Bren E. Backhaus",
        "Yingjie Cheng",
        "Nikko J. Cleri",
        "Henry C. Ferguson",
        "Kristian Finlator",
        "Mauro Giavalisco",
        "Zhiyuan Ji",
        "Intae Jung",
        "Jennifer M. Lotz",
        "Rosalia O'Brien",
        "Rosalind E. Skelton",
        "Vithal Tilvi",
        "Benjamin Weiner"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present an overview of the CANDELS Lyman-a Emission At Reionization (CLEAR) survey. CLEAR is a 130 orbit program of the Hubble Space Telescope using the Wide Field Camera 3 (WFC3) IR G102 grism. CLEAR targets 12 pointings divided between the GOODS-N and GOODS-S fields of the Cosmic Assembly Near-IR Deep Extragalactic Legacy Survey (CANDELS). Combined with existing spectroscopic data from other programs, the full CLEAR dataset includes spectroscopic imaging of these fields over 0.8-1.7 um. In this Paper, we describe the CLEAR survey, the survey strategy, the data acquisition, reduction, processing, and science products and catalogs released alongside this paper. The catalogs include emission line fluxes and redshifts derived from the combination of the photometry and grism spectroscopy for 6048 galaxies, primarily ranging from 0.2 < z < 3. We also provide an overview of CLEAR science goals and results. In conjunction with this Paper we provide links to electronic versions of the data products, including 1D + 2D extracted spectra and emission line maps.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09570v1"
    ],
    "publication_venue": "Accepted in ApJS. 29 pages, 14 figures. The data products (1D + 2D spectra, emission line maps) and catalogs (photometric and spectroscopic catalogs of GOODS-N and GOODS-S) are available at https://archive.stsci.edu/hlsp/clear",
    "doi": "10.3847/1538-4365/acc517"
}