{
    "arxiv_id": "2303.09966",
    "paper_title": "Magnitude-Corrected and Time-Aligned Interpolation of Head-Related Transfer Functions",
    "authors": [
        "Johannes M. Arend",
        "Christoph Pörschmann",
        "Stefan Weinzierl",
        "Fabian Brinkmann"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-10-25"
    ],
    "latest_version": 1,
    "categories": [
        "eess.AS",
        "cs.SD"
    ],
    "abstract": "Head-related transfer functions (HRTFs) are essential for virtual acoustic realities, as they contain all cues for localizing sound sources in three-dimensional space. Acoustic measurements are one way to obtain high-quality HRTFs. To reduce measurement time, cost, and complexity of measurement systems, a promising approach is to capture only a few HRTFs on a sparse sampling grid and then upsample them to a dense HRTF set by interpolation. However, HRTF interpolation is challenging because small changes in source position can result in significant changes in the HRTF phase and magnitude response. Previous studies greatly improved the interpolation by time-aligning the HRTFs in preprocessing, but magnitude interpolation errors, especially in contralateral regions, remain a problem. Building upon the time-alignment approaches, we propose an additional post-interpolation magnitude correction derived from a frequency-smoothed HRTF representation. Employing all 96 individual simulated HRTF sets of the HUTUBS database, we show that the magnitude correction significantly reduces interpolation errors compared to state-of-the-art interpolation methods applying only time alignment. Our analysis shows that when upsampling very sparse HRTF sets, the subject-averaged magnitude error in the critical higher frequency range is up to 1.5 dB lower when averaged over all directions and even up to 4 dB lower in the contralateral region. As a result, the interaural level differences in the upsampled HRTFs are considerably improved. The proposed algorithm thus has the potential to further reduce the minimum number of HRTFs required for perceptually transparent interpolation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09966v1"
    ],
    "publication_venue": null,
    "doi": "10.1109/TASLP.2023.3313908"
}