{
    "arxiv_id": "2303.16128",
    "paper_title": "Molecularly Resolved Electronic Landscapes of Differing Acceptor-Donor Interface Geometries",
    "authors": [
        "Katherine A. Cochrane",
        "Tanya S. Roussy",
        "Bingkai Yuan",
        "Gary Tom",
        "Erik Mårsell",
        "Sarah A. Burke"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Organic semiconductors are a promising class of materials for numerous electronic and optoelectronic applications, including solar cells. However, these materials tend to be extremely sensitive to the local environment and surrounding molecular geometry, causing the energy levels near boundaries and interfaces essential to device function to differ from those of the bulk. Scanning Tunneling Microscopy and Spectroscopy (STM/STS) has the ability to examine both the structural and electronic properties of these interfaces on the molecular and submolecular scale. Here we investigate the prototypical acceptor/donor system PTCDA/CuPc using sub-molecularly resolved pixel-by-pixel STS to demonstrate the importance of subtle changes in interface geometry in prototypical solar cell materials. PTCDA and CuPc were sequentially deposited on NaCl bilayers to create lateral heterojunctions that were decoupled from the underlying substrate. Donor and acceptor states were observed to shift in opposite directions suggesting an equilibrium charge transfer between the two. Narrowing of the gap energy compared to isolated molecules on the same surface are indicative of the influence of the local dielectric environment. Further, we find that the electronic state energies of both acceptor and donor are strongly dependent on the ratio and positioning of both molecules in larger clusters. This molecular-scale structural dependence of the electronic states of both interfacial acceptor and donor has significant implications for device design where level alignment strongly correlates to device performance.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16128v1"
    ],
    "publication_venue": null,
    "doi": "10.1021/acs.jpcc.8b01396"
}