{
    "arxiv_id": "2303.09889",
    "paper_title": "Cosmic ray mass composition at the \\textit{knee} using azimuthal fluctuations of air shower particles detected at ground by the KASCADE experiment",
    "authors": [
        "Nicusor Arsene"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The presence of hadronic sub-showers causes azimuthal non-uniformity in the particle distributions on the ground in vertical air showers. The $LCm$ parameter, which quantifies the non-uniformity of the signal recorded in detectors located at a given distance on a ring around the shower axis, has been successfully introduced as a gamma/hadron discriminator at PeV energies \\cite{Conceicao:2022lkc}. In this work, we demonstrate that the $LCm$ parameter can effectively serve as a mass composition discriminator in experiments that employ a compact array of detectors, like KASCADE. We reconstruct the $LCm$ parameter distributions in the energy range $\\lg(E/\\rm eV) = [15.0 \\text{ - } 16.0]$ using measurements from the KASCADE experiment, with intervals of $\\lg(E/\\rm eV) = 0.1$, which are then fitted with MC templates for five primary nuclei species p, He, C, Si, and Fe considering five hadronic interaction models: QGSjet-II-02, QGSjet-II-04, EPOS-LHC, SIBYLL 2.3c and SIBYLL 2.3d. We find that the $LCm$ parameter exhibits minimal dependence on the specific hadronic interaction model considered. The reconstructed fractions of individual species demonstrate a linear decrease in the abundance of protons with increasing energy, while the heavier components become prevalent above the \\textit{knee} as predicted by all five hadronic interaction models. Our findings indicate that the abundance of particle types as a function of energy aligns with three astrophysical models that link the \\textit{knee} to the acceleration and propagation of cosmic rays within the Galaxy. These findings suggest that the $LCm$ parameter could be a valuable tool for forthcoming measurements of the LHAASO experiment to enhance our knowledge about the origin and acceleration mechanisms of cosmic rays.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09889v1"
    ],
    "publication_venue": "Comments are welcome"
}