{
    "arxiv_id": "2303.13721",
    "paper_title": "Realization of Non-Hermitian Hopf Bundle Matter",
    "authors": [
        "Yung Kim",
        "Hee Chul Park",
        "Minwook Kyung",
        "Kyungmin Lee",
        "Jung-Wan Ryu",
        "Oubo You",
        "Shuang Zhang",
        "Bumki Min",
        "Moon Jip Park"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "cond-mat.mes-hall"
    ],
    "abstract": "Line excitations in topological phases are a subject of particular interest because their mutual linking structures encode robust topological information of matter. It has been recently shown that the linking and winding of complex eigenenergy strings can classify one-dimensional non-Hermitian topological matter. However, in higher dimensions, bundles of linked strings can emerge such that every string is mutually linked with all the other strings. Interestingly, despite being an unconventional topological structure, a non-Hermitian Hopf bundle has not been experimentally clarified. Here, we make the first attempt to explore the non-Hermitian Hopf bundle by visualizing the global linking structure of spinor strings in the momentum space of a two-dimensional electric circuit. By exploiting the flexibility of reconfigurable couplings between circuit nodes, we can study the non-Hermitian topological phase transition and gain insight into the intricate structure of the Hopf bundle. Furthermore, we find that the emergence of a higher-order skin effect in real space is accompanied by the linking of spinor strings in momentum space, revealing a bulk-boundary correspondence between the two domains. The proposed non-Hermitian Hopf bundle platform and visualization methodology pave the way to design new topologically robust non-Hermitian phases of matter.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13721v1"
    ],
    "publication_venue": null
}