{
    "arxiv_id": "2303.15117",
    "paper_title": "Predicting light curves of RR Lyrae variables using artificial neural network based interpolation of a grid of pulsation models",
    "authors": [
        "Nitesh Kumar",
        "Anupam Bhardwaj",
        "Harinder P. Singh",
        "Susmita Das",
        "Marcella Marconi",
        "Shashi M. Kanbur",
        "Philippe Prugniel"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "We present a new technique to generate the light curves of RRab stars in different photometric bands ($I$ and $V$ bands) using Artificial Neural Networks (ANN). A pre-computed grid of models was used to train the ANN, and the architecture was tuned using the $I$ band light curves. The best-performing network was adopted to make the final interpolators in the $I$ and $V$ bands. The trained interpolators were used to predict the light curve of RRab stars in the Magellanic Clouds, and the distances to the LMC and SMC were determined based on the reddening independent Wesenheit index. The estimated distances are in good agreement with the literature. The comparison of the predicted and observed amplitudes, and Fourier amplitude ratios showed good agreement, but the Fourier phase parameters displayed a few discrepancies. To showcase the utility of the interpolators, the light curve of the RRab star EZ Cnc was generated and compared with the observed light curve from the Kepler mission. The reported distance to EZ Cnc was found to be in excellent agreement with the updated parallax measurement from Gaia EDR3. Our ANN interpolator provides a fast and efficient technique to generate a smooth grid of model light curves for a wide range of physical parameters, which is computationally expensive and time-consuming using stellar pulsation codes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15117v1"
    ],
    "publication_venue": "Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad937"
}