{
    "arxiv_id": "2303.17218",
    "paper_title": "HARFLOW3D: A Latency-Oriented 3D-CNN Accelerator Toolflow for HAR on FPGA Devices",
    "authors": [
        "Petros Toupas",
        "Alexander Montgomerie-Corcoran",
        "Christos-Savvas Bouganis",
        "Dimitrios Tzovaras"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 5,
    "categories": [
        "cs.AR",
        "cs.CV",
        "cs.LG"
    ],
    "abstract": "For Human Action Recognition tasks (HAR), 3D Convolutional Neural Networks have proven to be highly effective, achieving state-of-the-art results. This study introduces a novel streaming architecture based toolflow for mapping such models onto FPGAs considering the model's inherent characteristics and the features of the targeted FPGA device. The HARFLOW3D toolflow takes as input a 3D CNN in ONNX format and a description of the FPGA characteristics, generating a design that minimizes the latency of the computation. The toolflow is comprised of a number of parts, including i) a 3D CNN parser, ii) a performance and resource model, iii) a scheduling algorithm for executing 3D models on the generated hardware, iv) a resource-aware optimization engine tailored for 3D models, v) an automated mapping to synthesizable code for FPGAs. The ability of the toolflow to support a broad range of models and devices is shown through a number of experiments on various 3D CNN and FPGA system pairs. Furthermore, the toolflow has produced high-performing results for 3D CNN models that have not been mapped to FPGAs before, demonstrating the potential of FPGA-based systems in this space. Overall, HARFLOW3D has demonstrated its ability to deliver competitive latency compared to a range of state-of-the-art hand-tuned approaches being able to achieve up to 5$\\times$ better performance compared to some of the existing works.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17218v1",
        "http://arxiv.org/pdf/2303.17218v2",
        "http://arxiv.org/pdf/2303.17218v3",
        "http://arxiv.org/pdf/2303.17218v4",
        "http://arxiv.org/pdf/2303.17218v5"
    ],
    "publication_venue": "11 pages, 8 figures, 6 tables"
}