{
    "arxiv_id": "2303.15853",
    "paper_title": "The interplay between feedback, accretion, transport and winds in setting gas-phase metal distribution in galaxies",
    "authors": [
        "Piyush Sharda",
        "Omri Ginzburg",
        "Mark R. Krumholz",
        "John C. Forbes",
        "Emily Wisnioski",
        "Matilde Mingozzi",
        "Henry R. M. Zovaro",
        "Avishai Dekel"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
    ],
    "abstract": "The recent decade has seen an exponential growth in spatially-resolved metallicity measurements in the interstellar medium (ISM) of galaxies. To first order, these measurements are characterised by the slope of the radial metallicity profile, known as the metallicity gradient. In this work, we model the relative role of star formation feedback, gas transport, cosmic gas accretion, and galactic winds in driving radial metallicity profiles and setting the mass-metallicity gradient relation (MZGR). We include a comprehensive treatment of these processes by including them as sources that supply mass, metals, and energy to marginally unstable galactic discs in pressure and energy balance. We show that both feedback and accretion that can drive turbulence and enhance metal-mixing via diffusion are crucial to reproduce the observed MZGR in local galaxies. Metal transport also contributes to setting metallicity profiles, but it is sensitive to the strength of radial gas flows in galaxies. While the mass loading of galactic winds is important to reproduce the mass metallicity relation (MZR), we find that metal mass loading is more important to reproducing the MZGR. Specifically, our model predicts preferential metal enrichment of galactic winds in low-mass galaxies. This conclusion is robust against our adopted scaling of the wind mass-loading factor, uncertainties in measured wind metallicities, and systematics due to metallicity calibrations. Overall, we find that at $z \\sim 0$, galactic winds and metal transport are more important in setting metallicity gradients in low-mass galaxies whereas star formation feedback and gas accretion dominate setting metallicity gradients in massive galaxies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15853v1"
    ],
    "publication_venue": "20 pages (+ appendix), 11 figures, 4 tables. Submitted to MNRAS"
}