{
    "arxiv_id": "2303.09590",
    "paper_title": "Visual Analytics of Multivariate Networks with Representation Learning and Composite Variable Construction",
    "authors": [
        "Hsiao-Ying Lu",
        "Takanori Fujiwara",
        "Ming-Yi Chang",
        "Yang-chih Fu",
        "Anders Ynnerman",
        "Kwan-Liu Ma"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-10-04"
    ],
    "latest_version": 2,
    "categories": [
        "cs.SI",
        "cs.HC",
        "cs.LG"
    ],
    "abstract": "Multivariate networks are commonly found in real-world data-driven applications. Uncovering and understanding the relations of interest in multivariate networks is not a trivial task. This paper presents a visual analytics workflow for studying multivariate networks to extract associations between different structural and semantic characteristics of the networks (e.g., what are the combinations of attributes largely relating to the density of a social network?). The workflow consists of a neural-network-based learning phase to classify the data based on the chosen input and output attributes, a dimensionality reduction and optimization phase to produce a simplified set of results for examination, and finally an interpreting phase conducted by the user through an interactive visualization interface. A key part of our design is a composite variable construction step that remodels nonlinear features obtained by neural networks into linear features that are intuitive to interpret. We demonstrate the capabilities of this workflow with multiple case studies on networks derived from social media usage and also evaluate the workflow through an expert interview.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09590v1",
        "http://arxiv.org/pdf/2303.09590v2"
    ],
    "publication_venue": "The previous version of this manuscript was accepted for publication by a journal. We decided to withdraw the version because the journal made an unacceptable requirement for us: change of the authors' affiliations"
}