{
    "arxiv_id": "2303.15769",
    "paper_title": "Carbon-Chain Chemistry in the Interstellar Medium",
    "authors": [
        "Kotomi Taniguchi",
        "Prasanta Gorai",
        "Jonathan C. Tan"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2024-03-14"
    ],
    "latest_version": 5,
    "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "The presence of carbon-chain molecules in the interstellar medium (ISM) has been known since the early 1970s and $>130$ such species have been identified to date, making up $\\sim 43$% of the total of detected ISM molecules. They are prevalent not only in star-forming regions in our Galaxy but also in other galaxies. These molecules provide important information on physical conditions, gas dynamics, and evolutionary stages of star-forming regions. Larger species of polycyclic aromatic hydrocarbons (PAHs) and fullerenes (C$_{60}$ and C$_{70}$), which may be related to the formation of the carbon-chain molecules, have been detected in circumstellar envelopes around carbon-rich Asymptotic Giant Branch (AGB) stars and planetary nebulae, while PAHs are also known to be a widespread component of the ISM in most galaxies. Recently, two line survey projects toward Taurus Molecular Cloud-1 with large single-dish telescopes have detected many new carbon-chain species, including molecules containing benzene rings. These new findings raise fresh questions about carbon-bearing species in the Universe. This article reviews various aspects of carbon-chain molecules, including observational studies, chemical simulations, quantum calculations, and laboratory experiments, and discusses open questions and how future facilities may answer them.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15769v1",
        "http://arxiv.org/pdf/2303.15769v2",
        "http://arxiv.org/pdf/2303.15769v3",
        "http://arxiv.org/pdf/2303.15769v4",
        "http://arxiv.org/pdf/2303.15769v5"
    ],
    "publication_venue": "A review article accepted for Astrophysics and Space Science"
}