{
    "arxiv_id": "2303.13238",
    "paper_title": "Three-dimensional, Time-dependent MHD Simulation of Disk-Magnetosphere-Stellar Wind Interaction in a T Tauri, Protoplanetary System",
    "authors": [
        "Ofer Cohen",
        "Cecilia Garraffo",
        "Jeremy Drake",
        "Kristina Monsch",
        "Igor Sokolov",
        "Federico Fraschetti"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
    ],
    "abstract": "We present a three-dimensional, time-dependent, MHD simulation of the short-term interaction between a protoplanetary disk and the stellar corona in a T Tauri system. The simulation includes the stellar magnetic field, self-consistent coronal heating and stellar wind acceleration, and a disk rotating at sub-Keplerian velocity to induce accretion. We find that initially, as the system relaxes from the assumed initial conditions, the inner part of the disk winds around and moves inward and close to the star as expected. However, the self-consistent coronal heating and stellar wind acceleration build up the original state after some time, significantly pushing the disk out beyond $10R_\\star$. After this initial relaxation period, we do not find clear evidence of a strong, steady accretion flow funneled along coronal field lines, but only weak, sporadic accretion. We produce synthetic coronal X-ray line emission light curves which show flare-like increases that are not correlated with accretion events nor with heating events. These variations in the line emission flux are the result of compression and expansion due to disk-corona pressure variations. Vertical disk evaporation evolves above and below the disk. However, the disk - stellar wind boundary stays quite stable, and any disk material that reaches the stellar wind region is advected out by the stellar wind.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13238v1"
    ],
    "publication_venue": "Accepted to ApJ, 12 pages, 11 figures"
}