{
    "arxiv_id": "2303.08136",
    "paper_title": "Higgs Condensates are Symmetry-Protected Topological Phases: II. $U(1)$ Gauge Theory and Superconductors",
    "authors": [
        "Ryan Thorngren",
        "Tibor Rakovszky",
        "Ruben Verresen",
        "Ashvin Vishwanath"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el",
        "cond-mat.supr-con",
        "hep-th",
        "quant-ph"
    ],
    "abstract": "Classifying Higgs phases within the landscape of gapped and symmetry preserving states of matter presents a conceptual challenge. We argue that $U(1)$ Higgs phases are symmetry-protected topological (SPT) phases and we derive their topological response theory and boundary anomaly -- applicable to superconductors treated with dynamical electromagnetic field. This generalizes the discussion of discrete gauge theories by Verresen et al., arXiv:2211.01376. We show that a Higgs phase in $d$ spatial dimensions is in a non-trivial SPT class protected by a global $U(1)$ symmetry associated with the Higgs field, and a $d-2$ form $U(1)$ magnetic symmetry, associated with the absence of magnetic monopoles. In $d=2$, this gives an SPT with a mixed Hall response between conventional symmetries, whereas in $d=3$ we obtain a novel SPT protected by a 0-form and 1-form symmetry whose 2+1d boundary anomaly is satisfied by a superfluid. The signature properties of superconductors -- Higgs phases for electromagnetism -- can be reproduced from this SPT response. For instance, the Josephson effect directly arises from the aforementioned boundary superfluid. In addition to this minimalist approach being complementary to Landau-Ginzburg theory, its non-perturbative nature is useful in situations where fluctuations are significant. We substantiate this by predicting the stability of the Josephson effect upon introducing monopoles in $U(1)$ lattice gauge theory, where tuning from the charge-1 Higgs phase to the confined phase leads to a quantum critical point in the junction. Furthermore, this perspective reveals unexpected connections, such as how persistent currents at the surface of a superconductor arise from generalized Thouless pumps. We also treat generalizations to partial-Higgs phases, including \"2e\" condensates in electronic superconductors, corresponding to symmetry-enriched topological orders.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08136v1"
    ],
    "publication_venue": "40 pages + appendices, 7 figures"
}