{
    "arxiv_id": "2303.08663",
    "paper_title": "Parametric study of the kinematic evolution of coronal mass ejection shock waves and their relation to flaring activity",
    "authors": [
        "Manon Jarry",
        "Alexis P. Rouillard",
        "Illya Plotnikov",
        "Athanasios Kouloumvakos",
        "Alexander Warmuth"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Coronal and interplanetary shock waves produced by coronal mass ejections (CMEs) are major drivers of space-weather phenomena, inducing major changes in the heliospheric radiation environment and directly perturbing the near-Earth environment, including its magnetosphere. A better understanding of how these shock waves evolve from the corona to the interplanetary medium can therefore contribute to improving nowcasting and forecasting of space weather. Early warnings from these shock waves can come from radio measurements as well as coronagraphic observations that can be exploited to characterise the dynamical evolution of these structures. Our aim is to analyse the geometrical and kinematic properties of 32 CME shock waves derived from multi-point white-light and ultraviolet imagery taken by the Solar Dynamics Observatory (SDO), Solar and Heliospheric Observatory (SoHO), and Solar-Terrestrial Relations Observatory (STEREO) to improve our understanding of how shock waves evolve in 3D during the eruption of a CME. We use our catalogue to search for relations between the shock wave's kinematic properties and the flaring activity associated with the underlying genesis of the CME piston. Past studies have shown that shock waves observed from multiple vantage points can be aptly reproduced geometrically by simple ellipsoids. The catalogue of reconstructed shock waves provides the time-dependent evolution of these ellipsoidal parameters. From these parameters, we deduced the lateral and radial expansion speeds of the shocks evolving over time. We compared these kinematic properties with those obtained from a single viewpoint by SoHO in order to evaluate projection effects. Finally, we examined the relationships between the shock wave and the associated flare when the latter was observed on the disc by considering the measurements of soft and hard X-rays.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08663v1"
    ],
    "publication_venue": "11 pages, 12 figures, accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202245480"
}