{
    "arxiv_id": "2303.16913",
    "paper_title": "Optimizing Reconfigurable Intelligent Surfaces for Short Transmissions: How Detailed Configurations can be Afforded?",
    "authors": [
        "Anders Enqvist",
        "Özlem Tuğfe Demir",
        "Cicek Cavdar",
        "Emil Björnson"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-10-18"
    ],
    "latest_version": 2,
    "categories": [
        "cs.IT",
        "eess.SP"
    ],
    "abstract": "In this paper, we examine how to minimize the total energy consumption of a user equipment (UE) when it transmits a finite-sized data payload of a given length. The receiving base station (BS) controls a reconfigurable intelligent surface (RIS) that can be utilized to improve the channel conditions, but only if additional pilot signals are transmitted to configure the RIS. The challenge is that the pilot resources spent on configuring the RIS increase the energy consumption, especially when small payloads are transmitted, so it must be balanced against the energy savings during data transmission. We derive a formula for the energy consumption, taking both the pilot and data transmission power into account. It also includes the effects of imperfect channel state information, the use of phase-shifts with finite resolution at the RIS, and the passive circuit energy consumption.\n  We also consider how dividing the RIS into subarrays consisting of multiple RIS elements using the same reflection coefficient can shorten the pilot length. In particular, the pilot power and subarray size are tuned to the payload length to minimize the energy consumption while maintaining parts of the aperture gain. Our analytical results show that, for a given geometry and transmission payload length, there exists a unique energy-minimizing subarray size and pilot power. For small payloads and when the channel conditions between the BS and UE are favorable compared to the path to the RIS, the energy consumption is minimized using subarrays with many elements and low pilot transmission power. On the other hand, when the channel conditions to the RIS are better and the data payloads are large, it is preferable to use fewer elements per subarray, potentially configuring each element individually and transmitting the pilot signals with additional power.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16913v1",
        "http://arxiv.org/pdf/2303.16913v2"
    ],
    "publication_venue": "16 pages, 9 figures. This article has been accepted for publication in IEEE Transactions on Wireless Communications. This is the author's version which has not been fully edited and content may change prior to final publication. arXiv admin note: text overlap with arXiv:2303.16625",
    "doi": "10.1109/TWC.2023.3307605"
}