{
    "arxiv_id": "2303.13313",
    "paper_title": "How to detect lensing rotation",
    "authors": [
        "Mathew Robertson",
        "Antony Lewis"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2024-07-01"
    ],
    "latest_version": 3,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "Gravitational lensing rotation of images is predicted to be negligible at linear order in density perturbations, but can be produced by the post-Born lens-lens coupling at second order. This rotation is somewhat enhanced for Cosmic Microwave Background (CMB) lensing due to the large source path length, but remains small and very challenging to detect directly by CMB lensing reconstruction alone. We show the rotation may be detectable at high significance as a cross-correlation signal between the curl reconstructed with Simons Observatory (SO) or CMB-S4 data, and a template constructed from quadratic combinations of large-scale structure (LSS) tracers. Equivalently, the lensing rotation-tracer-tracer bispectrum can also be detected, where LSS tracers considered include the CMB lensing convergence, galaxy density, and the Cosmic Infrared Background (CIB), or optimal combinations thereof. We forecast that an optimal combination of these tracers can probe post-Born rotation at the level of $5.7σ$-$6.1σ$ with SO and $13.6σ$-$14.7σ$ for CMB-S4, depending on whether standard quadratic estimators or maximum a posteriori iterative methods are deployed. We also show possible improvement up to $21.3σ$ using a CMB-S4 deep patch observation with polarization-only iterative lensing reconstruction. However, these cross-correlation signals have non-zero bias because the rotation template is quadratic in the tracers, and exists even if the lensing is rotation free. We estimate this bias analytically, and test it using simple null-hypothesis simulations to confirm that the bias remains subdominant to the rotation signal of interest. Detection and then measurement of the lensing rotation cross-spectrum is therefore a realistic target for future observations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13313v1",
        "http://arxiv.org/pdf/2303.13313v2",
        "http://arxiv.org/pdf/2303.13313v3"
    ],
    "publication_venue": "15 pages + appendix, 11 figures, 4 tables. Minor corrections (results unchanged): sign clarification in Eq 2.13, fixing typos in Eq 2.15 and Eq 5.4"
}