{
    "arxiv_id": "2303.08265",
    "paper_title": "The imprint of clump formation at high redshift. II. The chemistry of the bulge",
    "authors": [
        "Victor P. Debattista",
        "David J. Liddicott",
        "Oscar A. Gonzalez",
        "Leandro Beraldo e Silva",
        "Joao A. S. Amarante",
        "Ilin Lazar",
        "Manuela Zoccali",
        "Elena Valenti",
        "Deanne B. Fisher",
        "Tigran Khachaturyants",
        "David L. Nidever",
        "Thomas R. Quinn",
        "Min Du",
        "Susan Kassin"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-04-19"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "In Paper I we showed that clumps in high-redshift galaxies, having a high star formation rate density (Σ_SFR), produce disks with two tracks in the [Fe/H]-[α/Fe] chemical space, similar to that of the Milky Way's (MW's) thin + thick disks. Here we investigate the effect of clumps on the bulge's chemistry. The chemistry of the MW's bulge is comprised of a single track with two density peaks separated by a trough. We show that the bulge chemistry of an N-body + smoothed particle hydrodynamics clumpy simulation also has a single track. Star formation within the bulge is itself in the high-Σ_SFR clumpy mode, which ensures that the bulge's chemical track follows that of the thick disk at low [Fe/H] and then extends to high [Fe/H], where it peaks. The peak at low metallicity instead is comprised of a mixture of in-situ stars and stars accreted via clumps. As a result, the trough between the peaks occurs at the end of the thick disk track. We find that the high-metallicity peak dominates near the mid-plane and declines in relative importance with height, as in the MW. The bulge is already rapidly rotating by the end of the clump epoch, with higher rotation at low [α/Fe]. Thus clumpy star formation is able to simultaneously explain the chemodynamic trends of the MW's bulge, thin + thick disks and the Splash.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08265v1"
    ],
    "publication_venue": "25 pages, in press at ApJ",
    "doi": "10.3847/1538-4357/acbb00"
}