{
    "arxiv_id": "2303.08149",
    "paper_title": "Direct T_e-based Metallicities of z=2-9 Galaxies with JWST/NIRSpec: Empirical Metallicity Calibrations Applicable from Reionization to Cosmic Noon",
    "authors": [
        "Ryan L. Sanders",
        "Alice E. Shapley",
        "Michael W. Topping",
        "Naveen A. Reddy",
        "Gabriel B. Brammer"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We report detections of the [OIII]$λ$4364 auroral emission line for 16 galaxies at z=2.1-8.7, measured from JWST/NIRSpec observations obtained as part of the Cosmic Evolution Early Release Science (CEERS) survey program. We combine this CEERS sample with 9 objects from the literature at z=4-9 with auroral-line detections from JWST/NIRSpec and 21 galaxies at z=1.4-3.7 with auroral-line detections from ground-based spectroscopy. We derive electron temperature T_e and direct-method oxygen abundances for the combined sample of 46 star-forming galaxies at z=1.4-8.7. We use these measurements to construct the first high-redshift empirical T_e-based metallicity calibrations for the strong-line ratios [OIII]/H$β$, [OII]/H$β$, R23=([OIII]+[OII])/H$β$, [OIII]/[OII], and [NeIII]/[OII]. These new calibrations are valid over 12+log(O/H)=7.0-8.4 and can be applied to samples of star-forming galaxies at z=2-9, leading to an improvement in the accuracy of metallicity determinations at Cosmic Noon and in the Epoch of Reionization. The high-redshift strong-line relations are offset from calibrations based on typical $z\\sim0$ galaxies or HII regions, reflecting the known evolution of ionization conditions between $z\\sim0$ and $z\\sim2$. Deep spectroscopic programs with JWST/NIRSpec promise to improve statistics at the low and high ends of the metallicity range covered by the current sample, as well as improve the detection rate of [NII]$λ$6585 to allow the future assessment of N-based indicators. These new high-redshift calibrations will enable accurate characterizations of metallicity scaling relations at high redshift, improving our understanding of feedback and baryon cycling in the early universe.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08149v1"
    ],
    "publication_venue": "22 pages, 7 figures, 3 tables, submitted to ApJ"
}