{
    "arxiv_id": "2303.15355",
    "paper_title": "Mechanisms for Long-Lived, Photo-Induced Superconductivity",
    "authors": [
        "Sambuddha Chattopadhyay",
        "Christian J. Eckhardt",
        "Dante M. Kennes",
        "Michael A. Sentef",
        "Dongbin Shin",
        "Angel Rubio",
        "Andrea Cavalleri",
        "Eugene A. Demler",
        "Marios H. Michael"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con",
        "cond-mat.mes-hall",
        "cond-mat.stat-mech",
        "cond-mat.str-el",
        "physics.optics"
    ],
    "abstract": "Advances in the control of intense infrared light have led to the striking discovery of metastable superconductivity in $\\mathrm{K}_3\\mathrm{C}_{60}$ at 100K, lasting more than 10 nanoseconds. Inspired by these experiments, we discuss possible mechanisms for long-lived, photo-induced superconductivity above $T_{c}$. We analyze a minimal model of optically-driven Raman phonons coupled to inter-band electronic transitions. Using this model, we develop a possible microscopic mechanism for photo-controlling the pairing interaction by displacively shifting the Raman mode. Leveraging this mechanism, we explore two pictures of long-lived, light-induced superconductivity far above $T_c$. We first investigate long-lived, photo-induced superconductivity arising from the metastable trapping of a displaced phonon coordinate. We then propose an alternate route to long-lived superconductivity. Within this paradigm, the slow equilibration of quasi-particles enables a long-lived, non-thermal superconducting gap. We conclude by discussing implications of both scenarios to experiments that can be used to discriminate between them. Our work provides falsifiable, mechanistic explanations for the nanosecond scale photo-induced superconductivity found in $\\mathrm{K}_3\\mathrm{C}_{60}$, while also offering a theoretical basis for exploring long-lived, non-equilibrium superconductivity in other quantum materials.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15355v1"
    ],
    "publication_venue": "7 pages Main Text, 9 pages Supplementary Material, 4 figures"
}