{
    "arxiv_id": "2303.12924",
    "paper_title": "Active Learning Sensitivity Analysis of $γ^\\prime$(L1$_2$) Precipitate Morphology of Ternary Co-Based Superalloys",
    "authors": [
        "Whitney Tso",
        "Wenkun Wu",
        "David N. Seidman",
        "Olle G. Heinonen"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "To better understand the equilibrium $γ^\\prime$(L1$_2$) precipitate morphology in Co-based superalloys, a phase field modeling sensitivity analysis is conducted to examine how four phase-field parameters [initial Co concentration ($c_0$), double-well barrier height ($ω$), gradient energy density coefficient ($κ$), and lattice misfit strain ($ε_{\\rm misfit}$)] influence the $γ^\\prime$(L1$_2$) precipitate size and morphology. Gaussian Process Regression (GPR) models are used to fit the sample points and to generate surrogate models for both precipitate size and morphology. In an Active Learning approach, a Bayesian Optimization algorithm is coupled with the GPR models to suggest new sample points to calculate and efficiently update the models based on a reduction of uncertainty. The algorithm has a user-defined objective, which controls the balance between exploration and exploitation for new suggested points. Our methodology provides a qualitative and quantitative relationship between the $γ^\\prime$(L1$_2$) precipitate size and morphology and the four phase-field parameters, and concludes that the most sensitive phase-field parameter for precipitate size and morphology is the initial Co concentration ($c_0$) and the double-well barrier height ($ω$), respectively. We note that the GPR model for precipitate morphology required adding a noise tolerance in order to avoid overfitting due to irregularities in some of the simulated equilibrium $γ^\\prime$(L1$_2$) precipitate morphology.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12924v1"
    ],
    "publication_venue": "24 pages, 10 figures"
}