{
    "arxiv_id": "2303.14469",
    "paper_title": "The Invisible Dilaton",
    "authors": [
        "Philippe Brax",
        "Clare Burrage",
        "Jose A. R. Cembranos",
        "Patrick Valageas"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph",
        "astro-ph.CO",
        "gr-qc"
    ],
    "abstract": "We analyse the dynamics of a light scalar field responsible for the $μ$ term of the Higgs potential and coupled to matter via the Higgs-portal mechanism. We find that this dilaton model is stable under radiative corrections induced by the standard model particle masses. When the background value of the scalar field is stabilised at the minimum of the scalar potential, the scalar field fluctuations only couple quadratically to the massive fields of the standard model preventing the scalar direct decay into standard model particles. Cosmologically and prior to the electroweak symmetry breaking, the scalar field rolls down along its effective potential before eventually oscillating and settling down at the electroweak minimum. These oscillations can be at the origin of dark matter due to the initial misalignment of the scalar field compared to the electroweak minimum, and we find that, when the mass of the scalar field is less than the eV scale and acts as a condensate behaving like dark matter on large scales, the scalar particles cannot thermalise with the standard model thermal bath. As matter couples in a composition-dependent manner to the oscillating scalar, this could lead to a violation of the equivalence principle aboard satellites such as the MICROSCOPE experiment and the next generation of tests of the equivalence principle. Local gravitational tests are evaded thanks to the weakness of the quadratic coupling in the dark matter halo, and we find that, around other sources, these dilaton models could be subject to a screening akin to the symmetron mechanism.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14469v1"
    ],
    "publication_venue": "36 pages, 3 figures",
    "doi": "10.1103/PhysRevD.107.095015"
}