{
    "arxiv_id": "2303.11787",
    "paper_title": "Exciton-phonon-scattering: A competition between bosonic and fermionic nature of bound electron-hole pairs",
    "authors": [
        "Manuel Katzer",
        "Malte Selig",
        "Lukas Sigl",
        "Mirco Troue",
        "Johannes Figueiredo",
        "Jonas Kiemle",
        "Florian Sigger",
        "Ursula Wurstbauer",
        "Alexander W. Holleitner",
        "Andreas Knorr"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-09-06"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "cond-mat.quant-gas"
    ],
    "abstract": "The question of macroscopic occupation and spontaneous emergence of coherence for exciton ensembles has gained renewed attention due to the rise of van der Waals heterostructures made of atomically thin semiconductors. The hosted interlayer excitons exhibit nanosecond lifetimes, long enough to allow for excitonic thermalization in time. Several experimental studies reported signatures of macroscopic occupation effects at elevated exciton densities. With respect to theory, excitons are composite particles formed by fermionic constituents, and a general theoretical argument for a bosonic thermalization of an exciton gas beyond the linear regime is still missing. Here, we derive an equation for the phonon mediated thermalization at densities above the classical limit, and identify which conditions favor the thermalization of fermionic or bosonic character, respectively. In cases where acoustic, quasielastic phonon scattering dominates the dynamics, our theory suggests that transition metal dichalcogenide (TMDC) excitons might be bosonic enough to show bosonic thermalization behaviour and decreasing dephasing for increasing exciton densities. This can be interpreted as a signature of an emerging coherence in the exciton ground state, and agrees well with the experimentally observed features, such as a decreasing linewidth for increasing densities.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11787v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevB.108.L121102"
}