{
    "arxiv_id": "2303.14637",
    "paper_title": "Improved Nonlinear Transform Source-Channel Coding to Catalyze Semantic Communications",
    "authors": [
        "Sixian Wang",
        "Jincheng Dai",
        "Xiaoqi Qin",
        "Zhongwei Si",
        "Kai Niu",
        "Ping Zhang"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-05-25"
    ],
    "latest_version": 2,
    "categories": [
        "eess.SP",
        "cs.MM"
    ],
    "abstract": "Recent deep learning methods have led to increased interest in solving high-efficiency end-to-end transmission problems. These methods, we call nonlinear transform source-channel coding (NTSCC), extract the semantic latent features of source signal, and learn entropy model to guide the joint source-channel coding with variable rate to transmit latent features over wireless channels. In this paper, we propose a comprehensive framework for improving NTSCC, thereby higher system coding gain, better model versatility, and more flexible adaptation strategy aligned with semantic guidance are all achieved. This new sophisticated NTSCC model is now ready to support large-size data interaction in emerging XR, which catalyzes the application of semantic communications. Specifically, we propose three useful improvement approaches. First, we introduce a contextual entropy model to better capture the spatial correlations among the semantic latent features, thereby more accurate rate allocation and contextual joint source-channel coding are developed accordingly to enable higher coding gain. On that basis, we further propose response network architectures to formulate versatile NTSCC, i.e., once-trained model supports various rates and channel states that benefits the practical deployment. Following this, we propose an online latent feature editing method to enable more flexible coding rate control aligned with some specific semantic guidance. By comprehensively applying the above three improvement methods for NTSCC, a deployment-friendly semantic coded transmission system stands out finally. Our improved NTSCC system has been experimentally verified to achieve considerable bandwidth saving versus the state-of-the-art engineered VTM + 5G LDPC coded transmission system with lower processing latency.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14637v1",
        "http://arxiv.org/pdf/2303.14637v2"
    ],
    "publication_venue": null
}