{
    "arxiv_id": "2303.08990",
    "paper_title": "Notes on the $L_\\infty$-approach to local gauge field theories",
    "authors": [
        "Maxim Grigoriev",
        "Dmitry Rudinsky"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "hep-th",
        "math-ph"
    ],
    "abstract": "It is well known that a $Q$-manifold gives rise to an $L_\\infty$-algebra structure on the tangent space at a fixed point of the homological vector field. From the field theory perspective this implies that the expansion of a Batalin-Vilkovisky (BV) formulation around a vacuum solution can be equivalently cast into the form of an $L_\\infty$-algebra. In so doing, the BV symplectic structure determines a compatible cyclic structure on the $L_\\infty$-algebra. Moreover, $L_\\infty$ quasi-isomorphisms correspond to so-called equivalent reductions (also known as the elimination of generalized auxiliary fields) of the respective BV systems. Although at the formal level the relation is straightforward, its implementation in field theory requires some care because the underlying spaces become infinite-dimensional. In the case of local gauge theories, the relevant spaces can be approximated by nearly finite-dimensional ones through employing the jet-bundle technique. In this work we study the $L_\\infty$-counterpart of the jet-bundle BV approach and generalise it to a more flexible setup of so-called gauge PDEs. It turns out that in the latter case the underlying $L_\\infty$-structure is analogous to that of Chern-Simons theory. In particular, the underlying liner space is a module over the space-time exterior algebra and the higher $L_\\infty$-maps are multilinear. Furthermore, a counterpart of the cyclic structure turns out to be degenerate and possibly nonlinear, and corresponds to a compatible presymplectic structure the gauge PDE, which is known to encode the BV symplectic structure and hence the full-scale Lagrangian BV formulation. Moreover, given a degenerate cyclic structure one can consistently relax the $L_\\infty$-axioms in such a way that the formalism still describes non-topological models but involves only finitely-generated modules, as we illustrate in the example of Yang-Mills theory.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08990v1"
    ],
    "publication_venue": null
}