{
    "arxiv_id": "2303.14440",
    "paper_title": "A Bioinformatics Study for Recognition of Hub Genes and Pathways in Pancreatic Ductal Adenocarcinoma",
    "authors": [
        "Atefeh Akbarnia Dafrazi",
        "Tahmineh Mehrabi",
        "Fatemeh Malekinejad"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.MN"
    ],
    "abstract": "Background: The aim of this study is to use bioinformatics to discover the biomarkers associated with patients with Pancreatic Ductal Adenocarcinoma(PDAC).\n  Material and Methods: GSE28735, GSE15471, and GSE62452 are gene microarray datasets drived from the GEO database, included 153 PDAC samples and 145 normal samples. By analyzing both Gene Ontology (GO) and the Kyoto Encyclopedia of Genes (KEGG), for screening DEGs has provided information about their biological function. Protein-protein interactions (PPI) of DEGs were analyzed using the Search Tool for the Retrieval of Interacting Genes database (STRING) and visualized by Cytoscape. UALCAN was also used to perform prognostic analyses.\n  Results: In Pancreatic ductal adenocarcinoma, we discovered 2264 upregulated DEGs (uDEGs) and 723 downregulated DEGs (dDEGs). The Gene Ontology (GO) indicated that extracellular matrix organization, extracellular structure organization, collagen catabolic process and also the uDEGs are enriched in focal adhesion, PI3K-Akt signaling pathway, ECM-receptor interaction by KEGG analysis. The top ten hub genes were identified from the PPI network: COL1A1, COL3A1, COL1A2, FN1, COL5A2, ITGA3, FBN1, MET, COL6A3, and BGN. These 10 hub genes are highly upregulated in pancreatic ductal adenocarcinoma, according to GEPIA research. The UALCAN prognostic analysis of the 10 hub genes revealed that two of the elevated genes, ITGA3 and MET, significantly shortened PDAC patient survival time. Pancreatic ductal adenocarcinoma is linked to Focal adhesion, the PI3K-Akt signaling pathway, and ECM-receptor interaction, according to Module analysis from the PPI network.\n  Conclusion: This investigation identified hub genes and important signal pathways, which adds to our knowledge of molecular mechanisms and could be exploited as diagnostic and therapeutic biomarkers for Pancreatic ductal adenocarcinoma.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14440v1"
    ],
    "publication_venue": null
}