{
    "arxiv_id": "2303.10890",
    "paper_title": "Statistical anisotropy in galaxy ellipticity correlations",
    "authors": [
        "Maresuke Shiraishi",
        "Teppei Okumura",
        "Kazuyuki Akitsu"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-06-30"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
    ],
    "abstract": "As well as the galaxy number density and peculiar velocity, the galaxy intrinsic alignment can be used to test the cosmic isotropy. We study distinctive impacts of the isotropy breaking on the configuration-space two-point correlation functions (2PCFs) composed of the spin-2 galaxy ellipticity field. For this purpose, we build a formalism for general types of the isotropy-violating 2PCFs and a methodology to efficiently compute them by generalizing the polypolar spherical harmonic decomposition approach to the spin-weighted version. As a demonstration, we analyze the 2PCFs when the matter power spectrum has a well-known $g_*$-type isotropy-breaking term (induced by, e.g., dark vector fields). We then confirm that some anisotropic distortions indeed appear in the 2PCFs and their shapes rely on a preferred direction causing the isotropy violation, $\\hat{d}$. Such a feature can be a distinctive indicator for testing the cosmic isotropy. Comparing the isotropy-violating 2PCFs computed with and without the plane parallel (PP) approximation, we find that, depending on $\\hat{d}$, the PP approximation is no longer valid when an opening angle between the directions towards target galaxies is ${\\cal O}(1^\\circ)$ for the density-ellipticity and velocity-ellipticity cross correlations and around $10^\\circ$ for the ellipticity auto correlation. This suggests that an accurate test for the cosmic isotropy requires the formulation of the 2PCF without relying on the PP approximation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10890v1",
        "http://arxiv.org/pdf/2303.10890v2"
    ],
    "publication_venue": "25+1 pages, 8 figures"
}