{
    "arxiv_id": "2303.13922",
    "paper_title": "Triplet supercurrents in lateral Josephson junctions with a half-metallic ferromagnet",
    "authors": [
        "Yao Jungxiang",
        "Remko Fermin",
        "Kaveh Lahabi",
        "Jan Aarts"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con"
    ],
    "abstract": "Spin triplet supercurrents in half-metallic ferromagnets (HMFs) would be a valuable addition to the toolbox of superconducting spintronics since they promise to be long-range, fully spin-polarized, and with high current density. However, experimental studies on the subject remain scarce because there are only few HMFs available. Here we report on the generation of triplet supercurrents in mesoscopic lateral Josephson junctions, fabricated with the conventional superconductor NbTi and the HMF La$_{0.7}$Sr$_{0.3}$MnO$_3$ (LSMO), having a typical junction length of 20~nm. We use the electrode geometry as a tool to examine the triplet generator in the HMF and study junctions shaped as bar, square, and disk. In all junctions, we find strong supercurrents and high current densities, that are independent of the junction geometry and are insensitive to the application of in-plane fields, ruling out the magnetic vorticity in the disk geometry as the generator. Analysis of the critical current interference pattern upon application of a perpendicular magnetic field shows that the triplet supercurrent is highly constricted to the rims of the disk devices, yet uniformly distributed in the bar-shaped devices. The appearance of these rim supercurrents is tied to the combination of triplet transport and the disk geometry but is not central to the generator mechanism. Next, we analyze the temperature dependence of the critical current and find in its quadratic dependence a strong indication for the triplet nature of the supercurrents. Finally, we find the supercurrent to persist in junctions fabricated from a NbTi/Ag/LSMO trilayer. The results strongly indicate that the magnetic inhomogeneity needed for triplet generation resides in the LSMO layer adjacent to the NbTi/LSMO interface.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13922v1"
    ],
    "publication_venue": null
}