{
    "arxiv_id": "2303.11258",
    "paper_title": "Bronchoscopic video synchronization for interactive multimodal inspection of bronchial lesions",
    "authors": [
        "Qi Chang",
        "Patrick D. Byrnes",
        "Danish Ahmad",
        "Jennifer Toth",
        "Rebecca Bascom",
        "William E. Higgins"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "eess.IV"
    ],
    "abstract": "With lung cancer being the most fatal cancer worldwide, it is important to detect the disease early. A potentially effective way of detecting early cancer lesions developing along the airway walls (epithelium) is bronchoscopy. To this end, developments in bronchoscopy offer three promising noninvasive modalities for imaging bronchial lesions: white-light bronchoscopy (WLB), autofluorescence bronchoscopy (AFB), and narrow-band imaging (NBI). While these modalities give complementary views of the airway epithelium, the physician must manually inspect each video stream produced by a given modality to locate the suspect cancer lesions. Unfortunately, no effort has been made to rectify this situation by providing efficient quantitative and visual tools for analyzing these video streams. This makes the lesion search process extremely time-consuming and error-prone, thereby making it impractical to utilize these rich data sources effectively. We propose a framework for synchronizing multiple bronchoscopic videos to enable an interactive multimodal analysis of bronchial lesions. Our methods first register the video streams to a reference 3D chest computed-tomography (CT) scan to produce multimodal linkages to the airway tree. Our methods then temporally correlate the videos to one another to enable synchronous visualization of the resulting multimodal data set. Pictorial and quantitative results illustrate the potential of the methods.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11258v1"
    ],
    "publication_venue": null,
    "doi": "10.1117/12.2579931"
}