{
    "arxiv_id": "2303.08748",
    "paper_title": "DeFi Lending During The Merge",
    "authors": [
        "Lioba Heimbach",
        "Eric Schertenleib",
        "Roger Wattenhofer"
    ],
    "submission_date": "2023-01-23",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 2,
    "categories": [
        "q-fin.GN"
    ],
    "abstract": "Lending protocols in decentralized finance enable the permissionless exchange of capital from lenders to borrowers without relying on a trusted third party for clearing or market-making. Interest rates are set by the supply and demand of capital according to a pre-defined function. In the lead-up to The Merge: Ethereum blockchain's transition from proof-of-work (PoW) to proof-of-stake (PoS), a fraction of the Ethereum ecosystem announced plans of continuing with a PoW-chain. Owners of ETH - whether their ETH was borrowed or not - would hold the native tokens on each chain. This development alarmed lending protocols. They feared spiking ETH borrowing rates would lead to mass liquidations which could undermine their viability. Thus, the decentralized autonomous organization running the protocols saw no alternative to intervention - restricting users' ability to borrow.\n  We investigate the effects of the merge and the aforementioned intervention on the two biggest lending protocols on Ethereum: AAVE and Compound. Our analysis finds that borrowing rates were extremely volatile, jumping by two orders of magnitude, and borrowing at times reached 100% of the available funds. Despite this, no spike in mass liquidations or irretrievable loans materialized. Further, we are the first to quantify and analyze hard-fork-arbitrage, profiting from holding debt in the native blockchain token during a hard fork. We find that arbitrageurs transferred tokens to centralized exchanges which at the time were worth more than 13 Mio US$, money that was effectively extracted from the platforms' lenders.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08748v1",
        "http://arxiv.org/pdf/2303.08748v2"
    ],
    "publication_venue": null
}