{
    "arxiv_id": "2303.12999",
    "paper_title": "Automated Federated Learning in Mobile Edge Networks -- Fast Adaptation and Convergence",
    "authors": [
        "Chaoqun You",
        "Kun Guo",
        "Gang Feng",
        "Peng Yang",
        "Tony Q. S. Quek"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cs.DC"
    ],
    "abstract": "Federated Learning (FL) can be used in mobile edge networks to train machine learning models in a distributed manner. Recently, FL has been interpreted within a Model-Agnostic Meta-Learning (MAML) framework, which brings FL significant advantages in fast adaptation and convergence over heterogeneous datasets. However, existing research simply combines MAML and FL without explicitly addressing how much benefit MAML brings to FL and how to maximize such benefit over mobile edge networks. In this paper, we quantify the benefit from two aspects: optimizing FL hyperparameters (i.e., sampled data size and the number of communication rounds) and resource allocation (i.e., transmit power) in mobile edge networks. Specifically, we formulate the MAML-based FL design as an overall learning time minimization problem, under the constraints of model accuracy and energy consumption. Facilitated by the convergence analysis of MAML-based FL, we decompose the formulated problem and then solve it using analytical solutions and the coordinate descent method. With the obtained FL hyperparameters and resource allocation, we design a MAML-based FL algorithm, called Automated Federated Learning (AutoFL), that is able to conduct fast adaptation and convergence. Extensive experimental results verify that AutoFL outperforms other benchmark algorithms regarding the learning time and convergence performance.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12999v1"
    ],
    "publication_venue": null,
    "doi": "10.1109/JIOT.2023.3262664"
}