{
    "arxiv_id": "2303.12772",
    "paper_title": "Interpretable Bangla Sarcasm Detection using BERT and Explainable AI",
    "authors": [
        "Ramisa Anan",
        "Tasnim Sakib Apon",
        "Zeba Tahsin Hossain",
        "Elizabeth Antora Modhu",
        "Sudipta Mondal",
        "MD. Golam Rabiul Alam"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CL",
        "cs.AI"
    ],
    "abstract": "A positive phrase or a sentence with an underlying negative motive is usually defined as sarcasm that is widely used in today's social media platforms such as Facebook, Twitter, Reddit, etc. In recent times active users in social media platforms are increasing dramatically which raises the need for an automated NLP-based system that can be utilized in various tasks such as determining market demand, sentiment analysis, threat detection, etc. However, since sarcasm usually implies the opposite meaning and its detection is frequently a challenging issue, data meaning extraction through an NLP-based model becomes more complicated. As a result, there has been a lot of study on sarcasm detection in English over the past several years, and there's been a noticeable improvement and yet sarcasm detection in the Bangla language's state remains the same. In this article, we present a BERT-based system that can achieve 99.60\\% while the utilized traditional machine learning algorithms are only capable of achieving 89.93\\%. Additionally, we have employed Local Interpretable Model-Agnostic Explanations that introduce explainability to our system. Moreover, we have utilized a newly collected bangla sarcasm dataset, BanglaSarc that was constructed specifically for the evaluation of this study. This dataset consists of fresh records of sarcastic and non-sarcastic comments, the majority of which are acquired from Facebook and YouTube comment sections.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12772v1"
    ],
    "publication_venue": null
}