{
    "arxiv_id": "2303.17756",
    "paper_title": "Effect of interpolation kernels and grid refinement on two way-coupled point-particle simulations",
    "authors": [
        "Nathan A. Keane",
        "Sourabh V. Apte",
        "Suhas S. Jain",
        "Makrand A. Khanwale"
    ],
    "submission_date": "2023-03-31",
    "revised_dates": [
        "2023-08-22"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "The predictive capability of two way--coupled point-particle Euler-Lagrange model in accurately capturing particle-flow interactions under grid refinement, wherein the particle size can be comparable to the grid size, is systematically evaluated. Two situations are considered, (i) uniform flow over a stationary particle, and (ii) decaying isotropic turbulence laden with Kolmogorov-scale particles. Particle-fluid interactions are modeled using only the standard drag law, typical of large density-ratio systems. A zonal, advection-diffusion-reaction (Zonal-ADR) model is used to obtain the undisturbed fluid velocity needed in the drag closure. Two main types of interpolation kernels, grid-based and particle size--based, are employed. The effect of interpolation kernels on capturing the particle-fluid interactions, kinetic energy, dissipation rate, and particle acceleration statistics are evaluated in detail. It is shown that the interpolation kernels whose width scales with the particle size perform significantly better under grid refinement than kernels whose width scales with the grid size. Convergence with respect to spatial resolution is obtained with the particle size--based kernels with and without correcting for the self-disturbance effect. While the use of particle size--based interpolation kernels provide spatial convergence and perform better than kernels that scale based on grid size, small differences can still be seen in the converged results with and without correcting for the particle self-disturbance. Such differences indicate the need for self-disturbance correction to obtain the best results, especially when the particles are larger than the grid size.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17756v1"
    ],
    "publication_venue": "Submitted to International Journal of Multiphase Flow",
    "doi": "10.1016/j.ijmultiphaseflow.2023.104517"
}