{
    "arxiv_id": "2303.13786",
    "paper_title": "Statistically equivalent models with different causal structures: An example from physics identity",
    "authors": [
        "Yangqiuting Li",
        "Chandralekha Singh"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2024-02-21"
    ],
    "latest_version": 2,
    "categories": [
        "physics.ed-ph"
    ],
    "abstract": "Structural equation modeling (SEM) is a statistical method widely used in educational research to investigate relationships between variables. SEM models are typically constructed based on theoretical foundations and assessed through fit indices. However, a well-fitting SEM model alone is not sufficient to verify the causal inferences underlying the proposed model, as there are statistically equivalent models with distinct causal structures that equally well fit the data. Therefore, it is crucial for researchers using SEM to consider statistically equivalent models and to clarify why the proposed model is more accurate than the equivalent ones. However, many SEM studies did not explicitly address this important step, and no prior study in physics education research has delved into potential methods for distinguishing statistically equivalent models with differing causal structures. In this study, we use physics identity model as an example to discuss the importance of considering statistically equivalent models and how other data can help to distinguish them. Previous research has identified three dimensions of physics identity: perceived recognition, self-efficacy, and interest. However, the relationships between these dimensions have not been thoroughly understood. In this paper, we specify a model with perceived recognition predicting self-efficacy and interest, which is inspired by individual interviews with students in physics courses to make physics learning environments equitable and inclusive. We test our model with fit indices and discuss its statistically equivalent models with different causal inferences among perceived recognition, self-efficacy, and interest. We then discuss potential experiments that could further empirically test the causal inferences underlying the models, aiding the refinement to a more accurate causal model for guiding educational improvements.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13786v1",
        "http://arxiv.org/pdf/2303.13786v2"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevPhysEducRes.20.010101"
}