{
    "arxiv_id": "2303.12061",
    "paper_title": "Force Dipole Interactions in Tubular Fluid Membranes",
    "authors": [
        "Samyak Jain",
        "Rickmoy Samanta"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-07-26"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.soft",
        "physics.bio-ph",
        "physics.flu-dyn"
    ],
    "abstract": "We construct viscous fluid flow sourced by a force dipole embedded in a cylindrical fluid membrane, coupled to external embedding fluids. We find analytic expressions for the flow, in the limit of infinitely long and thin tubular membranes. We utilize this solution to formulate the in-plane dynamics of a pair of pusher-type dipoles along the cylinder surface. We find that a mutually perpendicular dipole pair generically move together along helical geodesics. Since the cylindrical geometry breaks the in-plane rotational symmetry of the membrane, there is a difference in flows along the axial and transverse directions of the cylinder. This in turn leads to anisotropic hydrodynamic interaction between the dipoles and is remarkably different from flat and spherical fluid membranes. In particular, the flow along the compact direction of the cylinder has a local rigid rotation term (independent of the angular coordinate but decays along the axis of the cylinder). Due to this feature of the flow, we observe that the interacting dipole pair initially situated along the axial direction exhibits an overall drift along the compact angular direction of the tubular fluid membrane. We find that the drift for the dipole pair increases linearly with time. Our results are relevant for non-equilibrium dynamics of motor proteins in tubular membranes arising in nature, as well as in-vitro experiments (25).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12061v1",
        "http://arxiv.org/pdf/2303.12061v2"
    ],
    "publication_venue": null,
    "doi": "10.1063/5.0151447"
}