{
    "arxiv_id": "2303.16682",
    "paper_title": "Improvement of variables interpretability in kernel PCA",
    "authors": [
        "Mitja Briscik",
        "Marie-Agnès Dillies",
        "Sébastien Déjean"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-08-22"
    ],
    "latest_version": 1,
    "categories": [
        "stat.AP"
    ],
    "abstract": "Kernel methods have been proven to be a powerful tool for the integration and analysis of highthroughput technologies generated data. Kernels offer a nonlinear version of any linear algorithm solely based on dot products. The kernelized version of Principal Component Analysis is a valid nonlinear alternative to tackle the nonlinearity of biological sample spaces. This paper proposes a novel methodology to obtain a data-driven feature importance based on the KPCA representation of the data. The proposed method, kernel PCA Interpretable Gradient (KPCA-IG), provides a datadriven feature importance that is computationally fast and based solely on linear algebra calculations. It has been compared with existing methods on three benchmark datasets. The accuracy obtained using KPCA-IG selected features is equal to or greater than the other methods' average. Also, the computational complexity required demonstrates the high efficiency of the method. An exhaustive literature search has been conducted on the selected genes from a publicly available Hepatocellular carcinoma dataset to validate the retained features from a biological point of view. The results once again remark on the appropriateness of the computed ranking. The black-box nature of kernel PCA needs new methods to interpret the original features. Our proposed methodology KPCA-IG proved to be a valid alternative to select influential variables in high-dimensional high-throughput datasets, potentially unravelling new biological and medical biomarkers.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16682v1"
    ],
    "publication_venue": null,
    "doi": "10.1186/s12859-023-05404-y"
}