{
    "arxiv_id": "2303.16112",
    "paper_title": "Cellular EXchange Imaging (CEXI): Evaluation of a diffusion model including water exchange in cells using numerical phantoms of permeable spheres",
    "authors": [
        "Rémy Gardier",
        "Juan Luis Villarreal Haro",
        "Erick J. Canales-Rodriguez",
        "Ileana O. Jelescu",
        "Gabriel Girard",
        "Jonathan Rafael-Patino",
        "Jean-Philippe Thiran"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-04-13"
    ],
    "latest_version": 2,
    "categories": [
        "eess.SP",
        "physics.med-ph"
    ],
    "abstract": "Purpose: Biophysical models of diffusion MRI have been developed to characterize microstructure in various tissues, but existing models are not suitable for tissue composed of permeable spherical cells. In this study we introduce Cellular Exchange Imaging (CEXI), a model tailored for permeable spherical cells, and compares its performance to a related Ball \\& Sphere (BS) model that neglects permeability. Methods: We generated DW-MRI signals using Monte-Carlo simulations with a PGSE sequence in numerical substrates made of spherical cells and their extracellular space for a range of membrane permeability. From these signals, the properties of the substrates were inferred using both BS and CEXI models. Results: CEXI outperformed the impermeable model by providing more stable estimates cell size and intracellular volume fraction that were diffusion time-independent. Notably, CEXI accurately estimated the exchange time for low to moderate permeability levels previously reported in other studies ($κ<25μm/s$). However, in highly permeable substrates ($κ=50μm/s$), the estimated parameters were less stable, particularly the diffusion coefficients. Conclusion: This study highlights the importance of modeling the exchange time to accurately quantify microstructure properties in permeable cellular substrates. Future studies should evaluate CEXI in clinical applications such as lymph nodes, investigate exchange time as a potential biomarker of tumor severity, and develop more appropriate tissue models that account for anisotropic diffusion and highly permeable membranes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16112v1",
        "http://arxiv.org/pdf/2303.16112v2"
    ],
    "publication_venue": "7 figures, 2 tables, 21 pages, under review"
}