{
    "arxiv_id": "2303.17597",
    "paper_title": "Robo3D: Towards Robust and Reliable 3D Perception against Corruptions",
    "authors": [
        "Lingdong Kong",
        "Youquan Liu",
        "Xin Li",
        "Runnan Chen",
        "Wenwei Zhang",
        "Jiawei Ren",
        "Liang Pan",
        "Kai Chen",
        "Ziwei Liu"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-14"
    ],
    "latest_version": 3,
    "categories": [
        "cs.CV",
        "cs.RO"
    ],
    "abstract": "The robustness of 3D perception systems under natural corruptions from environments and sensors is pivotal for safety-critical applications. Existing large-scale 3D perception datasets often contain data that are meticulously cleaned. Such configurations, however, cannot reflect the reliability of perception models during the deployment stage. In this work, we present Robo3D, the first comprehensive benchmark heading toward probing the robustness of 3D detectors and segmentors under out-of-distribution scenarios against natural corruptions that occur in real-world environments. Specifically, we consider eight corruption types stemming from adversarial weather conditions, external disturbances, and internal sensor failure. We uncover that, although promising results have been progressively achieved on standard benchmarks, state-of-the-art 3D perception models are at risk of being vulnerable to corruptions. We draw key observations on the use of data representations, augmentation schemes, and training strategies, that could severely affect the model's performance. To pursue better robustness, we propose a density-insensitive training framework along with a simple flexible voxelization strategy to enhance the model resiliency. We hope our benchmark and approach could inspire future research in designing more robust and reliable 3D perception models. Our robustness benchmark suite is publicly available.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17597v1",
        "http://arxiv.org/pdf/2303.17597v2",
        "http://arxiv.org/pdf/2303.17597v3"
    ],
    "publication_venue": "Preprint; 33 pages, 26 figures, 26 tables; Code at https://github.com/ldkong1205/Robo3D"
}