{
    "arxiv_id": "2303.17797",
    "paper_title": "Generalized and multi-oscillation solitons in the Nonlinear Schrödinger Equation with quartic dispersion",
    "authors": [
        "Ravindra Bandara",
        "Andrus Giraldo",
        "Neil G. R. Broderick",
        "Bernd Krauskopf"
    ],
    "submission_date": "2023-03-31",
    "revised_dates": [
        "2023-08-09"
    ],
    "latest_version": 1,
    "categories": [
        "nlin.PS",
        "math.DS"
    ],
    "abstract": "We study different types of solitons of a generalized nonlinear Schrödinger equation (GNLSE) that models optical pulses traveling down an optical waveguide with quadratic as well as quartic dispersion. A traveling-wave ansatz transforms this partial differential equation into a fourth-order nonlinear ordinary differential equation (ODE) that is Hamiltonian and has two reversible symmetries. Homoclinic orbits of the ODE that connect the origin to itself represent solitons of the GNLSE, and this allows us to study the existence and organization of solitons with advanced numerical tools for the detection and continuation of connecting orbits. In this way, we establish the existence of connections from one periodic orbit to another, called PtoP connections. They give rise to families of homoclinic orbits to either of the two periodic orbits; in the GNLSE they correspond to generalized solitons with oscillating tails whose amplitude does not decay but reaches a nonzero limit. Moreover, PtoP connections can be found in the energy level of the origin, where connections between this equilibrium and a given periodic orbit, called EtoP connections, are known to organize families of solitons. As we show here, EtoP and PtoP cycles can be assembled into different types of heteroclinic cycles that give rise to additional families of homoclinic orbits to the origin. In the GNLSE, these correspond to multi-oscillation solitons that feature several episodes of different oscillations in between their decaying tails. As for solitons organized by EtoP connections only, multi-oscillation solitons are shown to be an integral part of the phenomenon of truncated homoclinic snaking.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17797v1"
    ],
    "publication_venue": "25 Pages, 13 figures",
    "doi": "10.1063/5.0152562"
}