{
    "arxiv_id": "2303.09762",
    "paper_title": "Aemulus $ν$: Precise Predictions for Matter and Biased Tracer Power Spectra in the Presence of Neutrinos",
    "authors": [
        "Joseph DeRose",
        "Nickolas Kokron",
        "Arka Banerjee",
        "Shi-Fan Chen",
        "Martin White",
        "Risa Wechlser",
        "Kate Storey-Fisher",
        "Jeremy Tinker",
        "Zhongxu Zhai"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "We present the Aemulus $ν$ simulations: a suite of 150 $(1.05 h^{-1}\\rm Gpc)^3$ $N$-body simulations with a mass resolution of $3.51\\times 10^{10} \\frac{Ω_{cb}}{0.3} ~ h^{-1} M_{\\odot}$ in a $wν$CDM cosmological parameter space. The simulations have been explicitly designed to span a broad range in $σ_8$ to facilitate investigations of tension between large scale structure and cosmic microwave background cosmological probes. Neutrinos are treated as a second particle species to ensure accuracy to $0.5\\, \\rm eV$, the maximum neutrino mass that we have simulated. By employing Zel'dovich control variates, we increase the effective volume of our simulations by factors of $10-10^5$ depending on the statistic in question. As a first application of these simulations, we build new hybrid effective field theory and matter power spectrum surrogate models, demonstrating that they achieve $\\le 1\\%$ accuracy for $k\\le 1\\, h\\,\\rm Mpc^{-1}$ and $0\\le z \\le 3$, and $\\le 2\\%$ accuracy for $k\\le 4\\, h\\,\\rm Mpc^{-1}$ for the matter power spectrum. We publicly release the trained surrogate models, and estimates of the surrogate model errors in the hope that they will be broadly applicable to a range of cosmological analyses for many years to come.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09762v1"
    ],
    "publication_venue": "35 pages, 14 figures, to be submitted to JCAP"
}