{
    "arxiv_id": "2303.10193",
    "paper_title": "Ground state and spectral properties of the doped one-dimensional optical Hubbard-Su-Schrieffer-Heeger model",
    "authors": [
        "Debshikha Banerjee",
        "Jinu Thomas",
        "Alberto Nocera",
        "Steven Johnston"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el"
    ],
    "abstract": "We present a density matrix renormalization group (DMRG) study of the doped one-dimensional (1D) Hubbard-Su-Schrieffer-Hegger (Hubbard-SSH) model, where the atomic displacements linearly modulate the nearest-neighbor hopping integrals. Focusing on an optical variant of the model in the strongly correlated limit relevant for cuprate spin chains, we examine how the SSH interaction modifies the model's ground and excited state properties. The SSH coupling weakly renormalizes the model's single- and two-particle response functions for electron-phonon ($e$-ph) coupling strengths below a parameter-dependent critical value $g_\\mathrm{c}$. For larger $e$-ph coupling, the sign of the effective hopping integrals changes for a subset of orbitals, which drives a lattice dimerization distinct from the standard nesting-driven picture in 1D. The spectral weight of the one- and two-particle dynamical response functions are dramatically rearranged across this transition, with significant changes in the ground state correlations. We argue that this dimerization results from the breakdown of the linear approximation for the $e$-ph coupling and thus signals a fundamental limitation of the linear SSH interaction. Our results have consequences for our understanding of how SSH-like interactions can enter the physics of strongly correlated quantum materials, including the recently synthesized doped cuprate spin chains.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10193v1"
    ],
    "publication_venue": "Comments Welcome",
    "doi": "10.1103/PhysRevB.107.235113"
}