{
    "arxiv_id": "2303.09876",
    "paper_title": "Cosmology inference at the field level from biased tracers in redshift-space",
    "authors": [
        "Julia Stadler",
        "Fabian Schmidt",
        "Martin Reinecke"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "Cosmology inference of galaxy clustering at the field level with the EFT likelihood in principle allows for extracting all non-Gaussian information from quasi-linear scales, while robustly marginalizing over any astrophysical uncertainties. A pipeline in this spirit is implemented in the \\texttt{LEFTfield} code, which we extend in this work to describe the clustering of galaxies in redshift space. Our main additions are: the computation of the velocity field in the LPT gravity model, the fully nonlinear displacement of the evolved, biased density field to redshift space, and a systematic expansion of velocity bias. We test the resulting analysis pipeline by applying it to synthetic data sets with a known ground truth at increasing complexity: mock data generated from the perturbative forward model itself, sub-sampled matter particles, and dark matter halos in N-body simulations. By fixing the initial-time density contrast to the ground truth, while varying the growth rate $f$, bias coefficients and noise amplitudes, we perform a stringent set of checks. These show that indeed a systematic higher-order expansion of the velocity bias is required to infer a growth rate consistent with the ground truth within errors. Applied to dark matter halos, our analysis yields unbiased constraints on $f$ at the level of a few percent for a variety of halo masses at redshifts $z=0,\\,0.5,\\,1$ and for a broad range of cutoff scales $0.08\\,h/\\mathrm{Mpc} \\leq Λ\\leq 0.20\\,h/\\mathrm{Mpc}$. Importantly, deviations between true and inferred growth rate exhibit the scaling with halo mass, redshift and cutoff that one expects based on the EFT of Large Scale Structure. Further, we obtain a robust detection of velocity bias through its effect on the redshift-space density field and are able to disentangle it from higher-derivative bias contributions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09876v1"
    ],
    "publication_venue": null
}