{
    "arxiv_id": "2303.10672",
    "paper_title": "Going faster to see further: GPU-accelerated value iteration and simulation for perishable inventory control using JAX",
    "authors": [
        "Joseph Farrington",
        "Kezhi Li",
        "Wai Keong Wong",
        "Martin Utley"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2025-04-07"
    ],
    "latest_version": 1,
    "categories": [
        "cs.AI",
        "cs.DC"
    ],
    "abstract": "Value iteration can find the optimal replenishment policy for a perishable inventory problem, but is computationally demanding due to the large state spaces that are required to represent the age profile of stock. The parallel processing capabilities of modern GPUs can reduce the wall time required to run value iteration by updating many states simultaneously. The adoption of GPU-accelerated approaches has been limited in operational research relative to other fields like machine learning, in which new software frameworks have made GPU programming widely accessible. We used the Python library JAX to implement value iteration and simulators of the underlying Markov decision processes in a high-level API, and relied on this library's function transformations and compiler to efficiently utilize GPU hardware. Our method can extend use of value iteration to settings that were previously considered infeasible or impractical. We demonstrate this on example scenarios from three recent studies which include problems with over 16 million states and additional problem features, such as substitution between products, that increase computational complexity. We compare the performance of the optimal replenishment policies to heuristic policies, fitted using simulation optimization in JAX which allowed the parallel evaluation of multiple candidate policy parameters on thousands of simulated years. The heuristic policies gave a maximum optimality gap of 2.49%. Our general approach may be applicable to a wide range of problems in operational research that would benefit from large-scale parallel computation on consumer-grade GPU hardware.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10672v1"
    ],
    "publication_venue": null,
    "doi": "10.1007/s10479-025-06551-6"
}