{
    "arxiv_id": "2303.14250",
    "paper_title": "Anticorrosion properties of silica-based sol-gel coatings on steel -- the influence of hydrolysis and condensation conditions",
    "authors": [
        "Jolanta Gasiorek",
        "Anna Gasiorek",
        "Bartosz Babiarczuk",
        "Walis Jones",
        "Wojciech Simka",
        "Jerzy Detyna",
        "Jerzy Kaleta",
        "Justyna Krzak"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "In this paper, we present indirect methods to define the change in the rates of hydrolysis and condensation reactions of a silica oxide network formed of (3-glycidoxypropyl)methyltriethoxysilane (GPTMS) and (3-aminopropyl)triethoxysilane (ApTEOS), which was strongly dependent upon the nature of the solvent used in the reaction environment, such as methanol, ethanol, propanol, butanol and acetone. Electron microscopy (SEM), focused ion beam scanning electron microscopy (FIB), and Raman spectroscopy were used to investigate the morphology and structure changes. UV-VIS spectrometry, a wettability test, a scratch test and electrochemical tests, namely Tafel's polarization and electrochemical impedance spectroscopy (EIS), were used to analyze the functional changes in the obtained silica coatings. The coating synthesized in a methanol environment showed a polarization resistance (Rp) almost an order of magnitude greater than those synthesized in the other organic solvents. The greatest thickness, nearly 1.5 um, was obtained with the ethanol based coatings. Almost twice as much force (near 11 N) was required to detach the acetone based coatings, compared to the other coatings. Propanol and butanol contribute to the defects created and the decreased protection properties in the final materials and show a statistically significant influence on the formed corrosion film under sol-gel coatings, particularly for coatings based on propanol. No statistically significant influence of the solvents was observed on the thickness of coatings prepared with butanol or acetone.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14250v1"
    ],
    "publication_venue": "37 pages, 14 figures",
    "doi": "10.1016/j.ceramint.2022.08.291"
}