{
    "arxiv_id": "2303.12811",
    "paper_title": "SignCRF: Scalable Channel-agnostic Data-driven Radio Authentication System",
    "authors": [
        "Amani Al-shawabka",
        "Philip Pietraski",
        "Sudhir B Pattar",
        "Pedram Johari",
        "Tommaso Melodia"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CR",
        "cs.AI",
        "cs.LG",
        "cs.NI"
    ],
    "abstract": "Radio Frequency Fingerprinting through Deep Learning (RFFDL) is a data-driven IoT authentication technique that leverages the unique hardware-level manufacturing imperfections associated with a particular device to recognize (fingerprint) the device based on variations introduced in the transmitted waveform. The proposed SignCRF is a scalable, channel-agnostic, data-driven radio authentication platform with unmatched precision in fingerprinting wireless devices based on their unique manufacturing impairments and independent of the dynamic channel irregularities caused by mobility. SignCRF consists of (i) a baseline classifier finely trained to authenticate devices with high accuracy and at scale; (ii) an environment translator carefully designed and trained to remove the dynamic channel impact from RF signals while maintaining the radio's specific signature; (iii) a Max-Rule module that selects the highest precision authentication technique between the baseline classifier and the environment translator per radio. We design, train, and validate the performance of SignCRF for multiple technologies in dynamic environments and at scale (100 LoRa and 20 WiFi devices). We demonstrate that SignCRF significantly improves the RFFDL performance by achieving as high as 5x and 8x improvement in correct authentication of WiFi and LoRa devices when compared to the state-of-the-art, respectively.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12811v1"
    ],
    "publication_venue": "11 pages, 13 figures, 3 tables"
}