{
    "arxiv_id": "2303.08254",
    "paper_title": "MeROS: SysML-based Metamodel for ROS-based Systems",
    "authors": [
        "Tomasz Winiarski"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-06-02"
    ],
    "latest_version": 9,
    "categories": [
        "cs.RO",
        "cs.SE"
    ],
    "abstract": "The complexity of today's robot control systems implies difficulty in developing them efficiently and reliably. Systems engineering (SE) and frameworks come to help. The framework metamodels are needed to support the standardisation and correctness of the created application models. Although the use of frameworks is widespread nowadays, for the most popular of them, Robot Operating System (ROS), a contemporary metamodel has been missing so far. This article proposes a new metamodel for ROS called MeROS, which addresses the running system and developer workspace. The ROS comes in two versions: ROS 1 and ROS 2. The metamodel includes both versions. In particular, the latest ROS 1 concepts are considered, such as nodelet, action, and metapackage. An essential addition to the original ROS concepts is the grouping of these concepts, which provides an opportunity to illustrate the system's decomposition and varying degrees of detail in its presentation. The metamodel is derived from the requirements and verified on the practical example of Rico assistive robot. The matter is described in a standardised way in SysML (Systems Modeling Language). Hence, common development tools that support SysML can help develop robot controllers in the spirit of SE.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08254v1",
        "http://arxiv.org/pdf/2303.08254v2",
        "http://arxiv.org/pdf/2303.08254v3",
        "http://arxiv.org/pdf/2303.08254v4",
        "http://arxiv.org/pdf/2303.08254v5",
        "http://arxiv.org/pdf/2303.08254v6",
        "http://arxiv.org/pdf/2303.08254v7",
        "http://arxiv.org/pdf/2303.08254v8",
        "http://arxiv.org/pdf/2303.08254v9"
    ],
    "publication_venue": null
}