{
    "arxiv_id": "2303.12206",
    "paper_title": "Policy Optimization for Personalized Interventions in Behavioral Health",
    "authors": [
        "Jackie Baek",
        "Justin J. Boutilier",
        "Vivek F. Farias",
        "Jonas Oddur Jonasson",
        "Erez Yoeli"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-10-03"
    ],
    "latest_version": 2,
    "categories": [
        "cs.LG",
        "cs.AI"
    ],
    "abstract": "Behavioral health interventions, delivered through digital platforms, have the potential to significantly improve health outcomes, through education, motivation, reminders, and outreach. We study the problem of optimizing personalized interventions for patients to maximize a long-term outcome, where interventions are costly and capacity-constrained. We assume there exists a dataset collected from an initial pilot study that we can leverage. We present a new approach for this problem that we dub DecompPI, which approximates one step of policy iteration. Implementing DecompPI simply consists of a prediction task using the dataset, alleviating the need for online experimentation. DecompPI is a generic model-free algorithm that can be used irrespective of the underlying patient behavior model. We derive theoretical guarantees on a simple, special case of the model that is representative of our problem setting. We establish an approximation ratio for DecompPI with respect to the improvement beyond a null policy that does not allocate interventions. Specifically, when the initial policy used to collect the data is randomized, the approximation ratio of the improvement approaches 1/2 as the intervention capacity of the initial policy decreases. We show that this guarantee is robust to estimation errors. We conduct a rigorous empirical case study using real-world data from a mobile health platform for improving treatment adherence for tuberculosis. Using a validated simulation model, we demonstrate that DecompPI can provide the same efficacy as the status quo approach with approximately half the capacity of interventions. DecompPI is simple and easy to implement for organizations aiming to improve long-term behavior through targeted interventions, and this paper demonstrates its strong performance both theoretically and empirically.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12206v1",
        "http://arxiv.org/pdf/2303.12206v2"
    ],
    "publication_venue": null
}