{
    "arxiv_id": "2303.09236",
    "paper_title": "GIRT-Data: Sampling GitHub Issue Report Templates",
    "authors": [
        "Nafiseh Nikeghbal",
        "Amir Hossein Kargaran",
        "Abbas Heydarnoori",
        "Hinrich Schütze"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "cs.SE"
    ],
    "abstract": "GitHub's issue reports provide developers with valuable information that is essential to the evolution of a software development project. Contributors can use these reports to perform software engineering tasks like submitting bugs, requesting features, and collaborating on ideas. In the initial versions of issue reports, there was no standard way of using them. As a result, the quality of issue reports varied widely. To improve the quality of issue reports, GitHub introduced issue report templates (IRTs), which pre-fill issue descriptions when a new issue is opened. An IRT usually contains greeting contributors, describing project guidelines, and collecting relevant information. However, despite of effectiveness of this feature which was introduced in 2016, only nearly 5% of GitHub repositories (with more than 10 stars) utilize it. There are currently few articles on IRTs, and the available ones only consider a small number of repositories. In this work, we introduce GIRT-Data, the first and largest dataset of IRTs in both YAML and Markdown format. This dataset and its corresponding open-source crawler tool are intended to support research in this area and to encourage more developers to use IRTs in their repositories. The stable version of the dataset contains 1,084,300 repositories and 50,032 of them support IRTs. The stable version of the dataset and crawler is available here: https://github.com/kargaranamir/girt-data",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09236v1"
    ],
    "publication_venue": "Accepted to be published at the 20th IEEE/ACM International Conference on Mining Software Repositories (MSR 2023)"
}