{
    "arxiv_id": "2303.16804",
    "paper_title": "Information in feedback ratchets",
    "authors": [
        "Natalia Ruiz-Pino",
        "Daniel Villarubia-Moreno",
        "Antonio Prados",
        "Francisco J. Cao-García"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-10-12"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.stat-mech",
        "math-ph",
        "nlin.AO"
    ],
    "abstract": "Feedback control uses the state information of the system to actuate on it. The information used implies an effective entropy reduction of the controlled system, potentially increasing its performance. How to compute this entropy reduction has been formally shown for a general system, and has been explicitly computed for spatially discrete systems. Here, we address a relevant example of how to compute the entropy reduction by information in a spatially continuous feedback-controlled system. Specifically, we consider a feedback flashing ratchet, which constitutes a paradigmatic example for the role of information and feedback in the dynamics and thermodynamics of transport induced by the rectification of Brownian motion. A Brownian particle moves in a periodic potential that is switched on and off by a controller, with the latter performing the switching depending on the system state. We show how the entropy reduction can be computed from the entropy of a sequence of control actions, and also discuss the required sampling effort for its accurate computation. Moreover, the output power developed by the particle against an external force is investigated, which -- for some values of the system parameters -- is shown to become larger than the input power due to the switching of the potential: the apparent efficiency of the ratchet thus becomes higher than one, if the entropy reduction contribution is not considered. This result highlights the relevance of including the entropy reduction by information in the thermodynamic balance of feedback controlled devices, specifically when writing the second principle: the inclusion of the entropy reduction by information leads to a well-behaved efficiency over all the range of parameters investigated.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16804v1"
    ],
    "publication_venue": "17 pages, 13 figures",
    "doi": "10.1103/PhysRevE.108.034112"
}