{
    "arxiv_id": "2303.08095",
    "paper_title": "Cosmoglobe DR1 results. I. Improved Wilkinson Microwave Anisotropy Probe maps through Bayesian end-to-end analysis",
    "authors": [
        "D. J. Watts",
        "A. Basyrov",
        "J. R. Eskilt",
        "M. Galloway",
        "L. T. Hergt",
        "D. Herman",
        "H. T. Ihle",
        "S. Paradiso",
        "F. Rahman",
        "H. Thommesen",
        "R. Aurlien",
        "M. Bersanelli",
        "L. A. Bianchi",
        "M. Brilenkov",
        "L. P. L. Colombo",
        "H. K. Eriksen",
        "C. Franceschet",
        "U. Fuskeland",
        "E. Gjerløw",
        "B. Hensley",
        "G. A. Hoerning",
        "K. Lee",
        "J. G. S. Lunde",
        "A. Marins",
        "S. K. Nerval",
        "S. K. Patel",
        "M. Regnier",
        "M. San",
        "S. Sanyal",
        "N. -O. Stutzer",
        "A. Verma",
        "I. K. Wehus",
        "Y. Zhou"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-11-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "We present Cosmoglobe Data Release 1, which implements the first joint analysis of WMAP and Planck LFI time-ordered data, processed within a single Bayesian end-to-end framework. This framework builds directly on a similar analysis of the LFI measurements by the BeyondPlanck collaboration, and approaches the CMB analysis challenge through Gibbs sampling of a global posterior distribution, simultaneously accounting for calibration, mapmaking, and component separation. The computational cost of producing one complete WMAP+LFI Gibbs sample is 812 CPU-hr, of which 603 CPU-hrs are spent on WMAP low-level processing; this demonstrates that end-to-end Bayesian analysis of the WMAP data is computationally feasible. We find that our WMAP posterior mean temperature sky maps and CMB temperature power spectrum are largely consistent with the official WMAP9 results. Perhaps the most notable difference is that our CMB dipole amplitude is $3366.2 \\pm 1.4\\ \\mathrm{μK}$, which is $11\\ \\mathrm{μK}$ higher than the WMAP9 estimate and $2.5\\ σ$ higher than BeyondPlanck; however, it is in perfect agreement with the HFI-dominated Planck PR4 result. In contrast, our WMAP polarization maps differ more notably from the WMAP9 results, and in general exhibit significantly lower large-scale residuals. We attribute this to a better constrained gain and transmission imbalance model. It is particularly noteworthy that the W-band polarization sky map, which was excluded from the official WMAP cosmological analysis, for the first time appears visually consistent with the V-band sky map. Similarly, the long standing discrepancy between the WMAP K-band and LFI 30 GHz maps is finally resolved, and the difference between the two maps appears consistent with instrumental noise at high Galactic latitudes. All maps and the associated code are made publicly available through the Cosmoglobe web page.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08095v1"
    ],
    "publication_venue": "65 pages, 61 figures. Data available at cosmoglobe.uio.no. Submitted to A&A",
    "doi": "10.1051/0004-6361/202346414"
}