{
    "arxiv_id": "2303.12505",
    "paper_title": "Collective vs. individual behaviour for sums of i.i.d. random variables: appearance of the one-big-jump phenomenon",
    "authors": [
        "Quentin Berger",
        "Matthias Birkner",
        "Linglong Yuan"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "math.PR"
    ],
    "abstract": "This article studies large and local large deviations for sums of i.i.d. real-valued random variables in the domain of attraction of an $α$-stable law, $α\\in (0,2]$, with emphasis on the case $α=2$. There are two different scenarios: either the deviation is realised via a collective behaviour with all summands contributing to the deviation (a Gaussian scenario), or a single summand is atypically large and contributes to the deviation (a one-big-jump scenario). Such results are known when $α\\in (0,2)$ (large deviations always follow a one big-jump scenario) or when the random variables admit a moment of order $2+δ$ for some $δ>0$. We extend these results, including in particular the case where the right tail is regularly varying with index $-2$ (treating cases with infinite variance in the domain of attraction of the normal law). We identify the threshold for the transition between the Gaussian and the one-big-jump regimes; it is slightly larger when considering local large deviations compared to integral large deviations. Additionally, we complement our results by describing the behaviour of the sum and of the largest summand conditionally on a (local) large deviation, for any $α\\in (0,2]$, both in the Gaussian and in the one-big-jump regimes. As an application, we show how our results can be used in the study of condensation phenomenon in the zero-range process at the critical density, extending the range of parameters previously considered in the literature.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12505v1"
    ],
    "publication_venue": "54 pages"
}