{
    "arxiv_id": "2303.10175",
    "paper_title": "Measuring galaxy cluster mass profiles into low acceleration regions with galaxy kinematics",
    "authors": [
        "Pengfei Li",
        "Yong Tian",
        "Mariana P. Júlio",
        "Marcel S. Pawlowski",
        "Federico Lelli",
        "Stacy S. McGaugh",
        "James M. Schombert",
        "Justin I. Read",
        "Po-Chieh Yu",
        "Chung-Ming Ko"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
    ],
    "abstract": "We probe the outer dynamical mass profile of 16 galaxy clusters from the HIghest X-ray FLUx Galaxy Cluster Sample (HIFLUGCS) using galaxy kinematics. Numerically solving the spherical Jeans equation, we parameterize the dynamical mass profile and the galaxy velocity anisotropy profile using two general functions to ensure that our results are not biased towards any specific model. The mass-velocity anisotropy degeneracy is broken by using two \"virial shape parameters\" that depend on the fourth moment of velocity distribution. The resulting velocity anisotropy estimates consistently show a nearly isotropic distribution in the inner regions, with an increasing radial anisotropy towards large radii. We compare our derived dynamical masses with those calculated from X-ray gas data assuming hydrostatic equilibrium, finding that massive and rich relaxed clusters generally present consistent mass measurements, while unrelaxed or low-richness clusters have systematically larger total mass than hydrostatic mass by an average of 50\\%. This might help alleviate current tensions in the measurement of $σ_8$, but it also leads to cluster baryon fractions below the cosmic value. Finally, our approach probes accelerations as low as $10^{-11}$ m s$^{-2}$, comparable to the outskirts of individual late-type galaxies. We confirm that galaxy clusters deviate from the radial acceleration relation defined by galaxies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10175v1"
    ],
    "publication_venue": "13 pages, 8 figures, 1 table. Submitted to A&A"
}