{
    "arxiv_id": "2303.13234",
    "paper_title": "Global quantum discord and von Neumann entropy in multipartite two-level atomic systems",
    "authors": [
        "M. Ibrahim",
        "M. Usman",
        "Khalid Khan"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "We have computed the global quantum discord and von Neumann entropy of multipartite two-level atomic systems interacting with a single-mode Fock field. We use Tavis-Cumming model. We have explored how quantum correlations and quantum entanglement evolve with time in such systems. The quantum system is prepared initially in a mixed state and different parameters are varied to see how they affect the information processing in the system. The dynamical character of the global quantum discord and von Neumann entropy show an interplay between classical and non-classical correlations. Photons in this model play an important role to assist the global quantum discord and von Neumann entropy and we observed that the effects of the field on the global quantum discord and von Neumann entropy reside in the time evolution of the system indicating that both atom and field states have become entangled. The global quantum discord is assisted in a non-linear fashion with the number of photons in the system. The global quantum discord and von Neumann entropy show linear behavior with each other in the dynamics of the system. The effects of intrinsic decoherence on the dynamics of the global quantum discord and von Neumann entropy are also studied. We have extrapolated the results for a large photon number on the system. We have studied the effect of the change in the size of the system on the maximum value of global quantum discord and von Neumann entropy and we have estimated the scaling coefficients for this behavior.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13234v1"
    ],
    "publication_venue": null,
    "doi": "10.1142/S0219749923500065"
}