{
    "arxiv_id": "2303.16410",
    "paper_title": "Global Consistency of Empirical Likelihood",
    "authors": [
        "Haodi Liang",
        "Jiahua Chen"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "math.ST"
    ],
    "abstract": "This paper develops several interesting, significant, and interconnected approaches to nonparametric or semi-parametric statistical inferences. The overwhelmingly favoured maximum likelihood estimator (MLE) under parametric model is renowned for its strong consistency and optimality generally credited to Cramer. These properties, however, falter when the model is not regular or not completely accurate. In addition, their applicability is limited to local maxima close to the unknown true parameter value. One must therefore ascertain that the global maximum of the likelihood is strongly consistent under generic conditions (Wald, 1949). Global consistency is also a vital research problem in the context of empirical likelihood (Owen, 2001). The EL is a ground-breaking platform for nonparametric statistical inference. A subsequent milestone is achieved by placing estimating functions under the EL umbrella (Qin and Lawless, 1994). The resulting profile EL function possesses many nice properties of parametric likelihood but also shares the same shortcomings. These properties cannot be utilized unless we know the local maximum at hand is close to the unknown true parameter value. To overcome this obstacle, we first put forward a clean set of conditions under which the global maximum is consistent. We then develop a global maximum test to ascertain if the local maximum at hand is in fact a global maximum. Furthermore, we invent a global maximum remedy to ensure global consistency by expanding the set of estimating functions under EL. Our simulation experiments on many examples from the literature firmly establish that the proposed approaches work as predicted. Our approaches also provide superior solutions to problems of their parametric counterparts investigated by DeHaan (1981), Veall (1991), and Gan and Jiang (1999).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16410v1"
    ],
    "publication_venue": null
}