{
    "arxiv_id": "2303.11777",
    "paper_title": "Quasi Maximum Likelihood Estimation of High-Dimensional Factor Models: A Critical Review",
    "authors": [
        "Matteo Barigozzi"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-12-29"
    ],
    "latest_version": 4,
    "categories": [
        "econ.EM",
        "math.ST"
    ],
    "abstract": "We review Quasi Maximum Likelihood estimation of factor models for high-dimensional panels of time series. We consider two cases: (1) estimation when no dynamic model for the factors is specified \\citep{baili12,baili16}; (2) estimation based on the Kalman smoother and the Expectation Maximization algorithm thus allowing to model explicitly the factor dynamics \\citep{DGRqml,BLqml}. Our interest is in approximate factor models, i.e., when we allow for the idiosyncratic components to be mildly cross-sectionally, as well as serially, correlated. Although such setting apparently makes estimation harder, we show, in fact, that factor models do not suffer of the {\\it curse of dimensionality} problem, but instead they enjoy a {\\it blessing of dimensionality} property. In particular, given an approximate factor structure, if the cross-sectional dimension of the data, $N$, grows to infinity, we show that: (i) identification of the model is still possible, (ii) the mis-specification error due to the use of an exact factor model log-likelihood vanishes. Moreover, if we let also the sample size, $T$, grow to infinity, we can also consistently estimate all parameters of the model and make inference. The same is true for estimation of the latent factors which can be carried out by weighted least-squares, linear projection, or Kalman filtering/smoothing. We also compare the approaches presented with: Principal Component analysis and the classical, fixed $N$, exact Maximum Likelihood approach. We conclude with a discussion on efficiency of the considered estimators.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11777v1",
        "http://arxiv.org/pdf/2303.11777v2",
        "http://arxiv.org/pdf/2303.11777v3",
        "http://arxiv.org/pdf/2303.11777v4"
    ],
    "publication_venue": null
}