{
    "arxiv_id": "2303.10935",
    "paper_title": "On the exact quantum query complexity of $\\text{MOD}_m^n$ and $\\text{EXACT}_{k,l}^n$",
    "authors": [
        "Zekun Ye"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-05-15"
    ],
    "latest_version": 4,
    "categories": [
        "quant-ph",
        "cs.CC"
    ],
    "abstract": "The query model has generated considerable interest in both classical and quantum computing communities. Typically, quantum advantages are demonstrated by showcasing a quantum algorithm with a better query complexity compared to its classical counterpart. Exact quantum query algorithms play a pivotal role in developing quantum algorithms. For example, the Deutsch-Jozsa algorithm demonstrated exponential quantum advantages over classical deterministic algorithms. As an important complexity measure, exact quantum query complexity describes the minimum number of queries required to solve a specific problem exactly using a quantum algorithm.\n  In this paper, we consider the exact quantum query complexity of the following two $n$-bit symmetric functions $\\text{MOD}_m^n:\\{0,1\\}^n \\rightarrow \\{0,...,m-1\\}$ and $\\text{EXACT}_{k,l}^n:\\{0,1\\}^n \\rightarrow \\{0,1\\}$, which are defined as $\\text{MOD}_m^n(x) = |x| \\bmod m$ and $ \\text{EXACT}_{k,l}^n(x) = 1$ iff $|x| \\in \\{k,l\\}$, where $|x|$ is the number of $1$'s in $x$. Our results are as follows: i) We present an optimal quantum algorithm for computing $\\text{MOD}_m^n$, achieving a query complexity of $\\lceil n(1-\\frac{1}{m}) \\rceil$ for $1 < m \\le n$. This settles a conjecture proposed by Cornelissen, Mande, Ozols and de Wolf (2021). Based on this algorithm, we show the exact quantum query complexity of a broad class of symmetric functions that map $\\{0,1\\}^n$ to a finite set $X$ is less than $n$. ii) When $l-k \\ge 2$, we give an optimal exact quantum query algorithm to compute $\\text{EXACT}_{k,l}^n$ for the case $k=0$ or $k=1,l=n-1$. This resolves the conjecture proposed by Ambainis, Iraids and Nagaj (2017) partially.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10935v1",
        "http://arxiv.org/pdf/2303.10935v2",
        "http://arxiv.org/pdf/2303.10935v3",
        "http://arxiv.org/pdf/2303.10935v4"
    ],
    "publication_venue": null
}