{
    "arxiv_id": "2303.12040",
    "paper_title": "Roots and Requirements for Collaborative AIs",
    "authors": [
        "Mark Stefik"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-12-29"
    ],
    "latest_version": 6,
    "categories": [
        "cs.AI"
    ],
    "abstract": "The vision of AI collaborators is a staple of mythology and science fiction, where artificial agents with special talents assist human partners and teams. In this dream, sophisticated AIs understand nuances of collaboration and human communication. The AI as collaborator dream is different from computer tools that augment human intelligence (IA) or intermediate human collaboration. Such tools have their roots in the 1960s and helped to drive an information technology revolution. They can be useful but they are not intelligent and do not collaborate as effectively as skilled people. With the increase of hybrid and remote work since the COVID pandemic, the benefits and requirements for better coordination, collaboration, and communication are becoming a hot topic in the workplace. Employers and workers face choices and trade-offs as they negotiate the options for working from home versus working at the office. Many factors such as the high costs of homes near employers are impeding a mass return to the office. Government advisory groups and leaders in AI have advocated for years that AIs should be transparent and effective collaborators. Nonetheless, robust AIs that collaborate like talented people remain out of reach. Are AI teammates part of a solution? How artificially intelligent (AI) could and should they be? This position paper reviews the arc of technology and public calls for human-machine teaming. It draws on earlier research in psychology and the social sciences about what human-like collaboration requires. This paper sets a context for a second science-driven paper that advocates a radical shift in technology and methodology for creating resilient, intelligent, and human-compatible AIs (Stefik & Price, 2023). The aspirational goal is that such AIs would learn, share what they learn, and collaborate to achieve high capabilities.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12040v1",
        "http://arxiv.org/pdf/2303.12040v2",
        "http://arxiv.org/pdf/2303.12040v3",
        "http://arxiv.org/pdf/2303.12040v4",
        "http://arxiv.org/pdf/2303.12040v5",
        "http://arxiv.org/pdf/2303.12040v6"
    ],
    "publication_venue": "24 pages, 2 figures"
}