{
    "arxiv_id": "2303.08979",
    "paper_title": "An Approximate Bayesian Approach to Covariate-dependent Graphical Modeling",
    "authors": [
        "Sutanoy Dasgupta",
        "Peng Zhao",
        "Jacob Helwig",
        "Prasenjit Ghosh",
        "Debdeep Pati",
        "Bani K. Mallick"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "stat.ME",
        "stat.CO"
    ],
    "abstract": "Gaussian graphical models typically assume a homogeneous structure across all subjects, which is often restrictive in applications. In this article, we propose a weighted pseudo-likelihood approach for graphical modeling which allows different subjects to have different graphical structures depending on extraneous covariates. The pseudo-likelihood approach replaces the joint distribution by a product of the conditional distributions of each variable. We cast the conditional distribution as a heteroscedastic regression problem, with covariate-dependent variance terms, to enable information borrowing directly from the data instead of a hierarchical framework. This allows independent graphical modeling for each subject, while retaining the benefits of a hierarchical Bayes model and being computationally tractable. An efficient embarrassingly parallel variational algorithm is developed to approximate the posterior and obtain estimates of the graphs. Using a fractional variational framework, we derive asymptotic risk bounds for the estimate in terms of a novel variant of the $α$-Rényi divergence. We theoretically demonstrate the advantages of information borrowing across covariates over independent modeling. We show the practical advantages of the approach through simulation studies and illustrate the dependence structure in protein expression levels on breast cancer patients using CNV information as covariates.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08979v1"
    ],
    "publication_venue": null
}