{
    "arxiv_id": "2303.11889",
    "paper_title": "Resource Allocation for Cell-Free Massive MIMO-aided URLLC Systems Relying on Pilot Sharing",
    "authors": [
        "Qihao Peng",
        "Hong Ren",
        "Mianxiong Dong",
        "Maged Elkashlan",
        "Kai-Kit Wong",
        "Lajos Hanzo"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SP"
    ],
    "abstract": "Resource allocation is conceived for cell-free (CF) massive multi-input multi-output (MIMO)-aided ultra-reliable and low latency communication (URLLC) systems. Specifically, to support multiple devices with limited pilot overhead, pilot reuse among the users is considered, where we formulate a joint pilot length and pilot allocation strategy for maximizing the number of devices admitted. Then, the pilot power and transmit power are jointly optimized while simultaneously satisfying the devices' decoding error probability, latency, and data rate requirements. Firstly, we derive the lower bounds (LBs) of ergodic data rate under finite channel blocklength (FCBL). Then, we propose a novel pilot assignment algorithm for maximizing the number of devices admitted. Based on the pilot allocation pattern advocated, the weighted sum rate (WSR) is maximized by jointly optimizing the pilot power and payload power. To tackle the resultant NP-hard problem, the original optimization problem is first simplified by sophisticated mathematical transformations, and then approximations are found for transforming the original problems into a series of subproblems in geometric programming (GP) forms that can be readily solved. Simulation results demonstrate that the proposed pilot allocation strategy is capable of significantly increasing the number of admitted devices and the proposed power allocation achieves substantial WSR performance gain.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11889v1"
    ],
    "publication_venue": "Accepted by IEEE JASC-xURLLC6G-23 special issue"
}