{
    "arxiv_id": "2303.08078",
    "paper_title": "Realizing spin squeezing with Rydberg interactions in a programmable optical clock",
    "authors": [
        "William J. Eckner",
        "Nelson Darkwah Oppong",
        "Alec Cao",
        "Aaron W. Young",
        "William R. Milner",
        "John M. Robinson",
        "Jun Ye",
        "Adam M. Kaufman"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "cond-mat.quant-gas",
        "physics.atom-ph"
    ],
    "abstract": "Neutral-atom arrays trapped in optical potentials are a powerful platform for studying quantum physics, combining precise single-particle control and detection with a range of tunable entangling interactions. For example, these capabilities have been leveraged for state-of-the-art frequency metrology as well as microscopic studies of entangled many-particle states. In this work, we combine these applications to realize spin squeezing - a widely studied operation for producing metrologically useful entanglement - in an optical atomic clock based on a programmable array of interacting optical qubits. In this first demonstration of Rydberg-mediated squeezing with a neutral-atom optical clock, we generate states that have almost 4 dB of metrological gain. Additionally, we perform a synchronous frequency comparison between independent squeezed states and observe a fractional frequency stability of $1.087(1)\\times 10^{-15}$ at one-second averaging time, which is 1.94(1) dB below the standard quantum limit, and reaches a fractional precision at the $10^{-17}$ level during a half-hour measurement. We further leverage the programmable control afforded by optical tweezer arrays to apply local phase shifts in order to explore spin squeezing in measurements that operate beyond the relative coherence time with the optical local oscillator. The realization of this spin-squeezing protocol in a programmable atom-array clock opens the door to a wide range of quantum-information inspired techniques for optimal phase estimation and Heisenberg-limited optical atomic clocks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08078v1"
    ],
    "publication_venue": "13 pages, 4 figures; Supplementary Information"
}