{
    "arxiv_id": "2303.12165",
    "paper_title": "X-Shooting ULLYSES: Massive stars at low metallicity. III. Terminal wind speeds of ULLYSES massive stars",
    "authors": [
        "C. Hawcroft",
        "H. Sana",
        "L. Mahy",
        "J. O. Sundqvist",
        "A. de Koter",
        "P. Crowther",
        "J. Bestenlehner",
        "S. Brands",
        "A. David-Uraz",
        "L. Decin",
        "C. Erba",
        "M. Garcia",
        "W. -R. Hamann",
        "A. Herrero",
        "R. Ignace",
        "N. D. Kee",
        "B. Kubátová",
        "R. Lefever",
        "A. Moffat",
        "P. Najarro",
        "L. Oskinova",
        "D. Pauli",
        "R. Prinja",
        "J. Puls",
        "A. Sander",
        "T. Shenar",
        "N. St-Louis",
        "A. ud-Doula",
        "J. S. Vink"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "The winds of massive stars have an impact on stellar evolution and on the surrounding medium. The maximum speed reached by these outflows, the terminal wind speed, is a global wind parameter and an essential input for models of stellar atmospheres and feedback. With the arrival of the ULLYSES programme, a legacy UV spectroscopic survey with HST, we have the opportunity to quantify the wind speeds of massive stars at sub-solar metallicity (in the Large and Small Magellanic Clouds, 0.5Z and 0.2Z) at an unprecedented scale. We empirically quantify the wind speeds of a large sample of OB stars, including supergiants, giants, and dwarfs at sub-solar metallicity. Using these measurements, we investigate trends of terminal wind speed with a number of fundamental stellar parameters, namely effective temperature, metallicity, and surface escape velocity. We empirically determined the terminal wind speed for a sample of 149 OB stars in the Magellanic Clouds either by directly measuring the maximum velocity shift of the absorption component of the Civ 1548-1550 line profile, or by fitting synthetic spectra produced using the Sobolev with exact integration method. Stellar parameters were either collected from the literature, obtained using spectral-type calibrations, or predicted from evolutionary models. We find strong trends of terminal wind speed with effective temperature and surface escape speed when the wind is strong enough to cause a saturated P Cygni profile in Civ 1548-1550. We find evidence for a metallicity dependence on the terminal wind speed proportional to Z^0.22+-0.03 when we compared our results to previous Galactic studies. Our results suggest that effective temperature rather than surface escape speed should be used as a straightforward empirical prediction of terminal wind speed and that the observed metallicity dependence is steeper than suggested by earlier works.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12165v1"
    ],
    "publication_venue": "21 pages, 16 figures, 8 tables. Accepted in A&A"
}