{
    "arxiv_id": "2303.08795",
    "paper_title": "Rapidly evolving Galactic plane outbursts in NEOWISE: Revisiting the Galactic nova rate with the first all-sky search in the mid-infrared",
    "authors": [
        "Liam Zuckerman",
        "Kishalay De",
        "Anna-Christina Eilers",
        "Aaron M. Meisner",
        "Christos Panagiotou"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE"
    ],
    "abstract": "The Galactic nova rate is intimately linked to our understanding of its chemical enrichment and progenitor channels of Type Ia supernovae. Yet past estimates have varied by more than an order of magnitude ($\\approx10-300$ yr$^{-1}$) owing to limitations in both discovery methods as well as assumptions regarding the Galactic dust distribution and extragalactic stellar populations. Recent estimates utilizing synoptic near-infrared surveys have begun to provide a glimpse of a consensus ($\\approx25-50$ yr$^{-1}$); however, a consistent estimate remains lacking. Here, we present the first all-sky search for Galactic novae using 8 years of data from the NEOWISE mid-infrared (MIR) survey. Operating at $3.4$ and $4.6$ $μ$m where interstellar extinction is negligible, the 6-month cadence NEOWISE dataset offers unique sensitivity to discover slowly evolving novae across the entire Galaxy. Using a novel image subtraction pipeline together with systematic selection criteria, we identify a sample of 49 rapidly evolving MIR outbursts as candidate Galactic novae. While 27 of these sources are known novae, the remaining are previously missed nova candidates discovered in this work. The unknown events are spatially clustered along the densest and most heavily obscured regions of the Galaxy where previous novae are severely underrepresented. We use simulations of the NEOWISE survey strategy, the pipeline detection efficiency, and our criteria to derive a Galactic nova rate of $47.9^{+3.1}_{-8.3}$ yr$^{-1}$. The discovery of these exceptionally bright (yet overlooked) nova candidates confirm emerging suggestions that optical surveys have been highly incomplete in searches for Galactic novae, highlighting the potential for MIR searches in revealing the demographics of Galactic stellar outbursts.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08795v1",
        "http://arxiv.org/pdf/2303.08795v2"
    ],
    "publication_venue": "13 pages, 4 figures, 1 table, 3 figures in Appendix. Submitted to MNRAS. Comments welcome"
}