{
    "arxiv_id": "2303.16915",
    "paper_title": "A Modest Proposal for the Non-existence of Exoplanets: The Expansion of Stellar Physics to Include Squars",
    "authors": [
        "Charity Woodrum",
        "Raphael E. Hviding",
        "Rachael C. Amaro",
        "Katie Chamberlain"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
    ],
    "abstract": "The search for exoplanets has become a focal point of astronomical research, captivating public attention and driving scientific inquiry; however, the rush to confirm exoplanet discoveries has often overlooked potential alternative explanations leading to a scientific consensus that is overly reliant on untested assumptions and limited data. We argue that the evidence in support of exoplanet observation is not necessarily definitive and that alternative interpretations are not only possible, but necessary. Our conclusion is therefore concise: exoplanets do not exist. Here, we present the framework for a novel type of cuboid star, or squar, which can precisely reproduce the full range of observed phenomena in stellar light curves, including the trapezoidal flux deviations (TFDs) often attributed to \"exoplanets.\" In this discovery paper, we illustrate the power of the squellar model, showing that the light curve of the well-studied \"exoplanet\" WASP-12b can be reconstructed simply from a rotating squar with proportions $1:1/8:1$, without invoking ad-hoc planetary bodies. Our findings cast serious doubt on the validity of current \"exoplanetary\" efforts, which have largely ignored the potential role of squars and have instead blindly accepted the exoplanet hypothesis without sufficient critical scrutiny. In addition, we discuss the sociopolitical role of climate change in spurring the current exoplanet fervor which has lead to the speculative state of \"exoplanetary science\" today. We strongly urge the astronomical community to take our model proposal seriously and treat its severe ramifications with the utmost urgency to restore rationality to the field of astronomy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16915v1"
    ],
    "publication_venue": "7 pages, 4 figures, publication pending litigation. For all intents and purposes this manuscript is dated April 1st, 2023"
}