{
    "arxiv_id": "2303.10285",
    "paper_title": "Exact and optimal quadratization of nonlinear finite-dimensional non-autonomous dynamical systems",
    "authors": [
        "Andrey Bychkov",
        "Opal Issan",
        "Gleb Pogudin",
        "Boris Kramer"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-09-12"
    ],
    "latest_version": 3,
    "categories": [
        "cs.SC",
        "math.DS",
        "math.NA"
    ],
    "abstract": "Quadratization of polynomial and nonpolynomial systems of ordinary differential equations is advantageous in a variety of disciplines, such as systems theory, fluid mechanics, chemical reaction modeling and mathematical analysis. A quadratization reveals new variables and structures of a model, which may be easier to analyze, simulate, control, and provides a convenient parametrization for learning. This paper presents novel theory, algorithms and software capabilities for quadratization of non-autonomous ODEs. We provide existence results, depending on the regularity of the input function, for cases when a quadratic-bilinear system can be obtained through quadratization. We further develop existence results and an algorithm that generalizes the process of quadratization for systems with arbitrary dimension that retain the nonlinear structure when the dimension grows. For such systems, we provide dimension-agnostic quadratization. An example is semi-discretized PDEs, where the nonlinear terms remain symbolically identical when the discretization size increases. As an important aspect for practical adoption of this research, we extended the capabilities of the QBee software towards both non-autonomous systems of ODEs and ODEs with arbitrary dimension. We present several examples of ODEs that were previously reported in the literature, and where our new algorithms find quadratized ODE systems with lower dimension than the previously reported lifting transformations. We further highlight an important area of quadratization: reduced-order model learning. This area can benefit significantly from working in the optimal lifting variables, where quadratic models provide a direct parametrization of the model that also avoids additional hyperreduction for the nonlinear terms. A solar wind example highlights these advantages.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10285v1",
        "http://arxiv.org/pdf/2303.10285v2",
        "http://arxiv.org/pdf/2303.10285v3"
    ],
    "publication_venue": null
}