{
    "arxiv_id": "2303.17596",
    "paper_title": "Fate of entanglement in magnetism under Lindbladian or non-Markovian dynamics and conditions for their transition to Landau-Lifshitz-Gilbert classical dynamics",
    "authors": [
        "Federico Garcia-Gaitan",
        "Branislav K. Nikolic"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-05-04"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.str-el"
    ],
    "abstract": "It is commonly assumed in spintronics and magnonics that localized spins within antiferromagnets are in the Néel ground state (GS), as well as that such state evolves, when pushed out of equilibrium by current or external fields, according to the Landau-Lifshitz-Gilbert (LLG) equation viewing localized spins as classical vectors of fixed length. On the other hand, the true GS of antiferromagnets is highly entangled, as confirmed by very recent neutron scattering experiments witnessing their entanglement. Although GS of ferromagnets is always unentangled, their magnonic low-energy excitation are superpositions of many-body spin states and, therefore, entangled. In this study, we initialize quantum Heisenberg ferro- or antiferromagnetic chains hosing localized spins $S=1/2$, $S=1$ or $S=5/2$ into unentangled pure state and then evolve them by quantum master equations (QMEs) of Lindblad or non-Markovian type, derived by coupling localized spins to a bosonic bath (such as due to phonons) or by using additional ``reaction coordinate'' in the latter case. The time evolution is initiated by applying an external magnetic field, and entanglement of time-evolving {\\em mixed} quantum states is monitored by computing its logarithmic negativity. We find that non-Markovian dynamics maintains some degree of entanglement, which shrinks the length of the vector of spin expectation values, thereby making the LLG equation inapplicable. Conversely, Lindbladian (i.e., Markovian) dynamics ensures that entanglement goes to zero, thereby enabling quantum-to-classical (i.e., to LLG) transition in all cases -- $S=1/2$, $S=1$ and $S=5/2$ ferromagnet or $S=5/2$ antiferromagnet -- {\\em except} for $S=1/2$ and $S=1$ antiferromagnet. We also investigate the stability of entangled antiferromagnetic GS upon suddenly coupling it to the bosonic bath.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17596v1",
        "http://arxiv.org/pdf/2303.17596v2"
    ],
    "publication_venue": "7 pages, 3 figures"
}