{
    "arxiv_id": "2303.15340",
    "paper_title": "Inclusive and differential cross-sections for dilepton $t\\bar{t}$ production measured in $\\sqrt{s}=13\\;$TeV $pp$ collisions with the ATLAS detector",
    "authors": [
        "ATLAS Collaboration"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-08-10"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ex"
    ],
    "abstract": "Differential and double-differential distributions of kinematic variables of leptons from decays of top-quark pairs ($t\\bar{t}$) are measured using the full LHC Run 2 data sample collected with the ATLAS detector. The data were collected at a $pp$ collision energy of $\\sqrt{s}=13$ TeV and correspond to an integrated luminosity of 140 fb$^{-1}$. The measurements use events containing an oppositely charged $eμ$ pair and $b$-tagged jets. The results are compared with predictions from several Monte Carlo generators. While no prediction is found to be consistent with all distributions, a better agreement with measurements of the lepton $p_{\\text{T}}$ distributions is obtained by reweighting the $t\\bar{t}$ sample so as to reproduce the top-quark $p_{\\text{T}}$ distribution from an NNLO calculation. The inclusive top-quark pair production cross-section is measured as well, both in a fiducial region and in the full phase-space. The total inclusive cross-section is found to be \\[ σ_{t\\bar{t}} = 829 \\pm 1\\;(\\textrm{stat}) \\pm 13\\;(\\textrm{syst}) \\pm 8\\;(\\textrm{lumi}) \\pm 2\\; (\\textrm{beam})\\ \\textrm{pb}, \\] where the uncertainties are due to statistics, systematic effects, the integrated luminosity and the beam energy. This is in excellent agreement with the theoretical expectation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15340v1"
    ],
    "publication_venue": "71 pages in total, author list starting page 54, 13 figures, 29 tables, submitted to JHEP. All figures including auxiliary figures are available at https://atlas.web.cern.ch/Atlas/GROUPS/PHYSICS/PAPERS/TOPQ-2018-26/",
    "doi": "10.1007/JHEP07(2023)141"
}