{
    "arxiv_id": "2303.14822",
    "paper_title": "MGTBench: Benchmarking Machine-Generated Text Detection",
    "authors": [
        "Xinlei He",
        "Xinyue Shen",
        "Zeyuan Chen",
        "Michael Backes",
        "Yang Zhang"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-06-12"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CR",
        "cs.LG"
    ],
    "abstract": "Nowadays large language models (LLMs) have shown revolutionary power in a variety of natural language processing (NLP) tasks such as text classification, sentiment analysis, language translation, and question-answering. In this way, detecting machine-generated texts (MGTs) is becoming increasingly important as LLMs become more advanced and prevalent. These models can generate human-like language that can be difficult to distinguish from text written by a human, which raises concerns about authenticity, accountability, and potential bias. However, existing detection methods against MGTs are evaluated under different model architectures, datasets, and experimental settings, resulting in a lack of a comprehensive evaluation framework across different methodologies\n  In this paper, we fill this gap by proposing the first benchmark framework for MGT detection, named MGTBench. Extensive evaluations on public datasets with curated answers generated by ChatGPT (the most representative and powerful LLMs thus far) show that most of the current detection methods perform less satisfactorily against MGTs. An exceptional case is ChatGPT Detector, which is trained with ChatGPT-generated texts and shows great performance in detecting MGTs. Nonetheless, we note that only a small fraction of adversarial-crafted perturbations on MGTs can evade the ChatGPT Detector, thus highlighting the need for more robust MGT detection methods. We envision that MGTBench will serve as a benchmark tool to accelerate future investigations involving the evaluation of state-of-the-art MGT detection methods on their respective datasets and the development of more advanced MGT detection methods. Our source code and datasets are available at https://github.com/xinleihe/MGTBench.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14822v1",
        "http://arxiv.org/pdf/2303.14822v2"
    ],
    "publication_venue": null
}