{
    "arxiv_id": "2303.16572",
    "paper_title": "Shear-induced reinforcement in boehmite gels: a rheo-X-ray-scattering study",
    "authors": [
        "Iana Sudreau",
        "Marion Servel",
        "Eric Freyssingeas",
        "François Liénard",
        "Szilvia Karpati",
        "Stéphane Parola",
        "Xavier Jaurand",
        "Pierre-Yves Dugas",
        "Lauren Matthews",
        "Thomas Gibaud",
        "Thibaut Divoux",
        "Sébastien Manneville"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-12-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Boehmite, an aluminum oxide hydroxide $γ$-AlO(OH), is broadly used in the form of particulate dispersions in industrial applications, e.g., for the fabrication of ceramics and catalyst supports or as a binder for extrusion processes. Under acidic conditions, colloidal boehmite dispersions at rest form gels, i.e., space-spanning percolated networks that behave as soft solids at rest, and yet yield and flow like liquids under large enough deformations. Like many other colloidal gels, the solid-like properties of boehmite gels at rest are very sensitive to their previous mechanical history. Our recent work [Sudreau et al., J. Rheol. 66, 91-104 (2022), and Phys. Rev. Material 6, L042601 (2022)] has revealed such \\textit{memory effects}, where the shear experienced prior to flow cessation drives the elasticity of boehmite gels: while gels formed following application of a shear rate $\\dotγ_{\\rm p}$ larger than a critical value $\\dotγ_{\\rm c}$ are insensitive to shear history, gels formed after application of $\\dotγ_{\\rm p}<\\dotγ_{\\rm c}$ display reinforced viscoelastic properties and non-negligible residual stresses. Here, we provide a microstructural scenario for these striking observations by coupling rheometry and small-angle X-ray scattering. Time-resolved measurements for $\\dotγ_{\\rm p} <\\dotγ_{\\rm c}$ show that scattering patterns develop an anisotropic shape that persists upon flow cessation, whereas gels exposed to $\\dotγ_{\\rm p}>\\dotγ_{\\rm c}$ display isotropic scattering patterns upon flow cessation. Moreover, as the shear rate applied prior to flow cessation is decreased below $\\dotγ_{\\rm c}$, the level of anisotropy frozen in the sample microstructure grows similarly to the viscoelastic properties, thus providing a direct link between mechanical reinforcement and flow-induced microstructural anisotropy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16572v1"
    ],
    "publication_venue": "13 pages, 10 figures",
    "doi": "10.1103/PhysRevMaterials.7.115603"
}