{
    "arxiv_id": "2303.08759",
    "paper_title": "Absence of near-ambient superconductivity in LuH$_{2\\pm\\text{x}}$N$_y$",
    "authors": [
        "Xue Ming",
        "Ying-Jie Zhang",
        "Xiyu Zhu",
        "Qing Li",
        "Chengping He",
        "Yuecong Liu",
        "Bo Zheng",
        "Huan Yang",
        "Hai-Hu Wen"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.supr-con"
    ],
    "abstract": "Recently near-ambient superconductivity was claimed in N-doped lutetium hydride (ref. 1). This induces a worldwide fanaticism about the dream of room temperature superconductivity under low pressures. By using a high pressure and high temperature synthesis technique, we have successfully obtained the nitrogen doped lutetium hydride (LuH$_{2\\pm\\text{x}}$N$_y$) with a dark-bluish color and a structure with the space group of $Fm\\bar{3}m$ evidenced by x-ray diffraction. This structure is the same as that reported in ref. 1. The energy dispersive X-ray spectroscopy (EDS) confirmed the existence of nitrogen in some areas of the samples. At ambient pressure, we witness a kink of resistivity and magnetization at about 300 K, which may correspond to a rearrangement of hydrogen/nitrogen atoms, namely a structural transition. However, by applying a pressure from 1 GPa to 6 GPa, we have seen a progressively optimized metallic behavior without showing superconductivity down to 10 K. Temperature dependence of magnetization shows a roughly flat feature between 100 and 320 K, and the magnetization increases with magnetic field at 100 K, all these are not expected for superconductivity at 100 K. Thus, we conclude the absence of near-ambient superconductivity in this nitrogen-doped lutetium hydride under pressures below 6 GPa.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08759v1",
        "http://arxiv.org/pdf/2303.08759v2"
    ],
    "publication_venue": "21 pages, 5+2 figures"
}