{
    "arxiv_id": "2303.15894",
    "paper_title": "The mass accretion history of dark matter haloes down to Earth mass",
    "authors": [
        "Yizhou Liu",
        "Liang Gao",
        "Sownak Bose",
        "Carlos S. Frenk",
        "Adrian Jenkins",
        "Volker Springel",
        "Jie Wang",
        "Simon D. M. White",
        "Haonan Zheng"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2025-04-01"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
    ],
    "abstract": "We take advantage of the unprecedented dynamical range provided by the \"Cosmic-Zoom\" project to study the mass accretion history (MAH) of present-day dark matter haloes over the entire mass range present in the $Λ$CDM paradigm when the dark matter is made of weakly interacting massive particles of mass $100\\ \\mathrm{GeV}$. In particular, we complement previous studies by exploring the MAHs of haloes with mass from $10^8\\ h^{-1}\\mathrm{M_{\\odot}}$ down to Earth mass, $10^{-6}\\ h^{-1}\\mathrm{M_{\\odot}}$. The formation redshift of low-mass haloes anti-correlates weakly with mass, peaking at $z=3$ for haloes of mass $10^{-4}\\ h^{-1}\\mathrm{M_{\\odot}}$. Even lower masses are affected by the free-streaming cutoff in the primordial spectrum of density fluctuations and form at lower redshift. We compare MAHs in our simulations with predictions from two analytical models based on the extended Press-Schechter theory (EPS), and three empirical models derived by fitting and extrapolating either results from cosmological $N$-body simulations or Monte Carlo realizations of halo growth. All models fit our simulations reasonably well over the mass range for which they were calibrated. While the empirical models match better for more massive haloes, $M>10^{10}\\ h^{-1}\\mathrm{M_{\\odot}}$, the analytical models do better when extrapolated down to Earth mass. At the higher masses, we explore the correlation between local environment density and MAH, finding that biases are relatively weak, with typical MAHs for haloes in extremely low-density and in typical regions differing by less than $20$ percent at high redshift. We conclude that EPS theory predicts the hierarchical build-up of dark matter haloes quite well over the entire mass range.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15894v1",
        "http://arxiv.org/pdf/2303.15894v2"
    ],
    "publication_venue": "11 pages, 6 figures, published in MNRAS",
    "doi": "10.1093/mnras/stae003"
}