{
    "arxiv_id": "2303.09936",
    "paper_title": "Convergence of population processes with small and frequent mutations to the canonical equation of adaptive dynamics",
    "authors": [
        "Nicolas Champagnat",
        "Vincent Hass"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2024-02-05"
    ],
    "latest_version": 3,
    "categories": [
        "math.PR"
    ],
    "abstract": "In this article, a stochastic individual-based model describing Darwinian evolution of asexual, phenotypic trait-structured population, is studied. We consider a large population with constant population size characterised by a resampling rate modeling competition pressure driving selection and a mutation rate where mutations occur during life. In this model, the population state at fixed time is given as a measure on the space of phenotypes and the evolution of the population is described by a continuous time, measure-valued Markov process. We investigate the asymptotic behavior of the system, where mutations are frequent, in the double simultaneous limit of large population $(K \\to +\\infty)$ and small mutational effects $(σ_{K} \\to 0)$ proving convergence to an ODE known as the canonical equation of adaptive dynamics. This result holds only for a certain range of $σ_{K}$ parameters (as a function of $K$) which must be small enough but not too small either. The canonical equation describes the evolution in time of the dominant trait in the population driven by a fitness gradient. This result is based on an slow-fast asymptotic analysis. We use an averaging method, inspired by (Kurtz, 1992), which exploits a martingale approach and compactness-uniqueness arguments. The contribution of the fast component, which converges to the centered Fleming-Viot process, is obtained by averaging according to its invariant measure, recently characterised in (Champagnat-Hass, 2022).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09936v1",
        "http://arxiv.org/pdf/2303.09936v2",
        "http://arxiv.org/pdf/2303.09936v3"
    ],
    "publication_venue": "70 pages"
}