{
    "arxiv_id": "2303.13669",
    "paper_title": "The State of Food Systems Worldwide: Counting Down to 2030",
    "authors": [
        "Kate Schneider",
        "Jessica Fanzo",
        "Lawrence Haddad",
        "Mario Herrero",
        "Jose Rosero Moncayo",
        "Anna Herforth",
        "Roseline Reman",
        "Alejandro Guarin",
        "Danielle Resnick",
        "Namukolo Covic",
        "Christophe Béné",
        "Andrea Cattaneo",
        "Nancy Aburto",
        "Ramya Ambikapathi",
        "Destan Aytekin",
        "Simon Barquera",
        "Jane Battersby-Lennard",
        "Ty Beal",
        "Paulina Bizzoto Molina",
        "Carlo Cafiero",
        "Christine Campeau",
        "Patrick Caron",
        "Piero Conforti",
        "Kerstin Damerau",
        "Michael DiGirolamo",
        "Fabrice DeClerck",
        "Deviana Dewi",
        "Ismahane Elouafi",
        "Carola Fabi",
        "Pat Foley",
        "Ty Frazier",
        "Jessica Gephart",
        "Christopher Golden",
        "Carlos Gonzalez Fischer",
        "Sheryl Hendriks",
        "Maddalena Honorati",
        "Jikun Huang",
        "Gina Kennedy",
        "Amos Laar",
        "Rattan Lal",
        "Preetmoninder Lidder",
        "Brent Loken",
        "Quinn Marshall",
        "Yuta Masuda",
        "Rebecca McLaren",
        "Lais Miachon",
        "Hernán Muñoz",
        "Stella Nordhagen",
        "Naina Qayyum",
        "Michaela Saisana",
        "Diana Suhardiman",
        "Rashid Sumaila",
        "Maximo Torrero Cullen",
        "Francesco Tubiello",
        "Jose-Luis Vivero-Pol",
        "Patrick Webb",
        "Keith Wiebe"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "econ.GN"
    ],
    "abstract": "Transforming food systems is essential to bring about a healthier, equitable, sustainable, and resilient future, including achieving global development and sustainability goals. To date, no comprehensive framework exists to track food systems transformation and their contributions to global goals. In 2021, the Food Systems Countdown to 2030 Initiative (FSCI) articulated an architecture to monitor food systems across five themes: 1 diets, nutrition, and health; 2 environment, natural resources, and production; 3 livelihoods, poverty, and equity; 4 governance; and 5 resilience and sustainability. Each theme comprises three-to-five indicator domains. This paper builds on that architecture, presenting the inclusive, consultative process used to select indicators and an application of the indicator framework using the latest available data, constructing the first global food systems baseline to track transformation. While data are available to cover most themes and domains, critical indicator gaps exist such as off-farm livelihoods, food loss and waste, and governance. Baseline results demonstrate every region or country can claim positive outcomes in some parts of food systems, but none are optimal across all domains, and some indicators are independent of national income. These results underscore the need for dedicated monitoring and transformation agendas specific to food systems. Tracking these indicators to 2030 and beyond will allow for data-driven food systems governance at all scales and increase accountability for urgently needed progress toward achieving global goals.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13669v1"
    ],
    "publication_venue": null
}