{
    "arxiv_id": "2303.14990",
    "paper_title": "Microplastic and natural sediment in bed load saltation: material does not dictate the fate",
    "authors": [
        "James Lofty",
        "Daniel Valero",
        "Catherine A. M. E. Wilson",
        "Mário J. Franca",
        "Pablo Ouro"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "Microplastic (MP) pollution is a well document threat to our aquatic and terrestrial ecosystems, however, the mechanisms by which MPs are transported in river flows are still unknown. The transport of MPs and natural sediment in aquatic flows could be somewhat comparable, as particles are similar in size. However, it is unknown how the lower density of MPs and their different material properties impact their transport dynamics. To answer this, novel laboratory experiments on bed load saltation dynamics in an open-channel flow, using high-speed camera imaging and the detection of 11,035 individual saltation events were used to identify the similarities and differences between spherical MPs and spherical natural sediments transport. The tested MPs varied in terms of size and material properties (density and elasticity). Our analysis shows that the Rouse number accurately describes saltation length, height, transport velocity and collision angles equally well for both MPs and natural sediments. Through statistical inference, the distribution functions of saltation trajectory characteristics for MPs were analogous to natural sediment with only one sediment experiment (1.4 % of cases) differing from all other plastic experiments. Similarly, only nine experiments (9.3 % of cases) showed that collision angles for MPs differed from those of natural sediment experiments. Differences observed in terms of restitution become negligible in overall transport dynamics as turbulence overcomes the kinetic energy lost at particle-bed impact, which keeps particle motion independent from impact. Overall, spherical MP particles behave similarly to spherical natural sediments in aquatic environments under the examined experimental conditions. This is significant because there is an established body of knowledge for sediment transport that can serve as a foundation for the study of MP transport.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14990v1"
    ],
    "publication_venue": null
}