{
    "arxiv_id": "2303.15254",
    "paper_title": "Integrated Nested Laplace Approximations for Large-Scale Spatial-Temporal Bayesian Modeling",
    "authors": [
        "Lisa Gaedke-Merzhäuser",
        "Elias Krainski",
        "Radim Janalik",
        "Håvard Rue",
        "Olaf Schenk"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "stat.CO",
        "cs.DC",
        "math.NA"
    ],
    "abstract": "Bayesian inference tasks continue to pose a computational challenge. This especially holds for spatial-temporal modeling where high-dimensional latent parameter spaces are ubiquitous. The methodology of integrated nested Laplace approximations (INLA) provides a framework for performing Bayesian inference applicable to a large subclass of additive Bayesian hierarchical models. In combination with the stochastic partial differential equations (SPDE) approach it gives rise to an efficient method for spatial-temporal modeling. In this work we build on the INLA-SPDE approach, by putting forward a performant distributed memory variant, INLA-DIST, for large-scale applications. To perform the arising computational kernel operations, consisting of Cholesky factorizations, solving linear systems, and selected matrix inversions, we present two numerical solver options, a sparse CPU-based library and a novel blocked GPU-accelerated approach which we propose. We leverage the recurring nonzero block structure in the arising precision (inverse covariance) matrices, which allows us to employ dense subroutines within a sparse setting. Both versions of INLA-DIST are highly scalable, capable of performing inference on models with millions of latent parameters. We demonstrate their accuracy and performance on synthetic as well as real-world climate dataset applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15254v1"
    ],
    "publication_venue": "22 pages, 14 figures"
}