{
    "arxiv_id": "2303.14544",
    "paper_title": "Privacy-Enhancing Technologies in Federated Learning for the Internet of Healthcare Things: A Survey",
    "authors": [
        "Fatemeh Mosaiyebzadeh",
        "Seyedamin Pouriyeh",
        "Reza M. Parizi",
        "Quan Z. Sheng",
        "Meng Han",
        "Liang Zhao",
        "Giovanna Sannino",
        "Daniel Macêdo Batista"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.NI"
    ],
    "abstract": "Advancements in wearable medical devices in IoT technology are shaping the modern healthcare system. With the emergence of the Internet of Healthcare Things (IoHT), we are witnessing how efficient healthcare services are provided to patients and how healthcare professionals are effectively used AI-based models to analyze the data collected from IoHT devices for the treatment of various diseases. To avoid privacy breaches, these data must be processed and analyzed in compliance with the legal rules and regulations such as HIPAA and GDPR. Federated learning is a machine leaning based approach that allows multiple entities to collaboratively train a ML model without sharing their data. This is particularly useful in the healthcare domain where data privacy and security are big concerns. Even though FL addresses some privacy concerns, there is still no formal proof of privacy guarantees for IoHT data. Privacy Enhancing Technologies (PETs) are a set of tools and techniques that are designed to enhance the privacy and security of online communications and data sharing. PETs provide a range of features that help protect users' personal information and sensitive data from unauthorized access and tracking. This paper reviews PETs in detail and comprehensively in relation to FL in the IoHT setting and identifies several key challenges for future research.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14544v1"
    ],
    "publication_venue": "15 pages, 4 figures, 5 tables"
}