{
    "arxiv_id": "2303.10099",
    "paper_title": "Reconstructing Galactic magnetic fields from local measurements for backtracking ultra-high-energy cosmic rays",
    "authors": [
        "Alexandros Tsouros",
        "Gordian Edenhofer",
        "Torsten Enßlin",
        "Michalis Mastorakis",
        "Vasiliki Pavlidou"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
    ],
    "abstract": "(abridged) Ultra-high energy cosmic rays (UHECRs) are highly energetic charged particles with energies exceeding $10^{18}$ eV. Identifying their sources and production mechanism can provide insight into many open questions in astrophysics and high energy physics. However, the Galactic magnetic field (GMF) deflects UHECRs, and the high uncertainties in our current understanding of the $3$-dimensional structure of the GMF does not permit us to accurately determine their true arrival direction on the plane of the sky (PoS). This difficulty arises from the fact that currently all GMF observations are integrated along the line-of-sight (LoS). Upcoming stellar optopolarimetric surveys as well as Gaia data on stellar parallaxes, are expected to provide local measurements of the GMF in the near future. In this paper, we evaluate the reconstruction of the GMF in a limited region of the Galaxy given sparse and local GMF measurements within that region, through Bayesian inference using principles of Information Field Theory. We backtrack UHECRs through GMF configurations drawn from the posterior to improve our knowledge of their true arrival directions. We show that, for a weakly turbulent GMF, it is possible to correct for its effect on the observed arrival direction of UHECRs to within $\\sim 3^\\circ$. For completely turbulent fields, we show that our procedure can still be used to significantly improve our knowledge on the true arrival direction of UHECRs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10099v1"
    ],
    "publication_venue": "12 pages, 10 figures"
}