{
    "arxiv_id": "2303.14484",
    "paper_title": "Symmetry-mode analysis for local structure investigations using pair distribution function data",
    "authors": [
        "Parker K. Hamilton",
        "Jaime M. Moya",
        "Alannah M. Hallas",
        "E. Morosan",
        "Raju Baral",
        "Benjamin A. Frandsen"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Symmetry-adapted distortion modes provide a natural way to describe distorted structures derived from higher-symmetry parent phases. Structural refinements using symmetry-mode amplitudes as fit variables have been used for at least 10 years in Rietveld refinements of the average crystal structure from diffraction data; more recently, this approach has also been used for investigations of the local structure using real-space pair distribution function (PDF) data. Here, we further demonstrate the value of performing symmetry-mode fits to PDF data through the successful application of this method to two topical materials: TiSe$_2$, where we detect the subtle but long-range structural distortion driven by the formation of a charge density wave, and MnTe, where we characterize a large but highly localized structural distortion in terms of symmetry-lowering displacements of the Te atoms. The analysis is performed using fully open-source code within the DiffPy framework using two packages we developed for this work: pydistort, which provides a scriptable interface to the ISODISTORT web application for group theoretical calculations, and isotools, which converts the ISODISTORT output into a DiffPy-compatible format for subsequent fitting and analysis. These developments expand the potential impact of symmetry-adapted PDF analysis by enabling high throughput analysis and removing the need for any commercial software.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14484v1"
    ],
    "publication_venue": null
}