{
    "arxiv_id": "2303.11304",
    "paper_title": "Resource-Dependent Complexity of Quantum Channels",
    "authors": [
        "Roy Araiza",
        "Yidong Chen",
        "Marius Junge",
        "Peixue Wu"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-11-01"
    ],
    "latest_version": 3,
    "categories": [
        "quant-ph",
        "math-ph",
        "math.OA"
    ],
    "abstract": "Quantum complexity theory is concerned with the amount of elementary quantum resources needed to build a quantum system or a quantum operation. The fundamental question in quantum complexity is to define and quantify suitable complexity measures. This non-trivial question has attracted the attention of quantum information scientists, computer scientists, and high energy physicists alike. In this paper, we combine the approach in \\cite{LBKJL} and well-established tools from noncommutative geometry \\cite{AC, MR, CS} to propose a unified framework for \\textit{resource-dependent complexity measures of general quantum channels}, also known as \\textit{Lipschitz complexity}. This framework is suitable to study the complexity of both open and closed quantum systems. The central class of examples in this paper is the so-called \\textit{Wasserstein complexity} introduced in \\cite{LBKJL, PMTL}. We use geometric methods to provide upper and lower bounds on this class of complexity measures \\cite{N1,N2,N3}. Finally, we study the Lipschitz complexity of random quantum circuits and dynamics of open quantum systems in finite dimensional setting. In particular, we show that generically the complexity grows linearly in time before the \\textit{return time}. This is the same qualitative behavior conjecture by Brown and Susskind \\cite{BS1, BS2}. We also provide an infinite dimensional example where linear growth does not hold.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11304v1",
        "http://arxiv.org/pdf/2303.11304v2",
        "http://arxiv.org/pdf/2303.11304v3"
    ],
    "publication_venue": null
}