{
    "arxiv_id": "2303.14641",
    "paper_title": "Nanoscale molecular electrochemical supercapacitors",
    "authors": [
        "Ritu Gupta",
        "Ankur Malik",
        "Vincent Vivier",
        "Prakash Chandra Mondal"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "cond-mat.mes-hall"
    ],
    "abstract": "Due to the shorter channel length allowing faster ion/charge movement, nanoscale molecular thin films can be attractive electronic components for next-generation high-performing energy storage devices. However, controlling chemical functionalization and achieving stable electrode-molecule interfaces at the nanoscale via covalent functionalization for low-voltage operational, ultrafast charging/discharging remains a challenge. Herein, we present a simple, controllable, scalable, low-cost, and versatile electrochemical grafting approach to modulate chemical and electronic properties of graphite rods (GRs) that are extracted from low-cost EVEREADY cells (1.5 US $ for 10 cells of 1.5 V). On the ANT-modified GR (ANT/GR), the total capacitance unveils 350-fold enhancement as compared to an unmodified GR tested with 0.1 M H2SO4 electrolyte ensured by both potentiostatic and galvanostatic measurements. Such enhancement in capacitance is attributed to the contribution from the electrical double layer and Faradaic charge transfer. Due to higher conductivity, anthracene molecular layers possess more azo groups (-N=N-) over pyrene, and naphthalene molecular films during the electrochemical grafting, which is key to capacitance improvements. The ultra-low-loading nanofilms expose high surface area leading to extremely high energy density. The nanoscale molecular films (~ 23 nm thickness) show exceptional galvanostatic charge-discharge cycling stability (10,000) that operates at low potential. Electrochemical impedance spectroscopy was performed along with the DC measurements to unravel in-depth charge storage performances. Electrochemically grafted molecular films on GR show excellent balance in capacitance and electrical conductivity, high diffusion coefficient toward ferrocene, and can easily be synthesized in good yield on rigid to flexible electrodes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14641v1"
    ],
    "publication_venue": "18 pages, 6 Figures"
}