{
    "arxiv_id": "2303.17168",
    "paper_title": "On the analogy between the restricted primitive model and capacitor circuits: Semi-empirical alternatives for over- and underscreening in the calculation of mean ionic activity coefficients",
    "authors": [
        "Andrés González de Castilla",
        "Simon Müller",
        "Irina Smirnova"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph",
        "cond-mat.stat-mech",
        "physics.comp-ph"
    ],
    "abstract": "The analogy between the restricted primitive model and capacitor circuits, originally described decades ago for the Mean Spherical Approximation, is explored and applied to other electrolyte theories to demonstrate its transferability in linearized electrolyte theories. On this basis, we offer an explanation of why scaling the salt diameter blurs differences between electrolyte theories. Furthermore, a capacitor circuit analogy with principles from the Dressed Ion Theory is applied to develop a modified parameter of closest approach \"b\" for the Pitzer-Debye-Hückel term. Such modified parameter of closest approach is able to account for the qualitative effects of over- and underscreening in the calculation of mean ionic activity coefficients. This is achieved by a function that mimics the behavior of the multiple decay-length extension of the Debye-Hückel theory while also reproducing recommended values for \"b\" when strong ion coupling is present and the LPB approximation is no longer valid for 1:1 and 1:2 electrolytes. Finally, as proof of the extended applicability of this modified semi-empirical electrostatic theory, it is applied in combination with the predictive COSMO-RS-ES model and shown to be an effective replacement of its recently published version with ion pairing. This reduces the model complexity and at the same time improves its overall qualitative performance for the prediction of solubilities in mixed-solvent systems and even non-aqueous mean ionic activity coefficients.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17168v1"
    ],
    "publication_venue": null,
    "doi": "10.1016/j.molliq.2020.115204"
}