{
    "arxiv_id": "2303.10095",
    "paper_title": "The Pantheon Sample analysis of cosmological constraints under new models",
    "authors": [
        "Peifeng Peng"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "In this project, the cosmological parameters are determined by applying six cosmological models to fit the magnitude-redshift relation of the Pantheon Sample consisting of 1048 Type Ia supernovae (SNe Ia) in the range of $0.01 < z < 2.26$. Apart from the well-known flat $Λ$CDM model as well as other models that have been broadly studied, this project includes two new models, which are the $\\textit{o}\\textit{w}$CDM model and the $\\textit{o}\\textit{w}_0\\textit{w}_a$CDM model, to fully evaluate the correlations between the cosmological parameters by performing the MCMC algorithm and to explore the geometry and mass content of the Universe. Combining the measurements of the baryon acoustic oscillation (BAO) and the cosmic microwave background (CMB) with the SNe Ia constraints, the matter density parameter $Ω_M = 0.328^{+0.018}_{-0.026}$, the curvature of space parameter $Ω_k = 0.0045^{+0.0666}_{-0.0741}$, and the dark energy equation of state parameter $w = -1.120^{+0.143}_{-0.185}$ are measured for the $\\textit{o}\\textit{w}$CDM model. When it comes to the $\\textit{o}\\textit{w}_0\\textit{w}_a$CDM model, if the parameter $\\textit{w}$ is allowed to evolve with the redshift as $w = w_0 + w_a(1-a)$, the cosmological parameters are found to be $Ω_M = 0.344^{+0.018}_{-0.027}$, $Ω_k = 0.0027^{+0.0665}_{-0.0716}$, $w_0 = -0.739^{+0.336}_{-0.378}$, and $w_a = -0.812^{+0.750}_{-0.678}$. The parameters of the $\\textit{o}\\textit{w}$CDM model and the $\\textit{o}\\textit{w}_0\\textit{w}_a$CDM model are consistent with the literature results, although the parameter $\\textit{w}$ is not well constrained in both models. The large uncertainties of the parameter $\\textit{w}$ can be reduced by running more steps for the MCMC algorithm to better constrain the parameters and estimate their uncertainties.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10095v1"
    ],
    "publication_venue": "9 pages, 9 figures, 2 tables"
}