{
    "arxiv_id": "2303.14547",
    "paper_title": "The gap-size influence on the excitation of magnetorotational instability in cylindrical Couette flows",
    "authors": [
        "G. Rüdiger",
        "M. Schultz"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "The excitation conditions of the magnetorotational instability are studied for axially unbounded Taylor-Couette flows of various gap widths between the cylinders. The cylinders are considered as made from both perfect-conducting or insulating material and the conducting fluid with a finite but small magnetic Prandtl number rotates with a quasi-Keplerian velocity profile. The solutions are optimized with respect to the wave number and the Reynolds number of the rotation of the inner cylinder. For the axisymmetric modes we find the critical Lundquist number of the applied axial magnetic field the lower the wider the gap between the cylinders. A similar result is obtained for the induced cell structure: the wider the gap the more spherical the cells are. The marginal rotation rate of the inner cylinder -- for fixed size of the outer cylinder -- always possesses a minimum for not too wide and not too narrow gap widths. For perfect-conducting walls the minimum lies at $r_{\\rm in}\\simeq 0.4$ while it is at $r_{\\rm in}\\simeq 0.5$ for insulating walls where $r_{\\rm in}$ is the normalized radius of the inner cylinder. The lowest magnetic field amplitudes to excite the instability are required for Taylor-Couette flows between perfect-conducting cylinders with gaps corresponding to $r_{\\rm in}\\simeq 0.2$. For even wider and also for very thin gaps the needed magnetic fields and rotation frequencies are shown to become rather huge.\n  Also the nonaxisymmetric modes with $|m|=1$ have been considered. Their excitation generally requires stronger magnetic fields and higher magnetic Reynolds numbers in comparison to those for the axisymmetric modes which is true for wide-gap containers with $r_{\\rm in} \\lesssim 0.3$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14547v1"
    ],
    "publication_venue": "12 pages, 6 figures"
}