{
    "arxiv_id": "2303.15612",
    "paper_title": "Comparison of chromospheric diagnostics in a 3D model atmosphere: H$α$ linewidth and mm continua",
    "authors": [
        "Sneha Pandit",
        "Sven Wedemeyer",
        "Mats Carlsson",
        "Mikołaj Szydlarski"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2024-04-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "The Ha line, one of the most studied chromospheric diagnostics, is a tracer for magnetic field structures, while its line core intensity provides an estimate of the mass density. The brightness temperatures from Atacama Large Millimetre-submm Array (ALMA) observations provide a complementary view of the activity and the thermal structure of stellar atmospheres. These two diagnostics together can provide insights into the physical properties of stellar atmospheres. In this paper, we present a comparative study between synthetic continuum brightness temperature maps for mm wavelengths (0.3 mm to 8.5 mm) and the width of the Ha 6565Å line. The 3D radiative transfer codes Multi3D and Advanced Radiative Transfer (ART) are used to calculate synthetic spectra for the Ha line and the mm continua respectively, from an enhanced network atmosphere model with non-equilibrium hydrogen ionisation generated with the state-of-the-art 3D rMHD code Bifrost. We use Gaussian Point Spread Function (PSF) for simulating the effect of ALMA's limited spatial resolution and calculate the Ha vs. mm continuum correlations and slopes of scatter plots for the original and degraded resolution of the whole box, quiet sun and enhanced network patches separately. The Ha linewidth and mm brightness temperatures are highly correlated and the correlation is highest at a wavelength 0.8 mm i.e. ALMA Band 7. The correlation increases with decreased resolution. On the other hand, the slopes decrease with increasing wavelength. The degradation of resolution does not have a significant impact on the calculated slopes. With decreasing spatial resolution the standard deviations of the observables, Ha linewidth and brightness temperatures decrease and the correlations between them increase, but the slopes do not change significantly. Hence, these relations may prove useful to calibrate the mm continuum maps observed with ALMA.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15612v1"
    ],
    "publication_venue": "20 pages, 26 figures",
    "doi": "10.1051/0004-6361/202245412"
}