{
    "arxiv_id": "2303.11318",
    "paper_title": "Collisional evolution of dust and water ice in protoplanetary discs during and after an accretion outburst",
    "authors": [
        "Adrien Houge",
        "Sebastiaan Krijt"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Most protoplanetary discs are thought to undergo violent and frequent accretion outbursts, during which the accretion rate and central luminosity are elevated for several decades. This temporarily increases the disc temperature, leading to the sublimation of ice species as snowlines move outwards. In this paper, we investigate how an FUor-type accretion outburst alters the growth and appearance of dust aggregates at different locations in protoplanetary discs. We develop a model based on the Monte Carlo approach to simulate locally the coagulation and fragmentation of icy dust particles and investigate different designs for their structure and response to sublimation. Our main finding is that the evolution of dust grains located between the quiescent and outburst water snowlines is driven by significant changes in composition and porosity. The time required for the dust population to recover from the outburst and return to a coagulation/fragmentation equilibrium depends on the complex interplay of coagulation physics and outburst properties, and can take up to 4500 yr at 5 au. Pebble-sized particles, the building blocks of planetesimals, are either deprecated in water ice or completely destroyed, respectively resulting in drier planetesimals or halting their formation altogether. When accretion outbursts are frequent events, the dust can be far from collisional equilibrium for a significant fraction of time, offering opportunities to track past outbursts in discs at millimetre wavelengths. Our results highlight the importance of including accretion outbursts in models of dust coagulation and planet formation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11318v1"
    ],
    "publication_venue": "21 pages, 14 figures, accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad866"
}