{
    "arxiv_id": "2303.07871",
    "paper_title": "Probing Interface of Perovskite Oxide Using Surface-specific Terahertz Spectroscopy",
    "authors": [
        "Yudan Su",
        "Jiaming Le",
        "Junying Ma",
        "Long Cheng",
        "Yuxuan Wei",
        "Xiaofang Zhai",
        "Chuanshan Tian"
    ],
    "submission_date": "2023-03-13",
    "revised_dates": [],
    "latest_version": 1,
    "categories": [
        "physics.optics"
    ],
    "abstract": "The surface/interface species in perovskite oxides play an essential role in\nmany novel emergent physical phenomena and chemical processes. With low\neigen-energy in the terahertz region, such species at buried interfaces remain\npoorly understood due to the lack of feasible experimental techniques. Here, we\nshow that vibrational resonances and two-dimensional electron gas at the\ninterface can be characterized using surface-specific nonlinear spectroscopy in\nthe terahertz range. This technique uses intra-pulse difference frequency\nmixing (DFM) process, which is allowed only at surface/interface of a medium\nwith inversion symmetry. Sub-monolayer sensitivity can be achieved using the\nstate-of-the-art detection scheme for the terahertz emission from\nsurface/interface. As a demonstration, Drude-like nonlinear response from the\ntwo-dimensional electron gas emerging at LaAlO3/SrTiO3 or Al2O3/ SrTiO3\ninterface was successfully observed. Meanwhile, the interfacial vibrational\nspectrum of the ferroelectric soft mode of SrTiO3 at 2.8 THz was also obtained\nthat was polarized by the surface field in the interfacial region. The\ncorresponding surface/interface potential, which is a key parameter for\nSrTiO3-based interface superconductivity and photocatalysis, can now be\ndetermined optically via quantitative analysis on the polarized phonon\nspectrum. The interfacial species with resonant frequencies in the THz region\nrevealed by our method provide more insights into the understanding of physical\nproperties of complex oxides.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07871v1"
    ],
    "publication_venue": "arXiv admin note: substantial text overlap with arXiv:2207.14610"
}