{
    "arxiv_id": "2303.08579",
    "paper_title": "High spin-polarization in a disordered novel quaternary Heusler alloy FeMnVGa",
    "authors": [
        "Shuvankar Gupta",
        "Sudip Chakraborty",
        "Vidha Bhasin",
        "Santanu Pakhira",
        "Shovan Dan",
        "Celine Barreteau",
        "Jean-Claude Crivello",
        "S. N. Jha",
        "Maxim Avdeev",
        "Jean Marc Greneche",
        "Dibyendu Bhattacharyya",
        "Eric Alleno",
        "Chandan Mazumdar"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-07-26"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el"
    ],
    "abstract": "In this work, we report the successful synthesis of a Fe-based novel half-metallic quaternary Heusler alloy FeMnVGa and its structural, magnetic and transport properties probed through different experimental methods and theoretical technique. Density functional theory (DFT) calculations performed on different types of structure reveal that Type-2 ordered structure (space group: F-43m, Ga at 4a, V at 4b, Mn at 4c and Fe at 4d) possess minimum energy among all the ordered variants. Ab-initio simulations in Type 2 ordered structure further reveal that the compound is half-metallic ferromagnet (HMF) having a large spin-polarization (89.9 %). Neutron diffraction reveal that the compound crystalizes in disordered Type-2 structure (space group: Fm-3m) in which Ga occupy at 4a, V at 4b and Fe/Mn occupy 4c/4d sites with 50:50 proportions. The structural disorder is further confirmed by X-ray diffraction (XRD), extended X-ray absorption fine structure (EXAFS),57Fe Mossbauer spectrometry results and DFT calculations. Magnetisation studies suggest that the compound orders ferromagnetically below TC ~ 293 K and the saturation magnetization follows Slater-Pauling rule. Mossbauer spectrometry, along with neutron diffraction suggest that Mn is the major contributor to the total magnetism in the compound consistent with the theoretical calculations. First principle calculations indicate that spin-polarization remain high (81.3 %) even in the presence of such large atomic disorder. The robustness of the HMF property in presence of disorder is a quite unique characteristic over other reported HMF in literature and make this compound quiet promising for spintronics applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08579v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevB.108.045137"
}