{
    "arxiv_id": "2303.15515",
    "paper_title": "Binary black hole mergers from Population III stars: uncertainties from star formation and binary star properties",
    "authors": [
        "Filippo Santoliquido",
        "Michela Mapelli",
        "Giuliano Iorio",
        "Guglielmo Costa",
        "Simon C. O. Glover",
        "Tilman Hartwig",
        "Ralf S. Klessen",
        "Lorenzo Merli"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-07-20"
    ],
    "latest_version": 3,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE",
        "astro-ph.SR"
    ],
    "abstract": "Population III (Pop. III) binary stars likely produced the first stellar-born binary black hole (BBH) mergers in the Universe. Here, we quantify the main sources of uncertainty for the merger rate density evolution and mass spectrum of Pop. III BBHs by considering four different formation histories and 11 models of the initial orbital properties of Pop. III binary stars. The uncertainty on the orbital properties affects the BBH merger rate density by up to two orders of magnitude, models with shorter orbital periods leading to higher BBH merger rates. The uncertainty on the star formation history has a substantial impact on both the shape and the normalisation of the BBH merger rate density: the peak of the merger rate density shifts from $z\\sim{8}$ up to $z\\sim{16}$ depending on the assumed star formation rate, while the maximum BBH merger rate density for our fiducial binary population model spans from $\\sim{2}$ to $\\sim{30}$ Gpc$^{-3}$ yr$^{-1}$. The typical BBH masses are not affected by the star formation rate model and only mildly influenced by the binary population parameters. The primary black holes born from Pop. III stars tend to be rather massive ($30-40$ M$_\\odot$) with respect to those born from metal-rich stars ($8-10$ M$_\\odot$). We estimate that the Einstein Telescope will detect $10-10^4$ Pop. III BBH mergers per year, depending on the star formation history and binary star properties.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15515v1",
        "http://arxiv.org/pdf/2303.15515v2",
        "http://arxiv.org/pdf/2303.15515v3"
    ],
    "publication_venue": "19 pages, 20 figures, 1 table. Comments are welcome. Published in MNRAS",
    "doi": "10.1093/mnras/stad1860"
}