{
    "arxiv_id": "2303.09778",
    "paper_title": "SE-GSL: A General and Effective Graph Structure Learning Framework through Structural Entropy Optimization",
    "authors": [
        "Dongcheng Zou",
        "Hao Peng",
        "Xiang Huang",
        "Renyu Yang",
        "Jianxin Li",
        "Jia Wu",
        "Chunyang Liu",
        "Philip S. Yu"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cs.AI"
    ],
    "abstract": "Graph Neural Networks (GNNs) are de facto solutions to structural data learning. However, it is susceptible to low-quality and unreliable structure, which has been a norm rather than an exception in real-world graphs. Existing graph structure learning (GSL) frameworks still lack robustness and interpretability. This paper proposes a general GSL framework, SE-GSL, through structural entropy and the graph hierarchy abstracted in the encoding tree. Particularly, we exploit the one-dimensional structural entropy to maximize embedded information content when auxiliary neighbourhood attributes are fused to enhance the original graph. A new scheme of constructing optimal encoding trees is proposed to minimize the uncertainty and noises in the graph whilst assuring proper community partition in hierarchical abstraction. We present a novel sample-based mechanism for restoring the graph structure via node structural entropy distribution. It increases the connectivity among nodes with larger uncertainty in lower-level communities. SE-GSL is compatible with various GNN models and enhances the robustness towards noisy and heterophily structures. Extensive experiments show significant improvements in the effectiveness and robustness of structure learning and node representation learning.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09778v1"
    ],
    "publication_venue": "12 pages,5 figures, accepted by WWW2023",
    "doi": "10.1145/3543507.3583453"
}