{
    "arxiv_id": "2303.11940",
    "paper_title": "$2$-proper holomorphic images of classical Cartan domains",
    "authors": [
        "Gargi Ghosh",
        "Włodzimierz Zwonek"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-11-17"
    ],
    "latest_version": 3,
    "categories": [
        "math.CV"
    ],
    "abstract": "Motivated by the way two special domains, namely the symmetrized bidisc and the tetrablock, could be defined as the images of $2$-proper holomorphic images of classical Cartan domains, we present a general approach to study $2$-proper holomorphic images of bounded symmetric domains. We show some special properties of $2$-proper holomorphic maps (such as the construction of some idempotent automorphisms etc.) and enlist possible domains (up to biholomorphisms) which arise as $2$-proper holomorphic images of bounded symmetric domains. This leads us to a consideration of a new family of domains $\\mathbb L_n$ for $n\\geq 2.$ Let $L_n$ be an irreducible classical Cartan domain of type $IV$ (Lie ball) of dimension $n$ and $Λ_n : L_n \\to Λ_n (L_n):=\\mathbb L_n$ be the natural proper holomorphic mapping of multiplicity $2.$ It turns out that $\\mathbb L_2$ and $\\mathbb L_3$ are biholomorphic to the symmetrized bidisc and the tetrablock, respectively. In this article, we study function geometric properties of the family $\\{\\mathbb L_n : n \\geq 2\\}$ in a unified manner and thus extend results of many earlier papers on analogous properties of the symmetrized bidisc and the tetrablock. We show that $\\mathbb L_n$ cannot be exhausted by domains biholomorhic to any convex domains. Any proper holomorphic self-mapping of $\\mathbb L_n$ is an automorphism for $n \\geq 3.$ Moreover, the automorphism group ${\\rm Aut}(\\mathbb L_n)$ is isomorphic to ${\\rm Aut}( L_{n-1})$ and $\\mathbb L_n$ is inhomogeneous for $n\\geq3$. Additionally, we prove that $\\mathbb L_n$ is not a Lu Qi-Keng domain for $n \\geq 3.$",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11940v1",
        "http://arxiv.org/pdf/2303.11940v2",
        "http://arxiv.org/pdf/2303.11940v3"
    ],
    "publication_venue": "26 pages, to appear in Indiana Univ. Math. J"
}