{
    "arxiv_id": "2303.15321",
    "paper_title": "Changes in service distances of urban parks before and after the COVID-19 Pandemic: Applying a modified gravity model for Seoul Metropolitan Area",
    "authors": [
        "Dawon Oh",
        "In Kwon Park"
    ],
    "submission_date": "2023-03-04",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.soc-ph"
    ],
    "abstract": "COVID-19 significantly has changed the lifestyle in the urban areas. Urban parks reemerged as a savior of leisure activities and social joints under strict social-distancing measures. Thus, there have been significant changes in the thresholds of service distances of urban parks: People have become more willing to visit parks in farther areas. This paper aims to examine the difference between before and after the COVID-19 pandemic by applying a gravity model. We examine variations in the service areas of urban parks, dependig on the accessibility and design components of the park, using a dataset consisting of the park visitor's 'origin (home)' and 'destination (park)'. This LBD (Location-based Big Data) provides the home location of the urban park visitor. The data was constructed by SK Telecom, using individual smartphone signal data on a daily basis. Adjusted coefficients are estimated by OLS(ordinary least squares) with cluster-robust standard errors to compare the difference between 2019 and 2020. Contrary to a common belief, the transit accessibility of the park plays a more significant role than the physical traits of each parks. Accessibility itself determines a lot of the threshold distance of the park visit. While previous studies have identified the factors influencing the reaching distance of park services, this study also attempts to determine how the effects of the factors have changed due to the COVID-19 pandemic. As proven in this study, the marginal effects of those factors vary before and after the pandemic. By identifying the factors that determine the distance to visit in urban parks, it is possible to see which factors should be more focused on in planning small parks for residents in the neighborhood or large parks for more visitors from the entire region.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15321v1"
    ],
    "publication_venue": "Proceedings of 2021 International Conference of Asia-Pacific Planning Societies"
}