{
    "arxiv_id": "2303.10569",
    "paper_title": "Scattering for wave equations with sources close to the lightcone and prescribed radiation fields",
    "authors": [
        "Hans Lindblad",
        "Volker Schlue"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-04-28"
    ],
    "latest_version": 4,
    "categories": [
        "math.AP"
    ],
    "abstract": "We construct solutions with prescribed radiation fields for wave equations with polynomially decaying sources close to the lightcone. In this setting, which is motivated by semi-linear wave equations satisfying the weak null condition, solutions to the forward problem have a logarithmic leading order term on the lightcone and non-trivial homogeneous asymptotics in the interior of the lightcone. The backward scattering solutions we construct are given to second order by explicit asymptotic solutions in the wave zone, and in the interior of the light cone which satisfy novel matching conditions. In the process we find novel compatibility conditions for the scattering data at null infinity.\n  We also relate the asymptotics of the radiation field towards space-like infinity to explicit homogeneous solutions in the exterior of the light cone. This is the setting of slowly polynomially decaying data corresponding to mass, charge and angular momentum in applications. We show that homogeneous data of degree minus one and minus two for the wave equation results in the same logarithmic terms on the lightcone and homogeneous asymptotics in the interior as for the equations with sources close to the lightcone. The proof requires a delicate analysis of the forward solution close to the light cone and uses the invertibility of the Funk transform.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10569v1",
        "http://arxiv.org/pdf/2303.10569v2",
        "http://arxiv.org/pdf/2303.10569v3",
        "http://arxiv.org/pdf/2303.10569v4"
    ],
    "publication_venue": "v2: Theorem 1.5 and Section 7 added; v3: Extended Section 1.3 to include applications and updated references; v4: Improved Theorem 1.5, Remarks added, Notation in Section 7 changed, 50 pages, 3 figures"
}