{
    "arxiv_id": "2303.07927",
    "paper_title": "Examining the impacts of privacy awareness on user's self-disclosure on social media",
    "authors": [
        "Kijung Lee",
        "Prudence Attablayo"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [],
    "latest_version": 1,
    "categories": [
        "cs.SI",
        "cs.HC"
    ],
    "abstract": "This research aims to investigate the impact of users' privacy awareness on\ntheir self-disclosing behavior. Our primary research question is to investigate\nhow young social media users feel about the benefits and risks of disclosing\nthem-selves on social media and how risk-benefit awareness influences the\nassess-ment of their self-disclosure. Based on the data we recorded, the factor\nanalysis, and three-way ANOVA, we conclude that users who know more about\nprivacy benefits share more on social media (F= 36.291; df 1; sig < .001) while\nthose who know less about the benefits disclose less on social media. According\nto the analysis, users who know more about self-disclosure risks share less on\nso-cial media (F= 7.001; df 1; sig < .001). Users disclose less information on\nso-cial media platforms based on the different levels of their risk perceptions\n(df 3, F=.715, sig < 0.5). This indicates that risks on social media platforms\nvary to some degree. We saw that people's sharing habits based on their levels\nof risk, benefits, and social media platforms can vary. One thing that remained\ncertain was users' main benefit for engaging and disclosing on social media is\ntheir need to stay in touch with friends and their need for community. On the\nflip side, the main risk was the need not to be impersonated and misunderstood\nby people. Based on a simple frequency analysis of the open-ended questions we\nasked In our data collection, the most highlighted words in our responses were\n\"people\" and \"friends\". These were the two main words that stood out in all the\ndata we collected concerning the benefits, risks, and intention to\nself-disclose.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07927v1"
    ],
    "publication_venue": null
}