{
    "arxiv_id": "2303.11368",
    "paper_title": "A Bayesian Approach To The Halo-Galaxy-SMBH Connection Through Cosmic Time",
    "authors": [
        "Christopher Boettner",
        "Maxime Trebitsch",
        "Pratika Dayal"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2024-12-19"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
    ],
    "abstract": "We study the co-evolution of dark matter halos, galaxies and supermassive black holes using an empirical galaxy evolution model from $z=0$ -- $10$. We demonstrate that by connecting dark matter structure evolution with simple empirical prescriptions for baryonic processes, we are able to faithfully reproduce key observations in the relation between galaxies and their supermassive black holes. By assuming a physically-motivated, direct relationship between the galaxy and supermassive black hole properties to the mass of their host halo, we construct expressions for the galaxy stellar mass function, galaxy UV luminosity function, active black hole mass function and quasar bolometric luminosity function. We calibrate the baryonic prescriptions using a fully Bayesian approach in order to reproduce observed population statistics. The obtained parametrizations are then used to study the relation between galaxy and black hole properties, as well as their evolution with redshift. The galaxy stellar mass -- UV luminosity relation, black hole mass -- stellar mass relation, black hole mass -- AGN luminosity relation, and redshift evolution of these quantities obtained from the model are qualitatively consistent with observations. Based on these results, we present upper limits on the expected number of sources for $z=5$ up to $z=15$ for scheduled JWST and \\textit{Euclid} surveys, thus showcasing that empirical models can offer qualitative as well as quantitative prediction in a fast, easy and flexible manner that complements more computationally expensive approaches.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11368v1",
        "http://arxiv.org/pdf/2303.11368v2"
    ],
    "publication_venue": "25 pages, 25 figures, data and code availability specified in text, accepted by A&A"
}