{
    "arxiv_id": "2303.14248",
    "paper_title": "A geometric analysis of the impact of large but finite switching rates on vaccination evolutionary games",
    "authors": [
        "Rossella Della Marca",
        "Alberto d'Onofrio",
        "Mattia Sensi",
        "Sara Sottile"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-11-06"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.PE",
        "math.DS"
    ],
    "abstract": "In contemporary society, social networks accelerate decision dynamics causing a rapid switch of opinions in a number of fields, including the prevention of infectious diseases by means of vaccines. This means that opinion dynamics can nowadays be much faster than the spread of epidemics. Hence, we propose a Susceptible-Infectious-Removed epidemic model coupled with an evolutionary vaccination game embedding the public health system efforts to increase vaccine uptake. This results in a global system ``epidemic model + evolutionary game''. The epidemiological novelty of this work is that we assume that the switching to the strategy ``pro vaccine'' depends on the incidence of the disease. As a consequence of the above-mentioned accelerated decisions, the dynamics of the system acts on two different scales: a fast scale for the vaccine decisions and a slower scale for the spread of the disease. Another, and more methodological, element of novelty is that we apply Geometrical Singular Perturbation Theory (GSPT) to such a two-scale model and we then compare the geometric analysis with the Quasi-Steady-State Approximation (QSSA) approach, showing a criticality in the latter. Later, we apply the GSPT approach to the disease prevalence-based model already studied in (Della Marca and d'Onofrio, Comm Nonl Sci Num Sim, 2021) via the QSSA approach by considering medium-large values of the strategy switching parameter.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14248v1"
    ],
    "publication_venue": "26 pages, 6 figures",
    "doi": "10.1016/j.nonrwa.2023.103986"
}