{
    "arxiv_id": "2303.12153",
    "paper_title": "Text2Motion: From Natural Language Instructions to Feasible Plans",
    "authors": [
        "Kevin Lin",
        "Christopher Agia",
        "Toki Migimatsu",
        "Marco Pavone",
        "Jeannette Bohg"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-11-21"
    ],
    "latest_version": 4,
    "categories": [
        "cs.RO"
    ],
    "abstract": "We propose Text2Motion, a language-based planning framework enabling robots to solve sequential manipulation tasks that require long-horizon reasoning. Given a natural language instruction, our framework constructs both a task- and motion-level plan that is verified to reach inferred symbolic goals. Text2Motion uses feasibility heuristics encoded in Q-functions of a library of skills to guide task planning with Large Language Models. Whereas previous language-based planners only consider the feasibility of individual skills, Text2Motion actively resolves geometric dependencies spanning skill sequences by performing geometric feasibility planning during its search. We evaluate our method on a suite of problems that require long-horizon reasoning, interpretation of abstract goals, and handling of partial affordance perception. Our experiments show that Text2Motion can solve these challenging problems with a success rate of 82%, while prior state-of-the-art language-based planning methods only achieve 13%. Text2Motion thus provides promising generalization characteristics to semantically diverse sequential manipulation tasks with geometric dependencies between skills.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12153v1",
        "http://arxiv.org/pdf/2303.12153v2",
        "http://arxiv.org/pdf/2303.12153v3",
        "http://arxiv.org/pdf/2303.12153v4"
    ],
    "publication_venue": "Published in Autonomous Robots, Special Issue: Large Language Models in Robotics 2023. Project page: https://sites.google.com/stanford.edu/text2motion. First two authors contributed equally",
    "doi": "10.1007/s10514-023-10131-7"
}