{
    "arxiv_id": "2303.14458",
    "paper_title": "Related or Unrelated Diversification: What is Smart Specialization?",
    "authors": [
        "Önder Nomaler",
        "Bart Verspagen"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "econ.GN"
    ],
    "abstract": "In this paper, we investigate the nature of the density metric, which is employed in the literature on smart specialization and the product space. We find that although density is supposed to capture relatedness between a country's current specialization pattern and potential products that it may diversify into, density is also correlated strongly to the level of diversification of the country, and (less strongly) to the ubiquity of the product. Together, diversity and ubiquity capture 93% of the variance of density. We split density into a part that corresponds to related variety, and a part that does not (i.e., unrelated variety). In regressions for predicting gain or loss of specialization, both these parts are significant. The relative influence of related variety increases with the level of diversification of the country: only countries that are already diversified show a strong influence of related variety. In our empirical analysis, we put equal emphasis on gains and losses of specialization. Our data show that the specializations that were lost by a country often represented higher product complexity than the specializations that were gained over the same period. This suggests that 'smart' specialization should be aimed at preserving (some) existing specializations in addition to gaining new ones. Our regressions indicate that the relative roles of related and unrelated variety for explaining loss of specialization are similar to the case of specialization gains. Finally, we also show that unrelated variety is also important in indicators that are derived from density, such as the Economic Complexity Outlook Index.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14458v1"
    ],
    "publication_venue": null
}