{
    "arxiv_id": "2303.16802",
    "paper_title": "Are Chebyshev-based stability analysis and Urabe's error bound useful features for Harmonic Balance?",
    "authors": [
        "Lukas Woiwode",
        "Malte Krack"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "math.DS",
        "math.NA"
    ],
    "abstract": "Harmonic Balance is one of the most popular methods for computing periodic solutions of nonlinear dynamical systems. In this work, we address two of its major shortcomings: First, we investigate to what extent the computational burden of stability analysis can be reduced by consistent use of Chebyshev polynomials. Second, we address the problem of a rigorous error bound, which, to the authors' knowledge, has been ignored in all engineering applications so far. Here, we rely on Urabe's error bound and, again, use Chebyshev polynomials for the computationally involved operations. We use the error estimate to automatically adjust the harmonic truncation order during numerical continuation, and confront the algorithm with a state-of-the-art adaptive Harmonic Balance implementation. Further, we rigorously prove, for the first time, the existence of some isolated periodic solutions of the forced-damped Duffing oscillator with softening characteristic. We find that the effort for obtaining a rigorous error bound, in its present form, may be too high to be useful for many engineering problems. Based on the results obtained for a sequence of numerical examples, we conclude that Chebyshev-based stability analysis indeed permits a substantial speedup. Like Harmonic Balance itself, however, this method becomes inefficient when an extremely high truncation order is needed as, e.g., in the presence of (sharply regularized) discontinuities.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16802v1"
    ],
    "publication_venue": "The final version of this article is available online at https://doi.org/10.1016/j.ymssp.2023.110265",
    "doi": "10.1016/j.ymssp.2023.110265"
}