{
    "arxiv_id": "2303.17024",
    "paper_title": "Symmetry-breaking singular controller design for Bogdanov-Takens bifurcations with an application to Chua system",
    "authors": [
        "Majid Gazor",
        "Nasrin Sadri"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "math.DS",
        "math.AP"
    ],
    "abstract": "We provide a complete symmetry-breaking bifurcation control for equivariant smooth differential systems with Bogdanov-Takens singularities. Controller coefficient space is partitioned by critical controller sets into different connected regions. The connected regions provide a classification for all qualitatively different dynamics of the controlled system. Hence, a state feedback controller design with four small controller coefficients is proposed for an efficient and full singular symmetry-breaking control. Our approach works well for nonlinear control systems with both controllable and uncontrollable linearizations. Origin is a primary equilibrium for the uncontrolled system. This gives rise to two secondary local equilibria for the controlled system. These equilibria further experience tertiary fold and hysteresis type bifurcations. The secondary and primary equilibria experience Hopf and Bautin bifurcations leading to the appearance of one limit cycle from primary equilibrium, and either one or two from each secondary equilibria. The collisions of limit cycles with equilibria lead to either a heteroclinic cycle or four different homoclinic cycles. Each pair of limit cycles may respectively merge together and disappear. This is a saddle-node bifurcation of limit cycles. Different combinations of these give rise to a rich list of bifurcation scenarios. Finite determinacy of each of these bifurcations has been thoroughly investigated. This greatly influences their stabilization potential in applications. We consider Chua system with a quadratic state-feedback controller. Controlled Chua system experiences a pitchfork bifurcation, three Hopf bifurcations and two homoclinic bifurcations. There exist two different regions of controller coefficient choices for feedback regularization and two nearby regions for supercritical Hopf stabilization approach.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17024v1"
    ],
    "publication_venue": null
}