{
    "arxiv_id": "2303.10313",
    "paper_title": "Single OR multi-site event discrimination of strip multi-electrode high purity germanium detector via pulse shape analysis method",
    "authors": [
        "Yang Jingzhe",
        "Zeng Zhi",
        "Dai Wenhan",
        "Yang Mingxin",
        "Tian Yang",
        "Jiang Lin",
        "Wen Jingjun",
        "Xue Tao",
        "Zeng Ming",
        "Li Yulan"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ins-det"
    ],
    "abstract": "In order to suppress the background in rare event detection experiments such as 0ν\\b{eta}\\b{eta}, this paper developed a set of single/multi-site event pulse shape discrimination methods suitable for strip multi-electrode high-purity germanium detectors. In the simulation of 228Th, this method achieves 7.92 times suppression of SEP events at 2103 keV with a 57.43 % survival rate of DEP events at 1592 keV. The experimental study of 57Co and 137Cs sources was carried out by using the self-developed strip multi-electrode high-purity germanium detector prototype measurement system and compared with the simulation results. The results show that the discrimination effect of the PSD method on the experimental waveform is relatively consistent with that of the simulated waveform. The PSD method was used to identify the 0ν\\b{eta}\\b{eta} background events of 76Ge. The survival rate of 0ν\\b{eta}\\b{eta} events was 49.16 %, while the main background events 68Ge and 60Co, were 36.23 times and 31.45 times, respectively. The background suppression effects of 232Th and 238U were 4.79 times and 5.06 times, respectively. The results show that the strip multi-electrode high-purity germanium detector can be used for single/multi-site event discrimination and background suppression research. This method is expected to be applied in the measurement of 0ν\\b{eta}\\b{eta} and other rare events in China Jinping Underground Laboratory in the future.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10313v1"
    ],
    "publication_venue": "10 pages,8 figures,3 talbes"
}