{
    "arxiv_id": "2303.13605",
    "paper_title": "Massive damage generation accompanying pyramidal slip in hexagonal-close packed magnesium: an origin for its high hardening and brittleness",
    "authors": [
        "Yizhe Tang"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.app-ph"
    ],
    "abstract": "Mg represents a group of technically important hexagonal-close packed (hcp) metals whose mechanical behaviors are very different from body-centered cubic (bcc) and face-centered cubic (fcc) metals and the underlying mechanisms remain poorly-understood. It has been long known that Mg has high hardening and low ductility, and this was conventionally attributed to the scarce of active pyramidal slip. Recently immobilization of pyramidal dislocations was proposed to be the origins. Here we present a different scenario that has hitherto never been reported for Mg: mobile screw pyramidal dislocations double cross-slip and continue to double cross-slip as they glide, generating abundant vacancy clusters on the slipped planes. These vacancy clusters hinder subsequent dislocation motion and thus directly result in hardening; their accumulation as plastic deformation proceeds eventually causes premature fracture, i.e. brittleness. The massive damage accompanying pyramidal slip discovered here provides a different explanation for the long known hardening and brittleness of Mg, and suggests that sufficient amount of pyramidal dislocations could still be insufficient to effectively accommodate plasticity. Stabilizing pyramidal dislocation motion to avoid cross-slip and subsequent damage generation is also essential for property-improvement. The instability of pyramidal slip, manifested as continuous cross-slip here (could be different elsewhere), originates from its huge Burgers vector and could be a common feature of its kind. The detailed cross-slip mechanism also provides insights into the poorly known instabilities and complicated behavior of dislocations in a broader range of crystals with low symmetry and/or large Burgers vectors, including other hcp metals and ceramics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13605v1"
    ],
    "publication_venue": "32 pages, 6 figures"
}