{
    "arxiv_id": "2303.10522",
    "paper_title": "Dislocation distribution, crystallographic texture evolution and plastic inhomogeneity of Inconel 718 fabricated by laser powder-bed fusion",
    "authors": [
        "Jalal Al-Lami",
        "Thibaut Dessolier",
        "Talha Pirzada",
        "Minh-Son Pham"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Plastic inhomogeneity, particularly localised strain, is one of the main mechanisms responsible for failures in engineering alloys. This work studied the spatial arrangement and distribution of microstructure and their influence in the plastic inhomogeneity of Inconel 718 fabricated by additive manufacturing (AM). In particular, the density and spatial distribution of geometrically necessary dislocations (GNDs) and the crystallographic texture components were examined in relation to the spatial plastic deformation. In-situ tensile testing coupled with microscopy and EBSD was performed to understand the evolution of the as-built microstructure and its effect on the spatial and temporal deformation behaviour. Bidirectional scan strategy with no interlayer rotation resulted in highly ordered alternating arrangements of coarse Goss-like {110}<001> textured grains separated by fine Cube-like {100}<001> textured grains. This strategy also resulted in an overall high density of dislocations (in particular GNDs) with a regular pattern: the fine grains contained very high GND density while the coarse grains contained less GNDs but they were oriented to be perpendicular to the scan direction. Although this strategy resulted in a dominant Cube texture that is desirable for isotropy, the Cube texture gradually weakened and the undesirable Goss component increased during plastic deformation. Together with the columnar grain morphology and aligned GND arrangement, such texture evolution caused intense plastic inhomogeneity during deformation. Replacing the bidirectional strategy with a chessboard strategy involving a 67° layer rotation resulted in a lower GND density and much more random distribution of crystallographic texture and GNDs, with a dominant Cube component (and lower Goss texture) that remained stable throughout plastic deformation, reducing the plastic inhomogeneity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10522v1"
    ],
    "publication_venue": null
}