{
    "arxiv_id": "2303.15618",
    "paper_title": "Revisiting Emission-Line Measurement Methods for Narrow-Line Active Galactic Nuclei",
    "authors": [
        "Viraja C. Khatu",
        "Sarah C. Gallagher",
        "Keith Horne",
        "Edward M. Cackett",
        "Chen Hu",
        "Pu Du",
        "Jian-Min Wang",
        "Wei-Hao Bian",
        "Jin-Ming Bai",
        "Yong-Jie Chen",
        "Patrick Hall",
        "Bo-Wei Jiang",
        "Sha-Sha Li",
        "Yan-Rong Li",
        "Sofia Pasquini",
        "Yu-Yang Songsheng",
        "Chan Wang",
        "Ming Xiao",
        "Zhe Yu"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
    ],
    "abstract": "Measuring broad emission-line widths in active galactic nuclei (AGN) is not straightforward owing to the complex nature of flux variability in these systems. Line-width measurements become especially challenging when signal-to-noise is low, profiles are narrower, or spectral resolution is low. We conducted an extensive correlation analysis between emission-line measurements from the optical spectra of Markarian 142 (Mrk 142; a narrow-line Seyfert galaxy) taken with the Gemini North Telescope (Gemini) at a spectral resolution of 185.6+\\-10.2 km/s and the Lijiang Telescope (LJT) at 695.2+\\-3.9 km/s to investigate the disparities in the measured broad-line widths from both telescope data. Mrk~142 posed a challenge due to its narrow broad-line profiles, which were severely affected by instrumental broadening in the lower-resolution LJT spectra. We discovered that allowing the narrow-line flux of permitted lines having broad and narrow components to vary during spectral fitting caused a leak in the narrow-line flux to the broad component, resulting in broader broad-line widths in the LJT spectra. Fixing the narrow-line flux ratios constrained the flux leak and yielded the Hydrogen-beta broad-line widths from LJT spectra $\\sim$54\\% closer to the Gemini Hydrogen-beta widths than with flexible narrow-line ratios. The availability of spectra at different resolutions presented this unique opportunity to inspect how spectral resolution affected emission-line profiles in our data and adopt a unique method to accurately measure broad-line widths. Reconsidering line-measurement methods while studying diverse AGN populations is critical for the success of future reverberation-mapping studies. Based on the technique used in this work, we offer recommendations for measuring line widths in narrow-line AGN.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15618v1"
    ],
    "publication_venue": "14 pages, 9 figures, accepted for publication in PASP",
    "doi": "10.1088/1538-3873/acc973"
}