{
    "arxiv_id": "2303.10238",
    "paper_title": "Observation of a Prethermal $U(1)$ Discrete Time Crystal",
    "authors": [
        "Andrew Stasiuk",
        "Paola Cappellaro"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.dis-nn",
        "quant-ph"
    ],
    "abstract": "A time crystal is a state of periodically driven matter which breaks discrete time translation symmetry. Time crystals have been demonstrated experimentally in various programmable quantum simulators and exemplify how non-equilibrium, driven quantum systems can exhibit intriguing and robust properties absent in systems at equilibrium. These robust driven states need to be stabilized by some mechanism, with the preeminent candidates being many-body localization and prethermalization. This introduces additional constraints that make it challenging to experimentally observe time crystallinity in naturally occurring systems. Recent theoretical work has developed the notion of prethermalization \\textit{without temperature}, expanding the class of time crystal systems to explain time crystalline observations at (or near) infinite temperature. In this work, we conclusively observe the emergence of a prethermal $U(1)$ time crystalline state at quasi-infinite temperature in a solid-state NMR quantum emulator by verifying the requisites of prethermalization without temperature. In addition to observing the signature period-doubling behavior, we show the existence of a long-lived prethermal regime whose lifetime is significantly enhanced by strengthening an emergent $U(1)$ conservation law. Not only do we measure this enhancement through the global magnetization, but we also exploit on-site disorder to measure local observables, ruling out the possibility of many-body localization and confirming the emergence of long-range correlations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10238v1"
    ],
    "publication_venue": "12 pages"
}