{
    "arxiv_id": "2303.08361",
    "paper_title": "Towards Cooperative Federated Learning over Heterogeneous Edge/Fog Networks",
    "authors": [
        "Su Wang",
        "Seyyedali Hosseinalipour",
        "Vaneet Aggarwal",
        "Christopher G. Brinton",
        "David J. Love",
        "Weifeng Su",
        "Mung Chiang"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cs.DC",
        "cs.LG",
        "cs.NI",
        "eess.SY"
    ],
    "abstract": "Federated learning (FL) has been promoted as a popular technique for training machine learning (ML) models over edge/fog networks. Traditional implementations of FL have largely neglected the potential for inter-network cooperation, treating edge/fog devices and other infrastructure participating in ML as separate processing elements. Consequently, FL has been vulnerable to several dimensions of network heterogeneity, such as varying computation capabilities, communication resources, data qualities, and privacy demands. We advocate for cooperative federated learning (CFL), a cooperative edge/fog ML paradigm built on device-to-device (D2D) and device-to-server (D2S) interactions. Through D2D and D2S cooperation, CFL counteracts network heterogeneity in edge/fog networks through enabling a model/data/resource pooling mechanism, which will yield substantial improvements in ML model training quality and network resource consumption. We propose a set of core methodologies that form the foundation of D2D and D2S cooperation and present preliminary experiments that demonstrate their benefits. We also discuss new FL functionalities enabled by this cooperative framework such as the integration of unlabeled data and heterogeneous device privacy into ML model training. Finally, we describe some open research directions at the intersection of cooperative edge/fog and FL.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08361v1"
    ],
    "publication_venue": "This paper has been accepted for publication in IEEE Communications Magazine"
}