{
    "arxiv_id": "2303.14347",
    "paper_title": "Vision-based Vineyard Navigation Solution with Automatic Annotation",
    "authors": [
        "Ertai Liu",
        "Josephine Monica",
        "Kaitlin Gold",
        "Lance Cadle-Davidson",
        "David Combs",
        "Yu Jiang"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.RO",
        "cs.CV"
    ],
    "abstract": "Autonomous navigation is the key to achieving the full automation of agricultural research and production management (e.g., disease management and yield prediction) using agricultural robots. In this paper, we introduced a vision-based autonomous navigation framework for agriculture robots in trellised cropping systems such as vineyards. To achieve this, we proposed a novel learning-based method to estimate the path traversibility heatmap directly from an RGB-D image and subsequently convert the heatmap to a preferred traversal path. An automatic annotation pipeline was developed to form a training dataset by projecting RTK GPS paths collected during the first setup in a vineyard in corresponding RGB-D images as ground-truth path annotations, allowing a fast model training and fine-tuning without costly human annotation. The trained path detection model was used to develop a full navigation framework consisting of row tracking and row switching modules, enabling a robot to traverse within a crop row and transit between crop rows to cover an entire vineyard autonomously. Extensive field trials were conducted in three different vineyards to demonstrate that the developed path detection model and navigation framework provided a cost-effective, accurate, and robust autonomous navigation solution in the vineyard and could be generalized to unseen vineyards with stable performance.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14347v1"
    ],
    "publication_venue": "Submission to IROS 2023"
}