{
    "arxiv_id": "2303.09763",
    "paper_title": "Vortex Dynamics: A Variational Approach Using the Principle of Least Action",
    "authors": [
        "Nabil M. Khalifa",
        "Haithem E. Taha"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "The study of vortex dynamics using a variational formulation has an extensive history and a rich literature. The standard Hamiltonian function that describes the dynamics of interacting point vortices of constant strength is the Kirchhoff-Routh (KR) function. This function was not obtained from basic definitions of classical mechanics (i.e., in terms of kinetic and potential energies), but it was rather devised to match the already known differential equations of motion for constant-strength point vortices given by the Bio-Savart law. Instead, we develop a new variational formulation for vortex dynamics based on the principle of least action. As an application, we consider a system of non-deforming, free vortex patches of constant-strength. Interestingly, the obtained equations of motion are second-order differential equations defining vortex accelerations, not velocities. In the special case of constant-strength point vortices, the new formulation reduces to the motion determined from the KR function. However, for finite-core vortices, the resulting dynamics are more complex than those obtained from the KR formulation. For example, a pair of equal-strength, counter-rotating vortices could be initialized with different velocities, resulting in interesting patterns which cannot be handled by the KR approach. Also, the developed model easily admits external body forces (e.g., electromagnetic). The interaction between the electrodynamic force and the hydrodynamic vortex force leads to a rich, counter-intuitive behavior that could not be handled by the KR formulation. Finally, this new variational formulation, which is derived from first principles in mechanics, can be easily extended to deforming and/or arbitrary time-varying vortices.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09763v1"
    ],
    "publication_venue": null
}