{
    "arxiv_id": "2303.09064",
    "paper_title": "Rethinking the U-Net, ResUnet, and U-Net3+ architectures with dual skip connections for building footprint extraction",
    "authors": [
        "Bipul Neupane",
        "Jagannath Aryal",
        "Abbas Rajabifard"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-07-04"
    ],
    "latest_version": 3,
    "categories": [
        "cs.CV",
        "eess.IV"
    ],
    "abstract": "The importance of building footprints and their inventory has been recognised as foundational spatial information for multiple societal problems. Extracting complex urban buildings involves the segmentation of very high-resolution (VHR) earth observation (EO) images. U-Net is a common deep learning network and foundation for its new incarnations like ResUnet, U-Net++ and U-Net3+ for such segmentation. The re-incarnations look for efficiency gain by re-designing the skip connection component and exploiting the multi-scale features in U-Net. However, skip connections do not always improve these networks and removing some of them provides efficiency gains and reduced network parameters. In this paper, we propose three dual skip connection mechanisms for U-Net, ResUnet, and U-Net3+. These mechanisms deepen the feature maps forwarded by the skip connections and allow us to study which skip connections need to be denser to yield the highest efficiency gain. The mechanisms are evaluated on feature maps of different scales in the three networks, producing nine new network configurations. The networks are evaluated against their original vanilla versions using four building footprint datasets (three existing and one new) of different spatial resolutions: VHR (0.3m), high-resolution (1m and 1.2m), and multi-resolution (0.3+0.6+1.2m). The proposed mechanisms report efficiency gain on four evaluation measures for U-Net and ResUnet, and up to 17.7% and 18.4% gain in F1 score and Intersection over Union (IoU) for U-Net3+. The codes will be available in a GitHub link after peer review.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09064v1",
        "http://arxiv.org/pdf/2303.09064v2",
        "http://arxiv.org/pdf/2303.09064v3"
    ],
    "publication_venue": "This work has been submitted to Wiley for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible"
}