{
    "arxiv_id": "2303.17407",
    "paper_title": "Exploring the possible evolution of the mass density power-law index of strong gravitational lenses with a model-independent method",
    "authors": [
        "Jian Hu"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-05-08"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "In this work, we adopt a cosmological model-independent approach for the first time to test the question of whether the mass density power-law index($γ$) of the strong gravitational lensing system(SGLS) evolves with redshift, and the JLA SNe Ia sample and the quasar sample from Risaliti \\& Lusso (2019) are used to provide the luminosity distances to be calibrated. Our work is based on the flat universe assumption and the cosmic distance duality relation. A reliable data-matching method is used to pair SGLS-SNe and SGLS-quasar. By using the maximum likelihood method to constrain the luminosity distance and $γ$ index, we obtain the likelihood function values for the evolved and non-evolved cases, and then use the Akaike weights and the BIC selection weights to compare the advantages and disadvantages of these two cases. We find that the $γ$ index is slightly more likely to be a non-evolutionary model for $γ=2$ in the case of the currently used samples with low redshift ($z_l<\\sim$0.66). With Akaike weights, the relative probability is 66.3\\% versus 33.7\\% and 69.9\\% versus 30.1\\% for the SGLS+SNe Ia sample and SGLS+quasar sample, respectively, and with BIC selection weights, the relative probability is 87.4\\% versus 12.6\\% and 52.0\\% versus 48.0\\% for the two samples. In the evolving case for the relatively low redshift lens (SGLS+SNe Ia), with redshift 0.0625 to 0.659, $γ= 2.058^{+0.041}_{-0.040}-0.136^{+0.163}_{-0.165}z$. At high redshift (SGLS+quasar ), with redshift 0.0625 to 1.004, $γ= 2.051^{+0.076}_{-0.077}-0.171^{+0.214}_{-0.196}z$. Although not the more likely model, this evolved $γ$ case also fits the data well, with a negative and mild evolution for both low and high redshift samples.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17407v1"
    ],
    "publication_venue": "9 pages, 7 figures",
    "doi": "10.3847/1538-4357/acc9aa"
}