{
    "arxiv_id": "2303.15991",
    "paper_title": "Efficient Parallel Split Learning over Resource-constrained Wireless Edge Networks",
    "authors": [
        "Zheng Lin",
        "Guangyu Zhu",
        "Yiqin Deng",
        "Xianhao Chen",
        "Yue Gao",
        "Kaibin Huang",
        "Yuguang Fang"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-04-10"
    ],
    "latest_version": 3,
    "categories": [
        "cs.LG"
    ],
    "abstract": "The increasingly deeper neural networks hinder the democratization of privacy-enhancing distributed learning, such as federated learning (FL), to resource-constrained devices. To overcome this challenge, in this paper, we advocate the integration of edge computing paradigm and parallel split learning (PSL), allowing multiple client devices to offload substantial training workloads to an edge server via layer-wise model split. By observing that existing PSL schemes incur excessive training latency and large volume of data transmissions, we propose an innovative PSL framework, namely, efficient parallel split learning (EPSL), to accelerate model training. To be specific, EPSL parallelizes client-side model training and reduces the dimension of local gradients for back propagation (BP) via last-layer gradient aggregation, leading to a significant reduction in server-side training and communication latency. Moreover, by considering the heterogeneous channel conditions and computing capabilities at client devices, we jointly optimize subchannel allocation, power control, and cut layer selection to minimize the per-round latency. Simulation results show that the proposed EPSL framework significantly decreases the training latency needed to achieve a target accuracy compared with the state-of-the-art benchmarks, and the tailored resource management and layer split strategy can considerably reduce latency than the counterpart without optimization.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15991v1",
        "http://arxiv.org/pdf/2303.15991v2",
        "http://arxiv.org/pdf/2303.15991v3"
    ],
    "publication_venue": "15 pages, 13 figures"
}