{
    "arxiv_id": "2303.16933",
    "paper_title": "MUSEQuBES: Mapping the distribution of neutral hydrogen around low-redshift galaxies",
    "authors": [
        "Sayak Dutta",
        "Sowgat Muzahid",
        "Joop Schaye",
        "Sapna Mishra",
        "Hsiao-Wen Chen",
        "Sean Johnson",
        "Lutz Wisotzki",
        "Sebastiano Cantalupo"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present a detailed study of cool, neutral gas traced by Lya around 4595 z<0.5 galaxies using stacks of background quasar spectra. The galaxies are selected from our MUSEQuBES low-z survey along with data from the literature. These galaxies, with a median stellar mass of log (M*/Msun)= 10.0, are probed by 184 background quasars giving rise to 5054 quasar-galaxy pairs. The median impact parameter is b = 1.5 pMpc (median b/Rvir=10.4) with 204 (419) quasar-galaxy pairs probing b/Rvir < 1 (2). We find excess absorption out to at least ~ 15 Rvir transverse distance and ~ 600 km/s along the line of sight. We show that the median stacked profile for the full sample, dominated by the pairs with b > Rvir, can be explained by a galaxy-absorber two-point correlation function with r0 = 6.7 pMpc and gamma = -1.57. There are strong indications that the inner regions (< Rvir) of the rest equivalent width profile are better explained by a log-linear (or a Gaussian) relation whereas the outer regions are well described by a power-law, consistent with galaxy-absorber large-scale clustering. Using a sub-sample of 339 galaxies (442 quasar-galaxy pairs, median b/Rvir = 1.6) with star formation rate measurements, we find that the Lya absorption is significantly stronger for star-forming galaxies compared to passive galaxies, but only within the virial radius. The Lya absorption at b ~ Rvir for a redshift-controlled sample peaks at M* ~ 10^9 Msun~ (Mhalo ~ 10^11 Msun).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16933v1"
    ],
    "publication_venue": "21 pages +3 pages appendix. 12 figures + 2 figures in appendix. Submitted to MNRAS. Comments welcome"
}