{
    "arxiv_id": "2303.16124",
    "paper_title": "Search for lithium-rich giants in 32 open clusters with high-resolution spectroscopy",
    "authors": [
        "M. Tsantaki",
        "E. Delgado-Mena",
        "D. Bossini",
        "S. G. Sousa",
        "E. Pancino",
        "J. H. C. Martins"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "Lithium-rich giant stars are rare and their existence challenges our understanding of stellar structure and evolution. We profit from the high-quality sample gathered with HARPS and UVES, in order to search for Li-rich giants and to identify the Li enrichment mechanisms responsible. We derive stellar parameters for 247 stars belonging to 32 open clusters, with 0.07 Ga < ages < 3.6 Ga. We employed the spectral synthesis technique code FASMA for the abundance analysis of 228 stars from our sample. We also determined ages, distances, and extinction using astrometry and photometry from Gaia and PARSEC isochrones to constrain their evolutionary stage. Our sample covers a wide range of stellar masses from 1 to more than 6 solar masses where the majority of the masses are above 2 solar masses. We have found 14 canonical Li-rich giant stars which have experienced the first dredge-up. This corresponds to 6% of our total sample, which is higher than what is typically found for field stars. Apart from the canonical limit, we use the maximum Li abundance of the progenitor stars as a criterion for Li enrichment. We find Li enhancement also among eight stars which have passed the first dredge up and show strong Li lines based on the fact that stars at the same evolutionary stage in the same cluster have significantly different Li abundances. We confirm that giants with higher Li abundance correspond to a higher fraction of fast-rotating giants, suggesting a connection between Li enhancement and stellar rotation as predicted by stellar models. Our Li-rich giants are found in various evolutionary stages implying that no unique Li production mechanism is responsible for Li enrichment but rather different intrinsic or external mechanisms can be simultaneously at play.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16124v1"
    ],
    "publication_venue": "accepted in A&A, online data will be available in CDS",
    "doi": "10.1051/0004-6361/202244374"
}