{
    "arxiv_id": "2303.15674",
    "paper_title": "Predicted Performance Bounds of Thermochromism Assisted Photon Transport for Efficient Solar Thermal Energy Storage",
    "authors": [
        "Inderpreet Singh",
        "Vikrant Khullar"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "physics.optics"
    ],
    "abstract": "Efficient storage of solar thermal energy is still one of the major bottlenecks in realizing dispatchable solar thermal systems. Present work is a significant step in this direction, wherein, we propose, thermochromism assisted photon transport based optical charging for efficient latent heat storage. Seeding thermochromic nanoparticles into the phase change material (PCM) allows for dynamic control of PCM's optical properties - aiding deeper penetration of photons and hence significantly enhancing the photon-nanoparticle interactions. Moreover, carefully tailoring of transition temperature near the melting temperature allows for efficient non-radiative decay of the absorbed photon energy and that too under nearly thermostatic conditions. In particular, the present work serves to develop a mechanistic opto-thermal theoretical modelling framework to compute melting front progression, latent heat storage and sensible heat discharging capacities pertinent to thermochromism assisted photon transport. Moreover, to truly assess and quantify the benefits of the aforementioned charging route, a host of other possible charging routes (viz., thermal and non-thermochromic optical charging) have also been dealt with. Detailed analysis reveals that relative to the thermal charging route, thermochromism assisted optical charging offers significant enhancements in terms of melting front progression (approximately 152%) and latent heat storage capacity (approximately 167%). Overall, thermochromism assisted photon transport is a synergistic approach which allows for simultaneous collection and storage of solar energy at accelerated rates without requiring the PCM to be heated to high temperatures.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15674v1"
    ],
    "publication_venue": "28 pages, 17 figures, to be submitted to a Journal"
}