{
    "arxiv_id": "2303.17223",
    "paper_title": "Experimental super-Heisenberg quantum metrology with indefinite gate order",
    "authors": [
        "Peng Yin",
        "Xiaobin Zhao",
        "Yuxiang Yang",
        "Yu Guo",
        "Wen-Hao Zhang",
        "Gong-Chu Li",
        "Yong-Jian Han",
        "Bi-Heng Liu",
        "Jin-Shi Xu",
        "Giulio Chiribella",
        "Geng Chen",
        "Chuan-Feng Li",
        "Guang-Can Guo"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "The precision of quantum metrology is widely believed to be restricted by the Heisenberg limit, corresponding to a root mean square error that is inversely proportional to the number of independent processes probed in an experiment, N. In the past, some proposals have challenged this belief, for example using non-linear interactions among the probes. However, these proposals turned out to still obey the Heisenberg limit with respect to other relevant resources, such as the total energy of the probes. Here, we present a photonic implementation of a quantum metrology protocol surpassing the Heisenberg limit by probing two groups of independent processes in a superposition of two alternative causal orders. Each process creates a phase space displacement, and our setup is able to estimate a geometric phase associated to two sets of N displacements with an error that falls quadratically with N. Our results only require a single-photon probe with an initial energy that is independent of N. Using a superposition of causal orders outperforms every setup where the displacements are probed in a definite order. Our experiment features the demonstration of indefinite causal order in a continuous-variable system, and opens up the experimental investigation of quantum metrology setups boosted by indefinite causal order.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17223v1"
    ],
    "publication_venue": null
}