{
    "arxiv_id": "2303.17614",
    "paper_title": "Estimating Continuous Muscle Fatigue For Multi-Muscle Coordinated Exercise: A Pilot Study",
    "authors": [
        "Chunzhi Yi",
        "Baichun Wei",
        "Wei Jin",
        "Jianfei Zhu",
        "Seungmin Rho",
        "Zhiyuan Chen",
        "Feng Jiang"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "cs.HC",
        "cs.AI",
        "eess.SP"
    ],
    "abstract": "Assessing the progression of muscle fatigue for daily exercises provides vital indicators for precise rehabilitation, personalized training dose, especially under the context of Metaverse. Assessing fatigue of multi-muscle coordination-involved daily exercises requires the neuromuscular features that represent the fatigue-induced characteristics of spatiotemporal adaptions of multiple muscles and the estimator that captures the time-evolving progression of fatigue. In this paper, we propose to depict fatigue by the features of muscle compensation and spinal module activation changes and estimate continuous fatigue by a physiological rationale model. First, we extract muscle synergy fractionation and the variance of spinal module spikings as features inspired by the prior of fatigue-induced neuromuscular adaptations. Second, we treat the features as observations and develop a Bayesian Gaussian process to capture the time-evolving progression. Third, we solve the issue of lacking supervision information by mathematically formulating the time-evolving characteristics of fatigue as the loss function. Finally, we adapt the metrics that follow the physiological principles of fatigue to quantitatively evaluate the performance. Our extensive experiments present a 0.99 similarity between days, a over 0.7 similarity with other views of fatigue and a nearly 1 weak monotonicity, which outperform other methods. This study would aim the objective assessment of muscle fatigue.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17614v1"
    ],
    "publication_venue": "submitted to IEEE JBHI"
}