{
    "arxiv_id": "2303.07964",
    "paper_title": "On the Impact of Smartification Strategies for the State Estimation of Low Voltage Grids",
    "authors": [
        "Armin Fatemi",
        "Franziska Tischbein",
        "Frank Wirtz",
        "Christin Schmoger",
        "Stefan Dorendorf",
        "Annika Schurtz",
        "David Echternacht",
        "Andreas Ulbig"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY"
    ],
    "abstract": "The decarbonization of for example the energy or heat sector leads to the transformation of distribution grids. The expansion of decentralized energy resources and the integration of new consumers due to sector coupling (e.g. heat pumps or electric vehicles) into low voltage grids increases the need for grid expansion and usage of flexibilities in the grid. A high observability of the current grid status is needed to perform these tasks efficiently and effectively. Therefore, there is a need to increase the observability of low voltage grids by installing measurement technologies (e.g. smart meters). Multiple different measurement technologies are available for low voltage grids which can vary in their benefit to observation quality and their installation costs. Therefore, Bayernwerk Netz GmbH and E.DIS AG in cooperation with E-Bridge Consulting GmbH and the Institute for High Voltage Equipment and Grids, Digitalization and Energy Economics (IAEW) investigated the effectiveness of different strategies for the smartification of low voltage grids. This paper presents the methodology used for the investigation and exemplary results focusing on the impact of intelligent cable distribution cabinets and smart meters on the quality of the state estimation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07964v1"
    ],
    "publication_venue": "In proceedings of the 13th \"Internationale Energiewirtschaftstagung\" (IEWT2023), February 15-17, 2023, Vienna, Austria"
}