{
    "arxiv_id": "2303.16791",
    "paper_title": "Highly-Anisotropic Even-Denominator Fractional Quantum Hall State in an Orbitally-Coupled Half-Filled Landau Level",
    "authors": [
        "Chengyu Wang",
        "A. Gupta",
        "Y. J. Chung",
        "L. N. Pfeiffer",
        "K. W. West",
        "K. W. Baldwin",
        "R. Winkler",
        "M. Shayegan"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-08-16"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "cond-mat.mtrl-sci",
        "cond-mat.str-el"
    ],
    "abstract": "The even-denominator fractional quantum Hall states (FQHSs) in half-filled Landau levels are generally believed to host non-Abelian quasiparticles and be of potential use in topological quantum computing. Of particular interest is the competition and interplay between the even-denominator FQHSs and other ground states, such as anisotropic phases and composite fermion Fermi seas. Here we report the observation of an even-denominator fractional quantum Hall state with highly-anisotropic in-plane transport coefficients at Landau level filling factor $ν=3/2$. We observe this state in an ultra-high-quality GaAs two-dimensional hole system when a large in-plane magnetic field is applied. By increasing the in-plane field, we observe a sharp transition from an isotropic composite fermion Fermi sea to an anisotropic even-denominator FQHS. Our data and calculations suggest that a unique feature of two-dimensional holes, namely the coupling between heavy-hole and light-hole states, combines different orbital components in the wavefunction of one Landau level, and leads to the emergence of a highly-anisotropic even-denominator fractional quantum Hall state. Our results demonstrate that the GaAs two-dimensional hole system is a unique platform for the exploration of exotic, many-body ground states.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16791v1"
    ],
    "publication_venue": "7+13 pages, 4+6 figures",
    "doi": "10.1103/PhysRevLett.131.056302"
}