{
    "arxiv_id": "2303.16215",
    "paper_title": "The Circumgalactic Medium of Milky Way-like Galaxies in the TNG50 Simulation -- II: Cold, Dense Gas Clouds and High-Velocity Cloud Analogs",
    "authors": [
        "Rahul Ramesh",
        "Dylan Nelson",
        "Annalisa Pillepich"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
    ],
    "abstract": "We use the TNG50 simulation of the IllustrisTNG project to study cold, dense clouds of gas in the circumgalactic media (CGM) of Milky Way-like galaxies. We find that their CGM is typically filled with of order one hundred (thousand) reasonably (marginally) resolved clouds, possible analogs of high-velocity clouds (HVCs). There is a large variation in cloud abundance from galaxy to galaxy, and the physical properties of clouds that we explore -- mass, size, metallicity, pressure, and kinematics -- are also diverse. We quantify the distributions of cloud properties and cloud-background contrasts, providing cosmological inputs for idealized simulations. Clouds characteristically have sub-solar metallicities, diverse shapes, small overdensities ($χ= n_{\\rm cold} / n_{\\rm hot} \\lesssim 10$), are mostly inflowing, and have sub-virial rotation. At TNG50 resolution, resolved clouds have median masses of $\\sim 10^6\\,\\rm{M_\\odot}$ and sizes of $\\sim 10$ kpc. Larger clouds are well converged numerically, while the abundance of the smallest clouds increases with resolution, as expected. In TNG50 MW-like haloes, clouds are slightly (severely) under-pressurised relative to their surroundings with respect to total (thermal) pressure, implying that magnetic fields may be important. Clouds are not distributed uniformly throughout the CGM, but are clustered around other clouds, often near baryon-rich satellite galaxies. This suggests that at least some clouds originate from satellites, via direct ram-pressure stripping or otherwise. Finally, we compare with observations of intermediate and high velocity clouds from the real Milky Way halo. TNG50 shows a similar cloud velocity distribution as observations, and predicts a significant population of currently difficult-to-detect low velocity clouds.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16215v1"
    ],
    "publication_venue": "Accepted for publication (MNRAS). Part of a set of papers based on TNG50 MW/M31-like galaxies. Additional visuals and data products at www.tng-project.org/ramesh23b",
    "doi": "10.1093/mnras/stad951"
}