{
    "arxiv_id": "2303.08050",
    "paper_title": "Subjective and Objective Quality Assessment for in-the-Wild Computer Graphics Images",
    "authors": [
        "Zicheng Zhang",
        "Wei Sun",
        "Yingjie Zhou",
        "Jun Jia",
        "Zhichao Zhang",
        "Jing Liu",
        "Xiongkuo Min",
        "Guangtao Zhai"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-11-01"
    ],
    "latest_version": 3,
    "categories": [
        "cs.CV",
        "eess.IV"
    ],
    "abstract": "Computer graphics images (CGIs) are artificially generated by means of computer programs and are widely perceived under various scenarios, such as games, streaming media, etc. In practice, the quality of CGIs consistently suffers from poor rendering during production, inevitable compression artifacts during the transmission of multimedia applications, and low aesthetic quality resulting from poor composition and design. However, few works have been dedicated to dealing with the challenge of computer graphics image quality assessment (CGIQA). Most image quality assessment (IQA) metrics are developed for natural scene images (NSIs) and validated on databases consisting of NSIs with synthetic distortions, which are not suitable for in-the-wild CGIs. To bridge the gap between evaluating the quality of NSIs and CGIs, we construct a large-scale in-the-wild CGIQA database consisting of 6,000 CGIs (CGIQA-6k) and carry out the subjective experiment in a well-controlled laboratory environment to obtain the accurate perceptual ratings of the CGIs. Then, we propose an effective deep learning-based no-reference (NR) IQA model by utilizing both distortion and aesthetic quality representation. Experimental results show that the proposed method outperforms all other state-of-the-art NR IQA methods on the constructed CGIQA-6k database and other CGIQA-related databases. The database is released at https://github.com/zzc-1998/CGIQA6K.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08050v1",
        "http://arxiv.org/pdf/2303.08050v2",
        "http://arxiv.org/pdf/2303.08050v3"
    ],
    "publication_venue": null
}