{
    "arxiv_id": "2303.10168",
    "paper_title": "Inequality of avalanche sizes in models of fracture",
    "authors": [
        "Diksha",
        "Sumanta Kundu",
        "Bikas K. Chakrabarti",
        "Soumyajyoti Biswas"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.stat-mech",
        "cond-mat.dis-nn"
    ],
    "abstract": "Prediction of an imminent catastrophic event in a driven disordered system is of paramount importance from the laboratory scale controlled fracture experiment to the largest scale of mechanical failure i.e., earthquakes. It has been long conjectured that the statistical regularities in the energy emission time series mirrors the health of such driven systems and hence have the potential for predicting imminent catastrophe. Here we use the fiber bundle model (FBM) and Random fuse model (RFM) of fracture and record the time series of avalanche sizes. Such avalanches are necessarily very much unequal. These inequalities in the avalanche time series play an important role in predicting imminent failure. These inequalities are quantified through some indices, namely the Hirsch-index h, Gini index g, and Kolkata index k that are estimated from the Lorenz function L(p) where the p fraction of avalanche size acquires the cumulative fraction of avalanche mass when arranged in the ascending order of their sizes. Here we calculate these inequalities indices using the time series of avalanche size. In the mean-field case of the FBM, we can calculate h, g, and k analytically: these inequalities endpoints or terminal values can be a very good indicator of imminent catastrophic failure. For non-mean field cases, we give numerical results. These inequalities of avalanche size show universal scaling properties near the failure point.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10168v1",
        "http://arxiv.org/pdf/2303.10168v2"
    ],
    "publication_venue": null
}