{
    "arxiv_id": "2303.14251",
    "paper_title": "Tracking the validity of the quasi-static and sub-horizon approximations in modified gravity",
    "authors": [
        "J. Bayron Orjuela-Quintana",
        "Savvas Nesseris"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc",
        "astro-ph.CO"
    ],
    "abstract": "Within the framework of modified gravity, the quasi-static and sub-horizon approximations are widely used in analyses aiming to identify departures from the concordance model at late-times. Under these approximations, it is generally assumed that time derivatives are subdominant with respect to spatial derivatives given that the relevant physical modes are those well inside the Hubble radius. Here, in the context of the effective fluid approach applied to $f(R)$ theories, we put forward a new parameterization which allows us to obtain analytical expressions for the gravitational potentials, whence for the effective dark energy perturbations. In order to track the validity of the two aforementioned approximations, we compare our results and the standard results found in the literature against full numerical solutions for two well-known toy-models; namely, the designer ($f$DES) model and the Hu-Sawicki (HS) model. We find that: $i)$ the sub-horizon approximation can be safely applied for scales $k \\gtrsim 200 H_0$, $ii)$ in this ``safety region'', the quasi-static approximation is a very accurate description of the late-time dynamics even when dark energy significantly contribute to the cosmic budget, $iii)$ some relevant terms were neglected in the standard procedure yielding to inaccurate results in some of the dark energy effective fluid quantities; e.g. the sound speed. Instead, our expressions show overall agreement with respect to the full solutions. Therefore, our results indirectly indicate that the effective fluid expressions derived for more general modified gravity theories, such as Horndeski, should be revisited.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14251v1"
    ],
    "publication_venue": "27 pages, 16 figures"
}