{
    "arxiv_id": "2303.07877",
    "paper_title": "Projectability disentanglement for accurate and automated electronic-structure Hamiltonians",
    "authors": [
        "Junfeng Qiao",
        "Giovanni Pizzi",
        "Nicola Marzari"
    ],
    "submission_date": "2023-03-12",
    "revised_dates": [],
    "latest_version": 1,
    "categories": [
        "physics.comp-ph",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Maximally-localized Wannier functions (MLWFs) are a powerful and broadly used\ntool to characterize the electronic structure of materials, from chemical\nbonding to dielectric response to topological properties. Most generally, one\ncan construct MLWFs that describe isolated band manifolds, e.g. for the valence\nbands of insulators, or entangled band manifolds, e.g. in metals or describing\nboth the valence and the conduction manifolds in insulators. Obtaining MLWFs\nthat describe a target manifold accurately and with the most compact\nrepresentation often requires chemical intuition and trial and error, a\nchallenging step even for experienced researchers and a roadblock for automated\nhigh-throughput calculations. Here, we present a very natural and powerful\napproach that provides automatically MLWFs spanning the occupied bands and\ntheir natural complement for the empty states, resulting in Wannier Hamiltonian\nmodels that provide a tight-binding picture of optimized atomic orbitals in\ncrystals. Key to the success of the algorithm is the introduction of a\nprojectability measure for each Bloch state onto atomic orbitals (here, chosen\nfrom the pseudopotential projectors) that determines if that state should be\nkept identically, discarded, or mixed into a disentangling algorithm. We\nshowcase the accuracy of our method by comparing a reference test set of 200\nmaterials against the selected-columns-of-the-density-matrix algorithm, and its\nreliability by constructing Wannier Hamiltonians for 21737 materials from the\nMaterials Cloud.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07877v1"
    ],
    "publication_venue": null
}