{
    "arxiv_id": "2303.16555",
    "paper_title": "On Communication-Efficient Multisensor Track Association via Measurement Transformation (Extended Version)",
    "authors": [
        "Haiqi Liu",
        "Jiajie Sun",
        "Xuqi Zhang",
        "Fanqin Meng",
        "Xiaojing Shen",
        "Pramod K. Varshney"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 2,
    "categories": [
        "cs.IT"
    ],
    "abstract": "Multisensor track-to-track fusion for target tracking involves two primary operations: track association and estimation fusion. For estimation fusion, lossless measurement transformation of sensor measurements has been proposed for single target tracking. In this paper, we investigate track association which is a fundamental and important problem for multitarget tracking. First, since the optimal track association problem is a multi-dimensional assignment (MDA) problem, we demonstrate that MDA-based data association (with and without prior track information) using linear transformations of track measurements is lossless, and is equivalent to that using raw track measurements. Second, recent superior scalability and performance of belief propagation (BP) algorithms enable new real-time applications of multitarget tracking with resource-limited devices. Thus, we present a BP-based multisensor track association method with transformed measurements and show that it is equivalent to that with raw measurements. Third, considering communication constraints, it is more beneficial for local sensors to send in compressed data. Two analytical lossless transformations for track association are provided, and it is shown that their communication requirements from each sensor to the fusion center are less than those of fusion with raw track measurements. Numerical examples for tracking an unknown number of targets verify that track association with transformed track measurements has the same performance as that with raw measurements and requires fewer communication bandwidths.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16555v1",
        "http://arxiv.org/pdf/2303.16555v2"
    ],
    "publication_venue": null
}