{
    "arxiv_id": "2303.14529",
    "paper_title": "Temporal truth and bivalence an anachronistic formal approach to Aristotle's De Interpretatione 9",
    "authors": [
        "Luiz Henrique Lopes dos Santos"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "math.HO",
        "math.LO"
    ],
    "abstract": "Regarding the famous Sea Battle Argument, which Aristotle presents in De Interpretatione 9, there has never been a general agreement not only about its correctness but also, and mainly, about what the argument really is. According to the most natural reading of the chapter, the argument appeals to a temporal concept of truth and concludes that not every statement is always either true or false. However, many of Aristotle's followers and commentators have not adopted this reading. I believe that it has faced so much resistance for reasons of hermeneutic charity denying the law of universal bivalence seems to be overly disruptive to logical orthodoxy the kind of logical orthodoxy represented by what we now call classical propositional logic, much of which Aristotle clearly supports in many texts. I intend to show that the logical-semantic theses that the traditional reading finds in De Interpretatione 9 are much more conservative than they may seem to be at first glance. First, I will show that they complement, and do not contradict in any way, the orthodox definitions of the concepts of truth and statement that Aristotle advances in other texts. Second, by resorting in an anachronistic vein to concepts and methods peculiar to contemporary logic, I will show that a trivalent modal semantics conforming to those theses can be built for a standard formal language of the classical propositional calculus. It is remarkable that reasonable concepts of logical truth and logical consequence that may be defined on the basis of this trivalent modal semantics are coextensive with their orthodox counterparts, the concepts of tautology and tautological consequence of classical bivalent and extensional semantics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14529v1"
    ],
    "publication_venue": "23 pages, to be published in Journal of Ancient Philosophy, ISSN: 1981-9471/1981-9498"
}