{
    "arxiv_id": "2303.14014",
    "paper_title": "Hybrid aeromaterials for enhanced and rapid volumetric photothermal response",
    "authors": [
        "Lena M. Saure",
        "Niklas Kohlmann",
        "Haoyi Qiu",
        "Shwetha Shetty",
        "Ali Shaygan Nia",
        "Narayanan Ravishankar",
        "Xinliang Feng",
        "Alexander Szameit",
        "Lorenz Kienle",
        "Rainer Adelung",
        "Fabian Schütt"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "cond-mat.mtrl-sci",
        "physics.optics"
    ],
    "abstract": "Conversion of light into heat is essential for a broad range of technologies such as solar thermal heating, catalysis and desalination. Three-dimensional (3D) carbon nanomaterial-based aerogels have shown to hold great promise as photothermal transducer materials. However, till now, their light-to-heat conversion is limited by surface-near absorption, resulting in a strong heat localization only at the illuminated surface region, while most of the aerogel volume remains unused. We present an innovative fabrication concept for highly porous (>99.9%) photothermal hybrid aeromaterials, that enable an ultra-rapid and volumetric photothermal response with an enhancement by a factor of around 2.5 compared to the pristine variant. The hybrid aeromaterial is based on strongly light-scattering framework structures composed of interconnected hollow silicon dioxide (SiO${_2}$) microtubes, which are functionalized with extremely low amounts (in order of a few $μ$g cm${^-}$${^3}$) of reduced graphene oxide (rGO) nanosheets, acting as photothermal agents. Tailoring the density of rGO within the framework structure enables us to control both, light scattering and light absorption, and thus the volumetric photothermal response. We further show that by rapid and repeatable gas activation these transducer materials expand the field of photothermal applications, like untethered light-powered and -controlled microfluidic pumps and soft pneumatic actuators.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14014v1"
    ],
    "publication_venue": null
}