{
    "arxiv_id": "2303.12583",
    "paper_title": "Enhanced functional reversibility in lead-free ferroelectric material over long cycle pyroelectric energy conversion",
    "authors": [
        "Chenbo Zhang",
        "Zeyuan Zhu",
        "Ka Hung Chan",
        "Ruhao Huang",
        "Xian Chen"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2024-06-10"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.app-ph"
    ],
    "abstract": "The ferroelectric material usually exhibits temperature dependent spontaneous polarization, known as pyroelectricity, which can be used to directly convert thermal energy to electricity from ambient low-grade waste heat. When utilizing the structural phase transformations of the material, the conversion capability can be magnified, consequently the device performance can be strongly boosted by orders of magnitude. However, common ferroelectric oxides suffer the mechanical fatigue and functional degradation over cyclic phase transformations, hindering widespread applications of the energy conversion device. In this paper, we investigate the mechanical and functional reversibility of the material by lattice tuning and grain coarsening. We discover the lead-free compound Ba(Ce$_{0.005}$Zr$_{0.005}$)Ti$_{0.99}$O3-0.10(Ba$_{0.7}$Ca$_{0.3}$)TiO$_3$ (BCZT-0.10BCT) satisfying the compatibility condition among all present phases by its lattice parameters, making the phase transformations highly reversible. We demonstrated that the energy conversion device with the equiaxial coarse grains exhibits exceptional fatigue-resistance, with stable pyroelectric current output at 4$μ$A/cm$^2$ over 3,000 energy conversion cycles. Our work opens a new way to fabricate high-performance material that advances the pyroelectric energy conversion for practical application in engineering.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12583v1"
    ],
    "publication_venue": "18 pages, 5 figures, 1 table",
    "doi": "10.1103/PhysRevMaterials.7.064408"
}