{
    "arxiv_id": "2303.13980",
    "paper_title": "Thermodynamic and Magnetic Topology Evolution of the X1.0 Flare on 2021 October 28 Simulated by a Data-driven Radiative Magnetohydrodynamic Model",
    "authors": [
        "Jin-han Guo",
        "Yi-wei Ni",
        "Ze Zhong",
        "Yang Guo",
        "Chun Xia",
        "Hai-tang Li",
        "Stefaan Poedts",
        "Brigitte Schmieder",
        "Peng-fei Chen"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-04-26"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Solar filament eruptions, flares and coronal mass ejections (CMEs) are manifestations of drastic release of energy in the magnetic field, which are related to many eruptive phenomena from the Earth magnetosphere to black hole accretion disks. With the availability of high-resolution magnetograms on the solar surface, observational data-based modelling is a promising way to quantitatively study the underlying physical mechanisms behind observations. By incorporating thermal conduction and radiation losses in the energy equation, we develop a new data-driven radiative magnetohydrodynamic (MHD) model, which has the capability to capture the thermodynamic evolution compared to our previous zero-\\b{eta} model. Our numerical results reproduce major observational characteristics of the X1.0 flare on 2021 October 28 in NOAA active region (AR) 12887, including the morphology of the eruption, kinematic of flare ribbons, extreme-ultraviolet (EUV) radiations, and two components of the EUV waves predicted by the magnetic stretching model, i.e., a fast-mode shock wave and a slower apparent wave due to successive stretching of magnetic field lines. Moreover, some intriguing phenomena are revealed in the simulation. We find that flare ribbons separate initially and ultimately stop at the outer stationary quasi-separatrix layers (QSLs). Such outer QSLs correspond to the border of the filament channel and determine the final positions of flare ribbons, which can be used to predict the size and the lifetime of a flare before it occurs. In addition, the side view of the synthesized EUV and white-light images exhibit typical three-part structures of CMEs, where the bright leading front is roughly cospatial with the non-wave component of the EUV wave, reinforcing the magnetic stretching model for the slow component of EUV waves.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13980v1"
    ],
    "publication_venue": "46 pages, 15 figures, accepted for publication in The Astrophysical Journal Supplement",
    "doi": "10.3847/1538-4365/acc797"
}