{
    "arxiv_id": "2303.09568",
    "paper_title": "RXJ0437+00: Constraining Dark Matter with Exotic Gravitational Lenses",
    "authors": [
        "David J. Lagattuta",
        "Johan Richard",
        "Harald Ebeling",
        "Quentin Basto",
        "Catherine Cerny",
        "Alastair Edge",
        "Mathilde Jauzac",
        "Guillaume Mahler",
        "Richard Massey"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
    ],
    "abstract": "We present the first strong-gravitational-lensing analysis of the galaxy cluster RXJ0437.1+0043 (RXJ0437; z = 0.285). Newly obtained, deep MUSE observations, Keck/MOSFIRE near-infrared spectroscopy, and Hubble Space Telescope SNAPshot imaging reveal 13 multiply imaged background galaxies, three of them (at z=1.98, 2.97, and 6.02, respectively) in hyperbolic umbilic (H-U) lensing configurations. The H-U images are located only 20 -- 50 kpc from the cluster centre, i.e., at distances well inside the Einstein radius where images from other lens configurations are demagnified and often unobservable. Extremely rare (only one H-U lens was known previously) these systems are able to constrain the inner slope of the mass distribution -- and unlike radial arcs, the presence of H-U configurations is not biased towards shallow cores. The galaxies lensed by RXJ0437 are magnified by factors ranging from 30 to 300 and (in the case of H-U systems) stretched nearly isotropically. Taking advantage of this extreme magnification, we demonstrate how the source galaxies in H-U systems can be used to probe for small-scale ($\\sim 10^{9} M_{\\odot}$) substructures, providing additional insight into the nature of dark matter.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09568v1"
    ],
    "publication_venue": "17 pages, 13 figures, 3 tables (including 1 in an appendix). Accepted in MNRAS",
    "doi": "10.1093/mnras/stad803"
}