{
    "arxiv_id": "2303.12685",
    "paper_title": "Reconstructing the shock history in the CMZ of NGC 253 with ALCHEMI",
    "authors": [
        "K. -Y. Huang",
        "S. Viti",
        "J. Holdship",
        "J. G. Mangum",
        "S. Martín",
        "N. Harada",
        "S. Muller",
        "K. Sakamoto",
        "K. Tanaka",
        "Y. Yoshimura",
        "R. Herrero-Illana",
        "D. S. Meier",
        "E. Behrens",
        "P. P. van der Werf",
        "C. Henkel",
        "S. García-Burillo",
        "V. M. Rivilla",
        "K. L. Emig",
        "L. Colzi",
        "P. K. Humire",
        "R. Aladro",
        "M. Bouvier"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-07-19"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "HNCO and SiO are well known shock tracers and have been observed in nearby galaxies, including the nearby (D=3.5 Mpc) starburst galaxy NGC 253. The simultaneous detection of these two species in regions where the star formation rate is high may be used to study the shock history of the gas. We perform a multi-line molecular study using these two shock tracers (SiO and HNCO) with the aim of characterizing the gas properties. We also explore the possibility of reconstructing the shock history in NGC 253's Central Molecular Zone (CMZ). Six SiO transitions and eleven HNCO transitions were imaged at high resolution $1''.6$ (28 pc) with the Atacama Large Millimeter/submillimeter Array (ALMA) as part of the ALCHEMI Large Programme. Both non-LTE radiative transfer analysis and chemical modelling were performed in order to characterize the gas properties, and to investigate the chemical origin of the emission. The non-LTE radiative transfer analysis coupled with Bayesian inference shows clear evidence that the gas traced by SiO has different densities and temperatures than that traced by HNCO, with an indication that shocks are needed to produce both species. Chemical modelling further confirms such a scenario and suggests that fast and slow shocks are responsible for SiO and HNCO production, respectively, in most GMCs. We are also able to infer the physical characteristics of the shocks traced by SiO and HNCO for each GMC. Radiative transfer and chemical analysis of the SiO and HNCO in the CMZ of NGC 253 reveal a complex picture whereby most of the GMCs are subjected to shocks. We speculate on the possible shock scenarios responsible for the observed emission and provide potential history and timescales for each shock scenario. Higher spatial resolution observations of these two species are required in order to quantitatively differentiate between scenarios.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12685v1"
    ],
    "publication_venue": null,
    "doi": "10.1051/0004-6361/202245659"
}