{
    "arxiv_id": "2303.14294",
    "paper_title": "Stability and detectability of exomoons orbiting HIP 41378 f, a temperate Jovian planet with an anomalously low apparent density",
    "authors": [
        "Caleb K. Harada",
        "Courtney D. Dressing",
        "Munazza K. Alam",
        "James Kirk",
        "Mercedes Lopez-Morales",
        "Kazumasa Ohno",
        "Babatunde Akinsanmi",
        "Susana C. Barros",
        "Lars A. Buchhave",
        "Andrew Collier Cameron",
        "Ian J. Crossfield",
        "Fei Dai",
        "Peter Gao",
        "Steven Giacalone",
        "Salome Grouffal",
        "Jorge Lillo-Box",
        "Andrew W. Mayo",
        "Annelies Mortier",
        "Alexandre Santerne",
        "Nuno Santos",
        "Sergio G. Sousa",
        "Emma V. Turtelboom",
        "Andrew Vanderburg",
        "Peter J. Wheatley"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Moons orbiting exoplanets (\"exomoons\") may hold clues about planet formation, migration, and habitability. We investigate the plausibility of exomoons orbiting the temperate ($T_\\text{eq}=294$ K) giant ($R = 9.2$ $\\text{R}_\\oplus$) planet HIP 41378 f. Previous studies have suggested that HIP 41378 f has a low apparent bulk density of $0.09\\,\\text{g}\\,\\text{cm}^{-3}$ and a flat near-infrared transmission spectrum, suggesting that it may possess circumplanetary rings. Given the planet's long orbital period ($P\\approx1.5$ yr), it may also host a large exomoon. Here, we consider a hypothetical exomoon orbiting HIP 41378 f with the same satellite-to-planet mass ratio as the Moon-Earth system and assess its orbital stability using a suite of N-body and tidal migration simulations. We find that satellites up to this size are largely stable against Hill sphere escape and collisions with the host planet, consistent with theoretical stability limits determined by previous studies. We then simulate the expected transit signal from the exomoon and show that current transit observations likely cannot constrain the presence of exomoons orbiting HIP 41378 f, though future observations may be capable of detecting exomoons in other systems. Finally, we simulate the combined transmission spectrum of HIP 41378 f and an exomoon with a low-metallicity atmosphere, and show that the total effective spectrum is contaminated at the $\\sim$10 ppm level. Our work not only demonstrates the feasibility of exomoons orbiting HIP 41378 f, but also shows that large exomoons may be a source of uncertainty in future high-precision measurements of exoplanet systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14294v1"
    ],
    "publication_venue": "24 pages, 9 figures, 2 tables; submitted to AJ"
}