{
    "arxiv_id": "2303.07911",
    "paper_title": "Schrödinger as a Quantum Programmer: Estimating Entanglement via Steering",
    "authors": [
        "Aby Philip",
        "Soorya Rethinasamy",
        "Vincent Russo",
        "Mark M. Wilde"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2024-04-01"
    ],
    "latest_version": 3,
    "categories": [
        "quant-ph",
        "cond-mat.stat-mech",
        "cs.CC",
        "cs.DS",
        "hep-th"
    ],
    "abstract": "Quantifying entanglement is an important task by which the resourcefulness of\na quantum state can be measured. Here we develop a quantum algorithm that tests\nfor and quantifies the separability of a general bipartite state, by making use\nof the quantum steering effect, the latter originally discovered by\nSchr\\\"odinger. Our separability test consists of a distributed quantum\ncomputation involving two parties: a computationally limited client, who\nprepares a purification of the state of interest, and a computationally\nunbounded server, who tries to steer the reduced systems to a probabilistic\nensemble of pure product states. To design a practical algorithm, we replace\nthe role of the server by a combination of parameterized unitary circuits and\nclassical optimization techniques to perform the necessary computation. The\nresult is a variational quantum steering algorithm (VQSA), which is a modified\nseparability test that is better suited for the capabilities of quantum\ncomputers available today. We then simulate our VQSA on noisy quantum\nsimulators and find favorable convergence properties on the examples tested. We\nalso develop semidefinite programs, executable on classical computers, that\nbenchmark the results obtained from our VQSA. Our findings here thus provide a\nmeaningful connection between steering, entanglement, quantum algorithms, and\nquantum computational complexity theory. They also demonstrate the value of a\nparameterized mid-circuit measurement in a VQSA and represent a\nfirst-of-its-kind application for a distributed VQA.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07911v1",
        "http://arxiv.org/pdf/2303.07911v2",
        "http://arxiv.org/pdf/2303.07911v3"
    ],
    "publication_venue": "v3: 33 pages, 12 figures, all source code available as arXiv\n  ancillary files, update to complexity theoretic results for\n  QIP$_{\\operatorname{EB}}(2)$"
}