{
    "arxiv_id": "2303.09426",
    "paper_title": "Comparing bipartite entropy growth in open-system matrix product simulation methods",
    "authors": [
        "Guillermo Preisser",
        "David Wellnitz",
        "Thomas Botzung",
        "Johannes Schachenmayer"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-08-02"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "cond-mat.quant-gas"
    ],
    "abstract": "The dynamics of one-dimensional quantum many body systems is often numerically simulated with matrix product states (MPS). The computational complexity of MPS methods is known to be related to the growth of entropies of reduced density matrices for bipartitions of the chain. While for closed systems the entropy relevant for the complexity is uniquely defined by the entanglement entropy, for open systems it depends on the choice of the representation. Here, we systematically compare the growth of different entropies relevant to the complexity of matrix product representations in open-system simulations. We simulate an XXZ spin-1/2 chain in the presence of spontaneous emission/absorption and dephasing. We compare simulations using a representation of the full density matrix as a matrix product density operator (MPDO) with a quantum trajectory unravelling, where each trajectory is itself represented by an MPS (QT+MPS). We show that the bipartite entropy in the MPDO description (operator entanglement, OE) generally scales more favorable with time than the entropy in QT+MPS (trajectory entanglement, TE): i) For spontaneous emission/absorption the OE vanishes while the TE grows and reaches a constant value for large dissipative rates and sufficiently long times; ii) for dephasing the OE exhibits only logarithmic growth while the TE grows polynomially. Although QT+MPS requires a smaller local state space, the more favorable entropy growth can thus make MPDO simulations fundamentally more efficient than QT+MPS. Furthermore, MPDO simulations allow for easier exploitation of higher order Trotter decompositions and translational invariance, allowing for larger time steps and system sizes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09426v1"
    ],
    "publication_venue": "13 pages, 9 figures",
    "doi": "10.1103/PhysRevA.108.012616"
}