{
    "arxiv_id": "2303.08496",
    "paper_title": "Artificial Psychophysics questions Hue Cancellation Experiments",
    "authors": [
        "Jorge Vila-Tomás",
        "Pablo Hernández-Cámara",
        "Jesús Malo"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.NC"
    ],
    "abstract": "We show that in conventional hue cancellation experiments human-like opponent curves emerge even if the task is done by trivial (identity) artificial networks. Specifically, opponent spectral sensitivities always emerge as long as (i) the retina converts the input radiation into a tristimulus-like representation (any basis is equally valid), and (ii) the post-retinal network solves the standard hue cancellation task, e.g. it looks for the weights of the conventional cancelling lights so that every monochromatic stimulus plus the weighted cancelling lights match a grey reference in the (arbitrary) color representation used by the network. In fact, the selection of the cancellation lights is key to obtain human-like curves: results show that the classical choice for the cancellation lights is the one that leads to the best (more human-like) opponent result, and any other choices lead to progressively different spectral sensitivities. We show this in two different ways: through artificial hue cancellation experiments for a range of cancellation lights, and through a change-of-basis analogy of the experiments. These results suggest that the opponent curves of the standard hue cancellation experiment are just a by-product of the front-end photoreceptors and of a very specific experimental choice but they do not inform about the downstream color representation. In fact, the architecture of the post-retinal network (signal recombination or internal color space) seems irrelevant for the emergence of the curves in the classical experimental setting. This questions the conventional interpretation of the classical result of Jameson and Hurvich.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08496v1"
    ],
    "publication_venue": "17 pages, 7 figures"
}