{
    "arxiv_id": "2303.15257",
    "paper_title": "Measuring Magnetic 1/f Noise in Superconducting Microstructures and the Fluctuation-Dissipation Theorem",
    "authors": [
        "Matthew Herbst",
        "Andreas Fleischmann",
        "Daniel Hengstler",
        "David Mazibrada",
        "Lukas Münch",
        "Andreas Reifenberger",
        "Christian Ständer",
        "Christian Enss"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con"
    ],
    "abstract": "The performance of superconducting devices like qubits, SQUIDs, and particle detectors is often limited by finite coherence times and 1/f noise. Various types of slow fluctuators in the Josephson junctions and the passive parts of these superconducting circuits can be the cause, and devices usually suffer from a combination of different noise sources, which are hard to disentangle and therefore hard to eliminate. One contribution is magnetic 1/f noise caused by fluctuating magnetic moments of magnetic impurities or dangling bonds in superconducting inductances, surface oxides, insulating oxide layers, and adsorbates. In an effort to further analyze such sources of noise, we have developed an experimental set-up to measure both the complex impedance of superconducting microstructures, and the overall noise picked up by these structures. This allows for important sanity checks by connecting both quantities via the fluctuation-dissipation theorem. Since these two measurements are sensitive to different types of noise, we are able to identify and quantify individual noise sources. The superconducting inductances under investigation form a Wheatstone-like bridge, read out by two independent cross-correlated dc-SQUID read-out chains. The resulting noise resolution lies beneath the quantum limit of the front-end SQUIDs and lets us measure noise caused by just a few ppm of impurities in close-by materials. We present measurements of the insulating SiO2 layers of our devices, and magnetically doped noble metal layers in the vicinity of the pickup coils at T = 30 mK - 800 mK and f = 1 Hz - 100 kHz.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15257v1"
    ],
    "publication_venue": "13 pages, 5 figures"
}