{
    "arxiv_id": "2303.14114",
    "paper_title": "Object Motion Sensitivity: A Bio-inspired Solution to the Ego-motion Problem for Event-based Cameras",
    "authors": [
        "Shay Snyder",
        "Hunter Thompson",
        "Md Abdullah-Al Kaiser",
        "Gregory Schwartz",
        "Akhilesh Jaiswal",
        "Maryam Parsa"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV",
        "cs.NE"
    ],
    "abstract": "Neuromorphic (event-based) image sensors draw inspiration from the human-retina to create an electronic device that can process visual stimuli in a way that closely resembles its biological counterpart. These sensors process information significantly different than the traditional RGB sensors. Specifically, the sensory information generated by event-based image sensors are orders of magnitude sparser compared to that of RGB sensors. The first generation of neuromorphic image sensors, Dynamic Vision Sensor (DVS), are inspired by the computations confined to the photoreceptors and the first retinal synapse. In this work, we highlight the capability of the second generation of neuromorphic image sensors, Integrated Retinal Functionality in CMOS Image Sensors (IRIS), which aims to mimic full retinal computations from photoreceptors to output of the retina (retinal ganglion cells) for targeted feature-extraction. The feature of choice in this work is Object Motion Sensitivity (OMS) that is processed locally in the IRIS sensor. We study the capability of OMS in solving the ego-motion problem of the event-based cameras. Our results show that OMS can accomplish standard computer vision tasks with similar efficiency to conventional RGB and DVS solutions but offers drastic bandwidth reduction. This cuts the wireless and computing power budgets and opens up vast opportunities in high-speed, robust, energy-efficient, and low-bandwidth real-time decision making.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14114v1",
        "http://arxiv.org/pdf/2303.14114v2"
    ],
    "publication_venue": "This document is 9 pages and has 6 figures, tables, and algorithms"
}