{
    "arxiv_id": "2303.12289",
    "paper_title": "Adaptive Road Configurations for Improved Autonomous Vehicle-Pedestrian Interactions using Reinforcement Learning",
    "authors": [
        "Qiming Ye",
        "Yuxiang Feng",
        "Jose Javier Escribano Macias",
        "Marc Stettler",
        "Panagiotis Angeloudis"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cs.AI",
        "cs.RO",
        "eess.SY",
        "math.DS",
        "math.OC"
    ],
    "abstract": "The deployment of Autonomous Vehicles (AVs) poses considerable challenges and unique opportunities for the design and management of future urban road infrastructure. In light of this disruptive transformation, the Right-Of-Way (ROW) composition of road space has the potential to be renewed. Design approaches and intelligent control models have been proposed to address this problem, but we lack an operational framework that can dynamically generate ROW plans for AVs and pedestrians in response to real-time demand. Based on microscopic traffic simulation, this study explores Reinforcement Learning (RL) methods for evolving ROW compositions. We implement a centralised paradigm and a distributive learning paradigm to separately perform the dynamic control on several road network configurations. Experimental results indicate that the algorithms have the potential to improve traffic flow efficiency and allocate more space for pedestrians. Furthermore, the distributive learning algorithm outperforms its centralised counterpart regarding computational cost (49.55\\%), benchmark rewards (25.35\\%), best cumulative rewards (24.58\\%), optimal actions (13.49\\%) and rate of convergence. This novel road management technique could potentially contribute to the flow-adaptive and active mobility-friendly streets in the AVs era.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12289v1"
    ],
    "publication_venue": "11 pages, 7 figures, Copyright \\c{opyright} 2023, IEEE",
    "doi": "10.1109/TITS.2022.3220110"
}