{
    "arxiv_id": "2303.07905",
    "paper_title": "Off-axis Point Spread Function Reconstruction for Single Conjugate Adaptive Optics",
    "authors": [
        "Roland Wagner",
        "Jenny Niebsch",
        "Ronny Ramlau"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM"
    ],
    "abstract": "Modern Giant Segmented Mirror Telescopes (GSMTs) like the Extremely Large\nTelescope, which is currently under construction, depend heavily on Adaptive\nOptics (AO) systems to correct for atmospheric distortions. However, a residual\nblur always remains in the astronomical images corrected by Single Conjugate AO\n(SCAO) systems due to fitting and bandwidth errors, which can mathematically be\ndescribed by a convolution of the true image with a point spread function\n(PSF). Due to the nature of the turbulent atmosphere and its correction, the\nPSF is spatially varying, which is known as aniosplanatic effect. The PSF\nserves, e.g., as a quality measure for the science images and therefore needs\nto be known as accurately as possible.\n  In this paper, we present an algorithm for PSF reconstruction in directions\napart from the guide star direction in an SCAO system adapted to the needs of\nGSMTs focused on estimating the contribution of the anisoplanatic and\ngeneralized fitting error to the PSF. In particular, the PSF reconstruction\nalgorithm for Single Conjugate Adaptive Optics from (Wagner, 2018) is combined\nwith an algorithm for time-dependent atmospheric tomography from (Niebsch,\n2021) to obtain a direction dependent reconstruction of the post-AO PSF.\n  Results obtained in an end-to-end simulation tool show a qualitatively good\nreconstruction of the PSF compared to the PSF calculated directly from the\nsimulated incoming wavefront as well as a stable performance with respect to\nimprecise knowledge of atmospheric parameters.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07905v1"
    ],
    "publication_venue": "arXiv admin note: text overlap with arXiv:2012.11429"
}