{
    "arxiv_id": "2303.09284",
    "paper_title": "Exploring dark matter spike distribution around the Galactic centre with stellar orbits",
    "authors": [
        "Zhao-Qiang Shen",
        "Guan-Wen Yuan",
        "Cheng-Zi Jiang",
        "Yue-Lin Sming Tsai",
        "Qiang Yuan",
        "Yi-Zhong Fan"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE",
        "gr-qc"
    ],
    "abstract": "Precise measurements of the stellar orbits around Sagittarius A* have established the existence of a supermassive black hole (SMBH) at the Galactic centre (GC). Due to the interplay between the SMBH and dark matter (DM), the DM density profile in the innermost region of the Galaxy, which is crucial for the DM indirect detection, is still an open question. Among the most popular models in the literature, the theoretical spike profile proposed by Gondolo and Silk (1999; GS hereafter) is well adopted. In this work, we investigate the DM spike profile using updated data from the Keck and VLT telescopes considering that the presence of such an extended mass component may affect the orbits of the S-stars in the Galactic center. We examine the radius and slope of the generalized NFW spike profile, analyze the Einasto spike, and discuss the influence of DM annihilation on the results. Our findings indicate that an initial slope of $γ\\gtrsim 0.92$ for the generalized NFW spike profile is ruled out at a 95% confidence level. Additionally, the spike radius $R_{\\rm sp}$ larger than 21.5 pc is rejected at 95% probability for the Einasto spike with $α=0.17$, which also contradicts the GS spike model. The constraints with the VLT/GRAVITY upper limits are also projected. Although the GS NFW spike is well constrained by the Keck and VLT observation of S2, an NFW spike with a weak annihilation cusp may still be viable, as long as the DM annihilation cross section satisfies $\\left< σv \\right> \\gtrsim 7.7\\times 10^{-27}~{\\rm cm^3\\,s^{-1}} (m_{\\rm DM}/100~{\\rm GeV})$ at 95% level.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09284v1"
    ],
    "publication_venue": "11 pages, 9 figures and 1 table. To be submitted to MNRAS. Comments welcome!"
}