{
    "arxiv_id": "2303.17429",
    "paper_title": "Haagerup property and group-invariant percolation",
    "authors": [
        "Chiranjib Mukherjee",
        "Konstantin Recke"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "math.GR",
        "math.OA",
        "math.PR"
    ],
    "abstract": "Let $\\mathcal G$ be the Cayley graph of a finitely generated group $Γ$. We show that $Γ$ has the Haagerup property if and only if for every $α<1$, there is a $Γ$-invariant bond percolation $\\mathbb P$ on $\\mathcal G$ with $\\mathbb E[\\mathrm{deg}_ω(g)]>α\\mathrm{deg}_{\\mathcal G}(g)$ for every vertex $g$ and with the two-point function $τ(g,h)=\\mathbb P[g\\leftrightarrow h]$ vanishing as $d(g,h)\\to\\infty$. Our result is inspired by the characterization of amenability by Benjamini, Lyons, Peres and Schramm [7]. To derive our result, we use the characterization of the Haagerup property in terms of actions on spaces with measured walls in the sense of Cherix, Martin and Valette [11]. Our proof is based on a new construction using invariant point processes on such spaces with measured walls, which leads to quantitative bounds on the two-point functions. These bounds yield in particular exponential decay of the two-point function in several examples, including co-compact Fuchsian groups and lamplighters over free groups.\n  Moreover, our method allows us to strengthen a consequence of Kazhdan's property (T), due to Lyons and Schramm [44], to an {\\em equivalence}. Namely, we show that $Γ$ has property (T) if and only if there exists a threshold $α^*<1$ such that for every $Γ$-invariant bond percolation $\\mathbb P$ on $\\mathcal G$, $\\mathbb E[\\mathrm{deg}_ω(o)]>α^*\\mathrm{deg}(o)$ implies that the two-point function is bounded away from zero. We extend this result to the setting of {\\em relative} property (T). We then use the corresponding threshold to give a new proof of the fact, already observed by Gaboriau and Tucker-Drob [21], that there is no unique infinite cluster at the uniqueness threshold for Bernoulli bond percolation on Cayley graphs of groups admitting an infinite normal subgroup with relative property (T).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17429v1"
    ],
    "publication_venue": null
}