{
    "arxiv_id": "2303.08147",
    "paper_title": "Gravity waves in strong magnetic fields",
    "authors": [
        "Nicholas Z. Rui",
        "Jim Fuller"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Strong magnetic fields in the cores of stars are expected to significantly modify the behavior of gravity waves, which is likely the origin of suppressed dipole modes observed in many red giants. However, a detailed understanding of how such fields alter the spectrum and spatial structure of magnetogravity waves has been elusive. For a dipole field, we analytically characterize the horizontal eigenfunctions of magnetogravity modes, assuming that the wavevector is primarily radial. For axisymmetric modes ($m=0$), the magnetogravity wave eigenfunctions become Hough functions, and they have a radial turning point for sufficiently strong magnetic fields. For non-axisymmetric modes ($m\\neq0$), the interaction between the discrete $g$ mode spectrum and a continuum of Alfvén waves produces nearly discontinuous features in the fluid displacements at critical latitudes associated with a singularity in the fluid equations. We find that magnetogravity modes cannot propagate in regions with sufficiently strong magnetic fields, instead becoming evanescent. When encountering strong magnetic fields, ingoing gravity waves are likely refracted into outgoing slow magnetic waves. These outgoing waves approach infinite radial wavenumbers, which are likely to be damped efficiently. However, it may be possible for a small fraction of the wave power to escape the stellar core as pure Alfvén waves or magnetogravity waves confined to a very narrow equatorial band. The artificially sharp features in the WKB-separated solutions suggest the need for global mode solutions which include small terms neglected in our analysis.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08147v1"
    ],
    "publication_venue": "22 pages, 10 figures, comments welcome! (submitted to MNRAS)"
}