{
    "arxiv_id": "2303.14421",
    "paper_title": "Spatially-Aware Car-Sharing Demand Prediction",
    "authors": [
        "Dominik J. Mühlematter",
        "Nina Wiedemann",
        "Yanan Xin",
        "Martin Raubal"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2024-05-20"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG"
    ],
    "abstract": "In recent years, car-sharing services have emerged as viable alternatives to private individual mobility, promising more sustainable and resource-efficient, but still comfortable transportation. Research on short-term prediction and optimization methods has improved operations and fleet control of car-sharing services; however, long-term projections and spatial analysis are sparse in the literature. We propose to analyze the average monthly demand in a station-based car-sharing service with spatially-aware learning algorithms that offer high predictive performance as well as interpretability. In particular, we compare the spatially-implicit Random Forest model with spatially-aware methods for predicting average monthly per-station demand. The study utilizes a rich set of socio-demographic, location-based (e.g., POIs), and car-sharing-specific features as input, extracted from a large proprietary car-sharing dataset and publicly available datasets. We show that the global Random Forest model with geo-coordinates as an input feature achieves the highest predictive performance with an R-squared score of 0.87, while local methods such as Geographically Weighted Regression perform almost on par and additionally yield exciting insights into the heterogeneous spatial distributions of factors influencing car-sharing behaviour. Additionally, our study offers effective as well as highly interpretable methods for diagnosing and planning the placement of car-sharing stations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14421v1"
    ],
    "publication_venue": "16 pages, 6 figures",
    "doi": "10.1016/j.jtrangeo.2023.103765"
}