{
    "arxiv_id": "2303.09698",
    "paper_title": "Methodology for physics-informed generation of synthetic neutron time-of-flight measurement data",
    "authors": [
        "Noah Walton",
        "Jesse Brown",
        "William Fritsch",
        "Dave Brown",
        "Gustavo Nobre",
        "Vladimir Sobes"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "physics.comp-ph"
    ],
    "abstract": "Accurate neutron cross section data are a vital input to the simulation of nuclear systems for a wide range of applications from energy production to national security. The evaluation of experimental data is a key step in producing accurate cross sections. There is a widely recognized lack of reproducibility in the evaluation process due to its artisinal nature and therefore there is a call for improvement within the nuclear data community. This can be realized by automating/standardizing viable parts of the process, namely, parameter estimation by fitting theoretical models to experimental data. There are numerous candidate methods to approach this type of problem, but many rely on large, labelled datasets that are not accessible to the nuclear data evaluator. This work leverages problem-specific physics, Monte Carlo sampling, and a general methodology for data synthesis to generate unlimited, labelled experimental cross-section data of high-utility. The synthesized data is said to be of high-utility because it is statistically similar to the observed data. Heuristic and, where applicable, rigorous statistical comparisons to observed data support this claim. An open-source software is published alongside this article that executes the complete methodology to produce high-utility synthetic datasets. The goal of this work is to provide an approach and corresponding tool that will allow the evaluation community to begin exploring more data-driven, ML-based solutions to long-standing challenges in the field.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09698v1"
    ],
    "publication_venue": "13 pages, 5 figures"
}