{
    "arxiv_id": "2303.14912",
    "paper_title": "Weak Antilocalization and topological edge states in PdSn$_4$",
    "authors": [
        "N. K. Karn",
        "M. M. Sharma",
        "V. P. S. Awana"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "cond-mat.str-el"
    ],
    "abstract": "Here we report, the successful synthesis of single crystals of topological semimetal (TSM) candidate, PdSn$_4$ using the self-grown route. The synthesized crystal is well characterized through X-ray diffraction (XRD), field emission scanning electron microscopy (FESEM), and X-ray photoelectron spectroscopy (XPS). Detailed Rietveld analysis of the powder XRD pattern of PdSn$_4$ confirmed the same to crystallize in the Aea2 space group instead of reported Ccce. A large magnetoresistance (MR) along with Subnikov-de Haas oscillations have been observed in magnetotransport measurements at 2K. The presence of a weak antilocalization (WAL) effect in synthesized PdSn$_4$ crystal is confirmed and analyzed using Hikami Larkin Nagaoka (HLN) formalism, being applied on magnetoconductivity of the same at the low magnetic field. An extended Kohler rule is implemented on MR data, to determine the role of the scattering process and temperature-dependent carrier density on transport phenomenon in PdSn$_4$. Further, the non-trivial band topology and presence of edge states are shown through density functional theory (DFT) based theoretical calculations. All calculations are performed considering the Aea2 space group symmetry. The calculated Z2 invariants suggest the presence of weak topological insulating properties in PdSn$_4$. Clear evidence of topological edge states at the $Γ$ point is visible in calculated edge state spectra. This is the first report on PdSn$_4$, showing the presence of SdH oscillation in magneto transport measurement.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14912v1"
    ],
    "publication_venue": "26 PAGES TEXT + FIGS. REVISED J. APPL. PHYS. 2023",
    "doi": "10.1063/5.0145377"
}