{
    "arxiv_id": "2303.08643",
    "paper_title": "Phase Curves of Kuiper Belt Objects, Centaurs, and Jupiter Family Comets from the ATLAS Survey",
    "authors": [
        "Matthew M. Dobson",
        "Megan E. Schwamb",
        "Susan D. Benecchi",
        "Anne J. Verbiscer",
        "Alan Fitzsimmons",
        "Luke J. Shingles",
        "Larry Denneau",
        "A. N. Heinze",
        "Ken W. Smith",
        "John L. Tonry",
        "Henry Weiland",
        "David. R. Young"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "The Kuiper belt objects, the Centaurs, and the Jupiter-family comets form an evolutionary continuum of small outer Solar System objects, and their study allows us to gain insight into the history and evolution of the Solar System. Broadband photometry can be used to measure their phase curves, allowing a first-order probe into the surface properties of these objects, though limited telescope time makes measuring accurate phase curves difficult. We make use of serendipitous broadband photometry from the long-baseline, high-cadence ATLAS survey to measure the phase curves for a sample of 18 Kuiper belt objects, Centaurs, and Jupiter-family comets with unprecedentedly large datasets. We find phase curves with previously reported negative slopes become positive with increased data and are thus due to insufficient sampling of the phase curve profile, and not a real physical effect. We search for correlations between phase curve parameters, finding no strong correlations between any parameter pair, consistent with the findings of previous studies. We search for instances of cometary activity in our sample, finding a previously reported outburst by Echeclus and a new epoch of increased activity by Chiron. Applying the main belt asteroid HG1G2 phase curve model to three Jupiter-family comets in our sample with large phase angle spans, we find their slope parameters imply surfaces more consistent with those of carbonaceous main belt asteroids than silicaceous ones.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08643v1"
    ],
    "publication_venue": "42 pages, 24 figures, accepted for publication to the Planetary Science Journal. Supplementary materials will be available in the online journal version"
}