{
    "arxiv_id": "2303.11359",
    "paper_title": "Compact Symmetric Objects: A Distinct Population of Jetted Active Galaxies",
    "authors": [
        "S. Kiehlmann",
        "A. C. S. Readhead",
        "S. O'Neill",
        "P. N. Wilkinson",
        "M. L. Lister",
        "I. Liodakis",
        "S. Bruzewski",
        "T. J. Pearson",
        "E. Sheldahl",
        "A. Siemiginowska",
        "K. Tassis",
        "G. B. Taylor"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Compact Symmetric Objects (CSOs) are a class of compact, jetted Active Galactic Nuclei (AGN) whose jet axes are not aligned close to the line of sight, and whose observed emission is not predominantly relativistically boosted towards us. Using complete samples of CSOs, we present three independent lines of evidence, based on their relative numbers, their redshift distributions, and their size distributions, which show conclusively that most CSOs do not evolve into larger-scale radio sources. Thus CSOs belong to a distinct population of jetted-AGN. This population should be characterized as \"short-lived\", as opposed to \"young\". We show that there is a sharp upper cutoff in the CSO size distribution at $\\approx$ 500 pc, which cannot result from random episodic fueling events. There is clearly something that limits the fueling to $\\lesssim 100 M_\\odot$. Possible origins of CSOs, if not related to the fueling, must be related to the accretion disk, or the collimation of the relativistic jets. CSOs may well have a variety of origins, with each of the above mechanisms producing subsets of CSOs. Whatever the physical mechanism(s) might be, the distinct differences between CSOs and other jetted-AGN provide crucial insights into the formation and evolution of relativistic jets in AGN and the supermassive black holes that drive them.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11359v1"
    ],
    "publication_venue": "27 pages, 9 figures, 6 tables"
}