{
    "arxiv_id": "2303.16524",
    "paper_title": "Ensemble Learning Model on Artificial Neural Network-Backpropagation (ANN-BP) Architecture for Coal Pillar Stability Classification",
    "authors": [
        "G. Aileen Mendrofa",
        "Gatot Fatwanto Hertono",
        "Bevina Desjwiandara Handari"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 2,
    "categories": [
        "cs.LG"
    ],
    "abstract": "Pillars are important structural units used to ensure mining safety in underground hard rock mines. Therefore, precise predictions regarding the stability of underground pillars are required. One common index that is often used to assess pillar stability is the Safety Factor (SF). Unfortunately, such crisp boundaries in pillar stability assessment using SF are unreliable. This paper presents a novel application of Artificial Neural Network-Backpropagation (ANN-BP) and Deep Ensemble Learning for pillar stability classification. There are three types of ANN-BP used for the classification of pillar stability distinguished by their activation functions: ANN-BP ReLU, ANN-BP ELU, and ANN-BP GELU. This research also presents a new labeling alternative for pillar stability by considering its suitability with the SF. Thus, pillar stability is expanded into four categories: failed with a suitable safety factor, intact with a suitable safety factor, failed without a suitable safety factor, and intact without a suitable safety factor. There are five inputs used for each model: pillar width, mining height, bord width, depth to floor, and ratio. The results showed that the ANN-BP model with Ensemble Learning could improve ANN-BP performance with an average accuracy of 86.48% and an F_2-score of 96.35% for the category of failed with a suitable safety factor.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16524v1",
        "http://arxiv.org/pdf/2303.16524v2"
    ],
    "publication_venue": "The following article has been submitted to AIP Proceeding. After it is published, it will be found at https://publishing.aip.org/resources/librarians/products/journals/"
}