{
    "arxiv_id": "2303.09989",
    "paper_title": "Finding Competence Regions in Domain Generalization",
    "authors": [
        "Jens Müller",
        "Stefan T. Radev",
        "Robert Schmier",
        "Felix Draxler",
        "Carsten Rother",
        "Ullrich Köthe"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-06-13"
    ],
    "latest_version": 2,
    "categories": [
        "cs.LG",
        "stat.ML"
    ],
    "abstract": "We investigate a \"learning to reject\" framework to address the problem of silent failures in Domain Generalization (DG), where the test distribution differs from the training distribution. Assuming a mild distribution shift, we wish to accept out-of-distribution (OOD) data from a new domain whenever a model's estimated competence foresees trustworthy responses, instead of rejecting OOD data outright. Trustworthiness is then predicted via a proxy incompetence score that is tightly linked to the performance of a classifier. We present a comprehensive experimental evaluation of existing proxy scores as incompetence scores for classification and highlight the resulting trade-offs between rejection rate and accuracy gain. For comparability with prior work, we focus on standard DG benchmarks and consider the effect of measuring incompetence via different learned representations in a closed versus an open world setting. Our results suggest that increasing incompetence scores are indeed predictive of reduced accuracy, leading to significant improvements of the average accuracy below a suitable incompetence threshold. However, the scores are not yet good enough to allow for a favorable accuracy/rejection trade-off in all tested domains. Surprisingly, our results also indicate that classifiers optimized for DG robustness do not outperform a naive Empirical Risk Minimization (ERM) baseline in the competence region, that is, where test samples elicit low incompetence scores.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09989v1",
        "http://arxiv.org/pdf/2303.09989v2"
    ],
    "publication_venue": "The paper has been published at TMLR (see https://openreview.net/forum?id=TSy0vuwQFN)"
}