{
    "arxiv_id": "2303.16494",
    "paper_title": "EnKSGD: A Class Of Preconditioned Black Box Optimization And Inversion Algorithms",
    "authors": [
        "Brian Irwin",
        "Sebastian Reich"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2024-06-24"
    ],
    "latest_version": 1,
    "categories": [
        "math.OC",
        "math.NA"
    ],
    "abstract": "In this paper, we introduce the Ensemble Kalman-Stein Gradient Descent (EnKSGD) class of algorithms. The EnKSGD class of algorithms builds on the ensemble Kalman filter (EnKF) line of work, applying techniques from sequential data assimilation to unconstrained optimization and parameter estimation problems. The essential idea is to exploit the EnKF as a black box (i.e. derivative-free, zeroth order) optimization tool if iterated to convergence. In this paper, we return to the foundations of the EnKF as a sequential data assimilation technique, including its continuous-time and mean-field limits, with the goal of developing faster optimization algorithms suited to noisy black box optimization and inverse problems. The resulting EnKSGD class of algorithms can be designed to both maintain the desirable property of affine-invariance, and employ the well-known backtracking line search. Furthermore, EnKSGD algorithms are designed to not necessitate the subspace restriction property and variance collapse property of previous iterated EnKF approaches to optimization, as both these properties can be undesirable in an optimization context. EnKSGD also generalizes beyond the $L^{2}$ loss, and is thus applicable to a wider class of problems than the standard EnKF. Numerical experiments with both linear and nonlinear least squares problems, as well as maximum likelihood estimation, demonstrate the faster convergence of EnKSGD relative to alternative EnKF approaches to optimization.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16494v1"
    ],
    "publication_venue": "20 pages, 3 figures",
    "doi": "10.1137/23M1561142"
}