{
    "arxiv_id": "2303.17791",
    "paper_title": "Analysis of the current status of tuberculosis transmission in China based on a heterogeneity model",
    "authors": [
        "Chuanqing Xu",
        "Kedeng Cheng",
        "Yu Wang",
        "Songbai Guo",
        "Maoxing Liu",
        "Xiaojing Wang",
        "Zhiguo Zhang"
    ],
    "submission_date": "2023-03-31",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "stat.AP"
    ],
    "abstract": "Tuberculosis (TB) is an infectious disease transmitted through the respiratory system. China is one of the countries with a high burden of TB. Since 2004, an average of more than 800,000 cases of active TB have been reported each year in China. Analyzing the case data from 2004-2018, we find significant differences in TB incidence by age group. Therefore, the effect of age heterogeneous structure on TB transmission needs further study. We develop a model of TB to explore the role of age heterogeneity as a factor in TB transmission. The model is fitted numerically using the nonlinear least squares method to obtain the key parameters in the model, and the basic reproduction number Rv 0.8017 is calculated and the sensitivity anal-ysis of Rv to the parameters is given. The simulation results show that reducing the number of new infections in the elderly population and increasing the recovery rate of elderly patients with the disease could significantly reduce the transmission of tuberculosis. Furthermore the feasibility of achieving the goals of the WHO End TB Strategy in China is assessed, and we obtain that with existing TB control measures it will take another 30 years for China to reach the WHO goal to reduce 90% of the number of new cases by year 2049. However, in theoretical it is feasible to reach the WHO strategic goal of ending tuberculosis by 2035 if the group contact rate in the elderly population can be reduced though it is difficulty to reduce the contact rate.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17791v1"
    ],
    "publication_venue": "We think this is a very interesting work that gives a good understanding of the current TB transmission in China and assesses the possibility of China achieving the 2035 TB control target and also explores possible ways for how to prevent and control the TB in China"
}