{
    "arxiv_id": "2303.14513",
    "paper_title": "Shadows in dyonic Kerr-Sen black holes",
    "authors": [
        "Soumya Jana",
        "Sayan Kar"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-04-04"
    ],
    "latest_version": 2,
    "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
    ],
    "abstract": "Black holes with dyonic charges in Einstein-Maxwell-dilaton-axion supergravity theory are revisited in the context of black hole shadows. We consider static as well as rotating (namely the dyonic Kerr-Sen) black holes. The matter stress-energy tensor components, sourced by the Maxwell, axion and dilaton fields satisfy the standard energy conditions. The analytical expressions for the horizon and the shadow radius of the static spacetimes demonstrate their dependence on $P^2+Q^2$ ($P$, $Q$ the magnetic and electric charges, respectively) and the mass parameter $M$. The shadow radius lies in the range $2M <R_{shadow}<3\\sqrt{3} M$ and there is no stable photon orbit outside the horizon. Further, shadows cast by the rotating dyonic Kerr-Sen black holes are also studied and compared graphically with their Kerr-Newman and Kerr-Sen counterparts. Deviation of the shadow boundary is prominent with the variation of the magnetic charge, for the relatively slowly rotating dyonic Kerr-Sen spacetimes. We test any possible presence of a magnetic monopole charge in the backdrop of recent EHT observations for the supermassive black holes M87$^*$ and Sgr A$^*$. Deviation from circularity of the shadow boundary ($ΔC$) and deviation of the average shadow radius from the Schwarzschild shadow radius (quantified as the fractional deviation parameter $δ$) are the two observables used here. Observational bound on $ΔC$ (available only for M87$^*$) is satisfied for all theoretically allowed regions of parameter space and thus cannot constrain the parameters. The observational bound on $δ$ available for Sgr A$^*$ translates into an upper limit on any possible magnetic monopole charge linked to Sgr A$^*$ and is given as $P\\lesssim 0.873\\, M$. Such a constraint on $P$ is however expected to be far more stringent for other astrophysical tests.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14513v1",
        "http://arxiv.org/pdf/2303.14513v2"
    ],
    "publication_venue": "24 pages, 8 figures, references added"
}