{
    "arxiv_id": "2303.12364",
    "paper_title": "ExBEHRT: Extended Transformer for Electronic Health Records to Predict Disease Subtypes & Progressions",
    "authors": [
        "Maurice Rupp",
        "Oriane Peter",
        "Thirupathi Pattipaka"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 2,
    "categories": [
        "cs.LG",
        "cs.AI"
    ],
    "abstract": "In this study, we introduce ExBEHRT, an extended version of BEHRT (BERT applied to electronic health records), and apply different algorithms to interpret its results. While BEHRT considers only diagnoses and patient age, we extend the feature space to several multimodal records, namely demographics, clinical characteristics, vital signs, smoking status, diagnoses, procedures, medications, and laboratory tests, by applying a novel method to unify the frequencies and temporal dimensions of the different features. We show that additional features significantly improve model performance for various downstream tasks in different diseases. To ensure robustness, we interpret model predictions using an adaptation of expected gradients, which has not been previously applied to transformers with EHR data and provides more granular interpretations than previous approaches such as feature and token importances. Furthermore, by clustering the model representations of oncology patients, we show that the model has an implicit understanding of the disease and is able to classify patients with the same cancer type into different risk groups. Given the additional features and interpretability, ExBEHRT can help make informed decisions about disease trajectories, diagnoses, and risk factors of various diseases.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12364v1",
        "http://arxiv.org/pdf/2303.12364v2"
    ],
    "publication_venue": "ICLR 2023 Workshop on Trustworthy Machine Learning for Healthcare (Website: https://sites.google.com/view/tml4h2023/accepted-papers )"
}