{
    "arxiv_id": "2303.10688",
    "paper_title": "Quantum-enhanced sensing on an optical transition via emergent collective quantum correlations",
    "authors": [
        "Johannes Franke",
        "Sean R. Muleady",
        "Raphael Kaubruegger",
        "Florian Kranzl",
        "Rainer Blatt",
        "Ana Maria Rey",
        "Manoj K. Joshi",
        "Christian F. Roos"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-09-01"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "cond-mat.quant-gas",
        "physics.atom-ph"
    ],
    "abstract": "The control over quantum states in atomic systems has led to the most precise optical atomic clocks to date. Their sensitivity is currently bounded by the standard quantum limit, a fundamental floor set by quantum mechanics for uncorrelated particles, which can nevertheless be overcome when operated with entangled particles. Yet demonstrating a quantum advantage in real world sensors is extremely challenging and remains to be achieved aside from two remarkable examples, LIGO and more recently HAYSTAC. Here we illustrate a pathway for harnessing scalable entanglement in an optical transition using 1D chains of up to 51 ions with state-dependent interactions that decay as a power-law function of the ion separation. We show our sensor can be made to behave as a one-axis-twisting (OAT) model, an iconic fully connected model known to generate scalable squeezing. The collective nature of the state manifests itself in the preservation of the total transverse magnetization, the reduced growth of finite momentum spin-wave excitations, the generation of spin squeezing comparable to OAT (a Wineland parameter of $-3.9 \\pm 0.3$ dB for only N = 12 ions) and the development of non-Gaussian states in the form of atomic multi-headed cat states in the Q-distribution. The simplicity of our protocol enables scalability to large arrays with minimal overhead, opening the door to advances in timekeeping as well as new methods for preserving coherence in quantum simulation and computation. We demonstrate this in a Ramsey-type interferometer, where we reduce the measurement uncertainty by $-3.2 \\pm 0.5$ dB below the standard quantum limit for N = 51 ions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10688v1"
    ],
    "publication_venue": "During the completion of our work, we became aware of three related experiments using dressed Rydberg interactions in tweezer and microtrap array platforms. See arXiv:2303.08053, arXiv:2303.08078 and arXiv:2303.08805. This manuscript contains 14 Pages and 5 figures",
    "doi": "10.1038/s41586-023-06472-z"
}