{
    "arxiv_id": "2303.08895",
    "paper_title": "Rollout-Based Charging Strategy for Electric Trucks with Hours-of-Service Regulations (Extended Version)",
    "authors": [
        "Ting Bai",
        "Yuchao Li",
        "Karl H. Johansson",
        "Jonas Mårtensson"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2024-01-24"
    ],
    "latest_version": 4,
    "categories": [
        "eess.SY"
    ],
    "abstract": "Freight drivers of electric trucks need to design charging strategies for where and how long to recharge the truck in order to complete delivery missions on time. Moreover, the charging strategies should be aligned with drivers' driving and rest time regulations, known as hours-of-service (HoS) regulations. This letter studies the optimal charging problems of electric trucks with delivery deadlines under HoS constraints. We assume that a collection of charging and rest stations is given along a pre-planned route with known detours and that the problem data are deterministic. The goal is to minimize the total cost associated with the charging and rest decisions during the entire trip. This problem is formulated as a mixed integer program with bilinear constraints, resulting in a high computational load when applying exact solution approaches. To obtain real-time solutions, we develop a rollout-based approximate scheme, which scales linearly with the number of stations while offering solid performance guarantees. We perform simulation studies over the Swedish road network based on realistic truck data. The results show that our rollout-based approach provides near-optimal solutions to the problem in various conditions while cutting the computational time drastically.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08895v1",
        "http://arxiv.org/pdf/2303.08895v2",
        "http://arxiv.org/pdf/2303.08895v3",
        "http://arxiv.org/pdf/2303.08895v4"
    ],
    "publication_venue": "Extended version of the paper published in IEEE Control Systems Letters",
    "doi": "10.1109/LCSYS.2023.3285137"
}