{
    "arxiv_id": "2303.16289",
    "paper_title": "Long-term experimental study of price responsive predictive control in a real occupied single-family house with heat pump",
    "authors": [
        "Simon Thorsteinsson",
        "Alex Arash Sand Kalaee",
        "Pierre Vogler-Finck",
        "Henrik Lund Stærmose",
        "Ivan Katic",
        "Jan Dimon Bendtsen"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY"
    ],
    "abstract": "The continuous introduction of renewable electricity and increased consumption through electrification of the transport and heating sector challenges grid stability. This study investigates load shifting through demand side management as a solution. We present a four-month experimental study of a low-complexity, hierarchical Model Predictive Control approach for demand side management in a near-zero emission occupied single-family house in Denmark. The control algorithm uses a price signal, weather forecast, a single-zone building model, and a non-linear heat pump efficiency model to generate a space-heating schedule. The weather-compensated, commercial heat pump is made to act smart grid-ready through outdoor temperature input override to enable heat boosting and forced stops to accommodate the heating schedule. The cost reduction from the controller ranged from 2-33% depending on the chosen comfort level. The experiment demonstrates that load shifting is feasible and cost-effective, even without energy storage, and that the current price scheme provides an incentive for Danish end-consumers to shift heating loads. However, issues related to controlling the heat pump through input-manipulation were identified, and the authors propose a more promising path forward involving coordination with manufacturers and regulators to make commercial heat pumps truly smart grid-ready.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16289v1"
    ],
    "publication_venue": null
}