{
    "arxiv_id": "2303.16695",
    "paper_title": "Scalar induced gravitational waves in modified teleparallel gravity theories",
    "authors": [
        "Charalampos Tzerefos",
        "Theodoros Papanikolaou",
        "Emmanuel N. Saridakis",
        "Spyros Basilakos"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
    ],
    "abstract": "Primordial black holes (PBHs) forming out of the collapse of enhanced cosmological perturbations provide access to the early Universe through their associated observational signatures. In particular, enhanced cosmological perturbations collapsing to form PBHs are responsible for the generation of a stochastic gravitational-wave background (SGWB) induced by second-order gravitational interactions, usually called scalar induced gravitational waves (SIGWs). This SGWB is sensitive to the underlying gravitational theory; hence it can be used as a novel tool to test the standard paradigm of gravity and constrain possible deviations from general relativity. In this work, we study the aforementioned GW signal within modified teleparallel gravity theories, developing a formalism for the derivation of the GW spectral abundance within any form of gravitational action. At the end, working within viable $f(T,φ)$ models without matter-gravity couplings, and accounting for the effect of mono-parametric $f(T)$ gravity at the level of the source and the propagation of the tensor perturbations, we show that the respective GW signal is indistinguishable from that within GR. Interestingly, we find that in order to break the degeneracy between different $f(T)$ theories through the portal of SIGWs one should necessarily consider non-minimal matter-gravity couplings at the level of the gravitational action.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16695v1"
    ],
    "publication_venue": "16 pages without appendices (24 in total), 2 figures"
}