{
    "arxiv_id": "2303.11523",
    "paper_title": "20 GHz fiber-integrated femtosecond pulse and supercontinuum generation with a resonant electro-optic frequency comb",
    "authors": [
        "Pooja Sekhar",
        "Connor Fredrick",
        "David R. Carlson",
        "Zachary Newman",
        "Scott A. Diddams"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics"
    ],
    "abstract": "Frequency combs with mode spacing in the range of 10 to 20 gigahertz (GHz) are critical for increasingly important applications such as astronomical spectrograph calibration, high-speed dual-comb spectroscopy, and low-noise microwave generation. While electro-optic modulators and microresonators can provide narrowband comb sources at this repetition rate, a significant remaining challenge is a means to produce pulses with sufficient peak power to initiate nonlinear supercontinuum generation spanning hundreds of terahertz (THz) as required for self-referencing in these applications. Here, we provide a simple, robust, and universal solution to this problem using off-the-shelf polarization-maintaining (PM) amplification and nonlinear fiber components. This fiber-integrated approach for nonlinear temporal compression and supercontinuum generation is demonstrated with a resonant electro-optic frequency comb at 1550 nm. We show how to readily achieve pulses shorter than 60 fs at a repetition rate of 20 GHz and with peak powers in excess of 2 kW. The same technique can be applied to picosecond pulses at 10 GHz to demonstrate temporal compression by a factor of 9x yielding 50 fs pulses with peak power of 5.5 kW. These compressed pulses enable flat supercontinuum generation spanning more than 600 nm after propagation through multi-segment dispersion-tailored anomalous-dispersion highly nonlinear fiber (HNLF) or tantala waveguides. The same 10 GHz source can readily achieve an octave-spanning spectrum for self-referencing in dispersion-engineered silicon nitride waveguides. This simple all-fiber approach to nonlinear spectral broadening fills a critical gap for transforming any narrowband 10 to 20 GHz frequency comb into a broadband spectrum for a wide range of applications that benefit from the high pulse rate and require access to the individual comb modes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11523v1"
    ],
    "publication_venue": "15 pages, 11 figures"
}