{
    "arxiv_id": "2303.08226",
    "paper_title": "DeepAxe: A Framework for Exploration of Approximation and Reliability Trade-offs in DNN Accelerators",
    "authors": [
        "Mahdi Taheri",
        "Mohammad Riazati",
        "Mohammad Hasan Ahmadilivani",
        "Maksim Jenihhin",
        "Masoud Daneshtalab",
        "Jaan Raik",
        "Mikael Sjodin",
        "Bjorn Lisper"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cs.AI",
        "cs.AR"
    ],
    "abstract": "While the role of Deep Neural Networks (DNNs) in a wide range of safety-critical applications is expanding, emerging DNNs experience massive growth in terms of computation power. It raises the necessity of improving the reliability of DNN accelerators yet reducing the computational burden on the hardware platforms, i.e. reducing the energy consumption and execution time as well as increasing the efficiency of DNN accelerators. Therefore, the trade-off between hardware performance, i.e. area, power and delay, and the reliability of the DNN accelerator implementation becomes critical and requires tools for analysis. In this paper, we propose a framework DeepAxe for design space exploration for FPGA-based implementation of DNNs by considering the trilateral impact of applying functional approximation on accuracy, reliability and hardware performance. The framework enables selective approximation of reliability-critical DNNs, providing a set of Pareto-optimal DNN implementation design space points for the target resource utilization requirements. The design flow starts with a pre-trained network in Keras, uses an innovative high-level synthesis environment DeepHLS and results in a set of Pareto-optimal design space points as a guide for the designer. The framework is demonstrated in a case study of custom and state-of-the-art DNNs and datasets.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08226v1"
    ],
    "publication_venue": "This paper is accepted at the 24th International Symposium on Quality Electronic Design (ISQED) 2023, 8 pages, 4 figures, 4 tables"
}