{
    "arxiv_id": "2303.08285",
    "paper_title": "A comparative evaluation of turbulence models for simulation of unsteady cavitating flows",
    "authors": [
        "Dhruv Apte",
        "Mingming Ge",
        "Olivier Coutier-Delgosha"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2024-05-02"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "Cavitation is a complex multiphase phenomenon characterised by vapour bubbles forming due to a sudden pressure drop and is often accompanied by increased hull vibrations, increased radiated noise and decrease in propeller and impeller performance. Although the Reynolds-Averaged Navier-Stokes (RANS) method coupled with a cavitation model is still considered a practical tool to predict cavitating flows owing to its computational efficiency, it is unable to predict the unsteadiness of vapor shedding and over-predicts the eddy viscosity. To improve the prediction, an empirical eddy viscosity correction,[Reboud et al. 1998] was proposed to consider the compressibility effects produced by cavitation. Additionally, a new type of models termed as hybrid RANS-Large Eddy Simulation (LES) models have also been recently introduced in the community, having the ability to behave as a RANS or a LES model in different regions of the flow in order to combine the computational cost efficiency of RANS with the accuracy of LES modelling. However, there exists a lack of a comprehensive review of various such turbulence models like the k-ω Shear Stress Transport Model (SST), k-ω SST Scale-adaptive Simulation (SAS), k-ω SST Detached Eddy Simulation (DES), k-ω SST Delayed DES (DDES), Filter-Based Method (FBM) and Partially-Averaged Navier Stokes Method (PANS) to predict cavitating flows. In this work, we conduct such a review to compare their ability to predict cloud cavitating flows by comparing them with x-ray experimental data in a venturi. It is shown that with mesh refinement, standard models do show the vapor unsteadiness as seen in the experiment similar to that seen when using the Reboud correction. However, on local comparison of turbulence quantities, it is observed both forms of models have huge discrepancies with experimental data that does not improve downstream.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08285v1"
    ],
    "publication_venue": null,
    "doi": "10.1016/j.geoen.2023.212300"
}