{
    "arxiv_id": "2303.17162",
    "paper_title": "Physics-based bias-dependent compact modeling of 1/f noise in single- to few- layer 2D-FETs",
    "authors": [
        "Nikolaos Mavredakis",
        "Anibal Pacheco-Sanchez",
        "Md Hasibul Alam",
        "Anton Guimerà-Brunet",
        "Javier Martinez",
        "Jose Antonio Garrido",
        "Deji Akinwande",
        "David Jiménez"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "1/f noise is a critical figure of merit for the performance of transistors and circuits. For two-dimensional devices (2D-FETs), and especially for applications in the GHz range where short-channel FETs are required, velocity saturation (VS) effect can result in the reduction of 1/f noise at high longitudinal electric fields. A new physics-based compact model is for the first time introduced for single- to few- layer 2D-FETs in this study, precisely validating 1/f noise experiments for various types of devices. The proposed model mainly accounts for the measured 1/f noise bias dependence as the latter is defined by different physical mechanisms. Thus, analytical expressions are derived, valid in all regions of operation in contrast to conventional approaches available in literature so far, accounting for carrier number fluctuation (DN), mobility fluctuation (Dmu}) and contact resistance (DR) effects based on the underlying physics that rules these devices. DN mechanism due to trapping/detrapping together with an intense Coulomb scattering effect, dominates 1/f noise from medium to strong accumulation region while Dmu, is also demonstrated to modestly contribute in subthreshold region. DR can also be significant in very high carrier density. The VS induced reduction of 1/f noise measurements at high electric fields, is also remarkably captured by the model. The physical validity of the model can also assist in extracting credible conclusions when conducting comparisons between experimental data from devices with different materials or dielectrics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17162v1"
    ],
    "publication_venue": "Nanoscale, 2023, Advance Article",
    "doi": "10.1039/D3NR00922J"
}