{
    "arxiv_id": "2303.09276",
    "paper_title": "On coupled envelope evolution equations in the Hamiltonian theory of nonlinear surface gravity waves",
    "authors": [
        "Yan Li"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn",
        "math-ph",
        "physics.geo-ph"
    ],
    "abstract": "This paper presents a novel theoretical framework in the Hamiltonian theory of nonlinear surface gravity waves. The envelope of surface elevation and the velocity potential on the free water surface are introduced in the framework, which are shown to be a new pair of canonical variables. Using the two envelopes as the main unknowns, coupled envelope evolution equations (CEEEs) are derived based on a perturbation expansion. Similar to the High Order Spectral method, the CEEEs can be derived up to arbitrary order in wave steepness. In contrast, they have a temporal scale as slow as the rate of change of a wave spectrum and allow for the wave fields prescribed on a computational (spatial) domain with a much larger size and with spacing longer than the characteristic wavelength at no expense of accuracy and numerical efficiency. The energy balance equation is derived based on the CEEEs. The nonlinear terms in the CEEEs are in a form of the separation of wave harmonics, due to which an individual term is shown to have clear physical meanings in terms of whether or not it is able to force free waves which obey the dispersion relation. Both the nonlinear terms that can only lead to the forcing of bound waves and these which are capable of forcing free waves are demonstrated, with the latter through the analysis of the quartet and quintet resonant interactions of linear waves. The relations between the CEEEs and two other existing theoretical frameworks are established, including the theory for a train of Stokes waves up to second order in wave steepness [Fenton, J. waterway, Port, Coast. & Ocean Eng., 111, 2, 1985] and a semi-analytical framework for three-dimensional weakly nonlinear surface waves with arbitrary bandwidth and large directional spreading by Li & Li [Phys. Fluids, 33, 7, 2021].",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09276v1"
    ],
    "publication_venue": null,
    "doi": "10.1017/jfm.2023.205"
}