{
    "arxiv_id": "2303.07859",
    "paper_title": "Poisson-Nernst-Planck charging dynamics of an electric double layer capacitor: symmetric and asymmetric binary electrolytes",
    "authors": [
        "Ivan Palaia",
        "Adelchi J. Asta",
        "Megh Dutta",
        "Patrick B. Warren",
        "Benjamin Rotenberg",
        "Emmanuel Trizac"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2025-06-02"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.soft",
        "physics.chem-ph"
    ],
    "abstract": "A parallel plate capacitor containing an electrolytic solution is the\nsimplest model of a supercapacitor, or electric double layer capacitor. Using\nboth analytical and numerical techniques, we solve the Poisson-Nernst-Planck\nequations for such a system, describing the mean-field charging dynamics of the\ncapacitor, when a constant potential difference is abruptly applied to its\nplates. Working at constant total number of ions, we focus on the physical\nprocesses involved in the relaxation and, whenever possible, give its\nfunctional shape and exact time constants. We first review and study the case\nof a symmetric binary electrolyte, where we assume the two ionic species to\nhave the same charges and diffusivities. We then relax these assumptions and\npresent results for a generic strong (i.e. fully dissociated) binary\nelectrolyte. At low electrolyte concentration, the relaxation is simple to\nunderstand, as the dynamics of positive and negative ions appear decoupled. At\nhigher electrolyte concentration, we distinguish several regimes. In the linear\nregime (low voltages), relaxation is multi-exponential, it starts by the\nbuild-up of the equilibrium charge profile and continues with neutral mass\ndiffusion, and the relevant time scales feature both the average and the\nNernst-Hartley diffusion coefficients. In the purely nonlinear regime\n(intermediate voltages), the initial relaxation is slowed down exponentially\ndue to increased capacitance, while bulk effects become more and more evident.\nIn the fully nonlinear regime (high voltages), the dynamics of charge and mass\nare completely entangled and, asymptotically, the relaxation is linear in time.\nWe finally discuss non-ideal behavior in real capacitors and provide conditions\nfor which mean-field is expected to hold.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07859v1",
        "http://arxiv.org/pdf/2303.07859v2"
    ],
    "publication_venue": null
}