{
    "arxiv_id": "2303.17738",
    "paper_title": "Estimating the selection function of Gaia DR3 sub-samples",
    "authors": [
        "A. Castro-Ginard",
        "A. G. A. Brown",
        "Z. Kostrzewa-Rutkowska",
        "T. Cantat-Gaudin",
        "R. Drimmel",
        "S. Oh",
        "V. Belokurov",
        "A. R. Casey",
        "M. Fouesneau",
        "S. Khanna",
        "A. M. Price-Whelan",
        "H. W. Rix"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-08-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Understanding which sources are present in an astronomical catalogue and which are not is crucial for the accurate interpretation of astronomical data. In particular, for the multidimensional Gaia data, filters and cuts on different parameters or measurements introduces a selection function that may unintentionally alter scientific conclusions in subtle ways. We aim to develop a methodology to estimate the selection function for different sub-samples of stars in the Gaia catalogue. Comparing the number of stars in a given sub-sample to those in the overall Gaia catalogue, provides an estimate of the sub-sample membership probability, as a function of sky position, magnitude and colour. This estimate must differentiate the stochastic absence of sub-sample stars from selection effects. When multiplied with the overall Gaia catalogue selection function this provides the total selection function of the sub-sample. We present the method by estimating the selection function of the sources in Gaia DR3 with heliocentric radial velocity measurements. We also compute the selection function for the stars in the Gaia-Sausage/Enceladus sample, confirming that the apparent asymmetry of its debris across the sky is merely caused by selection effects. The developed method estimates the selection function of the stars present in a sub-sample of Gaia data, given that the sub-sample is completely contained in the Gaia parent catalogue (for which the selection function is known). This tool is made available in a GaiaUnlimited Python package.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17738v1"
    ],
    "publication_venue": "13 pages, 12 figures. Submitted to A&A",
    "doi": "10.1051/0004-6361/202346547"
}