{
    "arxiv_id": "2303.12561",
    "paper_title": "On Inflationary Models in f(R,T) Gravity with a Kinetic Coupling Term",
    "authors": [
        "A. Belhaj",
        "M. Benali",
        "Y. Hassouni",
        "M. Lamaaoune"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "hep-th"
    ],
    "abstract": "We investigate inflationary models in f(R,T) modified gravity with a kinetic coupling term ω^2 G^{μν}\\partial_μφ\\partial_νφhaving a positive factor needed to remove the ghosts. Taking f(R,T)=R+2βT, we calculate and analyse the relevant observable quantities including the spectral index $n_s$ and the tensor-to-scalar ratio r using the slow-roll approximations. Concretely, we consider two scenarios described by the decoupling and the coupling behaviors between the scalar potential and the f(R,T) gravity via the moduli space by dealing with two potentials being the quartic one V(φ) =λφ^4 and the small field inflation V(φ) =V_0(1- (\\fracφμ)^α). For the quartic inflation model, we consider a decoupling behavior. For the small field inflation, however, we present the parameter decoupling and coupling scenarios. For both scenarios, we compute and inspect n_s and r showing interesting results. For three different values of the number of e-folds N=60,65 and 70, we find that the coupling between f(R,T)1 and the scalar potential via the moduli space provides an excellent agreement with the observational findings. In the last part of this work, we provide a possible discussion on the amplitude of scalar power spectrum needed to provide a viability of the proposed theory. Considering the second potential form in the parameter coupling scenario, we find acceptable values in certain points of the moduli space.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12561v1"
    ],
    "publication_venue": "Latex, 16 pages, 3 figures. Published version 23. Authors in alphabetical order",
    "doi": "10.1142/S0217751X23500434"
}