{
    "arxiv_id": "2303.14210",
    "paper_title": "Disk settling and dynamical heating: histories of Milky Way-mass stellar disks across cosmic time in the FIRE simulations",
    "authors": [
        "Fiona McCluskey",
        "Andrew Wetzel",
        "Sarah R. Loebman",
        "Jorge Moreno",
        "Claude-Andre Faucher-Giguere"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We study the kinematics of stars both at their formation and today within 14 Milky Way (MW)-mass galaxies from the FIRE- 2 cosmological zoom-in simulations. We quantify the relative importance of cosmological disk settling and post-formation dynamical heating. We identify three eras: a Pre-Disk Era (typically >8 Gyr ago), when stars formed on dispersion-dominated orbits; an Early-Disk Era (~ 8 - 4 Gyr ago), when stars started to form on rotation-dominated orbits but with high velocity dispersion, sigma_form; and a Late-Disk Era (< 4 Gyr ago), when stars formed with low sigma_form. sigma_form increased with time during the Pre-Disk Era, peaking ~ 8 Gyr ago, then decreased throughout the Early-Disk Era as the disk settled and remained low throughout the Late-Disk Era. By contrast, the velocity dispersion measured today, sigma_now, increases monotonically with age because of stronger post-formation heating for Pre-Disk stars. Importantly, most of sigma_now was in place at formation, not added post-formation, for stars younger than ~ 10 Gyr. We compare the evolution of the three velocity components: at all times, sigma_R,form > sigma_phi,form > sigma_Z,form. Post-formation heating primarily increased sigma_R at ages < 4 Gyr but acted nearly isotropically for older stars. The lookback time that the disk began to settle correlates with its dynamical state today: earlier-settling galaxies currently form colder disks. Young stars in FIRE-2 are kinematically hotter than the MW but broadly agree with M31 and M33. Including stellar cosmic-ray feedback does not significantly change the amount of disk rotational support at fixed stellar mass.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14210v1"
    ],
    "publication_venue": "20 pages, submitted to MNRAS"
}