{
    "arxiv_id": "2303.08841",
    "paper_title": "X-HESS: a large sample of highly accreting serendipitous AGN under the XMM-Newton microscope",
    "authors": [
        "M. Laurenti",
        "F. Tombesi",
        "F. Vagnetti",
        "E. Piconcelli",
        "M. Guainazzi",
        "R. Middei"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
    ],
    "abstract": "The bulk of X-ray spectroscopic studies of active galactic nuclei (AGN) are focused on local ($z < 0.1$) sources with low-to-moderate ($< 0.3$) Eddington ratio ($λ_\\mathrm{Edd}$). It is then mandatory to overcome this limitation and improve our understanding of highly accreting AGN. In this work we present the preliminary results from the analysis of a sample of $\\sim70$ high-$λ_\\mathrm{Edd}$ radio-quiet AGN at $0.06 \\leq z \\leq 3.3$, based on the 10th release of the XMM-Newton serendipitous source catalogue, that we named as XMM-Newton High-Eddington Serendipitous AGN Sample (X-HESS). Almost $\\sim35\\%$ of the X-HESS AGN have multi-epoch archival observations and $\\sim70\\%$ of the sources can rely on simultaneous OM optical data. First results reveal sources showing signatures of ultra-fast outflows and remarkable long- and short-term X-ray flux variations. Indeed in J095847.88+690532.7 ($z \\sim 1.3$), one of the most densely monitored objects hosting a $\\sim$$10^9\\,M_\\odot$ supermassive black hole, we discovered a variation of the soft X-ray flux by a factor of > 2 over approximately one week (rest-frame). Large variations in the power-law continuum photon index $Γ$ are also observed, questioning expectations from previously reported $Γ- λ_\\mathrm{Edd}$ relations, for which $Γ\\geq 2$ would be a ubiquitous hallmark of AGN with $λ_\\mathrm{Edd} \\sim 1$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08841v1"
    ],
    "publication_venue": "7 pages, 5 figures, proceedings of the XMM-Newton Workshop 2022 \"Black hole accretion under the X-ray microscope\". Accepted for publication in Astronomische Nachrichten",
    "doi": "10.1002/asna.20230053"
}