{
    "arxiv_id": "2303.16375",
    "paper_title": "The large-scale structure of globular clusters in the NGC 1052 group",
    "authors": [
        "Maria Luisa Buzzo",
        "Duncan A. Forbes",
        "Jean P. Brodie",
        "Steven R. Janssens",
        "Warrick J. Couch",
        "Aaron J. Romanowsky",
        "Jonah S. Gannon"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Prompted by the many controversial claims involving the NGC 1052 group, including that it hosts two dark matter-free galaxies with overluminous and monochromatic globular cluster (GC) systems, here we map out the large-scale structure (LSS) of GCs over the entire group. To recover the LSS, we use archival optical CFHT imaging data. We recover two GC density maps, one based on universal photometric properties of GCs from simple stellar population models, and one based on the properties of spectroscopically confirmed GCs in DF2 and DF4 (the two dwarf galaxies with overluminous GC populations). Both selection methods reveal overdensities around the massive galaxies in the group, as well as around NGC 1052 itself, that are coincident with the positions of previously identified stellar streams and tidal features. No intragroup GCs are found connecting these structures to any of the dwarf galaxies. We find, however, two other dwarfs in the group hosting GC systems. These include RCP32 with 2 GCs with ages equivalent to the GCs around NGC 1052, and DF9 with 3 GCs with ages similar to the GCs around DF2 and DF4. We conclude that the GC distribution in the group does not strongly support any formation scenario in particular. It favours, nonetheless, scenarios relying on galaxy-galaxy interactions and on the coeval formation of GCs around the DM-free dwarf galaxies. These may include the recently proposed bullet-dwarf formation, as well as high-redshift tidal dwarf galaxy models.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16375v1"
    ],
    "publication_venue": "Accepted for publication in MNRAS. 11 pages, 5 figures, 2 tables",
    "doi": "10.1093/mnras/stad1012"
}