{
    "arxiv_id": "2303.08126",
    "paper_title": "Interlayer antisynchronization in degree-biased duplex networks",
    "authors": [
        "Sayantan Nag Chowdhury",
        "Sarbendu Rakshit",
        "Chittaranjan Hens",
        "Dibakar Ghosh"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "nlin.AO"
    ],
    "abstract": "With synchronization being one of nature's most ubiquitous collective behaviors, the field of network synchronization has experienced tremendous growth, leading to significant theoretical developments. However, most of these previous studies consider uniform connection weights and undirected networks with positive coupling. In the present article, we incorporate the asymmetry in a two-layer multiplex network by assigning the ratio of the adjacent nodes' degrees as the weights to the intralayer edges. Despite the presence of degree-biased weighting mechanism and attractive-repulsive coupling strengths, we are able to find the necessary conditions for intralayer synchronization and interlayer antisynchronization and test whether these two macroscopic states can withstand demultiplexing in a network. During the occurrence of these two states, we analytically calculate the oscillator's amplitude. In addition to deriving the local stability conditions for interlayer antisynchronization via the master stability function approach, we also construct a suitable Lyapunov function to determine a sufficient condition for global stability. We provide numerical evidence to show the necessity of negative interlayer coupling strength for the occurrence of antisynchronization, and such repulsive interlayer coupling coefficients can not destroy intralayer synchronization.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08126v1"
    ],
    "publication_venue": "16 pages, 5 figures (Accepted for publication in the journal Physical Review E)",
    "doi": "10.1103/PhysRevE.107.034313"
}