{
    "arxiv_id": "2303.09599",
    "paper_title": "cito: An R package for training neural networks using torch",
    "authors": [
        "Christian Amesoeder",
        "Florian Hartig",
        "Maximilian Pichler"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-10-10"
    ],
    "latest_version": 2,
    "categories": [
        "cs.LG"
    ],
    "abstract": "Deep Neural Networks (DNN) have become a central method for regression and classification tasks. Some packages exist that allow to fit DNN directly in R, but those are rather limited in their functionality. Most current deep learning applications rely on one of the major deep learning frameworks, in particular PyTorch or TensorFlow, to build and train DNNs. Using these frameworks, however, requires substantially more training and time than typical regression or machine learning functions in the R environment. Here, we present 'cito', a user-friendly R package for deep learning that allows to specify deep neural networks in the familiar formula syntax used in many R packages. To fit the models, 'cito' uses 'torch', taking advantage of the numerically optimized torch library, including the ability to switch between training models on CPUs or GPUs. Moreover, 'cito' includes many user-friendly functions for model plotting and analysis, including optional confidence intervals (CIs) based on bootstraps on predictions as well as explainable AI (xAI) metrics for effect sizes and variable importance with CIs and p-values. To showcase a typical analysis pipeline using 'cito', including its built-in xAI features to explore the trained DNN, we build a species distribution model of the African elephant. We hope that by providing a user-friendly R framework to specify, deploy and interpret deep neural networks, 'cito' will make this interesting model class more accessible to ecological data analysis. A stable version of 'cito' can be installed from the comprehensive R archive network (CRAN).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09599v1",
        "http://arxiv.org/pdf/2303.09599v2"
    ],
    "publication_venue": "15 pages, 4 figures, 2 tables"
}