{
    "arxiv_id": "2303.16034",
    "paper_title": "Error-corrected quantum repeaters with GKP qudits",
    "authors": [
        "Frank Schmidt",
        "Daniel Miller",
        "Peter van Loock"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "The Gottesman-Kitaev-Preskill (GKP) code offers the possibility to encode higher-dimensional qudits into individual bosonic modes with, for instance, photonic excitations. Since photons enable the reliable transmission of quantum information over long distances and since GKP states subject to photon loss can be recovered to some extent, the GKP code has found recent applications in theoretical investigations of quantum communication protocols. While previous studies have primarily focused on GKP qubits, the possible practical benefits of higher-dimensional GKP qudits are hitherto widely unexplored. In this paper, we carry out performance analyses for three quantum repeater protocols based on GKP qudits including concatenations with a multi-qudit quantum polynomial code. We find that the potential data transmission gains for qudits are often hampered by their decreased GKP error-correcting capabilities. However, we also identify parameter regimes in which having access to an increased number of quantum levels per mode can enhance the theoretically achievable secret-key rate of the quantum repeater. Some of our protocols share the attractive feature that local processing and complete error syndrome identification are realizable without online squeezing. Provided a supply of suitable multi-mode GKP states is available, this can be realized with a minimal set of passive linear optical operations, even when the logical qudits are composed of many physical qudits.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16034v1"
    ],
    "publication_venue": "19+11 pages, 6+4 figures. Comments welcome"
}