{
    "arxiv_id": "2303.08556",
    "paper_title": "Artificial Intelligence based drone for early disease detection and precision pesticide management in cashew farming",
    "authors": [
        "Manoj Kumar Rajagopal",
        "Bala Murugan MS"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "eess.IV"
    ],
    "abstract": "The use of unmanned aerial vehicles (UAV) is revolutionizing the agricultural industry. Cashews are grown by approximately 70% of small and marginal farmers, and the cashew industry plays a critical role in their economic development. To take timely counter measures against plant diseases and infections, it is imperative to monitor and detect diseases as early as possible and take suitable measures. Using UAVs, such as those that are equipped with artificial intelligence, can assist farmers by providing early detection of crop diseases and precision pesticide application. An edge computing paradigm of Artificial Intelligence is employed to process this image in order to make decisions with the least amount of latency possible. As a result of these decisions, the stage of infestation, the crops affected, the method of prevention of spreading the disease, and what type and amount of pesticides need to be applied can be determined. UAVs equipped with sensors detect disease patterns quickly and accurately over large areas. Combined with AI algorithms, these machines can analyse data from a variety of sources such as temperature, humidity, CO2 levels and soil composition. This allows them to recognize disease symptoms before they become visible. Early detection allows for more effective control strategies that can reduce costs caused by lost production due to infestations or crop failure. Using an end-to-end training architecture, mobileNetV2 determines how to classify anthracnose disease in cashew leaves. A standard PlantVillage dataset is used for performance evaluation and for standardization. Additionally, samples captured with a drone present a variety of image samples captured in a variety of conditions, which complicates the analysis. According to our analysis, we were able to identify the anthracnose with 95% accuracy and the healthy leaves with 99% accuracy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08556v1"
    ],
    "publication_venue": "18 pages, 5 figures"
}