{
    "arxiv_id": "2303.10044",
    "paper_title": "Electric field analysis in a cold-ion source using Stark spectroscopy of Rydberg atoms",
    "authors": [
        "Alisher Duspayev",
        "Georg Raithel"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-04-19"
    ],
    "latest_version": 1,
    "categories": [
        "physics.atom-ph",
        "quant-ph"
    ],
    "abstract": "We analyze electric fields in ion sources generated by quasi-continuous photo-ionization of cold Rb atoms trapped in the focal spot of a near-concentric, in-vacuum cavity for 1064-nm laser light. Ion streams are extracted with an external electric field, ${\\bf{F}}$. Stark effects of Rb 57$F$ and of nearby high-angular-momentum Rydberg levels, which exhibit large, linear Stark shifts, are employed to study the net electric-field probability distribution within the ion-source region over an extraction-field range of $0<F<0.35$ V/cm. For $F=0$, we also investigate ion-field-induced Stark spectra of the 60$P_{1/2}$-state, which exhibits a (lesser) quadratic electric-field response that affords a simplified electric-field analysis. Experimental Rydberg spectra are compared with theoretical Stark spectra, which are weighed with net electric-field distributions obtained from classical ion-trajectory simulations that include Coulomb interactions. Experiments and models agree well. At small $F$ and high ion source rates, the field approximately follows a Holtsmark distribution, and the ion streams are degraded by the Coulomb micro-fields. With increasing $F$ and at lower ion source rates, the fields become narrowly distributed around ${\\bf{F}}$, resulting in directional ion streams that are less degraded by micro-fields. Our results are of interest for monitoring cold-ion sources for focused-ion-beam applications, where Coulomb interactions are of concern, and for studies of electric fields in cold plasmas.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10044v1"
    ],
    "publication_venue": "11 pages, 6 figures, accepted to Physical Review Applied",
    "doi": "10.1103/PhysRevApplied.19.044051"
}