{
    "arxiv_id": "2303.14594",
    "paper_title": "Inflationary Dynamics and Swampland Criteria for Modified Gauss-Bonnet Gravity Compatible with GW170817",
    "authors": [
        "S. D. Odintsov",
        "V. K. Oikonomou",
        "F. P. Fronimos"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-08-01"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
    ],
    "abstract": "In this article we present an alternative formalism for the inflationary phenomenology of rescaled Einstein-Gauss-Bonnet models which are in agreement with the GW170817 event. By constraining the propagation velocity of primordial tensor perturbations, an approximate form for the time derivative of the scalar field coupled to the Gauss-Bonnet density is extracted. In turn, the overall degrees of freedom decrease and similar to the case of the canonical scalar field, only one scalar function needs to be designated, while the other is extracted from the continuity equation of the scalar field. We showcase explicitly that the slow-roll indices can be written in a closed form as functions of three dimensionless parameters, namely $x=\\frac{1}{2α}\\bigg(\\frac{κξ'}{ξ''}\\bigg)^2$, $β=8H^2ξ''$ and $γ=\\frac{ξ'ξ'''}{ξ''^2}$ and in turn, we prove that the Einstein-Gauss-Bonnet model can in fact produce a blue-tilted tensor spectral index if the condition $β\\geq1$ is satisfied, which is possible only for Einstein-Gauss-Bonnet models with $ξ''(φ_k)>0$. Afterwards, a brief comment on the running of the spectral indices is made where it is shown that $a_{\\mathcal{S}}(k_*)$ and $a_{\\mathcal{T}}(k_*)$ in the constrained case are approximately of the order $\\mathcal{O}(10^{-3})$, if not smaller. Last but not least, we examine the conditions under which the Swampland criteria are satisfied. We connect the tracking condition related to scalar field theories with the present models, and we highlight the important feature of the models we propose that the tracking condition can be satisfied only if the Swampland criteria are simultaneously satisfied, however the cases with $ξ\\sim1/V$ and $ξ\\sim V$ are excluded, as they cannot describe the inflationary era properly.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14594v1"
    ],
    "publication_venue": "PRD Accepted, abstract reduced due to arXiv limitations",
    "doi": "10.1103/PhysRevD.107.084007"
}