{
    "arxiv_id": "2303.08269",
    "paper_title": "Positive Unlabeled Learning Selected Not At Random (PULSNAR): class proportion estimation when the SCAR assumption does not hold",
    "authors": [
        "Praveen Kumar",
        "Christophe G. Lambert"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-11-09"
    ],
    "latest_version": 2,
    "categories": [
        "cs.LG"
    ],
    "abstract": "Positive and Unlabeled (PU) learning is a type of semi-supervised binary classification where the machine learning algorithm differentiates between a set of positive instances (labeled) and a set of both positive and negative instances (unlabeled). PU learning has broad applications in settings where confirmed negatives are unavailable or difficult to obtain, and there is value in discovering positives among the unlabeled (e.g., viable drugs among untested compounds). Most PU learning algorithms make the selected completely at random (SCAR) assumption, namely that positives are selected independently of their features. However, in many real-world applications, such as healthcare, positives are not SCAR (e.g., severe cases are more likely to be diagnosed), leading to a poor estimate of the proportion, $α$, of positives among unlabeled examples and poor model calibration, resulting in an uncertain decision threshold for selecting positives. PU learning algorithms can estimate $α$ or the probability of an individual unlabeled instance being positive or both. We propose two PU learning algorithms to estimate $α$, calculate calibrated probabilities for PU instances, and improve classification metrics: i) PULSCAR (positive unlabeled learning selected completely at random), and ii) PULSNAR (positive unlabeled learning selected not at random). PULSNAR uses a divide-and-conquer approach that creates and solves several SCAR-like sub-problems using PULSCAR. In our experiments, PULSNAR outperformed state-of-the-art approaches on both synthetic and real-world benchmark datasets.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08269v1",
        "http://arxiv.org/pdf/2303.08269v2"
    ],
    "publication_venue": null
}