{
    "arxiv_id": "2303.13773",
    "paper_title": "Graph Neural Networks for the Offline Nanosatellite Task Scheduling Problem",
    "authors": [
        "Bruno Machado Pacheco",
        "Laio Oriel Seman",
        "Cezar Antonio Rigo",
        "Eduardo Camponogara",
        "Eduardo Augusto Bezerra",
        "Leandro dos Santos Coelho"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2025-03-21"
    ],
    "latest_version": 3,
    "categories": [
        "cs.LG",
        "cs.AI",
        "math.OC"
    ],
    "abstract": "This study investigates how to schedule nanosatellite tasks more efficiently using Graph Neural Networks (GNNs). In the Offline Nanosatellite Task Scheduling (ONTS) problem, the goal is to find the optimal schedule for tasks to be carried out in orbit while taking into account Quality-of-Service (QoS) considerations such as priority, minimum and maximum activation events, execution time-frames, periods, and execution windows, as well as constraints on the satellite's power resources and the complexity of energy harvesting and management. The ONTS problem has been approached using conventional mathematical formulations and exact methods, but their applicability to challenging cases of the problem is limited. This study examines the use of GNNs in this context, which has been effectively applied to optimization problems such as the traveling salesman, scheduling, and facility placement problems. More specifically, we investigate whether GNNs can learn the complex structure of the ONTS problem with respect to feasibility and optimality of candidate solutions. Furthermore, we evaluate using GNN-based heuristic solutions to provide better solutions (w.r.t. the objective value) to the ONTS problem and reduce the optimization cost. Our experiments show that GNNs are not only able to learn feasibility and optimality for instances of the ONTS problem, but they can generalize to harder instances than those seen during training. Furthermore, the GNN-based heuristics improved the expected objective value of the best solution found under the time limit in 45%, and reduced the expected time to find a feasible solution in 35%, when compared to the SCIP (Solving Constraint Integer Programs) solver in its off-the-shelf configuration",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13773v1",
        "http://arxiv.org/pdf/2303.13773v2",
        "http://arxiv.org/pdf/2303.13773v3"
    ],
    "publication_venue": null
}