{
    "arxiv_id": "2303.15018",
    "paper_title": "Theoretical understanding of correlation between magnetic phase transition and the superconducting dome in high-Tc cuprates",
    "authors": [
        "Chen Zhang",
        "Cai-Xin Zhang",
        "Su-Huai Wei",
        "Haiqing Lin",
        "Hui-Xiong Deng"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con"
    ],
    "abstract": "Many issues concerning the origin of high-temperature superconductivity (HTS) are still under debate. For example, how the magnetic ordering varies with doping and its relationship with the superconducting temperature; and why the maximal Tc always occurs near the quantum critical point. In this paper, taking hole-doped La2CuO4 as a classical example, we employ the first-principles band structure and total energy calculations and Monte Carlo simulations to explore how the symmetry-breaking magnetic ground state evolves with hole doping and the origin of a dome-shaped superconductivity region in the phase diagram. We demonstrate that the local antiferromagnetic ordering and doping play key roles in determining the electron-phonon coupling, thus Tc. Initially, the La2CuO4 possesses a checkerboard local antiferromagnetic ground state. As the hole doping increases, Tc increases with the increase of the density of states at the Fermi surface. But as the doping increases further, the strength of the antiferromagnetic interaction weakens. At the critical doping level, a magnetic phase transition occurs that reduces the local antiferromagnetism-assisted electron-phonon coupling, thus diminishing the Tc. The superconductivity disappears in the heavily overdoped region when the antiferromagnetic ordering disappears. These observations could account for why cuprates have a dome-shaped superconductivity region in the phase diagram. Our study, thus, contributes to a fundamental understanding of the correlation between doping, local magnetic ordering, and superconductivity of HTS.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15018v1"
    ],
    "publication_venue": "14 pages, 3 figures in the main text; 11 pages, 7 figures in the supplementary materials"
}