{
    "arxiv_id": "2303.17170",
    "paper_title": "On the analogy between the restricted primitive model and capacitor circuits. Part II: A generalized Gibbs-Duhem consistent extension of the Pitzer-Debye-Hückel term with corrections for low and variable relative permittivity",
    "authors": [
        "Andrés González de Castilla",
        "Simon Müller",
        "Irina Smirnova"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft",
        "cond-mat.stat-mech",
        "physics.chem-ph",
        "physics.comp-ph"
    ],
    "abstract": "We present a novel, generalized and thermodynamically consistent modification of the Pitzer-Debye-Hückel term that can include concentration dependent density, molar mass and relative permittivity within the derivation. In contrast to similar developments, this extension is applicable to simple salts with small spherical ions as well as ionic liquids in aqueous, mixed or non-aqueous solvents. Its central feature is the inclusion of a modified parameter of closest approach, which improves the overall theoretical accuracy of the Pitzer-Debye-Hückel term when applied in variable or very low relative permittivity media. Gibbs-Duhem consistency is retained in the modified extension and sample calculations for aqueous [BMIM][BF4] and aqueous NaCl are provided. This novel Pitzer-Debye-Hückel extension with a concentration dependent relative permittivity is applied with the predictive COSMO-RS-ES model for the calculation of phase equilibria and activity coefficients in electrolyte systems. The performance of the COSMO-RS-ES model for correlations and predictions improves considerably upon consistent introduction of mixture properties in the long-range term. For the first time, the model is capable of satisfactorily calculating activity coefficients and phase equilibria in aqueous, mixed and non-aqueous electrolytes up to very high salt concentrations. The present work also demonstrates that the COSMO-RS-ES model effectively counter-balances its lack of a Born and hard sphere terms, which are commonly applied when a salt concentration dependent relative permittivity is being consistently considered. Finally, our results support the consistent inclusion of a concentration dependent relative permittivity in order to improve the modelling of electrolytes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17170v1"
    ],
    "publication_venue": null,
    "doi": "10.1016/j.molliq.2022.119398"
}