{
    "arxiv_id": "2303.10819",
    "paper_title": "DNA supercoiling in bacteria: state of play and challenges from a viewpoint of physics based modeling",
    "authors": [
        "Ivan Junier",
        "Elham Ghobadpour",
        "Olivier Espeli",
        "Ralf Everaers"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-10-05"
    ],
    "latest_version": 3,
    "categories": [
        "q-bio.BM",
        "physics.bio-ph",
        "q-bio.QM"
    ],
    "abstract": "DNA supercoiling is central to many fundamental processes of living organisms. Its average level along the chromosome and over time reflects the dynamic equilibrium of opposite activities of topoisomerases, which are required to relax mechanical stresses that are inevitably produced during DNA replication and gene transcription. Supercoiling affects all scales of the spatio-temporal organization of bacterial DNA, from the base pair to the large scale chromosome conformation. Highlighted in vitro and in vivo in the 1960s and 1970s, respectively, the first physical models were proposed concomitantly in order to predict the deformation properties of the double helix. About fifteen years later, polymer physics models demonstrated on larger scales the plectonemic nature and the tree-like organization of supercoiled DNA. Since then, many works have tried to establish a better understanding of the multiple structuring and physiological properties of bacterial DNA in thermodynamic equilibrium and far from equilibrium.\n  The purpose of this essay is to address upcoming challenges by thoroughly exploring the relevance, predictive capacity, and limitations of current physical models, with a specific focus on structural properties beyond the scale of the double helix. We discuss more particularly the problem of DNA conformations, the interplay between DNA supercoiling with gene transcription and DNA replication, its role on nucleoid formation and, finally, the problem of scaling up models. Our primary objective is to foster increased collaboration between physicists and biologists. To achieve this, we have reduced the respective jargon to a minimum and we provide some explanatory background material for the two communities.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10819v1",
        "http://arxiv.org/pdf/2303.10819v2",
        "http://arxiv.org/pdf/2303.10819v3"
    ],
    "publication_venue": "11 figures",
    "doi": "10.3389/fmicb.2023.1192831"
}