{
    "arxiv_id": "2303.11990",
    "paper_title": "Blow-ups and normal bundles in connective and nonconnective derived geometries",
    "authors": [
        "Oren Ben-Bassat",
        "Jeroen Hekking"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2025-09-23"
    ],
    "latest_version": 2,
    "categories": [
        "math.AG"
    ],
    "abstract": "This work presents a generalization of derived blow-ups and of the derived deformation to the normal bundle from derived algebraic geometry to any geometric context. The latter is our proposed globalization of a derived algebraic context, itself a generalization of the theory of simplicial commutative rings.\n  One key difference between a geometric context and ordinary derived algebraic geometry is that the coordinate ring of an affine object in the former is not necessarily connective. When constructing generalized blow-ups, this not only turns out to be remarkably convenient, but also leads to a wider existence result. Indeed, we show that the derived Rees algebra and the derived blow-up exist for any affine morphism of stacks in a given geometric context. However, in general the derived Rees algebra will no longer be connective, hence in general the derived blow-up will not live in the connective part of the theory. Unsurprisingly, this can be solved by restricting the input to closed immersions. The proof of the latter statement uses a derived deformation to the normal bundle in any given geometric context, which is also of independent interest.\n  Besides the geometric context which extends algebraic geometry, the second main example of a geometric context will be an extension of analytic geometry. The latter is a recent construction, and includes many different flavors of analytic geometry, such as complex analytic geometry, non-archimedean rigid analytic geometry and analytic geometry over the integers. The present work thus provides derived blow-ups and a derived deformation to the normal bundle in all of these, which is expected to have many applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11990v1",
        "http://arxiv.org/pdf/2303.11990v2"
    ],
    "publication_venue": "50 pages",
    "doi": "10.1016/j.aim.2025.110530"
}