{
    "arxiv_id": "2303.11699",
    "paper_title": "Neural networks trained on synthetically generated crystals can extract structural information from ICSD powder X-ray diffractograms",
    "authors": [
        "Henrik Schopmans",
        "Patrick Reiser",
        "Pascal Friederich"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.mtrl-sci",
        "cs.LG"
    ],
    "abstract": "Machine learning techniques have successfully been used to extract structural information such as the crystal space group from powder X-ray diffractograms. However, training directly on simulated diffractograms from databases such as the ICSD is challenging due to its limited size, class-inhomogeneity, and bias toward certain structure types. We propose an alternative approach of generating synthetic crystals with random coordinates by using the symmetry operations of each space group. Based on this approach, we demonstrate online training of deep ResNet-like models on up to a few million unique on-the-fly generated synthetic diffractograms per hour. For our chosen task of space group classification, we achieved a test accuracy of 79.9% on unseen ICSD structure types from most space groups. This surpasses the 56.1% accuracy of the current state-of-the-art approach of training on ICSD crystals directly. Our results demonstrate that synthetically generated crystals can be used to extract structural information from ICSD powder diffractograms, which makes it possible to apply very large state-of-the-art machine learning models in the area of powder X-ray diffraction. We further show first steps toward applying our methodology to experimental data, where automated XRD data analysis is crucial, especially in high-throughput settings. While we focused on the prediction of the space group, our approach has the potential to be extended to related tasks in the future.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11699v1",
        "http://arxiv.org/pdf/2303.11699v2"
    ],
    "publication_venue": null
}