{
    "arxiv_id": "2303.11510",
    "paper_title": "ICASSP 2023 Deep Speech Enhancement Challenge",
    "authors": [
        "Harishchandra Dubey",
        "Ashkan Aazami",
        "Vishak Gopal",
        "Babak Naderi",
        "Sebastian Braun",
        "Ross Cutler",
        "Alex Ju",
        "Mehdi Zohourian",
        "Min Tang",
        "Hannes Gamper",
        "Mehrsa Golestaneh",
        "Robert Aichner"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cs.SD",
        "eess.AS"
    ],
    "abstract": "Deep Speech Enhancement Challenge is the 5th edition of deep noise suppression (DNS) challenges organized at ICASSP 2023 Signal Processing Grand Challenges. DNS challenges were organized during 2019-2023 to stimulate research in deep speech enhancement (DSE). Previous DNS challenges were organized at INTERSPEECH 2020, ICASSP 2021, INTERSPEECH 2021, and ICASSP 2022. From prior editions, we learnt that improving signal quality (SIG) is challenging particularly in presence of simultaneously active interfering talkers and noise. This challenge aims to develop models for joint denosing, dereverberation and suppression of interfering talkers. When primary talker wears a headphone, certain acoustic properties of their speech such as direct-to-reverberation (DRR), signal to noise ratio (SNR) etc. make it possible to suppress neighboring talkers even without enrollment data for primary talker. This motivated us to create two tracks for this challenge: (i) Track-1 Headset; (ii) Track-2 Speakerphone. Both tracks has fullband (48kHz) training data and testset, and each testclips has a corresponding enrollment data (10-30s duration) for primary talker. Each track invited submissions of personalized and non-personalized models all of which are evaluated through same subjective evaluation. Most models submitted to challenge were personalized models, same team is winner in both tracks where the best models has improvement of 0.145 and 0.141 in challenge's Score as compared to noisy blind testset.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11510v1"
    ],
    "publication_venue": "6 pages, 1 figure. arXiv admin note: text overlap with arXiv:2202.13288"
}