{
    "arxiv_id": "2303.12274",
    "paper_title": "A Hierarchical Hybrid Learning Framework for Multi-agent Trajectory Prediction",
    "authors": [
        "Yujun Jiao",
        "Mingze Miao",
        "Zhishuai Yin",
        "Chunyuan Lei",
        "Xu Zhu",
        "Linzhen Nie",
        "Bo Tao"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 2,
    "categories": [
        "cs.RO",
        "cs.CV"
    ],
    "abstract": "Accurate and robust trajectory prediction of neighboring agents is critical for autonomous vehicles traversing in complex scenes. Most methods proposed in recent years are deep learning-based due to their strength in encoding complex interactions. However, unplausible predictions are often generated since they rely heavily on past observations and cannot effectively capture the transient and contingency interactions from sparse samples. In this paper, we propose a hierarchical hybrid framework of deep learning (DL) and reinforcement learning (RL) for multi-agent trajectory prediction, to cope with the challenge of predicting motions shaped by multi-scale interactions. In the DL stage, the traffic scene is divided into multiple intermediate-scale heterogenous graphs based on which Transformer-style GNNs are adopted to encode heterogenous interactions at intermediate and global levels. In the RL stage, we divide the traffic scene into local sub-scenes utilizing the key future points predicted in the DL stage. To emulate the motion planning procedure so as to produce trajectory predictions, a Transformer-based Proximal Policy Optimization (PPO) incorporated with a vehicle kinematics model is devised to plan motions under the dominant influence of microscopic interactions. A multi-objective reward is designed to balance between agent-centric accuracy and scene-wise compatibility. Experimental results show that our proposal matches the state-of-the-arts on the Argoverse forecasting benchmark. It's also revealed by the visualized results that the hierarchical learning framework captures the multi-scale interactions and improves the feasibility and compliance of the predicted trajectories.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12274v1",
        "http://arxiv.org/pdf/2303.12274v2"
    ],
    "publication_venue": null
}