{
    "arxiv_id": "2303.12972",
    "paper_title": "Seeing-limited Coupling of Starlight into Single-mode Fiber with a Small Telescope",
    "authors": [
        "David H. Sliski",
        "Cullen H. Blake",
        "Jason D. Eastman",
        "Samuel Halverson"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM"
    ],
    "abstract": "An optical fiber link to a telescope provides many advantages for spectrometers designed to detect and characterize extrasolar planets through precise radial velocity (PRV) measurements. In the seeing-limited regime, a multi-mode fiber is typically used so that a significant amount of starlight may be captured. In the near-diffraction-limited case, either with an adaptive optics system or with a small telescope at an excellent site, efficiently coupling starlight into a much smaller, single-mode fiber may be possible. In general, a spectrometer designed for single-mode fiber input will be substantially less costly than one designed for multi-mode fiber input. We describe the results of tests coupling starlight from a 70 cm telescope at Mt. Hopkins, Arizona into the single-mode fiber of the MINERVA-Red spectrometer at a wavelength of ~850 nm using a low-speed tip/tilt image stabilization system comprising all commercial, off-the-shelf components. We find that approximately 0.5% of the available starlight is coupled into the single-mode fiber under seeing conditions typical for observatories hosting small telescopes, which is close to the theoretical expectation. We discuss scientific opportunities for small telescopes paired with inexpensive, high-resolution spectrometers, as well as upgrade paths that should significantly increase the coupling efficiency for the MINERVA-Red system.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12972v1"
    ],
    "publication_venue": "8 pages, 4 figures. Accepted for publication in Astronomische Nachrichten",
    "doi": "10.1002/asna.20220080"
}