{
    "arxiv_id": "2303.09052",
    "paper_title": "Superconducting Diode Effect and Large Magnetochiral Anisotropy in T$_d$-MoTe$_2$ Thin Film",
    "authors": [
        "Wan-Shun Du",
        "Weipeng Chen",
        "Yangbo Zhou",
        "Tengfei Zhou",
        "Guangjian Liu",
        "Zongteng Zhang",
        "Zichuan Miao",
        "Hao Jia",
        "Song Liu",
        "Yue Zhao",
        "Zhensheng Zhang",
        "Tingyong Chen",
        "Ning Wang",
        "Wen Huang",
        "Zhen-Bing Tan",
        "Jing-Jing Chen",
        "Da-Peng Yu"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con"
    ],
    "abstract": "In the absence of time-reversal invariance, metals without inversion symmetry may exhibit nonreciprocal charge transport -- a magnetochiral anisotropy that manifests as unequal electrical resistance for opposite current flow directions. If superconductivity also sets in, the charge transmission may become dissipationless in one direction while remaining dissipative in the opposite, thereby realizing a superconducting diode. Through both DC and AC magnetoresistance measurements, we study the nonreciprocal effects in thin films of the superconducting noncentrosymmetric type-II Weyl semimetal T$_d$-MoTe$_2$. We report nonreciprocal superconducting critical currents with a diode efficiency close to 20\\%~, and an extreme magnetochiral anisotropy coefficient up to \\SI{1e9}{\\per\\tesla\\per\\ampere}, under weak out-of-plane magnetic field in the millitesla range. Intriguingly, unlike the finding in Rashba systems, the strongest in-plane nonreciprocal effect does not occur when the field is perpendicular to the current flow direction. We develop a phenomenological theory to demonstrate that this peculiar behavior can be attributed to the asymmetric structure of spin-orbit coupling in T$_d$-MoTe$_2$. Our study highlights how the form of spin-orbit coupling, as dictated by the underlying crystallographic symmetry, critically impacts the nonreciprocal transport. Our work demonstrates that T$_d$-MoTe$_2$ offers an accessible material platform for the practical application of superconducting diodes under a relatively weak magnetic field.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09052v1"
    ],
    "publication_venue": "8 pages, 5figures"
}