{
    "arxiv_id": "2303.15504",
    "paper_title": "The Ginzburg-Landau theory of flat band superconductors with quantum metric",
    "authors": [
        "Shuai A. Chen",
        "K. T. Law"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-07-03"
    ],
    "latest_version": 3,
    "categories": [
        "cond-mat.supr-con",
        "cond-mat.str-el"
    ],
    "abstract": "Recent experimental study unveiled highly unconventional phenomena in the superconducting twisted bilayer graphene (TBG) with ultra flat bands, which cannot be described by the conventional BCS theory. For example, given the small Fermi velocity of the flat bands, the predicted superconducting coherence length accordingly to BCS theory is more than 20 times shorter than the measured values. A new theory is needed to understand many of the unconventional properties of flat band superconductors. In this work, we establish a Ginzburg-Landau (GL) theory from a microscopic flat band Hamiltonian. The GL theory shows how the properties of the physical quantities such as the critical temperature, the superconducting coherence length, the upper critical field and the superfluid density are governed by the quantum metric of the Bloch states. One key conclusion is that the superconducting coherence length is not determined by the Fermi velocity but by the size of the optimally localized Wannier functions which is limited by quantum metric. Applying the theory to TBG, we calculated the superconducting coherence length and the upper critical fields. The results match the experimental ones well without fine tuning of parameters. The established GL theory provides a new and general theoretical framework for understanding flat band superconductors with quantum metric.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15504v1",
        "http://arxiv.org/pdf/2303.15504v2",
        "http://arxiv.org/pdf/2303.15504v3"
    ],
    "publication_venue": "5 + 15 pages, 1 figure, 1 table, and comments are welcome"
}