{
    "arxiv_id": "2303.17516",
    "paper_title": "Reference frames in General Relativity and the galactic rotation curves",
    "authors": [
        "L. Filipe O. Costa",
        "José Natário",
        "F. Frutos-Alfaro",
        "Michael Soffel"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-08-29"
    ],
    "latest_version": 2,
    "categories": [
        "gr-qc",
        "astro-ph.GA"
    ],
    "abstract": "The physical interpretation of the exact solutions of the Einstein field equations is, in general, a challenging task, part of the difficulties lying in the significance of the coordinate system. We discuss the extension of the International Astronomical Union (IAU) reference system to the exact theory. It is seen that such an extension, retaining some of its crucial properties, can be achieved in a special class of spacetimes, admitting non-shearing congruences of observers which, at infinity, have zero vorticity and acceleration. As applications, we consider the FLRW, Kerr and NUT spacetimes, the van Stockum rotating dust cylinder, spinning cosmic strings and, finally, we debunk the so-called Balasin-Grumiller (BG) model, and the claims that the galaxies' rotation curves can be explained through gravitomagnetic effects without the need for Dark Matter. The BG spacetime is shown to be completely inappropriate as a galactic model: its dust is actually static with respect to the asymptotic inertial frame, its gravitomagnetic effects arise from unphysical singularities along the axis (a pair of NUT rods, combined with a spinning cosmic string), and the rotation curves obtained are merely down to an invalid choice of reference frame -- the congruence of zero angular momentum observers, which are being dragged by the singularities.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17516v1",
        "http://arxiv.org/pdf/2303.17516v2"
    ],
    "publication_venue": "29 pages, 10 figures. Slightly improved version, typos corrected, references added. Supplemental material is provided in the ancillary Mathematica files \"NUTmetrics.nb\" and \"BGmetric.nb\". Version to be submitted",
    "doi": "10.1103/PhysRevD.108.044056"
}