{
    "arxiv_id": "2303.11182",
    "paper_title": "HI line analysis of Herbig Ae/Be stars using X-Shooter spectra",
    "authors": [
        "B. Shridharan",
        "Blesson Mathew",
        "R. Arun",
        "T. B. Cysil"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Herbig Ae/Be stars are intermediate-mass pre-main sequence stars undergoing accretion through their circumstellar disk. The optical and infrared (IR) spectra of HAeBe stars show HI emission lines belonging to Balmer, Paschen and Brackett series. We use the archival X-Shooter spectra available for 109 HAeBe stars from Vioque et al. (2018) and analyse the various HI lines present in them. We segregated the stars into different classes based on the presence of higher-order lines in different HI series. We discuss the dependence of the appearance of higher-order lines on the stellar parameters. We find that most massive and younger stars show all the higher-order lines in emission. The stars showing only lower-order lines have Teff < 12000 K and an age range of 5-10 Myr. We perform a Case B line ratio analysis for a sub-sample of stars showing most of the HI lines in emission. We note that all but four stars belonging to the sub-sample show lower HI line ratios than theoretical values, owing to the emitting medium being optically thick. The HI line flux ratios do not depend on the star's spectral type. Further, from the line ratios of lower-order lines and Paschen higher-order lines, we note that line ratios of most HAeBe stars match with electron density value in the range 10^9 - 10^11 cm^-3. The electron temperature, however, could not be ascertained with confidence using the line ratios studied in this work.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11182v1"
    ],
    "publication_venue": "Accepted, To be published as part of the JOAA special issue on \"3rd Meeting on Star Formation: Star Formation Studies in the Context of NIR Instruments on 3.6m DOT\". 12 pages, 7 figures",
    "doi": "10.1007/s12036-023-09952-w"
}