{
    "arxiv_id": "2303.10943",
    "paper_title": "On massive neutral lepton scattering on nucleus",
    "authors": [
        "V. A. Bednyakov"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph"
    ],
    "abstract": "The paper presents a theoretical approach to the description of the relativistic scattering of a massive (neutral) lepton on a nucleus, in which the latter retains its integrity. The measurable cross section of this process includes the elastic (or coherent) contribution, when the nucleus remains in its original quantum state and the inelastic (incoherent) contribution, when the nucleus goes into another (excited) quantum state. Transition from the elastic scattering regime to the inelastic scattering regime is regulated automatically by the dependence of the form factors on the momentum transferred to the nucleus. At small momentum transfers elastic scattering dominates. AS the transferred momentum increases, the contribution of the inelastic scattering increases, and the latter becomes dominant at sufficiently large transferred momenta. The scattering of massive (anti)neutrinos interacting with nucleons through the $V\\mp A$ currents of the Standard Model is considered in detail. Because of the nonzero masses, an additional channel arises for elastic and inelastic scattering of these (anti)neutrinos on nuclei due to the possibility of changing the helicity of these (anti)neutrinos. The expressions obtained for the cross sections are applicable to any precision data analysis involving neutrinos and antineutrinos, especially when non-zero neutrino masses can be taken into account. These expressions can also be used in the analysis of experiments on direct detection of (neutral) massive weakly interacting relativistic dark matter particles since, unlike the generally accepted case, they simultaneously take into account both elastic and inelastic interactions of the particles. The presence of an \"inelastic signal\" with its characteristic signature may be the only registrable evidence of interaction of the dark matter particle with the nucleus.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10943v1"
    ],
    "publication_venue": "60 pages, 3 figures, to be published in Physics of Elementary Particles and Atomic Nuclei (in Russian)"
}