{
    "arxiv_id": "2303.14736",
    "paper_title": "Disentangling Writer and Character Styles for Handwriting Generation",
    "authors": [
        "Gang Dai",
        "Yifan Zhang",
        "Qingfeng Wang",
        "Qing Du",
        "Zhuliang Yu",
        "Zhuoman Liu",
        "Shuangping Huang"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Training machines to synthesize diverse handwritings is an intriguing task. Recently, RNN-based methods have been proposed to generate stylized online Chinese characters. However, these methods mainly focus on capturing a person's overall writing style, neglecting subtle style inconsistencies between characters written by the same person. For example, while a person's handwriting typically exhibits general uniformity (e.g., glyph slant and aspect ratios), there are still small style variations in finer details (e.g., stroke length and curvature) of characters. In light of this, we propose to disentangle the style representations at both writer and character levels from individual handwritings to synthesize realistic stylized online handwritten characters. Specifically, we present the style-disentangled Transformer (SDT), which employs two complementary contrastive objectives to extract the style commonalities of reference samples and capture the detailed style patterns of each sample, respectively. Extensive experiments on various language scripts demonstrate the effectiveness of SDT. Notably, our empirical findings reveal that the two learned style representations provide information at different frequency magnitudes, underscoring the importance of separate style extraction. Our source code is public at: https://github.com/dailenson/SDT.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14736v1"
    ],
    "publication_venue": "accepted by CVPR 2023. Source code: https://github.com/dailenson/SDT"
}