{
    "arxiv_id": "2303.08822",
    "paper_title": "Nonequilibrium calcium dynamics optimizes the energetic efficiency of mitochondrial metabolism",
    "authors": [
        "Valérie Voorsluijs",
        "Francesco Avanzini",
        "Gianmaria Falasco",
        "Massimiliano Esposito",
        "Alexander Skupin"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 2,
    "categories": [
        "q-bio.MN",
        "cond-mat.other",
        "cond-mat.stat-mech"
    ],
    "abstract": "Living organisms continuously harness energy to perform complex functions for their adaptation and survival while part of that energy is dissipated in the form of heat or chemical waste. Determining the energetic cost and the efficiency of specific cellular processes remains a largely open problem. Here, we analyze the efficiency of mitochondrial adenosine triphosphate (ATP) production through the tricarboxylic acid (TCA) cycle and oxidative phosphorylation that generates most of the cellular chemical energy in eukaryotes. The regulation of this pathway by calcium signaling represents a well-characterized example of a regulatory cross-talk that can affect the energetic output of a metabolic pathway, but its concrete energetic impact remains elusive. On the one hand, calcium enhances ATP production by activating key enzymes of the TCA cycle, but on the other hand calcium homeostasis depends on ATP availability. To evaluate how calcium signaling impacts the efficiency of mitochondrial metabolism, we propose a detailed kinetic model describing the calcium-mitochondria cross-talk and we analyze it using a nonequilibrium thermodynamic approach: after identifying the effective reactions driving mitochondrial metabolism out of equilibrium, we quantify the thermodynamic efficiency of the metabolic machinery for different physiological conditions. We find that calcium oscillations increase the efficiency with a maximum close to substrate-limited conditions, suggesting a compensatory effect of calcium signaling on the energetics of mitochondrial metabolism.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08822v1",
        "http://arxiv.org/pdf/2303.08822v2"
    ],
    "publication_venue": null
}