{
    "arxiv_id": "2303.16612",
    "paper_title": "Satellite design optimization for differential lift and drag applications",
    "authors": [
        "C. Marianowski",
        "C. Traub",
        "M. Pfeiffer",
        "J. Beyer",
        "S. Fasoulas"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2024-04-24"
    ],
    "latest_version": 1,
    "categories": [
        "physics.space-ph"
    ],
    "abstract": "Utilizing differential atmospheric forces in the Very Low Earth Orbits (VLEO) regime for the control of the relative motion within a satellite formation is a promising option as any thrusting device has tremendous effects on the mission capacity due to the limited weight and size restrictions of small satellites. One possible approach to increase the available control forces is to reduce the mass of the respective satellites as well as to increase the available surface area. However, satellites of these characteristics suffer from rapid orbital decay and consequently have a reduced service lifetime. Therefore, achieving higher control forces is in contradiction to achieving a minimum orbital decay of the satellites, which currently represents one of the biggest challenges in the VLEO regime. In this work, the geometry of a given reference satellite, a 3UCubeSat, is optimized under the consideration of different surface material properties for differential lift and drag control applications while simultaneously ensuring a sustained VLEO operation. Notably, not only the consideration of sustainability but also the optimization with regard to differential lift is new in literature. It was shown that the advantageous geometries strongly depend on the type of gas-surface interaction and thus, two different final designs, one for each extreme type, are presented. In both cases, improvements in all relevant parameters could be achieved solely via geometry adaptions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16612v1"
    ],
    "publication_venue": null,
    "doi": "10.1007/s12567-024-00550-2"
}