{
    "arxiv_id": "2303.12749",
    "paper_title": "Quantum and classical contributions to entropy production in fermionic and bosonic Gaussian systems",
    "authors": [
        "Krzysztof Ptaszynski",
        "Massimiliano Esposito"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 2,
    "categories": [
        "quant-ph",
        "cond-mat.stat-mech"
    ],
    "abstract": "As previously demonstrated, the entropy production - a key quantity characterizing the irreversibility of thermodynamic processes - is related to generation of correlations between degrees of freedom of the system and its thermal environment. This raises the question of whether such correlations are of a classical or quantum nature, namely, whether they are accessible through measurements. We address this problem by considering fermionic and bosonic Gaussian systems. We show that for fermions the entropy production is mostly quantum due to the parity superselection rule which restricts the set of physically allowed measurements to projections on the Fock states, thus significantly limiting the amount of classically accessible correlations. In contrast, in bosonic systems a much larger amount of correlations can be accessed through Gaussian measurements. Specifically, while the quantum contribution may be important at low temperatures, in the high temperature limit the entropy production corresponds to purely classical position-momentum correlations. Our results demonstrate an important difference between fermionic and bosonic systems regarding the existence of a quantum-to-classical transition in the microscopic formulation of the entropy production. They also show that entropy production can be mainly caused by quantum correlations even in the weak coupling limit, which admits a description in terms of classical rate equations for state populations, as well as in the low particle density limit, where the transport properties of both bosons and fermions converge to those of classical particles.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12749v1",
        "http://arxiv.org/pdf/2303.12749v2"
    ],
    "publication_venue": "22 pages, 16 figures"
}