{
    "arxiv_id": "2303.14839",
    "paper_title": "A dynamical transition from localized to uniform scrambling in locally hyperbolic systems",
    "authors": [
        "Mathias Steinhuber",
        "Peter Schlagheck",
        "Juan-Diego Urbina",
        "Klaus Richter"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 2,
    "categories": [
        "quant-ph",
        "cond-mat.other",
        "nlin.SI"
    ],
    "abstract": "Fast scrambling of quantum correlations, reflected by the exponential growth of Out-of-Time-Order Correlators (OTOCs) on short pre-Ehrenfest time scales, is commonly considered as a major quantum signature of unstable dynamics in quantum systems with a classical limit. In two recent works, by Hummel et al. [1] and by Xu et al. [2], a significant difference in the scrambling rate of integrable (many-body) systems was observed, depending on the initial state being semiclassically localized around unstable fixed points or fully delocalized (infinite temperature). Specifically, the quantum Lyapunov exponent $λ_{\\rm q}$ quantifying the OTOC growth is given, respectively, by $λ_{\\rm q}=2λ_{\\rm s}$ or $λ_{\\rm q}=λ_{\\rm s}$ in terms of the stability exponent $λ_{\\rm s}$ of the hyperbolic fixed point. Here we show that a wave packet, initially localized around this fixed point, features a distinct dynamical transition between these two regions. We present an analytical semiclassical approach providing a physical picture of this phenomenon and support our findings by extensive numerical simulations in the whole parameter range of locally unstable dynamics of a Bose-Hubbard dimer. Our results suggest that the existence of this transition is a hallmark of unstable separatrix dynamics in integrable systems. This allows one to distinguish, within the exponential OTOC growth behavior, unstable integrable (many-body) dynamics from genuine chaotic dynamics featuring uniform growth.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14839v1",
        "http://arxiv.org/pdf/2303.14839v2"
    ],
    "publication_venue": "11 pages, 7 figures"
}