{
    "arxiv_id": "2303.11690",
    "paper_title": "Exposure Assessment for Wearable Patch Antenna Arrays at Millimeter Waves",
    "authors": [
        "Silvia Gallucci",
        "Marta Bonato",
        "Martina Benini",
        "Marta Parazzini",
        "Maxim Zhadobov"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2024-06-04"
    ],
    "latest_version": 1,
    "categories": [
        "cs.NI"
    ],
    "abstract": "Since the spread of the wearable systems and the implementation of the forthcoming 5G in many devices, the question about the assessment of the exposure in wearable typical usage to millimeter waves is crucial and timely. For such frequencies, the power absorption becomes strongly superficial and involves only the most superficial tissue of the human body, i.e., the skin. In literature there are some models able to describe the layered structure of the skin but, until now, there is no literature consensus on the skin model to employ in computational exposure assessment studies. For these reasons, the present work aimed to simulate four different models of the most superficial tissues with different degree of detail exposed to two wearable patch antennas at different frequencies i.e., 28 GHz and 39 GHz. This allows to investigate the impact that the choice of a layered model rather than the homogeneous one has on the exposure. Simulations were performed through the FDTD method, implemented in the Sim4life platform and the exposure was assessed with the absorbed power density averaged over 1 cm2 and 4 cm2 (Sab). The data showed that the homogeneous model underestimates the peak value of Sab obtained for multi-layer models in the stratum corneum (by 14% to 21% depending on the number of layers of the model and the frequency). This finding was confirmed by an analytical approach with two impinging plane wave TEM-polarized with normal incidence at 28 GHz and 39 GHz respectively. Conversely, there are no substantial differences in the exposure levels between the layered models",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11690v1"
    ],
    "publication_venue": null,
    "doi": "10.1109/ACCESS.2024.3408955"
}