{
    "arxiv_id": "2303.09636",
    "paper_title": "Nitrogen-vacancy magnetometry of individual Fe-triazole spin crossover nanorods",
    "authors": [
        "Suvechhya Lamichhane",
        "Kayleigh A McElveen",
        "Adam Erickson",
        "Ilja Fescenko",
        "Shuo Sun",
        "Rupak Timalsina",
        "Yinsheng Guo",
        "Sy-Hwang Liou",
        "Rebecca Y. Lai",
        "Abdelghani Laraoui"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-05-23"
    ],
    "latest_version": 3,
    "categories": [
        "cond-mat.mes-hall",
        "physics.chem-ph",
        "quant-ph"
    ],
    "abstract": "[Fe(Htrz)2(trz)](BF4) (Fe-triazole) spin crossover molecules show thermal, electrical, and optical switching between high spin (HS) and low spin (LS) states, making them promising candidates for molecular spintronics. The LS and HS transitions originate from the electronic configurations of Fe(II), and are considered to be diamagnetic and paramagnetic respectively. The Fe(II) LS state has six paired electrons in the ground states with no interaction with the magnetic field and a diamagnetic behavior is usually observed. While the bulk magnetic properties of Fe-triazole compounds are widely studied by standard magnetometry techniques their properties at the individual level are missing. Here we use nitrogen vacancy (NV) based magnetometry to study the magnetic properties of the Fe-triazole LS state of nanoparticle clusters and individual nanorods of size varying from 20 to 1000 nm. Scanning electron microscopy (SEM) and Raman spectroscopy are performed to determine the size of the nanoparticles/nanorods and to confirm their respective spin state. The magnetic field patterns produced by the nanoparticles/nanorods are imaged by NV magnetic microscopy as a function of applied magnetic field (up to 350 mT) and correlated with SEM and Raman. We found that in most of the nanorods the LS state is slightly paramagnetic, possibly originating from the surface oxidation and/or the greater Fe(III) presence along the nanorod edges. NV measurements on the Fe-triazole LS state nanoparticle clusters revealed both diamagnetic and paramagnetic behavior. Our results highlight the potential of NV quantum sensors to study the magnetic properties of spin crossover molecules and molecular magnets.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09636v1",
        "http://arxiv.org/pdf/2303.09636v2",
        "http://arxiv.org/pdf/2303.09636v3"
    ],
    "publication_venue": null,
    "doi": "10.1021/acsnano.3c01819"
}