{
    "arxiv_id": "2303.08311",
    "paper_title": "Characterization of local deformation around hydrides in Zircaloy-4 using conventional and high angular resolution electron backscatter diffraction",
    "authors": [
        "Ruth M. Birch",
        "James O. Douglas",
        "T. Ben Britton"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Zircaloy-4 is used as a fuel cladding material for water reactors, as it has good mechanical properties, corrosion resistance, and a low thermal neutron absorption cross section. However, the mechanical performance of Zircaloy-4 can be reduced during service due to hydrogen uptake and hydride formation. These hydrides are brittle, and often reduce the strength and toughness of materials as well as increase susceptibility to delayed hydride cracking (DHC). In this work, large grain Zircaloy-4 with hydrides was prepared and then cross sectioned using cryo-ion beam polishing, using plasma focused ion beam (pFIB) and broad ion beam (BIB) approaches to enable the preparation of a very high quality flat surface with no preferential etching of either the hydride or zirconium metal (typically metallographic polishing preferentially removes hydrides). Conventional and high angular resolution electron backscatter diffraction (EBSD) analysis were then used to explore morphology, deformation fields, and orientation relationships between the zirconium matrix and hydrides. Four maps were collected for analysis which included hydrides near grain boundaries: (a) where the hydride smoothly decorates across two of the connecting boundaries near a triple junction; (b) where the hydride smoothly decorates the boundary; (c) a mixture of smooth decoration of the interface and protrusion into the grains; (d) fine scale hydride that protrudes into one grain. This work highlights that incompatibility of the hydride within the zirconium matrix is strongly linked to the orientation relationship of the hydride and matrix, and the grain boundary character. These results may enable enhanced understanding of the role of hydrides in fracture as well as stress-induced hydride reorientation and DHC susceptibility.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08311v1"
    ],
    "publication_venue": "as submitted"
}