{
    "arxiv_id": "2303.07864",
    "paper_title": "DualMix: Unleashing the Potential of Data Augmentation for Online Class-Incremental Learning",
    "authors": [
        "Yunfeng Fan",
        "Wenchao Xu",
        "Haozhao Wang",
        "Jiaqi Zhu",
        "Junxiao Wang",
        "Song Guo"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [],
    "latest_version": 1,
    "categories": [
        "cs.LG"
    ],
    "abstract": "Online Class-Incremental (OCI) learning has sparked new approaches to expand\nthe previously trained model knowledge from sequentially arriving data streams\nwith new classes. Unfortunately, OCI learning can suffer from catastrophic\nforgetting (CF) as the decision boundaries for old classes can become\ninaccurate when perturbated by new ones. Existing literature have applied the\ndata augmentation (DA) to alleviate the model forgetting, while the role of DA\nin OCI has not been well understood so far. In this paper, we theoretically\nshow that augmented samples with lower correlation to the original data are\nmore effective in preventing forgetting. However, aggressive augmentation may\nalso reduce the consistency between data and corresponding labels, which\nmotivates us to exploit proper DA to boost the OCI performance and prevent the\nCF problem. We propose the Enhanced Mixup (EnMix) method that mixes the\naugmented samples and their labels simultaneously, which is shown to enhance\nthe sample diversity while maintaining strong consistency with corresponding\nlabels. Further, to solve the class imbalance problem, we design an Adaptive\nMixup (AdpMix) method to calibrate the decision boundaries by mixing samples\nfrom both old and new classes and dynamically adjusting the label mixing ratio.\nOur approach is demonstrated to be effective on several benchmark datasets\nthrough extensive experiments, and it is shown to be compatible with other\nreplay-based techniques.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07864v1"
    ],
    "publication_venue": "10 pages, 7 figures and 3 tables"
}