{
    "arxiv_id": "2303.09231",
    "paper_title": "The MPIfR-MeerKAT Galactic Plane survey I -- System setup and early results",
    "authors": [
        "P. V. Padmanabh",
        "E. D. Barr",
        "S. S. Sridhar",
        "M. R. Rugel",
        "A. Damas-Segovia",
        "A. M. Jacob",
        "V. Balakrishnan",
        "M. Berezina",
        "M. C. i Bernadich",
        "A. Brunthaler",
        "D. J. Champion",
        "P. C. C. Freire",
        "S. Khan",
        "H. -R. Klöckner",
        "M. Kramer",
        "Y. K. Ma",
        "S. A. Mao",
        "Y. P. Men",
        "K. M. Menten",
        "S. Sengupta",
        "V. Venkatraman Krishnan",
        "O. Wucknitz",
        "F. Wyrowski",
        "M. C. Bezuidenhout",
        "S. Buchner",
        "M. Burgay",
        "W. Chen",
        "C. J. Clark",
        "L. Künkel",
        "L. Nieder",
        "B. Stappers",
        "L. S. Legodi",
        "M. M. Nyamai"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
    ],
    "abstract": "Galactic plane radio surveys play a key role in improving our understanding of a wide range of astrophysical phenomena from neutron stars and Galactic magnetic fields to stellar formation and evolution. Performing such a survey on the latest interferometric telescopes produces large data rates necessitating a shift towards fully or quasi-real-time data analysis with data being stored for only the time required to process them. This has instilled a need to re-devise scientific strategies and methods for the effective management of telescope observing time. We describe here the setup for the 3000 hour Max-Planck-Institut für Radioastronomie (MPIfR) MeerKAT Galactic Plane survey (MMGPS). The survey is unique by operating in a commensal mode. Key science objectives of the survey including the discovery of new pulsars and transients as well as studies of Galactic magnetism, the interstellar medium and star formation rates. We explain the strategy coupled with the necessary hardware and software infrastructure needed for data reduction in the imaging, spectral and time domains. We have so far discovered 78 new pulsars including 17 binary pulsars. We have also developed an imaging pipeline sensitive to the order of a few tens of micro-Jansky and a spatial resolution of a few arcseconds. Further science operations are about to commence with an S-Band receiver system built in-house and operated in collaboration with the South African Radio Astronomy Observatory (SARAO). Spectral line commissioning observations at S-band already illustrate the spectroscopic capabilities of this instrument. These results have not only opened new avenues for Galactic science but also laid a strong foundation for surveys with future telescopes like the Square Kilometre Array (SKA).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09231v1"
    ],
    "publication_venue": "22 pages, 7 figures, Submitted to MNRAS"
}