{
    "arxiv_id": "2303.12528",
    "paper_title": "MEGA: Multilingual Evaluation of Generative AI",
    "authors": [
        "Kabir Ahuja",
        "Harshita Diddee",
        "Rishav Hada",
        "Millicent Ochieng",
        "Krithika Ramesh",
        "Prachi Jain",
        "Akshay Nambi",
        "Tanuja Ganu",
        "Sameer Segal",
        "Maxamed Axmed",
        "Kalika Bali",
        "Sunayana Sitaram"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-05-23"
    ],
    "latest_version": 3,
    "categories": [
        "cs.CL"
    ],
    "abstract": "Generative AI models have impressive performance on many Natural Language Processing tasks such as language understanding, reasoning and language generation. One of the most important questions that is being asked by the AI community today is about the capabilities and limits of these models, and it is clear that evaluating generative AI is very challenging. Most studies on generative Large Language Models (LLMs) are restricted to English and it is unclear how capable these models are at understanding and generating other languages. We present the first comprehensive benchmarking of generative LLMs - MEGA, which evaluates models on standard NLP benchmarks, covering 8 diverse tasks and 33 typologically diverse languages. We also compare the performance of generative LLMs to State of the Art (SOTA) non-autoregressive models on these tasks to determine how well generative models perform compared to the previous generation of LLMs. We present a thorough analysis of the performance of models across languages and discuss some of the reasons why generative LLMs are currently not optimal for all languages. We create a framework for evaluating generative LLMs in the multilingual setting and provide directions for future progress in the field.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12528v1",
        "http://arxiv.org/pdf/2303.12528v2",
        "http://arxiv.org/pdf/2303.12528v3"
    ],
    "publication_venue": null
}