{
    "arxiv_id": "2303.11442",
    "paper_title": "Spontaneous Emulsification: Elucidation of the Local Processes",
    "authors": [
        "Monicka Kullappan",
        "Wes Patel",
        "Manoj K. Chaudhury"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft",
        "physics.chem-ph"
    ],
    "abstract": "Micro and/or Nano sized emulsions are formed when an organic liquid gently comes in contact with water in the presence of a surfactant, where no external agitation is required. Many years of research made it clear that the driving force for spontaneous emulsification arises from the differences of the chemical potentials of various components in the organic and aqueous phases, which triggers diffusion coupled hydrodynamic fluctuation. While extraordinary theoretical developments have taken place that attempted to describe these processes within the scopes of equilibrium and non-equilibrium thermodynamics, the local processes underlying the spontaneous emulsification, however, still remain elusive. In this research, we investigate the local processes that involve the transfer of surfactant as well as water from one phase to another (i.e. water to oil), which results in the formation of water-in-oil emulsion in the organic phase and, subsequently. Thes emulsions invert into oil-in-water emulsion, rather abruptly, as they cross the phase boundary. Studies based on UV spectroscopy and molecular dynamics indicate that these processes may involve explosive events and subsequent assembly of the fragments to other organized structures which are reminiscent of cusp catastrophe proposed earlier by Dickinson. These processes lead to either to a strong or a weak fluctuation of the component concentrations below the interface that also becomes evident in the fast (athermal) diffusion of the emulsion droplets from the interfacial region farther into the bulk water. These events can be arrested suitably with polymeric additives.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11442v1"
    ],
    "publication_venue": null
}