{
    "arxiv_id": "2303.17588",
    "paper_title": "Heavy Traffic Analysis of Multi-Class Bipartite Queueing Systems Under FCFS",
    "authors": [
        "Lisa Aoki Hillas",
        "Rene Caldentey",
        "Varun Gupta"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "math.PR"
    ],
    "abstract": "This paper examines the performance of multi-class multi-server bipartite queueing systems under a FCFS-ALIS service discipline, where each arriving customer is only compatible with a subset of servers. We analyze the system under conventional heavy-traffic conditions, where the traffic intensity approaches one from below. Building upon the formulation and results of Afeche et al. 2021, we generalize the model by allowing the vector of arrival rates to approach the heavy-traffic limit from an arbitrary direction. We characterize the steady-state waiting times of the various customer classes and demonstrate that a much wider range of waiting time outcomes is achievable. Furthermore, we establish that the matching probabilities, i.e., the probabilities of different customer classes being served by different servers, do not depend on the direction along which the system approaches heavy traffic. We also investigate the design of compatibility between customer classes and servers, finding that a service provider who has complete control over the matching can design a delay-minimizing menu by considering only the limiting arrival rates. When some constraints on the compatibility structure exist, the direction of convergence to heavy-traffic affects which menu minimizes delay. Additionally, we discover that the bipartite matching queueing system exhibits a form of Braess's paradox, where adding more connectivity to an existing system can lead to higher average waiting times, despite the fact that neither customers nor servers act strategically.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17588v1"
    ],
    "publication_venue": null
}