{
    "arxiv_id": "2303.13538",
    "paper_title": "Bluetooth and WiFi Dataset for Real World RF Fingerprinting of Commercial Devices",
    "authors": [
        "Anu Jagannath",
        "Zackary Kane",
        "Jithin Jagannath"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-08-17"
    ],
    "latest_version": 2,
    "categories": [
        "cs.NI",
        "cs.LG"
    ],
    "abstract": "RF fingerprinting is emerging as a physical layer security scheme to identify illegitimate and/or unauthorized emitters sharing the RF spectrum. However, due to the lack of publicly accessible real-world datasets, most research focuses on generating synthetic waveforms with software-defined radios (SDRs) which are not suited for practical deployment settings. On other hand, the limited datasets that are available focus only on chipsets that generate only one kind of waveform. Commercial off-the-shelf (COTS) combo chipsets that support two wireless standards (for example WiFi and Bluetooth) over a shared dual-band antenna such as those found in laptops, adapters, wireless chargers, Raspberry Pis, among others are becoming ubiquitous in the IoT realm. Hence, to keep up with the modern IoT environment, there is a pressing need for real-world open datasets capturing emissions from these combo chipsets transmitting heterogeneous communication protocols. To this end, we capture the first known emissions from the COTS IoT chipsets transmitting WiFi and Bluetooth under two different time frames. The different time frames are essential to rigorously evaluate the generalization capability of the models. To ensure widespread use, each capture within the comprehensive 72 GB dataset is long enough (40 MSamples) to support diverse input tensor lengths and formats. Finally, the dataset also comprises emissions at varying signal powers to account for the feeble to high signal strength emissions as encountered in a real-world setting.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13538v1",
        "http://arxiv.org/pdf/2303.13538v2"
    ],
    "publication_venue": "Revision Under Review"
}