{
    "arxiv_id": "2303.10311",
    "paper_title": "On the rise of fear speech in online social media",
    "authors": [
        "Punyajoy Saha",
        "Kiran Garimella",
        "Narla Komal Kalyan",
        "Saurabh Kumar Pandey",
        "Pauras Mangesh Meher",
        "Binny Mathew",
        "Animesh Mukherjee"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cs.SI",
        "cs.CL",
        "cs.CY"
    ],
    "abstract": "Recently, social media platforms are heavily moderated to prevent the spread of online hate speech, which is usually fertile in toxic words and is directed toward an individual or a community. Owing to such heavy moderation, newer and more subtle techniques are being deployed. One of the most striking among these is fear speech. Fear speech, as the name suggests, attempts to incite fear about a target community. Although subtle, it might be highly effective, often pushing communities toward a physical conflict. Therefore, understanding their prevalence in social media is of paramount importance. This article presents a large-scale study to understand the prevalence of 400K fear speech and over 700K hate speech posts collected from Gab.com. Remarkably, users posting a large number of fear speech accrue more followers and occupy more central positions in social networks than users posting a large number of hate speech. They can also reach out to benign users more effectively than hate speech users through replies, reposts, and mentions. This connects to the fact that, unlike hate speech, fear speech has almost zero toxic content, making it look plausible. Moreover, while fear speech topics mostly portray a community as a perpetrator using a (fake) chain of argumentation, hate speech topics hurl direct multitarget insults, thus pointing to why general users could be more gullible to fear speech. Our findings transcend even to other platforms (Twitter and Facebook) and thus necessitate using sophisticated moderation policies and mass awareness to combat fear speech.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10311v1"
    ],
    "publication_venue": "16 pages, 9 tables, 15 figures, accepted in Proceedings of the National Academy of Sciences of the United States of America",
    "doi": "10.1073/pnas.2212270120"
}