{
    "arxiv_id": "2303.10961",
    "paper_title": "LFACon: Introducing Anglewise Attention to No-Reference Quality Assessment in Light Field Space",
    "authors": [
        "Qiang Qu",
        "Xiaoming Chen",
        "Yuk Ying Chung",
        "Weidong Cai"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2024-12-11"
    ],
    "latest_version": 1,
    "categories": [
        "eess.IV",
        "cs.CV",
        "cs.MM"
    ],
    "abstract": "Light field imaging can capture both the intensity information and the direction information of light rays. It naturally enables a six-degrees-of-freedom viewing experience and deep user engagement in virtual reality. Compared to 2D image assessment, light field image quality assessment (LFIQA) needs to consider not only the image quality in the spatial domain but also the quality consistency in the angular domain. However, there is a lack of metrics to effectively reflect the angular consistency and thus the angular quality of a light field image (LFI). Furthermore, the existing LFIQA metrics suffer from high computational costs due to the excessive data volume of LFIs. In this paper, we propose a novel concept of \"anglewise attention\" by introducing a multihead self-attention mechanism to the angular domain of an LFI. This mechanism better reflects the LFI quality. In particular, we propose three new attention kernels, including anglewise self-attention, anglewise grid attention, and anglewise central attention. These attention kernels can realize angular self-attention, extract multiangled features globally or selectively, and reduce the computational cost of feature extraction. By effectively incorporating the proposed kernels, we further propose our light field attentional convolutional neural network (LFACon) as an LFIQA metric. Our experimental results show that the proposed LFACon metric significantly outperforms the state-of-the-art LFIQA metrics. For the majority of distortion types, LFACon attains the best performance with lower complexity and less computational time.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10961v1"
    ],
    "publication_venue": "Accepted for IEEE VR 2023 (TVCG Special Issues) (Early Access)",
    "doi": "10.1109/TVCG.2023.3247069"
}