{
    "arxiv_id": "2303.10460",
    "paper_title": "Average Probability of Error for Single Uniprior Index Coding over Rayleigh Fading Channel",
    "authors": [
        "Anjana A Mahesh",
        "Charul Rajput",
        "Bobbadi Rupa",
        "B. Sundar Rajan"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cs.IT"
    ],
    "abstract": "Ong and Ho developed optimal linear index codes for single uniprior index coding problems (ICPs) by finding a spanning tree for each of the strongly connected components of the corresponding information-flow graphs, following which Thomas et al. considered the same class of ICPs over Rayleigh fading channel. They developed the min-max probability of error criterion for choosing an index code which minimized the probability of error at the receivers and showed that there always exist optimal linear index codes for which any receiver takes at most two transmissions to decode a requested message. Motivated by the above works, this paper considers single uniprior ICPs over Rayleigh fading channels for which minimizing average probability of error is shown to be a criterion for further selection of index codes. The optimal index code w.r.t this criterion is shown to be one that minimizes the total number of transmissions used for decoding the message requests at all the receivers. An algorithm that generates a spanning tree which has a lower value of this metric as compared to the optimal star graph is also presented. For a given set of parameters of single uniprior ICPs, a lower bound for the total number of transmissions used by any optimal index code is derived, and a class of ICPs for which this bound is tight is identified.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10460v1"
    ],
    "publication_venue": "A shorter version to appear in the proceedings of IEEE Information Theory Workshop (ITW 2023). 6 pages, 5 figures and 2 tables"
}