{
    "arxiv_id": "2303.13634",
    "paper_title": "Physics-informed PointNet: On how many irregular geometries can it solve an inverse problem simultaneously? Application to linear elasticity",
    "authors": [
        "Ali Kashefi",
        "Leonidas J. Guibas",
        "Tapan Mukerji"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-04-04"
    ],
    "latest_version": 2,
    "categories": [
        "cs.LG",
        "cs.CE"
    ],
    "abstract": "Regular physics-informed neural networks (PINNs) predict the solution of partial differential equations using sparse labeled data but only over a single domain. On the other hand, fully supervised learning models are first trained usually over a few thousand domains with known solutions (i.e., labeled data) and then predict the solution over a few hundred unseen domains. Physics-informed PointNet (PIPN) is primarily designed to fill this gap between PINNs (as weakly supervised learning models) and fully supervised learning models. In this article, we demonstrate that PIPN predicts the solution of desired partial differential equations over a few hundred domains simultaneously, while it only uses sparse labeled data. This framework benefits fast geometric designs in the industry when only sparse labeled data are available. Particularly, we show that PIPN predicts the solution of a plane stress problem over more than 500 domains with different geometries, simultaneously. Moreover, we pioneer implementing the concept of remarkable batch size (i.e., the number of geometries fed into PIPN at each sub-epoch) into PIPN. Specifically, we try batch sizes of 7, 14, 19, 38, 76, and 133. Additionally, the effect of the PIPN size, symmetric function in the PIPN architecture, and static and dynamic weights for the component of the sparse labeled data in the loss function are investigated.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13634v1",
        "http://arxiv.org/pdf/2303.13634v2"
    ],
    "publication_venue": null
}