{
    "arxiv_id": "2303.17374",
    "paper_title": "Intraseasonal Oscillation of Land Surface Moisture and its role in the maintenance of land ITCZ during the active phases of the Indian Summer Monsoon",
    "authors": [
        "Pratibha Gautam",
        "Rajib Chattopadhyay",
        "Gill Martin",
        "Susmitha Joseph",
        "A. K. Sahai"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2024-07-08"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ao-ph"
    ],
    "abstract": "What is the role of soil moisture in maintaining the land ITCZ during the active phase of the monsoon? This question has been addressed in this study by using ERA5 reanalysis datasets, and then we evaluate the question in the CFS model-free run. Like rainfall, soil moisture also show intraseasonal oscillation. Furthermore, the sub-seasonal and seasonal features of soil moisture are different from each other. During the summer monsoon season, the maximum soil moisture is found over western coastal regions, central parts of India, and the northeastern Indian subcontinent. However, during active phases of the monsoon, the maximum positive soil moisture anomaly was found in North West parts of India. soil moisture also play a pre-conditioning role during active phases of the monsoon over the monsoon core zone of India. When it is further divided into two boxes, the north monsoon core zone, and the south monsoon core zone, it is found that the preconditioning depends on that region's soil type and climate classification. Also, we calculate the moist static energy (MSE) budget during the monsoon phases to show how soil moisture feedback affects the boundary layer MSE and rainfall. A similar analysis is applied to the model run, but it cannot show the realistic preconditioning role of soil moisture and its feedback on the rainfall as in observations. We conclude that to get proper feedback between soil moisture and precipitation during the active phase of the monsoon in the model, the pre-conditioning of soil moisture should be realistic.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17374v1"
    ],
    "publication_venue": null,
    "doi": "10.1007/s00382-023-07070-5"
}