{
    "arxiv_id": "2303.13722",
    "paper_title": "Natural language processing to automatically extract the presence and severity of esophagitis in notes of patients undergoing radiotherapy",
    "authors": [
        "Shan Chen",
        "Marco Guevara",
        "Nicolas Ramirez",
        "Arpi Murray",
        "Jeremy L. Warner",
        "Hugo JWL Aerts",
        "Timothy A. Miller",
        "Guergana K. Savova",
        "Raymond H. Mak",
        "Danielle S. Bitterman"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-09-14"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CL"
    ],
    "abstract": "Radiotherapy (RT) toxicities can impair survival and quality-of-life, yet remain under-studied. Real-world evidence holds potential to improve our understanding of toxicities, but toxicity information is often only in clinical notes. We developed natural language processing (NLP) models to identify the presence and severity of esophagitis from notes of patients treated with thoracic RT. We fine-tuned statistical and pre-trained BERT-based models for three esophagitis classification tasks: Task 1) presence of esophagitis, Task 2) severe esophagitis or not, and Task 3) no esophagitis vs. grade 1 vs. grade 2-3. Transferability was tested on 345 notes from patients with esophageal cancer undergoing RT.\n  Fine-tuning PubmedBERT yielded the best performance. The best macro-F1 was 0.92, 0.82, and 0.74 for Task 1, 2, and 3, respectively. Selecting the most informative note sections during fine-tuning improved macro-F1 by over 2% for all tasks. Silver-labeled data improved the macro-F1 by over 3% across all tasks. For the esophageal cancer notes, the best macro-F1 was 0.73, 0.74, and 0.65 for Task 1, 2, and 3, respectively, without additional fine-tuning.\n  To our knowledge, this is the first effort to automatically extract esophagitis toxicity severity according to CTCAE guidelines from clinic notes. The promising performance provides proof-of-concept for NLP-based automated detailed toxicity monitoring in expanded domains.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13722v1"
    ],
    "publication_venue": "17 pages, 6 tables, 1figure, submiting to JCO-CCI for review",
    "doi": "10.1200/CCI.23.00048"
}