{
    "arxiv_id": "2303.12096",
    "paper_title": "Reply to: Inability of a graph neural network heuristic to outperform greedy algorithms in solving combinatorial optimization problems",
    "authors": [
        "Martin J. A. Schuetz",
        "J. Kyle Brubaker",
        "Helmut G. Katzgraber"
    ],
    "submission_date": "2023-02-03",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cond-mat.dis-nn",
        "cs.AI",
        "math.OC",
        "quant-ph"
    ],
    "abstract": "We provide a comprehensive reply to the comment written by Stefan Boettcher [arXiv:2210.00623] and argue that the comment singles out one particular non-representative example problem, entirely focusing on the maximum cut problem (MaxCut) on sparse graphs, for which greedy algorithms are expected to perform well. Conversely, we highlight the broader algorithmic development underlying our original work, and (within our original framework) provide additional numerical results showing sizable improvements over our original data, thereby refuting the comment's original performance statements. Furthermore, it has already been shown that physics-inspired graph neural networks (PI-GNNs) can outperform greedy algorithms, in particular on hard, dense instances. We also argue that the internal (parallel) anatomy of graph neural networks is very different from the (sequential) nature of greedy algorithms, and (based on their usage at the scale of real-world social networks) point out that graph neural networks have demonstrated their potential for superior scalability compared to existing heuristics such as extremal optimization. Finally, we conclude highlighting the conceptual novelty of our work and outline some potential extensions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12096v1"
    ],
    "publication_venue": "Manuscript: 2 pages, 1 figure. arXiv admin note: substantial text overlap with arXiv:2302.03602",
    "doi": "10.1038/s42256-022-00588-z"
}