{
    "arxiv_id": "2303.11361",
    "paper_title": "The Evolution of Compact Symmetric Objects -- A Possible Connection with Tidal Disruption Events",
    "authors": [
        "A. C. S. Readhead",
        "V. Ravi",
        "R. D. Blandford",
        "A. G. Sullivan",
        "J. Somalwar",
        "I. Liodakis",
        "M. L. Lister",
        "G. B. Taylor",
        "P. N. Wilkinson",
        "N. Globus",
        "S. Kiehlmann",
        "C. R. Lawrence",
        "S. O'Neill",
        "V. Pavlidou",
        "T. J. Pearson",
        "E. Sheldahl",
        "A. Siemiginowska",
        "K. Tassis"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
    ],
    "abstract": "Compact Symmetric Objects (CSOs) form a distinct class of jetted active galactic nuclei (jetted-AGN). We examine a carefully selected sample of 54 CSOs, and confirm that there are two unrelated classes: an edge-dimmed, low-luminosity class (CSO 1), and an edge-brightened, high-luminosity class (CSO 2). Using statistically significant blind tests, we show that CSO 2s themselves consist of two morphologically distinct classes: CSO 2.0, having prominent hot-spots at the leading edges of narrow jets and/or narrow lobes; and CSO 2.2, without prominent hot-spots, and with broad jets and/or lobes. An intermediate class, CSO 2.1, exhibits mixed properties. The four classes occupy different, overlapping, portions of the luminosity-size plane, with the sizes of largest CSOs being $\\sim 500$pc. We advance the hypothesis that CSO 2.0s are young and evolve through CSO 2.1s into CSO 2.2s, which are old (up to $\\sim 5000$ yr). Thus CSOs do not evolve into larger types of jetted-AGN, but spend their whole life cycle as CSOs. The radio emission region energies in the CSO 2s we have studied range from $\\sim 10^{-4}\\, M_\\odot {c}^2$ to $\\sim 7 \\, M_\\odot {c}^2$. We show that the transient nature of CSO 2s, and their birthrate, can be explained through ignition in the tidal disruption events of giant stars. We also consider possibilities for tapping the spin energy of the supermassive black hole, and tapping the energy of the accretion disk, in a manner similar to, but not the same as, that which occurs in dwarf novae. Our results demonstrate conclusively that CSOs constitute a large family of AGN in which we have thus far studied only the brightest. More comprehensive radio studies, with higher sensitivity, resolution, and dynamic range, will revolutionize our understanding of AGN and the central engines that power them.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11361v1"
    ],
    "publication_venue": "41 pages, 13 figures, 10 tables"
}