{
    "arxiv_id": "2303.12912",
    "paper_title": "A long-duration gamma-ray burst of dynamical origin from the nucleus of an ancient galaxy",
    "authors": [
        "Andrew J. Levan",
        "Daniele B. Malesani",
        "Benjamin P. Gompertz",
        "Anya E. Nugent",
        "Matt Nicholl",
        "Samantha Oates",
        "Daniel A. Perley",
        "Jillian Rastinejad",
        "Brian D. Metzger",
        "Steve Schulze",
        "Elizabeth R. Stanway",
        "Anne Inkenhaag",
        "Tayyaba Zafar",
        "J. Feliciano Agui Fernandez",
        "Ashley Chrimes",
        "Kornpob Bhirombhakdi",
        "Antonio de Ugarte Postigo",
        "Wen-fai Fong",
        "Andrew S. Fruchter",
        "Giacomo Fragione",
        "Johan P. U. Fynbo",
        "Nicola Gaspari",
        "Kasper E. Heintz",
        "Jens Hjorth",
        "Pall Jakobsson",
        "Peter G. Jonker",
        "Gavin P. Lamb",
        "Ilya Mandel",
        "Soheb Mandhai",
        "Maria E. Ravasio",
        "Jesper Sollerman",
        "Nial R. Tanvir"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The majority of long duration ($>2$ s) gamma-ray bursts (GRBs) are believed to arise from the collapse of massive stars \\cite{Hjorth+03}, with a small proportion created from the merger of compact objects. Most of these systems are likely formed via standard stellar evolution pathways. However, it has long been thought that a fraction of GRBs may instead be an outcome of dynamical interactions in dense environments, channels which could also contribute significantly to the samples of compact object mergers detected as gravitational wave sources. Here we report the case of GRB 191019A, a long GRB (T_90 = 64.4 +/- 4.5 s) which we pinpoint close (<100 pc projected) to the nucleus of an ancient (>1~Gyr old) host galaxy at z=0.248. The lack of evidence for star formation and deep limits on any supernova emission make a massive star origin difficult to reconcile with observations, while the timescales of the emission rule out a direct interaction with the supermassive black hole in the nucleus of the galaxy, We suggest that the most likely route for progenitor formation is via dynamical interactions in the dense nucleus of the host, consistent with the centres of such galaxies exhibiting interaction rates up to two orders of magnitude larger than typical field galaxies. The burst properties could naturally be explained via compact object mergers involving white dwarfs (WD), neutron stars (NS) or black holes (BH). These may form dynamically in dense stellar clusters, or originate in a gaseous disc around the supermassive black hole. Future electromagnetic and gravitational-wave observations in tandem thus offer a route to probe the dynamical fraction and the details of dynamical interactions in galactic nuclei and other high density stellar systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12912v1"
    ],
    "publication_venue": "Accepted to Nature Astronomy. This is the submitted version and will differ from the published version due to modifications in the refereeing process",
    "doi": "10.21203/rs.3.rs-2298504/v1"
}