{
    "arxiv_id": "2303.11721",
    "paper_title": "Using Forests in Multivariate Regression Discontinuity Designs",
    "authors": [
        "Yiqi Liu",
        "Yuan Qi"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2024-07-10"
    ],
    "latest_version": 2,
    "categories": [
        "econ.EM"
    ],
    "abstract": "We discuss estimation and inference of conditional treatment effects in regression discontinuity designs with multiple scores. Aside from the commonly used local linear regression approach and a minimax-optimal estimator recently proposed by Imbens and Wager (2019), we consider two estimators based on random forests -- honest regression forests and local linear forests -- whose construction resembles that of standard local regressions, with theoretical validity following from results in Wager and Athey (2018) and Friedberg et al. (2020). We design a systematic Monte Carlo study with data generating processes built both from functional forms that we specify and from Wasserstein Generative Adversarial Networks that can closely mimic the observed data. We find that no single estimator dominates across all simulations: (i) local linear regressions perform well in univariate settings, but can undercover when multivariate scores are transformed into a univariate score -- which is commonly done in practice -- possibly due to the \"zero-density\" issue of the collapsed univariate score at the transformed cutoff; (ii) good performance of the minimax-optimal estimator depends on accurate estimation of a nuisance parameter and its current implementation only accepts up to two scores; (iii) forest-based estimators are not designed for estimation at boundary points and can suffer from bias in finite sample, but their flexibility in modeling multivariate scores opens the door to a wide range of empirical applications in multivariate regression discontinuity designs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11721v1",
        "http://arxiv.org/pdf/2303.11721v2"
    ],
    "publication_venue": null
}