{
    "arxiv_id": "2303.11128",
    "paper_title": "Nonlinear Damping and Field-aligned Flows of Propagating Shear Alfvén Waves with Braginskii Viscosity",
    "authors": [
        "Alexander J. B. Russell"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "physics.plasm-ph",
        "physics.space-ph"
    ],
    "abstract": "Braginskii MHD provides a more accurate description of many plasma environments than classical MHD since it actively treats the stress tensor using a closure derived from physical principles. Stress tensor effects nonetheless remain relatively unexplored for solar MHD phenomena, especially in nonlinear regimes. This paper analytically examines nonlinear damping and longitudinal flows of propagating shear Alfvén waves. Most previous studies of MHD waves in Braginskii MHD considered the strict linear limit of vanishing wave perturbations. We show that those former linear results only apply to Alfvén wave amplitudes in the corona that are so small as to be of little interest, typically a wave energy less than $10^{-11}$ times the energy of the background magnetic field. For observed wave amplitudes, the Braginskii viscous dissipation of coronal Alfvén waves is nonlinear and a factor around $10^9$ stronger than predicted by the linear theory. Furthermore, the dominant damping occurs through the parallel viscosity coefficient $η_0$, rather than the perpendicular viscosity coefficient $η_2$ in the linearized solution. This paper develops the nonlinear theory, showing that the wave energy density decays with an envelope $(1+z/L_d)^{-1}$. The damping length $L_d$ exhibits an optimal damping solution, beyond which greater viscosity leads to lower dissipation as the viscous forces self-organise the longitudinal flow to suppress damping. Although the nonlinear damping greatly exceeds the linear damping, it remains negligible for many coronal applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11128v1"
    ],
    "publication_venue": "Accepted for publication in ApJ"
}