{
    "arxiv_id": "2303.12506",
    "paper_title": "Leximin Approximation: From Single-Objective to Multi-Objective",
    "authors": [
        "Eden Hartman",
        "Avinatan Hassidim",
        "Yonatan Aumann",
        "Erel Segal-Halevi"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-08-01"
    ],
    "latest_version": 3,
    "categories": [
        "cs.GT",
        "cs.DS",
        "cs.MA"
    ],
    "abstract": "Leximin is a common approach to multi-objective optimization, frequently employed in fair division applications. In leximin optimization, one first aims to maximize the smallest objective value; subject to this, one maximizes the second-smallest objective; and so on. Often, even the single-objective problem of maximizing the smallest value cannot be solved accurately. What can we hope to accomplish for leximin optimization in this situation? Recently, Henzinger et al. (2022) defined a notion of \\emph{approximate} leximin optimality. Their definition, however, considers only an additive approximation.\n  In this work, we first define the notion of approximate leximin optimality, allowing both multiplicative and additive errors. We then show how to compute, in polynomial time, such an approximate leximin solution, using an oracle that finds an approximation to a single-objective problem. The approximation factors of the algorithms are closely related: an $(α,ε)$-approximation for the single-objective problem (where $α\\in (0,1]$ and $ε\\geq 0$ are the multiplicative and additive factors respectively) translates into an $\\left(\\frac{α^2}{1-α+ α^2}, \\fracε{1-α+α^2}\\right)$-approximation for the multi-objective leximin problem, regardless of the number of objectives.\n  Finally, we apply our algorithm to obtain an approximate leximin solution for the problem of \\emph{stochastic allocations of indivisible goods}.\n  For this problem, assuming sub-modular objectives functions, the single-objective egalitarian welfare can be approximated, with only a multiplicative error, to an optimal $1-\\frac{1}{e}\\approx 0.632$ factor w.h.p. We show how to extend the approximation to leximin, over all the objective functions, to a multiplicative factor of $\\frac{(e-1)^2}{e^2-e+1} \\approx 0.52$ w.h.p or $\\frac{1}{3}$ deterministically.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12506v1",
        "http://arxiv.org/pdf/2303.12506v2",
        "http://arxiv.org/pdf/2303.12506v3"
    ],
    "publication_venue": null
}