{
    "arxiv_id": "2303.16956",
    "paper_title": "FeDiSa: A Semi-asynchronous Federated Learning Framework for Power System Fault and Cyberattack Discrimination",
    "authors": [
        "Muhammad Akbar Husnoo",
        "Adnan Anwar",
        "Haftu Tasew Reda",
        "Nasser Hosseizadeh",
        "Shama Naz Islam",
        "Abdun Naser Mahmood",
        "Robin Doss"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CR",
        "cs.DC",
        "cs.LG",
        "eess.SY"
    ],
    "abstract": "With growing security and privacy concerns in the Smart Grid domain, intrusion detection on critical energy infrastructure has become a high priority in recent years. To remedy the challenges of privacy preservation and decentralized power zones with strategic data owners, Federated Learning (FL) has contemporarily surfaced as a viable privacy-preserving alternative which enables collaborative training of attack detection models without requiring the sharing of raw data. To address some of the technical challenges associated with conventional synchronous FL, this paper proposes FeDiSa, a novel Semi-asynchronous Federated learning framework for power system faults and cyberattack Discrimination which takes into account communication latency and stragglers. Specifically, we propose a collaborative training of deep auto-encoder by Supervisory Control and Data Acquisition sub-systems which upload their local model updates to a control centre, which then perform a semi-asynchronous model aggregation for a new global model parameters based on a buffer system and a preset cut-off time. Experiments on the proposed framework using publicly available industrial control systems datasets reveal superior attack detection accuracy whilst preserving data confidentiality and minimizing the adverse effects of communication latency and stragglers. Furthermore, we see a 35% improvement in training time, thus validating the robustness of our proposed method.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16956v1"
    ],
    "publication_venue": "To appear in IEEE INFOCOM AidTSP 2023"
}