{
    "arxiv_id": "2303.16778",
    "paper_title": "Assorted, Archetypal and Annotated Two Million (3A2M) Cooking Recipes Dataset based on Active Learning",
    "authors": [
        "Nazmus Sakib",
        "G. M. Shahariar",
        "Md. Mohsinul Kabir",
        "Md. Kamrul Hasan",
        "Hasan Mahmud"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-06-14"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
    ],
    "abstract": "Cooking recipes allow individuals to exchange culinary ideas and provide food preparation instructions. Due to a lack of adequate labeled data, categorizing raw recipes found online to the appropriate food genres is a challenging task in this domain. Utilizing the knowledge of domain experts to categorize recipes could be a solution. In this study, we present a novel dataset of two million culinary recipes labeled in respective categories leveraging the knowledge of food experts and an active learning technique. To construct the dataset, we collect the recipes from the RecipeNLG dataset. Then, we employ three human experts whose trustworthiness score is higher than 86.667% to categorize 300K recipe by their Named Entity Recognition (NER) and assign it to one of the nine categories: bakery, drinks, non-veg, vegetables, fast food, cereals, meals, sides and fusion. Finally, we categorize the remaining 1900K recipes using Active Learning method with a blend of Query-by-Committee and Human In The Loop (HITL) approaches. There are more than two million recipes in our dataset, each of which is categorized and has a confidence score linked with it. For the 9 genres, the Fleiss Kappa score of this massive dataset is roughly 0.56026. We believe that the research community can use this dataset to perform various machine learning tasks such as recipe genre classification, recipe generation of a specific genre, new recipe creation, etc. The dataset can also be used to train and evaluate the performance of various NLP tasks such as named entity recognition, part-of-speech tagging, semantic role labeling, and so on. The dataset will be available upon publication: https://tinyurl.com/3zu4778y.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16778v1"
    ],
    "publication_venue": null,
    "doi": "10.1007/978-3-031-34622-4_15"
}