{
    "arxiv_id": "2303.09824",
    "paper_title": "Motion Planning for Autonomous Driving: The State of the Art and Future Perspectives",
    "authors": [
        "Siyu Teng",
        "Xuemin Hu",
        "Peng Deng",
        "Bai Li",
        "Yuchen Li",
        "Dongsheng Yang",
        "Yunfeng Ai",
        "Lingxi Li",
        "Long Chen",
        "Zhe Xuanyuan",
        "Fenghua Zhu"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 3,
    "categories": [
        "cs.RO",
        "cs.AI"
    ],
    "abstract": "Thanks to the augmented convenience, safety advantages, and potential commercial value, Intelligent vehicles (IVs) have attracted wide attention throughout the world. Although a few autonomous driving unicorns assert that IVs will be commercially deployable by 2025, their implementation is still restricted to small-scale validation due to various issues, among which precise computation of control commands or trajectories by planning methods remains a prerequisite for IVs. This paper aims to review state-of-the-art planning methods, including pipeline planning and end-to-end planning methods. In terms of pipeline methods, a survey of selecting algorithms is provided along with a discussion of the expansion and optimization mechanisms, whereas in end-to-end methods, the training approaches and verification scenarios of driving tasks are points of concern. Experimental platforms are reviewed to facilitate readers in selecting suitable training and validation methods. Finally, the current challenges and future directions are discussed. The side-by-side comparison presented in this survey not only helps to gain insights into the strengths and limitations of the reviewed methods but also assists with system-level design choices.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09824v1",
        "http://arxiv.org/pdf/2303.09824v2",
        "http://arxiv.org/pdf/2303.09824v3"
    ],
    "publication_venue": "20 pages, 14 figures and 5 tables"
}