{
    "arxiv_id": "2303.14886",
    "paper_title": "An Extensive Catalog of Early-type Dwarf Galaxies in the Local Universe: Morphology and Environment",
    "authors": [
        "Sanjaya Paudel",
        "Suk-Jin Yoon",
        "Jaewon Yoo",
        "Rory Smith",
        "Daya Nidhi Chhatkuli",
        "Rajesh Kumar Bachan",
        "Binil Aryal",
        "Binod Adhikari",
        "Namuna Adhikari",
        "Amrit Sedain",
        "Sharup Sheikh",
        "Sarashwati Dhital",
        "Ashutosh Giri",
        "Rabin Baral"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present an extensive catalog of 5405 early-type dwarf (dE) galaxies located in the various environments, i.e., clusters, groups and fields, of the local universe ($z$ $<$ 0.01). The dEs are selected through visual inspection of the Legacy survey's $g$-$r$-$z$ combined tri-color images. The inspected area, covering a total sky area of 7643 deg$^{2}$, encompasses two local clusters, Virgo and Fornax, 265 groups, and the regions around 586 field galaxies of $M_{K}$ $<$ $-$21 mag. \\trev{The catalog aims to be one of the most extensive and publicly accessible collections of data on dE, despite its complex completeness limits that may not accurately represent its statistical completeness.} The strength of the catalog lies in the morphological characteristics, including nucleated, tidal, and ultradiffuse dE. The two clusters contribute nearly half (2437 out of 5405) dEs, and the 265 groups contribute 2103 dEs. There are 864 dEs in 586 fields, i.e., $\\sim$\\,1.47 dEs per field. Using a standard definition commonly used in literature, we identify 100 ultra-diffuse galaxies (UDGs), which take $\\sim$\\,2\\,\\% of the dE population. We find that 40\\,\\% of our sample dEs harbor a central nucleus, and among the UDG population, a majority, 79\\%, are nonnucleated. About 1.3\\,\\% of dEs suffer from ongoing tidal disturbance by nearby massive galaxies, and only 0.03\\,\\% show the sign of recent dwarf-dwarf mergers. The association between dEs and their nearest bright neighbor galaxies suggests that dEs are more likely created where their neighbors are non-star-forming ones.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14886v1"
    ],
    "publication_venue": "Accepted for publication in ApJS"
}