{
    "arxiv_id": "2303.11919",
    "paper_title": "Scalable Methods for Computing Sharp Extreme Event Probabilities in Infinite-Dimensional Stochastic Systems",
    "authors": [
        "Timo Schorlepp",
        "Shanyin Tong",
        "Tobias Grafke",
        "Georg Stadler"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-10-18"
    ],
    "latest_version": 2,
    "categories": [
        "stat.CO",
        "math.OC",
        "math.PR"
    ],
    "abstract": "We introduce and compare computational techniques for sharp extreme event probability estimates in stochastic differential equations with small additive Gaussian noise. In particular, we focus on strategies that are scalable, i.e. their efficiency does not degrade upon temporal and possibly spatial refinement. For that purpose, we extend algorithms based on the Laplace method for estimating the probability of an extreme event to infinite dimensional path space. The method estimates the limiting exponential scaling using a single realization of the random variable, the large deviation minimizer. Finding this minimizer amounts to solving an optimization problem governed by a differential equation. The probability estimate becomes sharp when it additionally includes prefactor information, which necessitates computing the determinant of a second derivative operator to evaluate a Gaussian integral around the minimizer. We present an approach in infinite dimensions based on Fredholm determinants, and develop numerical algorithms to compute these determinants efficiently for the high-dimensional systems that arise upon discretization. We also give an interpretation of this approach using Gaussian process covariances and transition tubes. An example model problem, for which we provide an open-source python implementation, is used throughout the paper to illustrate all methods discussed. To study the performance of the methods, we consider examples of stochastic differential and stochastic partial differential equations, including the randomly forced incompressible three-dimensional Navier-Stokes equations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11919v1",
        "http://arxiv.org/pdf/2303.11919v2"
    ],
    "publication_venue": null,
    "doi": "10.1007/s11222-023-10307-2"
}