{
    "arxiv_id": "2303.13491",
    "paper_title": "FraudAuditor: A Visual Analytics Approach for Collusive Fraud in Health Insurance",
    "authors": [
        "Jiehui Zhou",
        "Xumeng Wang",
        "Jie Wang",
        "Hui Ye",
        "Huanliang Wang",
        "Zihan Zhou",
        "Dongming Han",
        "Haochao Ying",
        "Jian Wu",
        "Wei Chen"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-04-04"
    ],
    "latest_version": 1,
    "categories": [
        "cs.HC"
    ],
    "abstract": "Collusive fraud, in which multiple fraudsters collude to defraud health insurance funds, threatens the operation of the healthcare system. However, existing statistical and machine learning-based methods have limited ability to detect fraud in the scenario of health insurance due to the high similarity of fraudulent behaviors to normal medical visits and the lack of labeled data. To ensure the accuracy of the detection results, expert knowledge needs to be integrated with the fraud detection process. By working closely with health insurance audit experts, we propose FraudAuditor, a three-stage visual analytics approach to collusive fraud detection in health insurance. Specifically, we first allow users to interactively construct a co-visit network to holistically model the visit relationships of different patients. Second, an improved community detection algorithm that considers the strength of fraud likelihood is designed to detect suspicious fraudulent groups. Finally, through our visual interface, users can compare, investigate, and verify suspicious patient behavior with tailored visualizations that support different time scales. We conducted case studies in a real-world healthcare scenario, i.e., to help locate the actual fraud group and exclude the false positive group. The results and expert feedback proved the effectiveness and usability of the approach.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13491v1"
    ],
    "publication_venue": "12 pages, 7 figures",
    "doi": "10.1109/TVCG.2023.3261910"
}