{
    "arxiv_id": "2303.14678",
    "paper_title": "Plant Performance in Precision Horticulture: Optimal climate control under stochastic uncertainty",
    "authors": [
        "Simon van Mourik",
        "Bert van't Ooster",
        "Michel Vellekoop"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "math.OC",
        "eess.SY"
    ],
    "abstract": "This paper presents an optimal control algorithm for crop production when state dynamics are uncertain due to stochastic noise. The case study concerns a 50 day production round of lettuce in a greenhouse where control input consists of daily and nightly temperature set points. The control problem was formulated in terms of a stochastic Markov decision process with the objective to maximize the expected net revenue at harvest time.\n  The performance was compared to that of a stochastic static controller, and a deterministic time-varying dynamic feedback controller for the case of heat limited weather conditions, and strict requirements on harvest weight precision. Compared to the stochastic dynamic controller, the static controller resulted in lower maximal expected net revenue (-19 \\%), less precision at harvest time (state uncertainty increased with 86 \\%), and a larger sensitivity towards a change in starting day (varying the starting time from 0 to 10 days caused a variation of 15 \\% in expected net revenue, compared to 11\\% for the original controller). The deterministic controller also resulted in lower maximal expected net revenue (-16 \\%), and less precision at harvest time (state uncertainty increased with 40 \\%). The sensitivity of expected net revenue towards a change in starting day increased dramatically (60 \\% compared to 11\\% for the original controller).\n  The results of the deterministic controller provided insights in the trade-off between optimality in case of no noise, versus robustness to noise, whereas the results of the static controller provided insights in importance of dynamic feedback in achieving high precision in harvest weight. The results of this single case study should be interpreted with caution, however they illustrate a considerable potential benefit for stochastic greenhouse climate control.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14678v1"
    ],
    "publication_venue": null
}