{
    "arxiv_id": "2303.14062",
    "paper_title": "Mutual information of subsystems and the Page curve for Schwarzschild de-Sitter black hole",
    "authors": [
        "Anirban Roy Chowdhury",
        "Ashis Saha",
        "Sunandan Gangopadhyay"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "hep-th",
        "gr-qc"
    ],
    "abstract": "In this work, we show that the two proposals associated to the mutual information of matter fields can be given for an eternal Schwarzschild black hole in de-Sitter spacetime. These proposals also depicts the status of associated entanglement wedges and their roleplay in obtaining the correct Page curve of radiation. The first proposal has been give for the before Page time scenario, which shows that the mutual information $I(R_{H}^{+}:R_{H}^{-})$ vanishes at a certain value of the observer's time $t_{b_{H}}=t_{H}$ (where $t_{H}\\ll β_{H}$). We claim that this is the Hartman-Maldacena time at which the entanglement wedge associated to $R_{H}^{+}\\cup R_{H}^{-}$ gets disconnected and the fine-grained radiation entropy has the form $S(R_{H})\\sim \\log(β_{H})$. The second proposal depicts the fact that just after the Page time, when the replica wormholes are the dominating saddle-points, the mutual information $I(B_{H}^{+}:B_{H}^{-})$ vanishes as soon as the time difference $t_{a_{H}}-t_{b_{H}}$ equals the scrambling time. Holographically, this reflects that the entanglement wedge associated to $B_{H}^{+}\\cup B_{H}^{-}$ jumps to the disconnected phase at this particular time-scale. Furthermore, these two proposals lead us to the correct time-evolution of the fine-grained entropy of radiation as portrayed by the Page curve. We have also shown that similar observations can be obtained for the radiation associated to the cosmological horizon.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14062v1"
    ],
    "publication_venue": "18 pages LaTex, comments are welcome"
}