{
    "arxiv_id": "2303.11547",
    "paper_title": "A VR-based Priming Framework and Technology Implementation to Improve Learning Mindsets and Academic Performance in Post-Secondary Students",
    "authors": [
        "Dan Hawes",
        "Ali Arya"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cs.HC"
    ],
    "abstract": "Recent research indicates that most post-secondary students in North America \"felt overwhelming anxiety\" in the past few years, negatively affecting well-being and academic performance. Further research revealed that other emotions, biases, perceptions, and negative thoughts, can similarly affect student academic performance. To address this problem, we classify these counterproductive mindsets, including anxiety, into Scarcity Mindset, a self-limiting perspective that appropriates cognitive bandwidth required for essential processes like learning in favour of addressing more critical needs or perceived insufficiencies. Through a multi-disciplinary literature analysis of ideas in cognitive science, learning theories and mindsets, and current technology approaches that are suited to address the limitations of scarcity thinking, we identify strategies to help transition students to a more positive Abundance Mindsets. We demonstrate that these priming intervention strategies can transfer to leading-edge digital environments, particularly Virtual Reality (VR). Offering further insights into the findings of our two previously presented studies, we argue that priming interventions related to preparatory activities and the context priming are transferable to virtual reality environments. As such, building on our multidisciplinary research insights, we propose a comprehensive priming model that exploits priming techniques in an iterative process called Cyclical Priming Methodology (CPM). These intervention strategies can focus on student preparation, motivation, reflection, the context of the learning environment, and other aspects of the learning process. Building on CPM, we further propose a technology implementation within VR called Virtual Reality Experience Priming (VREP) and discuss the process to embed CPM/VREP activities within the Experiential Learning Theory (ELT) cycle.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11547v1"
    ],
    "publication_venue": null
}