{
    "arxiv_id": "2303.14026",
    "paper_title": "Glitches in solar-like oscillating F-type stars: Theoretical signature of the base of the convective envelope on the ratios $r_{010}$",
    "authors": [
        "M. Deal",
        "M. -J. Goupil",
        "M. S. Cunha",
        "M. J. P. F. G. Monteiro",
        "Y. Lebreton",
        "S. Christophe",
        "F. Pereira",
        "R. Samadi",
        "A. V. Oreshina",
        "G. Buldgen"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "The transition between convective and radiative stellar regions is still not fully understood. The sharp variations in sound speed located in these transition regions give rise to a signature in specific seismic indicators, opening the possibility to constrain the physics of convection to radiation transition. Among those seismic indicators, the ratios of the small to large frequency separation for $l=0$ and $1$ modes ($r_{010}$) were shown to be particularly efficient to probe these transition regions. Interestingly, in the Kepler Legacy F-type stars, the oscillatory signatures left in the $r_{010}$ ratios by the sharp sound-speed variation have unexpected large amplitudes that still need to be explained. We show that the signature of the bottom of the convective envelope is amplified in the ratios $r_{010}$ by the frequency dependence of the amplitude compared to the signal seen in the frequencies themselves or the second differences. We find that among the different options of physical input investigated here, large amplitude signatures can only be obtained when convective penetration of the surface convective zone into the underlying radiative region is taken into account. In this case and even for amplitudes as large as those observed in F-type stars, the oscillating signature in the ratios can only be detected when the convective envelope is deep enough. This deep extension of the convective envelope causes doubt that the origin of the large amplitudes is due to penetrative convection as it is modelled here or implies that current stellar modelling (without penetrative convection) leads to an underestimation of the size of convective envelopes. In any case, studying the glitch signatures of a large number of oscillating F-type stars opens the possibility to constrain the physics of the stellar interior in these regions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14026v1"
    ],
    "publication_venue": "19 pages, 12 figures, accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202245103"
}