{
    "arxiv_id": "2303.14735",
    "paper_title": "The Collective Dynamics of a Stochastic Port-Hamiltonian Self-Driven Agent Model in One Dimension",
    "authors": [
        "Matthias Ehrhardt",
        "Thomas Kruse",
        "Antoine Tordeux"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "math.DS"
    ],
    "abstract": "The collective motion of self-driven agents is a phenomenon of great interest in interacting particle systems. In this paper, we develop and analyze a model of agent motion in one dimension with periodic boundaries using a stochastic port-Hamiltonian system (PHS). The interaction model is symmetric and based on nearest neighbors. The distance-based terms and kinematic relations correspond to the skew-symmetric Hamiltonian structure of the PHS, while the velocity difference terms make the system dissipative. The originality of the approaches lies in the stochastic noise that plays the role of an external input. It turns out that the stochastic PHS with a quadratic potential is an Ornstein-Uhlenbeck process, for which we explicitly determine the distribution for any time $t\\ge 0$ and in the limit $t\\to\\infty$.\n  We characterize the collective motion by showing that the agents' mean velocity is Brownian noise whose fluctuations increase with time, while the variance of the agents' velocities and distances, which quantify the coordination of the agents' motion, converge. The motion model does not specify a preferred direction of motion. However, assuming a equilibrium uniform starting configuration, the results show that the noise triggers rapidly coordinated agent motion determined by the Brownian behavior of the mean velocity. Interestingly, simulation results show that some theoretical properties obtained with the Ornstein-Uhlenbeck process also hold for the nonlinear model with general interaction potential.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14735v1"
    ],
    "publication_venue": null
}