{
    "arxiv_id": "2303.07921",
    "paper_title": "The stochastic renormalized mean curvature flow for planar convex sets",
    "authors": [
        "Marc Arnaudon",
        "Koléhè Coulibaly-Pasquier",
        "Laurent Miclo"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [],
    "latest_version": 1,
    "categories": [
        "math.PR"
    ],
    "abstract": "We investigate renormalized mean curvature flow (RMCF) and stochastic\nrenormalized mean curvature flow (SRMCF) for convex sets in the plane.RMCF is\nthe inverse gradient flow for logarithm of square of the perimeter divided by\nthe volume. SRMCF is We investigate renormalized mean curvature flow (RMCF) and\nstochastic renormalized mean curvature flow (SRMCF) for convex sets in the\nplane. RMCF is the inverse gradient flow for logarithm of $\\sigma/\\lambda^2$\nwhere $\\sigma$ is the perimeter and $\\lambda$ is the volume. SRMCF is RMCF\nperturbated by some Brownian noise and has the remarkable property that it can\nbe intertwined with Brownian motion, yielding a generalization of Pitman\n\"$2M-X$\" theorem. We prove that along RMCF, entropy $\\mathcal{E}_t$ for\ncurvature as well as $h_t:=\\sigma_t/\\lambda_t$ are non-increasing. We deduce\ninfinite lifetime and convergence to a disk after normalization. For SRMCF the\nsituation is more complicated. As $h_t$ is always a supermartingale, for\n$\\mathcal{E}_t$ to be a supermartingale, we need that the starting set is\ninvariant by the isometry group $G_n$ generated by the reflection with respect\nto the vertical line and the rotation of angle $2\\pi/n$, for some $n\\ge 3$. But\nfor proving infinite lifetime, we need invariance of the starting set by $G_n$\nfor some $n\\ge 7$. We provide the first SRMCF with infinite lifetime which\ncannot be reduced to a finite dimensional flow. Gage inequality plays a major\nrole in our study of the regularity of flows, as well as a careful\ninvestigation of morphological skeletons. We characterize symmetric convex sets\nwith star shaped skeletons in terms of properties of their Gauss map. Finally,\nwe establish a new isoperimetric estimate for these sets, of order $1/n^4$\nwhere $n$ is the number of branches of the skeleton.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07921v1"
    ],
    "publication_venue": null
}