{
    "arxiv_id": "2303.16242",
    "paper_title": "CuNeRF: Cube-Based Neural Radiance Field for Zero-Shot Medical Image Arbitrary-Scale Super Resolution",
    "authors": [
        "Zixuan Chen",
        "Jian-Huang Lai",
        "Lingxiao Yang",
        "Xiaohua Xie"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-09-19"
    ],
    "latest_version": 3,
    "categories": [
        "eess.IV",
        "cs.CV"
    ],
    "abstract": "Medical image arbitrary-scale super-resolution (MIASSR) has recently gained widespread attention, aiming to super sample medical volumes at arbitrary scales via a single model. However, existing MIASSR methods face two major limitations: (i) reliance on high-resolution (HR) volumes and (ii) limited generalization ability, which restricts their application in various scenarios. To overcome these limitations, we propose Cube-based Neural Radiance Field (CuNeRF), a zero-shot MIASSR framework that can yield medical images at arbitrary scales and viewpoints in a continuous domain. Unlike existing MIASSR methods that fit the mapping between low-resolution (LR) and HR volumes, CuNeRF focuses on building a coordinate-intensity continuous representation from LR volumes without the need for HR references. This is achieved by the proposed differentiable modules: including cube-based sampling, isotropic volume rendering, and cube-based hierarchical rendering. Through extensive experiments on magnetic resource imaging (MRI) and computed tomography (CT) modalities, we demonstrate that CuNeRF outperforms state-of-the-art MIASSR methods. CuNeRF yields better visual verisimilitude and reduces aliasing artifacts at various upsampling factors. Moreover, our CuNeRF does not need any LR-HR training pairs, which is more flexible and easier to be used than others. Our code will be publicly available soon.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16242v1",
        "http://arxiv.org/pdf/2303.16242v2",
        "http://arxiv.org/pdf/2303.16242v3"
    ],
    "publication_venue": "This paper is accepted by the International Conference on Computer Vision (ICCV) 2023"
}