{
    "arxiv_id": "2303.12832",
    "paper_title": "Fast and accurate collapse-time predictions for collisionless matter",
    "authors": [
        "Cornelius Rampf",
        "Shohei Saga",
        "Atsushi Taruya",
        "Stéphane Colombi"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.CO",
        "gr-qc"
    ],
    "abstract": "We consider the gravitational collapse of collisionless matter seeded by three crossed sine waves with various amplitudes, also in the presence of a linear external tidal field. We explore two theoretical methods that are more efficient than standard Lagrangian perturbation theory (LPT) for resolving shell-crossings, the crossing of particle trajectories. One of the methods completes the truncated LPT series for the displacement field far into the UV regime, thereby exponentially accelerating its convergence while at the same time removing pathological behavior of LPT observed in void regions. The other method exploits normal-form techniques known from catastrophe theory, which amounts here to replacing the sine-wave initial data by its second-order Taylor expansion in space at shell-crossing location. This replacement leads to a speed-up in determining the displacement field by several orders of magnitudes, while still achieving permille-level accuracy in the prediction of the shell-crossing time. The two methods can be used independently, but the overall best performance is achieved when combining them. Lastly, we find accurate formulas for the nonlinear density and for the triaxial evolution of the fluid in the fundamental coordinate system, as well as report a newly established exact correspondence between perfectly symmetric sine-wave collapse and spherical collapse.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12832v1",
        "http://arxiv.org/pdf/2303.12832v2"
    ],
    "publication_venue": "30 pages, 24 figures, v2: fixed minor notational inconsistency in equation 2.8, optimised colour scale for figure 11"
}