{
    "arxiv_id": "2303.11603",
    "paper_title": "Broadband X-ray timing and spectral characteristics of the accretion-powered millisecond X-ray pulsar MAXI J1816$-$195",
    "authors": [
        "Zhaosheng Li",
        "Lucien Kuiper",
        "Mingyu Ge",
        "Maurizio Falanga",
        "Juri Poutanen",
        "Long Ji",
        "Yuanyue Pan",
        "Yue Huang",
        "Renxin Xu",
        "Liming Song",
        "Jinlu Qu",
        "Shu Zhang",
        "Fangjun Lu",
        "Shuang-Nan Zhang"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "We studied the broadband X-ray timing and spectral behaviors of the newly confirmed accreting millisecond X-ray pulsar MAXI J1816$-$195 during its 2022 outburst. We used the data from Insight-HXMT ME/HE, NICER and NuSTAR which cover the energy range between 0.8--210 keV. Coherent timing analysis of Insight-HXMT ME/HE and NICER data revealed a complex behavior at the early stage of the outburst, between MJD 59737.0-59741.9, and beyond between MJD 59741.9-59760.6 a significant spin-up $\\dotν$ of $(9.0\\pm2.1)\\times10^{-14}~{\\rm Hz~s^{-1}}$. We detected the X-ray pulsations up to $\\sim95$ keV in a combination of Insight-HXMT HE observations. The pulse profiles were quite stable over the whole outburst and could be well described by a truncated Fourier series using two harmonics, the fundamental and the first overtone. Both components kept alignment in the range 0.8--64 keV. The joint and time-averaged NICER and Insight-HXMT spectra in the energy range 1--150 keV were well fitted by the absorbed Comptonization model compps plus disk blackbody with two additional Gaussian components. Based on the bolometric flux during the spin-up epoch, we determined a magnetic field strength of $(0.23-1.11)\\times10^8$ G in MAXI J1816--195.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11603v1"
    ],
    "publication_venue": "12 pages, 6 figures, submitted to ApJ"
}