{
    "arxiv_id": "2303.15922",
    "paper_title": "Hole doping in compositionally complex correlated oxide enables tunable exchange biasing",
    "authors": [
        "Alessandro R. Mazza",
        "Elizabeth Skoropata",
        "Jason Lapano",
        "Michael A. Chilcote",
        "Cameron Jorgensen",
        "Nan Tang",
        "Zheng Gai",
        "John Singleton",
        "Matthew J. Brahlek",
        "Dustin A. Gilbert",
        "Thomas Z. Ward"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el",
        "cond-mat.dis-nn",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Magnetic interfaces and the phenomena arising from them drive both the design of modern spintronics and fundamental research. Recently, it was revealed that through designing magnetic frustration in configurationally complex entropy stabilized oxides, exchange bias can occur in structurally single crystal films. This eliminates the need for complex heterostructures and nanocomposites in the design and control of magnetic response phenomena. In this work, we demonstrate through hole doping of a high entropy perovskite oxide that tuning of magnetic responses can be achieved. With detailed magnetometry, we show magnetic coupling exhibiting a variety of magnetic responses including exchange bias and antiferromagnetic spin reversal in the entropy stabilized ABO3 perovskite oxide La1-xSrx(Cr0.2Mn0.2Fe0.2Co0.2Ni0.2)O3 family. We find that manipulation of the A-site charge state can be used to balance magnetic phase compositions and coupling responses. This allows for the creation of highly tunable exchange bias responses. In the low Sr doping regime, a spin frustrated region arising at the antiferromagnetic phase boundary is shown to directly couple to the antiferromagnetic moments of the film and emerges as the dominant mechanism, leading to a vertical shift of magnetization loops in response to field biasing. At higher concentrations, direct coupling of antiferromagnetic and ferromagnetic regions is observed. This tunability of magnetic coupling is discussed within the context of these three competing magnetic phases, revealing critical features in designing exchange bias through exploiting spin frustration and disorder in high entropy oxides.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15922v1"
    ],
    "publication_venue": null,
    "doi": "10.1063/5.0142224"
}