{
    "arxiv_id": "2303.13052",
    "paper_title": "Generative AI-aided Optimization for AI-Generated Content (AIGC) Services in Edge Networks",
    "authors": [
        "Hongyang Du",
        "Zonghang Li",
        "Dusit Niyato",
        "Jiawen Kang",
        "Zehui Xiong",
        "Huawei Huang",
        "Shiwen Mao"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 2,
    "categories": [
        "cs.NI"
    ],
    "abstract": "As Metaverse emerges as the next-generation Internet paradigm, the ability to efficiently generate content is paramount. AI-Generated Content (AIGC) offers a promising solution to this challenge. However, the training and deployment of large AI models necessitate significant resources. To address this issue, we introduce an AIGC-as-a-Service (AaaS) architecture, which deploys AIGC models in wireless edge networks, ensuring ubiquitous access to AIGC services for Metaverse users. Nonetheless, a key aspect of providing personalized user experiences requires the careful selection of AIGC service providers (ASPs) capable of effectively executing user tasks. This selection process is complicated by environmental uncertainty and variability, a challenge not yet addressed well in existing literature. Therefore, we first propose a diffusion model-based AI-generated optimal decision (AGOD) algorithm, which can generate the optimal ASP selection decisions. We then apply AGOD to deep reinforcement learning (DRL), resulting in the Deep Diffusion Soft Actor-Critic (D2SAC) algorithm, which achieves efficient and effective ASP selection. Our comprehensive experiments demonstrate that D2SAC outperforms seven leading DRL algorithms. Furthermore, the proposed AGOD algorithm has the potential for extension to various optimization problems in wireless networks, positioning it a promising approach for the future research on AIGC-driven services in Metaverse. The implementation of our proposed method is available at: https://github.com/Lizonghang/AGOD.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13052v1",
        "http://arxiv.org/pdf/2303.13052v2"
    ],
    "publication_venue": null
}