{
    "arxiv_id": "2303.13472",
    "paper_title": "Plotting Behind the Scenes: Towards Learnable Game Engines",
    "authors": [
        "Willi Menapace",
        "Aliaksandr Siarohin",
        "Stéphane Lathuilière",
        "Panos Achlioptas",
        "Vladislav Golyanik",
        "Sergey Tulyakov",
        "Elisa Ricci"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-12-08"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV",
        "cs.AI"
    ],
    "abstract": "Neural video game simulators emerged as powerful tools to generate and edit videos. Their idea is to represent games as the evolution of an environment's state driven by the actions of its agents. While such a paradigm enables users to play a game action-by-action, its rigidity precludes more semantic forms of control. To overcome this limitation, we augment game models with prompts specified as a set of natural language actions and desired states. The result-a Promptable Game Model (PGM)-makes it possible for a user to play the game by prompting it with high- and low-level action sequences. Most captivatingly, our PGM unlocks the director's mode, where the game is played by specifying goals for the agents in the form of a prompt. This requires learning \"game AI\", encapsulated by our animation model, to navigate the scene using high-level constraints, play against an adversary, and devise a strategy to win a point. To render the resulting state, we use a compositional NeRF representation encapsulated in our synthesis model. To foster future research, we present newly collected, annotated and calibrated Tennis and Minecraft datasets. Our method significantly outperforms existing neural video game simulators in terms of rendering quality and unlocks applications beyond the capabilities of the current state of the art. Our framework, data, and models are available at https://snap-research.github.io/promptable-game-models/.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13472v1",
        "http://arxiv.org/pdf/2303.13472v2"
    ],
    "publication_venue": "ACM Transactions on Graphics \\c{opyright} Copyright is held by the owner/author(s) 2023. This is the author's version of the work. It is posted here for your personal use. Not for redistribution. The definitive Version of Record was published in ACM Transactions on Graphics, http://dx.doi.org/10.1145/3635705",
    "doi": "10.1145/3635705"
}