{
    "arxiv_id": "2303.12100",
    "paper_title": "3D Radiation-Hydrodynamic Simulations Resolving Interior of Rapidly Accreting Primordial Protostar",
    "authors": [
        "Kazutaka Kimura",
        "Takashi Hosokawa",
        "Kazuyuki Sugimura",
        "Hajime Fukushima"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-04-04"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "Direct collapse of supermassive stars is a possible pathway to form supermassive black hole seeds at high redshifts. Whereas previous three-dimensional (3D) simulations demonstrate that supermassive stars form via rapid mass accretion, those resolving the stellar interior have been limited. We here report 3D radiation-hydrodynamic (RHD) simulations following the evolution of rapidly accreting protostars resolving the stellar interior. We use an adaptive mesh refinement code with our newly developed RHD solver employing an explicit M1 closure method. We follow the early evolution until the stellar mass reaches $\\sim 10~M_\\odot$ from two different initial configurations of spherical and turbulent clouds. We demonstrate that, in both the cases, a swollen protostar whose radius is $100\\mathrm{-}1000~R_\\odot$ appears, as predicted by the stellar evolution calculations. Its effective temperature remains a few thousand Kelvin, and the radiative feedback by ionizing photons is too weak to disturb the accretion flow up to the epoch examined in this work. In the turbulent case, the protostar rotates rapidly at more than 0.4 times the Keplerian velocity owing to the angular momentum provided by the initial turbulence. The protostar approximates an oblate spheroid, and its equatorial radius is more than twice the polar radius. Our results suggest that we need to consider the rapid stellar rotation to elucidate the realistic 3D protostellar evolution in the supermassive star formation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12100v1",
        "http://arxiv.org/pdf/2303.12100v2"
    ],
    "publication_venue": "9 pages, 5 figures, submitted to ApJ"
}