{
    "arxiv_id": "2303.14119",
    "paper_title": "An alternative simulation approach for surface flashover in vacuum using a 1D2V continuum and kinetic model",
    "authors": [
        "Guang-Yu Sun",
        "Ru-Hui Lian",
        "Shu Zhang",
        "Xiong Yang",
        "Muhammad Farasat Abbas",
        "Chao Wang",
        "Bao-Hong Guo",
        "Bai-Peng Song",
        "Guan-Jun Zhang"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-04-27"
    ],
    "latest_version": 2,
    "categories": [
        "physics.plasm-ph"
    ],
    "abstract": "Surface flashover across insulator in vacuum is a destructive plasma discharge which undermines the behaviors of a range of applications in electrical engineering, particle physics, space engineering, etc. This phenomenon is widely modeled by the particle-in-cell (PIC) simulation, here the continuum and kinetic simulation method is first proposed and implemented as an alternative solution for flashover modeling, aiming for the prevention of the unfavorable particle noises in PIC models. The 1D2V (one dimension in space, two dimensions in velocity) kinetic simulation model is constructed. Modeling setup, physical assumptions, and simulation algorithm are presented in detail, and a comparison with the well-known secondary electron emission avalanche (SEEA) analytical expression and existing PIC simulation is made. Obtained kinetic simulation results are consistent with the analytical prediction, and feature noise-free data of surface charge density as well as particle fluxes of primary and secondary electrons. Discrepancies between the two simulation models and analytical predictions are explained. The code is convenient for updating to include additional physical processes, and possible implementations of outgassing and extra plasma species for final breakdown stage are discussed. The proposed continuum and kinetic approach is expected to inspire future flashover modeling studies for the understanding and mitigation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14119v1",
        "http://arxiv.org/pdf/2303.14119v2"
    ],
    "publication_venue": null
}