{
    "arxiv_id": "2303.10891",
    "paper_title": "Non-Exemplar Online Class-incremental Continual Learning via Dual-prototype Self-augment and Refinement",
    "authors": [
        "Fushuo Huo",
        "Wenchao Xu",
        "Jingcai Guo",
        "Haozhao Wang",
        "Yunfeng Fan",
        "Song Guo"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-08-24"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV"
    ],
    "abstract": "This paper investigates a new, practical, but challenging problem named Non-exemplar Online Class-incremental continual Learning (NO-CL), which aims to preserve the discernibility of base classes without buffering data examples and efficiently learn novel classes continuously in a single-pass (i.e., online) data stream. The challenges of this task are mainly two-fold: (1) Both base and novel classes suffer from severe catastrophic forgetting as no previous samples are available for replay. (2) As the online data can only be observed once, there is no way to fully re-train the whole model, e.g., re-calibrate the decision boundaries via prototype alignment or feature distillation. In this paper, we propose a novel Dual-prototype Self-augment and Refinement method (DSR) for NO-CL problem, which consists of two strategies: 1) Dual class prototypes: vanilla and high-dimensional prototypes are exploited to utilize the pre-trained information and obtain robust quasi-orthogonal representations rather than example buffers for both privacy preservation and memory reduction. 2) Self-augment and refinement: Instead of updating the whole network, we optimize high-dimensional prototypes alternatively with the extra projection module based on self-augment vanilla prototypes, through a bi-level optimization problem. Extensive experiments demonstrate the effectiveness and superiority of the proposed DSR in NO-CL.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10891v1",
        "http://arxiv.org/pdf/2303.10891v2"
    ],
    "publication_venue": null
}