{
    "arxiv_id": "2303.16305",
    "paper_title": "Non-planar corrections in orbifold/orientifold $\\mathcal N=2$ superconformal theories from localization",
    "authors": [
        "M. Beccaria",
        "G. P. Korchemsky",
        "A. A. Tseytlin"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "hep-th"
    ],
    "abstract": "We study non-planar corrections in two special $\\mathcal N=2$ superconformal $SU(N)$ gauge theories that are planar-equivalent to $\\mathcal N=4$ SYM theory: two-nodes quiver model with equal couplings and $\\mathcal N=2$ vector multiplet coupled to two hypermultiplets in rank-2 symmetric and antisymmetric representations. We focus on two observables in these theories that admit representation in terms of localization matrix model: free energy on 4-sphere and the expectation value of half-BPS circular Wilson loop. We extend the methods developed in arXiv:2207.11475 to derive a systematical expansion of non-planar corrections to these observables at strong 't Hooft coupling constant $位$. We show that the leading non planar corrections are given by a power series in $位^{3/2}/N^2$ with rational coefficients. Sending $N$ and the coupling constant $位$ to infinity with $位^{3/2}/N^2$ kept fixed corresponds to the familiar double scaling limit in matrix models. We find that in this limit the observables in the two models are related in a remarkably simple way: the free energies differ by the factor of $2$, whereas the Wilson loop expectation values coincide. Surprisingly, these relations hold only at strong coupling, they are not valid in the weak coupling regime. We also discuss a dual string theory interpretation of the leading corrections to the free energy in the double scaling limit suggesting their relation to curvature corrections in type IIB string effective action.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16305v1"
    ],
    "publication_venue": "54 pages"
}