{
    "arxiv_id": "2303.10483",
    "paper_title": "Encounter-based reaction-subdiffusion model I: surface adsorption and the local time propagator",
    "authors": [
        "Paul C Bressloff"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.stat-mech"
    ],
    "abstract": "In this paper, we develop an encounter-based model of partial surface adsorption for fractional diffusion in a bounded domain. We take the probability of adsorption to depend on the amount of particle-surface contact time, as specified by a Brownian functional known as the boundary local time $\\ell(t)$. If the rate of adsorption is state dependent, then the adsorption process is non-Markovian, reflecting the fact that surface activation/deactivation proceeds progressively by repeated particle encounters. The generalized adsorption event is identified as the first time that the local time crosses a randomly generated threshold. Different models of adsorption (Markovian and non-Markovian) then correspond to different choices for the random threshold probability density $ψ(\\ell)$. The marginal probability density for particle position $\\X(t)$ prior to absorption depends on $ψ$ and the joint probability density for the pair $(\\X(t),\\ell(t))$, also known as the local time propagator. In the case of normal diffusion one can use a Feynman-Kac formula to derive an evolution equation for the propagator. Here we derive the local time propagator equation for fractional diffusion by taking a continuum limit of a heavy-tailed continuous-time random walk (CTRW). We use our encounter-based model to investigate the effects of subdiffusion and non-Markovian adsorption on the long-time behavior of the first passage time (FPT) density in a finite interval $[0,L]$ with a reflecting boundary at $x=L$. In particular, we determine how the choice of function $ψ$ affects the large-$t$ power law decay of the FPT density. Finally, we indicate how to extend the model to higher spatial dimensions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10483v1"
    ],
    "publication_venue": "21 pages 5 figures"
}