{
    "arxiv_id": "2303.13875",
    "paper_title": "Designing wavelength sampling for Fabry-Pérot observations. Information-based spectral sampling",
    "authors": [
        "C. J. Díaz Baso",
        "L. Rouppe van der Voort",
        "J. de la Cruz Rodríguez",
        "J. Leenaarts"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
    ],
    "abstract": "Fabry-Pérot interferometers (FPIs) have become very popular in solar observations because they offer a balance between cadence, spatial resolution, and spectral resolution through a careful design of the spectral sampling scheme according to the observational requirements of a given target. However, an efficient balance requires knowledge of the expected target conditions, the properties of the chosen spectral line, and the instrumental characteristics. Our aim is to find a method that allows finding the optimal spectral sampling of FPI observations in a given spectral region. In this study, we propose a technique based on a sequential selection approach where a neural network is used to predict the spectrum (or physical quantities, if the model is known) from the information at a few points. Only those points that contain relevant information and improve the model prediction are included in the sampling scheme. The method adapts the separation of the points according to the spectral resolution of the instrument, the typical broadening of the spectral shape, and the typical Doppler velocities. The experiments using the CaII 8542 A line show that the resulting wavelength scheme naturally places more points in the core than in the wings, consistent with the sensitivity of the spectral line at each wavelength interval. The method can also be used as an accurate interpolator, to improve the inference of the magnetic field when using the weak-field approximation. Overall, this method offers an objective approach for designing new instrumentation or observing proposals with customized configurations for specific targets. This is particularly relevant when studying highly dynamic events in the solar atmosphere with a cadence that preserves spectral coherence without sacrificing much information.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13875v1"
    ],
    "publication_venue": "8 pages, 7 figures, accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202346230"
}