{
    "arxiv_id": "2303.07892",
    "paper_title": "SILOP: An Automated Framework for Semantic Segmentation Using Image Labels Based on Object Perimeters",
    "authors": [
        "Erik Ostrowski",
        "Bharath Srinivas Prabakaran",
        "Muhammad Shafique"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-04-25"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Achieving high-quality semantic segmentation predictions using only image-level labels enables a new level of real-world applicability. Although state-of-the-art networks deliver reliable predictions, the amount of handcrafted pixel-wise annotations to enable these results are not feasible in many real-world applications. Hence, several works have already targeted this bottleneck, using classifier-based networks like Class Activation Maps~\\cite{CAM} (CAMs) as a base. Addressing CAM's weaknesses of fuzzy borders and incomplete predictions, state-of-the-art approaches rely only on adding regulations to the classifier loss or using pixel-similarity-based refinement after the fact. We propose a framework that introduces an additional module using object perimeters for improved saliency. We define object perimeter information as the line separating the object and background. Our new PerimeterFit module will be applied to pre-refine the CAM predictions before using the pixel-similarity-based network. In this way, our PerimeterFit increases the quality of the CAM prediction while simultaneously improving the false negative rate. We investigated a wide range of state-of-the-art unsupervised semantic segmentation networks and edge detection techniques to create useful perimeter maps, which enable our framework to predict object locations with sharper perimeters. We achieved up to 1.5% improvement over frameworks without our PerimeterFit module. We conduct an exhaustive analysis to illustrate that SILOP enhances existing state-of-the-art frameworks for image-level-based semantic segmentation. The framework is open-source and accessible online at https://github.com/ErikOstrowski/SILOP.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07892v1",
        "http://arxiv.org/pdf/2303.07892v2"
    ],
    "publication_venue": "Accepted for Publication at the Joint Conference on Neural Networks (IJCNN), July 2023, Gold Coast, Queensland, Australia"
}