{
    "arxiv_id": "2303.12876",
    "paper_title": "A Survey on Task Allocation and Scheduling in Robotic Network Systems",
    "authors": [
        "Saeid Alirezazadeh",
        "Luís A. Alexandre"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2024-11-08"
    ],
    "latest_version": 2,
    "categories": [
        "cs.RO",
        "cs.NI"
    ],
    "abstract": "Cloud Robotics is helping to create a new generation of robots that leverage the nearly unlimited resources of large data centers (i.e., the cloud), overcoming the limitations imposed by on-board resources. Different processing power, capabilities, resource sizes, energy consumption, and so forth, make scheduling and task allocation critical components. The basic idea of task allocation and scheduling is to optimize performance by minimizing completion time, energy consumption, delays between two consecutive tasks, along with others, and maximizing resource utilization, number of completed tasks in a given time interval, and suchlike. In the past, several works have addressed various aspects of task allocation and scheduling. In this paper, we provide a comprehensive overview of task allocation and scheduling strategies and related metrics suitable for robotic network cloud systems. We discuss the issues related to allocation and scheduling methods and the limitations that need to be overcome. The literature review is organized according to three different viewpoints: Architectures and Applications, Methods and Parameters. In addition, the limitations of each method are highlighted for future research.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12876v1",
        "http://arxiv.org/pdf/2303.12876v2"
    ],
    "publication_venue": "in IEEE Internet of Things Journal. IEEE Copyright. No third party (other than authors and employers) may post IEEE-copyrighted material without obtaining the necessary licenses or permissions from the IEEE Intellectual Property Rights Office or other authorized representatives of the IEEE",
    "doi": "10.1109/JIOT.2024.3491944"
}