{
    "arxiv_id": "2303.08768",
    "paper_title": "Molecular Identifification, Antioxidant Effifficacy of Phenolic Compounds, and Antimicrobial Activity of Beta-Carotene Isolated from Fruiting Bodies of Suillus sp",
    "authors": [
        "Shimal Yonuis Abdulhadi",
        "Raghad Nawaf Gergees",
        "Ghazwan Qasim Hasan"
    ],
    "submission_date": "2023-03-12",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.OT",
        "physics.bio-ph"
    ],
    "abstract": "Suillus species, in general, are edible mushrooms, and environmentally important that are associated mostly with pine trees in the tropics regions. These fungi considered a remarkable source of phenolic compounds that play a crucial role as antioxidants which may reduce the risk of most human chronic diseases such as cancer, diabetes, asthma, atherosclerosis, Alzheimer, and others. On the other hand, carotenoids (\\b{eta} carotene) are the most popular natural pigments which play an important role to protect the plants from photo-oxidative reactions. In human, these compounds prevent oxidative stress and expects to have antimicrobial activity. Here, the phenolic compounds were extracted with Ethyl acetate from fruiting bodies of Suillus sp and analyzed by HPLC, the antioxidant activity (reducing power%) of phenolic compounds was determined at the concentrations of 1, 2.5, and 5 mg/mL. Antimicrobial activity of \\b{eta} carotene pigment was measured at a concentration of 100 mg/mL against some human pathogenic bacteria such as Escherichia coli, Pseudomonas aeruginosa, Klebsiella pneumonia, and Staphylococcus aureus. The specific DNA region ITS was amplified and sequenced using ITS1 and ITS4 primers with some bioinformatics analyses. The phenolic extract isolated from fruiting bodies of Suillus sp showed a remarkable antioxidant activity by increasing the reducing power percent (from F+3 ions to F+2 ions) comparing with the industrial antioxidant (Propyl gallate) at all used concentrations. Percent of reducing power of phenolic compounds were 75.5, 84.9 and 95.7% at concentrations of 1, 2.5, and 5 mg/mL respectively; comparing with PG were 65.9, 81.3, and 93.3 at 1, 2.5, and 5 mg/mL respectively. The \\b{eta} carotene pigment revealed a significant antimicrobial activity at a concentration of 100 mg/mL against K. pneumonia, E. coli, and S. aureus.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08768v1"
    ],
    "publication_venue": "10 pages, 7 figures, 3 tables",
    "doi": "10.33640/2405-609X.1966"
}