{
    "arxiv_id": "2303.16483",
    "paper_title": "Low-energy quadrupole collectivity of Sn nuclei in self-consistent calculations with semi-realistic interaction",
    "authors": [
        "Y. Omura",
        "H. Nakada",
        "K. Abe",
        "M. Takahashi"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "nucl-th"
    ],
    "abstract": "Quadrupole collectivity of the lowest-lying states, focusing on $E_x(2^+_1)$ and $B(E2;0^+_1\\to 2^+_1)$, have been investigated for the $N=50-82$ Sn nuclei by applying the self-consistent approaches with the semi-realistic interaction M3Y-P6. Both $E_x(2^+_1)$ and $B(E2;0^+_1\\to 2^+_1)$ are well reproduced by the spherical Hartree-Fock-Bogolyubov (HFB) plus quasiparticle random-phase approximation (QRPA) calculations in $N\\geq 64$, without adjustable parameters. The measured $B(E2)$ values in the neutron-deficient Sn nuclei cast a puzzle. In $54\\leq N\\leq 62$, the spherical HFB\\,+\\,QRPA calculations give too strong $B(E2)$, opposite to the shell-model predictions within the one major shell. Via the constrained-HFB (CHFB) calculations, it is found that the neutron-deficient Sn nuclei are soft against the quadrupole deformation, accounting for the limited applicability of the HFB\\,+\\,QRPA approach. In particular, the potential energy curves (PECs) are almost flat in the range of $|q_0|\\lesssim 200\\,\\mathrm{fm}^2$ in $^{106-110}$Sn. We confirm that the near degeneracy of $n0g_{7/2}$ and $n1d_{5/2}$ triggers weak quadrupole deformation and its balance with the pairing makes PECs flat, which is qualitatively consistent with a recent shell model result in an extended model space, by the calculations shifting the single-particle energy spacing and the pairing strength. These conclusions are supported by the proton-to-neutron ratios of the transition matrix elements and the reference values of $B(E2)$ with the angular-momentum projection on top of the CHFB solutions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16483v1"
    ],
    "publication_venue": null
}