{
    "arxiv_id": "2303.12189",
    "paper_title": "Functional significance of lamellar architecture in marine sponge fibers: conditions for when splitting a cylindrical tube into an assembly of tubes will decrease its bending stiffness",
    "authors": [
        "Sayaka Kochiyama",
        "Benjamin Grossman-Ponemon",
        "Haneesh Kesari"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "physics.bio-ph"
    ],
    "abstract": "Numerous ingenious engineering designs and devices have been the product of bio-inspiration. Bone, nacre, and other such stiff structural biological materials (SSBMs) are composites that contain mineral and organic materials interlaid together in layers. In nacre, this lamellar architecture is known to contribute to its fracture toughness, and has been investigated with the goal of discovering new engineering material design principles that can aid the development of synthetic composites that are both strong and tough. The skeletal anchor fibers (spicules) of $\\textit{Euplectella aspergillum}$ ($\\textit{Ea.}$) also display a lamellar architecture; however, it was recently shown using fracture mechanics experiments and computations that the lamellar structure in them does not significantly contribute to their fracture toughness. An alternate hypothesis$-$load carrying capacity (LCC) hypothesis$-$regarding the lamellar architecture's functional significance in $\\textit{Ea.}$ spicules is that it enhances the spicule's strength, rather than its toughness. From the ecology perspective the LCC hypothesis is certainly plausible, since a higher strength would allow the spicules to more firmly anchor $\\textit{Ea.}$ to the sea floor, which would be beneficial to it since it is a filter feeding animal. In this paper we present support for the LCC hypothesis from the solid and structural mechanics perspective, which, compared to the support from ecology, is far harder to identify but equally, if not more, compelling and valid. We found that when the spicule functions in a knotted configuration a reduced bending stiffness benefits its load carrying capacity, and that for a wide class of materials that are consistent with the spicules' axial symmetry, sectioning a cylindrical tube into an assembly of co-axial tubes can reduce the tube's bending stiffness.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12189v1"
    ],
    "publication_venue": null
}