{
    "arxiv_id": "2303.17717",
    "paper_title": "Pedestrian Behavior Interacting with Autonomous Vehicles during Unmarked Midblock Multilane Crossings: Role of Infrastructure Design, AV Operations and Signaling",
    "authors": [
        "Fengjiao Zou",
        "Jennifer Ogle",
        "Weimin Jin",
        "Patrick Gerard",
        "Daniel Petty",
        "Andrew Robb"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "cs.RO"
    ],
    "abstract": "One of the main challenges autonomous vehicles (AVs) will face is interacting with pedestrians, especially at unmarked midblock locations where the right-of-way is unspecified. This study investigates pedestrian crossing behavior given different roadway centerline features (i.e., undivided, two-way left-turn lane (TWLTL), and median) and various AV operational schemes portrayed to pedestrians through on-vehicle signals (i.e., no signal, yellow negotiating indication, and yellow/blue negotiating/no-yield indications). This study employs virtual reality to simulate an urban unmarked midblock environment where pedestrians interact with AVs. Results demonstrate that both roadway centerline design features and AV operations and signaling significantly impact pedestrian unmarked midblock crossing behavior, including the waiting time at the curb, waiting time in the middle of the road, and the total crossing time. But only the roadway centerline features significantly impact the walking time. Participants in the undivided scene spent a longer time waiting at the curb and walking on the road than in the median and TWLTL scenes, but they spent a shorter time waiting in the middle. Compared to the AV without a signal, the design of yellow signal significantly reduced pedestrian waiting time at the curb and in the middle. But yellow/blue significantly increased the pedestrian waiting time. Interaction effects between roadway centerline design features and AV operations and signaling are significant only for waiting time in the middle. For middle waiting time, yellow/blue signals had the most impact on the median road type and the least on the undivided road. Demographics, past behaviors, and walking exposure are also explored. Older individuals tend to wait longer, and pedestrian past crossing behaviors and past walking exposures do not significantly impact pedestrian walking behavior.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17717v1"
    ],
    "publication_venue": null
}