{
    "arxiv_id": "2303.16821",
    "paper_title": "Decision Making for Autonomous Driving in Interactive Merge Scenarios via Learning-based Prediction",
    "authors": [
        "Salar Arbabi",
        "Davide Tavernini",
        "Saber Fallah",
        "Richard Bowden"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "cs.RO",
        "cs.AI",
        "cs.LG"
    ],
    "abstract": "Autonomous agents that drive on roads shared with human drivers must reason about the nuanced interactions among traffic participants. This poses a highly challenging decision making problem since human behavior is influenced by a multitude of factors (e.g., human intentions and emotions) that are hard to model. This paper presents a decision making approach for autonomous driving, focusing on the complex task of merging into moving traffic where uncertainty emanates from the behavior of other drivers and imperfect sensor measurements. We frame the problem as a partially observable Markov decision process (POMDP) and solve it online with Monte Carlo tree search. The solution to the POMDP is a policy that performs high-level driving maneuvers, such as giving way to an approaching car, keeping a safe distance from the vehicle in front or merging into traffic. Our method leverages a model learned from data to predict the future states of traffic while explicitly accounting for interactions among the surrounding agents. From these predictions, the autonomous vehicle can anticipate the future consequences of its actions on the environment and optimize its trajectory accordingly. We thoroughly test our approach in simulation, showing that the autonomous vehicle can adapt its behavior to different situations. We also compare against other methods, demonstrating an improvement with respect to the considered performance metrics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16821v1"
    ],
    "publication_venue": "12 pages, 12 figures"
}