{
    "arxiv_id": "2303.09798",
    "paper_title": "Light-curve Modelling for The Initial Rising Phase of Rapidly-evolving Transients Powered by Continuous Outflow",
    "authors": [
        "Kohki Uno",
        "Keiichi Maeda"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
    ],
    "abstract": "A wind-driven model is a new framework to model observational properties of transients that are powered by continuous outflow from a central system. While it has been applied to Fast Blue Optical Transients (FBOTs), the applicability has been limited to post-peak behaviours due to the steady-state assumptions; non-steady-state physics, e.g., expanding outflow, is important to model the initial rising phase. In this paper, we construct a time-dependent wind-driven model, which can take into account the expanding outflow and the time evolution of the outflow rate. We apply the model to a sample of well-observed FBOTs. FBOTs require high outflow rates ($\\sim 30$ M$_{\\odot}$ yr$^{-1}$) and fast velocity ($\\sim 0.2-0.3c$), with the typical ejecta mass and energy budget of $\\sim 0.2$ M$_{\\odot}$ and $\\sim 10^{52}$ erg, respectively. The energetic outflow supports the idea that the central engine of FBOTs may be related to a relativistic object, e.g., a black hole. The initial photospheric temperature is $10^{5-6}$ K, which suggests that FBOTs will show UV or X-ray flash similar to supernova shock breakouts. We discuss future prospects of surveys and follow-up observations of FBOTs in the UV bands. FBOTs are brighter in the UV bands than in the optical bands, and the timescale is a bit longer than in optical wavelengths. We suggest that UV telescopes with a wide field of view can play a key role in discovering FBOTs and characterizing their natures.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09798v1"
    ],
    "publication_venue": "7 pages, 6 Figures, and 1 Table. Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad840"
}