{
    "arxiv_id": "2303.10291",
    "paper_title": "Detection of Uncertainty in Exceedance of Threshold (DUET): An Adversarial Patch Localizer",
    "authors": [
        "Terence Jie Chua",
        "Wenhan Yu",
        "Jun Zhao"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV",
        "cs.AI"
    ],
    "abstract": "Development of defenses against physical world attacks such as adversarial patches is gaining traction within the research community. We contribute to the field of adversarial patch detection by introducing an uncertainty-based adversarial patch localizer which localizes adversarial patch on an image, permitting post-processing patch-avoidance or patch-reconstruction. We quantify our prediction uncertainties with the development of \\textit{\\textbf{D}etection of \\textbf{U}ncertainties in the \\textbf{E}xceedance of \\textbf{T}hreshold} (DUET) algorithm. This algorithm provides a framework to ascertain confidence in the adversarial patch localization, which is essential for safety-sensitive applications such as self-driving cars and medical imaging. We conducted experiments on localizing adversarial patches and found our proposed DUET model outperforms baseline models. We then conduct further analyses on our choice of model priors and the adoption of Bayesian Neural Networks in different layers within our model architecture. We found that isometric gaussian priors in Bayesian Neural Networks are suitable for patch localization tasks and the presence of Bayesian layers in the earlier neural network blocks facilitates top-end localization performance, while Bayesian layers added in the later neural network blocks contribute to better model generalization. We then propose two different well-performing models to tackle different use cases.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10291v1"
    ],
    "publication_venue": "This paper has won the Best Paper Award in IEEE/ACM International Conference on Big Data Computing, Applications and Technologies (BDCAT) 2022"
}