{
    "arxiv_id": "2303.08860",
    "paper_title": "The Nature of LoBAL QSOs: II. HST/WFC3 Observations Reveal Host Galaxies Dominated by Mergers",
    "authors": [
        "Mariana S. Lazarova",
        "Gabriela Canalizo",
        "Mark Lacy",
        "Wyatt Behn",
        "Kaitlyn Raub",
        "Vardha N. Bennert",
        "Duncan Farrah"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Low-ionization Broad Absorption Line QSOs (LoBALs) are suspected to be merging systems in which extreme, AGN-driven outflows have been triggered. Whether or not LoBALs are uniquely associated with mergers, however, has yet to be established. To characterize the morphologies of LoBALs, we present the first high-resolution morphological analysis of a volume-limited sample of 22 SDSS-selected LoBALs at 0.5 < z < 0.6 from Hubble Space Telescope Wide Field Camera 3 observations. Host galaxies are resolved in 86% of the systems in F125W, which is sensitive to old stellar populations, while only 18% are detected in F475W, which traces young, unobscured stellar populations. Signs of recent or ongoing tidal interaction are present in 45-64% of the hosts, including double nuclei, tidal tails, bridges, plumes, shells, and extended debris. Ongoing interaction with a companion is apparent in 27-41% of the LoBALs, with as much as 1/3 of the sample representing late-stage mergers at projected nuclear separations <10 kpc. Detailed surface brightness modeling indicates that 41% of the hosts are bulge-dominated while only 18% are disks. We discuss trends in various properties as a function of merger stage and parametric morphology. Notably, mergers are associated with slower, dustier winds than those seen in undisturbed/unresolved hosts. Our results favor an evolutionary scenario in which quasar-level accretion during various merger stages is associated with the observed outflows in low-z LoBALs. We discuss differences between LoBALs and FeLoBALs and show that selection via the traditional Balnicity index would have excluded all but one of the mergers.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08860v1"
    ],
    "publication_venue": "69 pages, 30 figures, Accepted to The Astrophysical Journal"
}