{
    "arxiv_id": "2303.14340",
    "paper_title": "The Shapes of Stellar Spectra",
    "authors": [
        "Carlos Allende Prieto"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Stellar atmospheres separate the hot and dense stellar interiors from the emptiness of space. Radiation escapes from the outermost layers of a star, carrying direct physical information. Underneath the atmosphere, the very high opacity keeps radiation thermalized and resembling a black body with the local temperature. In the atmosphere the opacity drops, and radiative energy leaks out, which is redistributed in wavelength according to the physical processes by which matter and radiation interact, in particular photoionization. In this article, I will evaluate the role of photoionization in shaping the stellar energy distribution of stars. To that end, I employ simple, state-of-the-art plane-parallel model atmospheres and a spectral synthesis code, dissecting the effects of photoionization from different chemical elements and species, for stars of different masses in the range of 0.3 to 2 M$_{\\odot}$. I examine and interpret the changes in the observed spectral energy distributions of the stars as a function of the atmospheric parameters. The photoionization of atomic hydrogen and H$^-$ are the most relevant contributors to the continuum opacity in the optical and near-infrared regions, while heavier elements become important in the ultraviolet region. In the spectra of the coolest stars (spectral types M and later), the continuum shape from photoionization is no longer recognizable due to the accumulation of lines, mainly from molecules. These facts have been known for a long time, but the calculations presented provide an updated quantitative evaluation and insight into the role of photoionization on the structure of stellar atmospheres.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14340v1"
    ],
    "publication_venue": "Accepted and published by Atoms. Part of the special issue on Photoionization of Atoms, edited by S. Nahar and G. Hinojosa"
}