{
    "arxiv_id": "2303.09986",
    "paper_title": "Towards AI-controlled FES-restoration of movements: Learning cycling stimulation pattern with reinforcement learning",
    "authors": [
        "Nat Wannawas",
        "A. Aldo Faisal"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 2,
    "categories": [
        "cs.RO",
        "cs.LG",
        "eess.SY"
    ],
    "abstract": "Functional electrical stimulation (FES) has been increasingly integrated with other rehabilitation devices, including robots. FES cycling is one of the common FES applications in rehabilitation, which is performed by stimulating leg muscles in a certain pattern. The appropriate pattern varies across individuals and requires manual tuning which can be time-consuming and challenging for the individual user. Here, we present an AI-based method for finding the patterns, which requires no extra hardware or sensors. Our method has two phases, starting with finding model-based patterns using reinforcement learning and detailed musculoskeletal models. The models, built using open-source software, can be customised through our automated script and can be therefore used by non-technical individuals without extra cost. Next, our method fine-tunes the pattern using real cycling data. We test our both in simulation and experimentally on a stationary tricycle. In the simulation test, our method can robustly deliver model-based patterns for different cycling configurations. The experimental evaluation shows that our method can find a model-based pattern that induces higher cycling speed than an EMG-based pattern. By using just 100 seconds of cycling data, our method can deliver a fine-tuned pattern that gives better cycling performance. Beyond FES cycling, this work is a showcase, displaying the feasibility and potential of human-in-the-loop AI in real-world rehabilitation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09986v1",
        "http://arxiv.org/pdf/2303.09986v2"
    ],
    "publication_venue": null
}