{
    "arxiv_id": "2303.14003",
    "paper_title": "Transthoracic super-resolution ultrasound localization microscopy of myocardial vasculature in patients",
    "authors": [
        "Jipeng Yan",
        "Biao Huang",
        "Johanna Tonko",
        "Matthieu Toulemonde",
        "Joseph Hansen-Shearer",
        "Qingyuan Tan",
        "Kai Riemer",
        "Konstantinos Ntagiantas",
        "Rasheda A Chowdhury",
        "Pier Lambiase",
        "Roxy Senior",
        "Meng-Xing Tang"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "eess.IV",
        "eess.SP"
    ],
    "abstract": "Micro-vascular flow in the myocardium is of significant importance clinically but remains poorly understood. Up to 25% of patients with symptoms of coronary heart diseases have no obstructive coronary arteries and have suspected microvascular diseases. However, such microvasculature is difficult to image in vivo with existing modalities due to the lack of resolution and sensitivity. Here, we demonstrate the feasibility of transthoracic super-resolution ultrasound localisation microscopy (SRUS/ULM) of myocardial microvasculature and hemodynamics in a large animal model and in patients, using a cardiac phased array probe with a customised data acquisition and processing pipeline. A multi-level motion correction strategy was proposed. A tracking framework incorporating multiple features and automatic parameter initialisations was developed to reconstruct microcirculation. In two patients with impaired myocardial function, we have generated SRUS images of myocardial vascular structure and flow with a resolution that is beyond the wave-diffraction limit (half a wavelength), using data acquired within a breath hold. Myocardial SRUS/ULM has potential to improve the understanding of myocardial microcirculation and the management of patients with cardiac microvascular diseases.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14003v1"
    ],
    "publication_venue": "22 pages, 10 figures"
}