{
    "arxiv_id": "2303.12648",
    "paper_title": "Physical Models for Solar Cycle Predictions",
    "authors": [
        "Prantika Bhowmik",
        "Jie Jiang",
        "Lisa Upton",
        "Alexandre Lemerle",
        "Dibyendu Nandy"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-07-26"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "The dynamic activity of stars such as the Sun influences (exo)planetary space environments through modulation of stellar radiation, plasma wind, particle and magnetic fluxes. Energetic stellar phenomena such as flares and coronal mass ejections act as transient perturbations giving rise to hazardous space weather. Magnetic fields -- the primary driver of stellar activity -- are created via a magnetohydrodynamic dynamo mechanism within stellar convection zones. The dynamo mechanism in our host star -- the Sun -- is manifest in the cyclic appearance of magnetized sunspots on the solar surface. While sunspots have been directly observed for over four centuries, and theories of the origin of solar-stellar magnetism have been explored for over half a century, the inability to converge on the exact mechanism(s) governing cycle to cycle fluctuations and inconsistent predictions for the strength of future sunspot cycles have been challenges for models of solar cycle forecasts. This review discusses observational constraints on the solar magnetic cycle with a focus on those relevant for cycle forecasting, elucidates recent physical insights which aid in understanding solar cycle variability, and presents advances in solar cycle predictions achieved via data-driven, physics-based models. The most successful prediction approaches support the Babcock-Leighton solar dynamo mechanism as the primary driver of solar cycle variability and reinforces the flux transport paradigm as a useful tool for modelling solar-stellar magnetism.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12648v1"
    ],
    "publication_venue": "50 pages, 7 figures, submitted to Space Science Reviews",
    "doi": "10.1007/s11214-023-00983-x"
}