{
    "arxiv_id": "2303.08448",
    "paper_title": "A Cross-institutional Evaluation on Breast Cancer Phenotyping NLP Algorithms on Electronic Health Records",
    "authors": [
        "Sicheng Zhou",
        "Nan Wang",
        "Liwei Wang",
        "Ju Sun",
        "Anne Blaes",
        "Hongfang Liu",
        "Rui Zhang"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CL",
        "cs.IR",
        "cs.LG"
    ],
    "abstract": "Objective: The generalizability of clinical large language models is usually ignored during the model development process. This study evaluated the generalizability of BERT-based clinical NLP models across different clinical settings through a breast cancer phenotype extraction task.\n  Materials and Methods: Two clinical corpora of breast cancer patients were collected from the electronic health records from the University of Minnesota and the Mayo Clinic, and annotated following the same guideline. We developed three types of NLP models (i.e., conditional random field, bi-directional long short-term memory and CancerBERT) to extract cancer phenotypes from clinical texts. The models were evaluated for their generalizability on different test sets with different learning strategies (model transfer vs. locally trained). The entity coverage score was assessed with their association with the model performances.\n  Results: We manually annotated 200 and 161 clinical documents at UMN and MC, respectively. The corpora of the two institutes were found to have higher similarity between the target entities than the overall corpora. The CancerBERT models obtained the best performances among the independent test sets from two clinical institutes and the permutation test set. The CancerBERT model developed in one institute and further fine-tuned in another institute achieved reasonable performance compared to the model developed on local data (micro-F1: 0.925 vs 0.932).\n  Conclusions: The results indicate the CancerBERT model has the best learning ability and generalizability among the three types of clinical NLP models. The generalizability of the models was found to be correlated with the similarity of the target entities between the corpora.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08448v1"
    ],
    "publication_venue": "16 pages, 3 figures"
}