{
    "arxiv_id": "2303.15481",
    "paper_title": "Effect of restrained versus free drying on hygro-expansion of hardwood and softwood fibers and paper handsheet",
    "authors": [
        "N. H. Vonk",
        "R. H. J. Peerlings",
        "M. G. D. Geers",
        "J. P. M. Hoefnagels"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Earlier works in literature on the hygro-expansion of paper state that the larger hygro-expansivity of freely compared to restrained dried handsheets is due to structural differences between the fibers inside the handsheet. To unravel this hypothesis, first, the hygro-expansion of freely and restrained dried, hardwood and softwood handsheets has been characterized. Subsequently, the transient full-field hygro-expansion (longitudinal, transverse, and shear strain) of fibers extracted from these handsheets was measured using global digital height correlation, from which the micro-fibril angle was deduced. The hygro-expansivity of each individual fiber was tested before and after a wetting period, during which the fiber's moisture content is maximized, to analyze if a restrained dried fiber can \"transform\" into a freely dried fiber. It was found that the longitudinal hygro-expansion of the freely dried fibers is significantly larger than the restrained dried fibers, consistent with the sheet-scale differences. The difference in micro-fibril angle between the freely and restrained dried fibers is a possible explanation for this difference, but merely for the hardwood fibers, which are able to \"transform\" to freely dried fibers after being soaked in water. In contrast, this \"transformation\" does not happen in softwood fibers, even after full immersion in water for a day. Various mechanisms have been studied to explain the observations on freely and restrained dried hardwood and softwood, fiber and handsheets including analysis of the fibers' lumen and cross-sectional shape. The presented results and discussion deepens the understanding of the differences between freely and restrained dried handsheets.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15481v1"
    ],
    "publication_venue": "43 pages, 15 figures, 2 tables"
}