{
    "arxiv_id": "2303.11393",
    "paper_title": "Short-lived radioisotope enrichment in star-forming regions from stellar winds and supernovae",
    "authors": [
        "Richard J. Parker",
        "Tim Lichtenberg",
        "Miti Patel",
        "Cheyenne K. M. Polius",
        "Matthew Ridsdill-Smith"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "The abundance of the short-lived radioisotopes 26-Al and 60-Fe in the early Solar system is usually explained by the Sun either forming from pre-enriched material, or the Sun's protosolar disc being polluted by a nearby supernova explosion from a massive star. Both hypotheses suffer from significant drawbacks: the former does not account for the dynamical evolution of star-forming regions, while in the latter the time for massive stars to explode as supernovae can be similar to, or even longer than, the lifetime of protoplanetary discs. In this paper, we extend the disc enrichment scenario to include the contribution of 26-Al from the winds of massive stars before they explode as supernovae. We use N-body simulations and a post-processing analysis to calculate the amount of enrichment in each disc, and we vary the stellar density of the star-forming regions. We find that stellar winds contribute to disc enrichment to such an extent that the Solar system's 26-Al/60-Fe ratio is reproduced in up to 50 per cent of discs in dense (rho = 1000Msun pc^-3) star-forming regions. When winds are a significant contributor to the SLR enrichment, we find that Solar system levels of enrichment can occur much earlier (before 2.5 Myr) than when enrichment occurs from supernovae, which start to explode at later ages (>4 Myr). We find that Solar system levels of enrichment all but disappear in low-density star-forming regions (rho < 10Msun pc^-3), implying that the Solar system must have formed in a dense, populous star-forming region if 26-Al and 60-Fe were delivered directly to the protosolar disc from massive-star winds and supernovae.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11393v1"
    ],
    "publication_venue": "16 pages, 10 figures, 1 appendix with 3 further figures, accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad871"
}