{
    "arxiv_id": "2303.16962",
    "paper_title": "Gravitational Wave Eigenfrequencies from Neutrino-Driven Core-Collapse Supernovae",
    "authors": [
        "Noah E. Wolfe",
        "Carla Frohlich",
        "Jonah M. Miller",
        "Alejandro Torres-Forne",
        "Pablo Cerda-Duran"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "gr-qc"
    ],
    "abstract": "Core-collapse supernovae are predicted to produce gravitational waves (GWs) that may be detectable by Advanced LIGO/Virgo. These GW signals carry information from the heart of these catacylsmic events, where matter reaches nuclear densities. Recent studies have shown that it may be possible to infer properties of the proto-neutron star (PNS) via gravitational waves generated by hydrodynamic perturbations of the PNS. However, we lack a comprehensive understanding of how these relationships may change with the properties of core-collapse supernovae. In this work, we build a self-consistent suite of over 1000 exploding core-collapse supernovae from a grid of progenitor masses and metallicities combined with six different nuclear equations of state. Performing a linear perturbation analysis on each model, we compute the resonant gravitational-wave frequencies of the PNS, and we motivate a time-agnostic method for identifying characteristic frequencies of the dominant gravitational-wave emission. From this, we identify two characteristic frequencies, of the early- and late-time signal, that measure the surface gravity of the cold remnant neutron star, and simultaneously constrain the hot nuclear equation of state. However, we find that the details of the core-collapse supernova model, such as the treatment of gravity or the neutrino transport, and whether it explodes, noticeably change the magnitude and evolution of the PNS eigenfrequencies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16962v1"
    ],
    "publication_venue": "27 pages, 11 figures, submitted to ApJ"
}