{
    "arxiv_id": "2303.17364",
    "paper_title": "A search technique to observe precessing compact binary mergers in the advanced detector era",
    "authors": [
        "Connor McIsaac",
        "Charlie Hoy",
        "Ian Harry"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc",
        "astro-ph.HE",
        "astro-ph.IM"
    ],
    "abstract": "Gravitational-wave signals from compact binary coalescences are most efficiently identified through matched filter searches, which match the data against a pre-generated bank of gravitational-wave templates. Although different techniques for performing the matched filter, as well as generating the template bank, exist, currently all modelled gravitational-wave searches use templates that restrict the component spins to be aligned (or anti-aligned) with the orbital angular momentum. This means that current searches are less sensitive to gravitational-wave signals generated from binaries with generic spins (precessing), suggesting that, potentially, a significant fraction of signals may remain undetected. In this work we introduce a matched filter search that is sensitive to signals generated from precessing binaries and can realistically be used during a gravitational-wave observing run. We take advantage of the fact that a gravitational-wave signal from a precessing binary can be decomposed into a power series of five harmonics, to show that a generic-spin template bank, which is only $\\sim 3\\times$ larger than existing aligned-spin banks, is needed to increase our sensitive volume by $\\sim 100\\%$ for neutron star black hole binaries with total mass larger than $17.5\\, M_{\\odot}$ and in-plane spins $>0.67$. In fact, our generic spin search performs as well as existing aligned-spin searches for neutron star black hole signals with insignificant in-plane spins, but improves sensitivity by $\\sim60\\%$ on average across the full generic spin parameter space. We anticipate that this improved technique will identify significantly more gravitational-wave signals, and, ultimately, help shed light on the unknown spin distribution of binaries in the universe.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17364v1"
    ],
    "publication_venue": "23 pages, 12 figures. For data release, see https://icg-gravwaves.github.io/precessing_search_paper/"
}