{
    "arxiv_id": "2303.12590",
    "paper_title": "Unveiling the chemical fingerprint of phosphorus-rich stars I. In the infrared region of APOGEE-2",
    "authors": [
        "Maren Brauner",
        "Thomas Masseron",
        "D. A. García-Hernández",
        "Marco Pignatari",
        "Kate A. Womack",
        "Maria Lugaro",
        "Christian R. Hayes"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "The origin of phosphorus, one of the essential elements for life on Earth, is currently unknown. Prevalent models of Galactic chemical evolution (GCE) underestimate the amount of P compared to observations. The recently discovered P-rich ([P/Fe] > 1 dex) and metal-poor giants further challenge current theories on stellar nucleosynthesis. Since the observed stars are low-mass giants, our primary goal is to find clues on their progenitor. By increasing the number of known P-rich stars, we aim to narrow down a reliable chemical abundance pattern and to place robust constraints on the responsible nucleosynthetic mechanism. In the long term, identifying the progenitor of the P-rich stars may contribute to the search for the source of P in our Galaxy. We performed a detailed chemical abundance analysis based on the H-band spectra from APOGEE-2 (DR17). Employing the BACCHUS code, we measured the abundances of 13 elements in the sample, which is mainly composed of a recent collection of Si-enhanced giants. We also analyzed the orbital motions and compared the abundance results to possible nucleosynthetic formation scenarios, as well as to detailed GCE models. We enlarged the sample of confirmed P-rich stars from 16 to 78 giants, representing the largest sample of P-rich stars to date. Significant enhancements in O, Al, Si and Ce, as well as systematic correlations among the elements, unveil the chemical fingerprint of the P-rich stars. The high Mg and C+N found in some of the P-rich stars with respect to P-normal stars is not confirmed over the full sample. Strikingly, the strong over-abundance in the $α$-element Si is accompanied by normal Ca and S abundances. Our analysis of the orbital motion showed that the P-rich stars do not belong to a specific sub-population. In addition, we confirm that the majority of the sample stars are not part of binary systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12590v1"
    ],
    "publication_venue": "29 pages, 18 figures, 8 tables, accepted for publication in Astronomy & Astrophysics"
}