{
    "arxiv_id": "2303.14581",
    "paper_title": "Shapley-based Explainable AI for Clustering Applications in Fault Diagnosis and Prognosis",
    "authors": [
        "Joseph Cohen",
        "Xun Huan",
        "Jun Ni"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2025-02-04"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "eess.SP",
        "eess.SY"
    ],
    "abstract": "Data-driven artificial intelligence models require explainability in intelligent manufacturing to streamline adoption and trust in modern industry. However, recently developed explainable artificial intelligence (XAI) techniques that estimate feature contributions on a model-agnostic level such as SHapley Additive exPlanations (SHAP) have not yet been evaluated for semi-supervised fault diagnosis and prognosis problems characterized by class imbalance and weakly labeled datasets. This paper explores the potential of utilizing Shapley values for a new clustering framework compatible with semi-supervised learning problems, loosening the strict supervision requirement of current XAI techniques. This broad methodology is validated on two case studies: a heatmap image dataset obtained from a semiconductor manufacturing process featuring class imbalance, and a benchmark dataset utilized in the 2021 Prognostics and Health Management (PHM) Data Challenge. Semi-supervised clustering based on Shapley values significantly improves upon clustering quality compared to the fully unsupervised case, deriving information-dense and meaningful clusters that relate to underlying fault diagnosis model predictions. These clusters can also be characterized by high-precision decision rules in terms of original feature values, as demonstrated in the second case study. The rules, limited to 1-2 terms utilizing original feature scales, describe 12 out of the 16 derived equipment failure clusters with precision exceeding 0.85, showcasing the promising utility of the explainable clustering framework for intelligent manufacturing applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14581v1"
    ],
    "publication_venue": "23 pages with 8 figures",
    "doi": "10.1007/s10845-024-02468-2"
}