{
    "arxiv_id": "2303.08858",
    "paper_title": "A Framework for the Automated Parameterization of a Sensorless Bearing Fault Detection Pipeline",
    "authors": [
        "Tobias Wagner",
        "Alexander Gepperth",
        "Elmar Engels"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SP"
    ],
    "abstract": "This study proposes a framework for the automated hyperparameter optimization of a bearing fault detection pipeline for permanent magnet synchronous motors (PMSMs) without the need of external sensors. A automated machine learning (AutoML) pipeline search is performed by means of a genetic optimization to reduce human induced bias due to inappropriate parameterizations. For this purpose, a search space is defined, which includes general methods of signal processing and manipulation as well as methods tailored to the respective task and domain. The proposed framework is evaluated on the bearing fault detection use case under real world conditions. Considerations on the generalization of the deployed fault detection pipelines are also taken into account. Likewise, attention was paid to experimental studies for evaluations of the robustness of the fault detection pipeline to variations of the motors working condition parameters between the training and test domain. The present work contributes to the research of fault detection on rotating machinery in the following terms: (1) Reduction of the human induced bias to the data science process, while still considering expert and task related knowledge, ending in a generic search approach (2) tackling the bearing fault detection task without the need for external sensors (sensorless) (3) learning a domain robust fault detection pipeline applicable to varying motor operating parameters without the need of re-parameterizations or fine-tuning (4) investigations on working condition discrepancies with an excessive degree to determine the pipeline limitations regarding the abstraction of the motor parameters and the pipeline hyperparameters",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08858v1"
    ],
    "publication_venue": "8 pages, 4 figures, 5 tables, ieee conference paper template used",
    "doi": "10.22105/jarie.2023.391005.1538"
}