{
    "arxiv_id": "2303.08143",
    "paper_title": "Imaging Cold Nuclear Matter with Energy Correlators",
    "authors": [
        "Kyle Devereaux",
        "Wenqing Fan",
        "Weiyao Ke",
        "Kyle Lee",
        "Ian Moult"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph",
        "hep-ex",
        "nucl-ex",
        "nucl-th"
    ],
    "abstract": "The future electron-ion collider (EIC) will produce the first-ever high energy collisions between electrons and a wide range of nuclei, opening a new era in the study of cold nuclear matter. Quarks and gluons produced in these collisions will propagate through the dense nuclear matter of nuclei, imprinting its structure into subtle correlations in the energy flux of final state hadrons. In this Letter, we apply recent developments from the field of jet substructure, namely the energy correlator observables, to decode these correlations and provide a new window into nuclear structure. The energy correlators provide a calibrated probe of the scale dependence of vacuum QCD dynamics, enabling medium modifications to be cleanly imaged and interpreted as a function of scale. Using the eHIJING parton shower to simulate electron-nucleus collisions, we demonstrate that the size of the nucleus is cleanly imprinted as an angular scale in the correlators, with a magnitude that is visible for realistic EIC kinematics. Remarkably, we can even observe the size difference between the proposed EIC nuclear targets ${}^3$He, ${}^4$He, ${}^{12}$C, ${}^{40}$Ca, ${}^{64}$Cu, ${}^{197}$Au, and ${}^{238}$U, showing that the energy correlators can image femtometer length scales using asymptotic energy flux. Our approach offers a unified view of jet substructure across collider experiments, and provides numerous new theoretical tools to unravel the complex dynamics of QCD in extreme environments, both hot and cold.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08143v1"
    ],
    "publication_venue": "6 pages, 5 beautiful figures, and appendices"
}