{
    "arxiv_id": "2303.16937",
    "paper_title": "Don't believe the hype(r): The Yellow Supergiants of Westerlund 1",
    "authors": [
        "Emma R. Beasor",
        "Nathan Smith",
        "Jennifer E. Andrews"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-08-02"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "Yellow hypergiants (YHGs) are often presumed to represent a transitional post-red supergiant (RSG) phase for stars $\\sim$30-40 \\msun. Here we present visual-wavelength echelle spectra of six YHG candidates in the Galactic cluster Westerlund 1, and we compare them to known YHGs, IRC +10420 and Hen3-1979. We find that the six YHG candidates do not exhibit any metallic emission lines, nor do they show strong H$α$ emission, and as such do not meet the criteria necessary to be classified as YHGs. In conjunction with their moderate luminosities of \\logl = 4.7-5.4 estimated from optical/infrared photometry, we suggest instead that they are normal yellow supergiants (YSGs) with more modest initial masses around 15-20 \\msun. This adds additional support to the hypothesis that Wd1 is a multi-age cluster with an older age than previously assumed, and is not a $\\sim$5 Myr old cluster caught at a very specific transitional point when single-star evolution might yield Wolf-Rayet stars, luminous blue variables (LBVs), RSGs, and YHGs in the same cluster. Nevertheless, the population of YSGs in Wd1 is very unusual, with YSGs outnumbering RSGs, but with both spanning a large luminosity range. Here, we discuss evolutionary scenarios that might have led to the high fraction of YSGs. The number of YSGs and their significant luminosity spread cannot be explained by simple population synthesis models with single or binary stars. Even with multiple ages or a large age spread, the high YSG/RSG ratio remains problematic. We suggest instead that the objects may experience a prolonged YSG phase due to evolution in triple systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16937v1"
    ],
    "publication_venue": "Accepted to ApJ",
    "doi": "10.3847/1538-4357/acdd6d"
}