{
    "arxiv_id": "2303.12918",
    "paper_title": "Inner Energy Relaxation and Growth of Nano-Size Particles",
    "authors": [
        "Mitchell Bredice",
        "Michael G. Rozman",
        "Jonathan Smucker",
        "Eric Farmer",
        "Robin Côté",
        "Vasili Kharchenko"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2024-07-30"
    ],
    "latest_version": 1,
    "categories": [
        "physics.atm-clus"
    ],
    "abstract": "In this study, molecular dynamics simulations were conducted to investigate the relaxation of the internal energy in nano-sized particles and its impact on the nucleation of atomic clusters. Quantum-mechanical potentials were utilized to analyze the growth and collision relaxation of the internal energy of Ar$_n$H$^+$ clusters in a metastable Ar gas. The results revealed that small nano-clusters are formed in highly excited rotational-vibrational states, and the relaxation of internal energy and growth of these nascent clusters are concurrent processes with a strong mutual influence. Under non-equilibrium growth conditions, the relaxation of internal energy can delay the cluster growth process. The rates of cluster growth and internal energy relaxation were found to be influenced by energy-transfer collisions between cluster particles and free Ar atoms of the bath gas. Furthermore, the non-equilibrium growth and internal energy relaxation of small nano-clusters were found to depend on the structure of the cluster's atomic shells. An ensemble of molecular dynamics simulations were conducted to investigate the growth, time-evolution of kinetic and total energies of Ar$_n$H$^+$ clusters with specified $n \\leq 11$, and the results were explained by collisional relaxation processes described by the Boltzmann equation. Finally, the general relationship between the rates of internal energy relaxation and non-equilibrium growth of nano-particles is discussed.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12918v1"
    ],
    "publication_venue": "16 pages, 15 figures",
    "doi": "10.1103/PhysRevA.108.032812"
}