{
    "arxiv_id": "2303.15480",
    "paper_title": "Transient hygro- and hydro-expansion of freely and restrained dried paper: the fiber-network coupling",
    "authors": [
        "N. H. Vonk",
        "W. P. C. van Spreuwel",
        "T. Anijs",
        "R. H. J. Peerlings",
        "M. G. D. Geers",
        "J. P. M. Hoefnagels"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "The transient dimensional changes during \\textit{hygro}-expansion and \\textit{hydro}-expansion of freely and restrained dried, softwood and hardwood sheets and fibers is monitored, to unravel the governing micro-mechanisms occurring during gradual water saturation. The response of individual fibers is measured using a full-field global digital height correlation method, which has been extended to monitor the transient \\textit{hydro}-expansion of fibers from dry to fully saturated. The \\textit{hygro}- and \\textit{hydro}-expansion is larger for freely versus restrained dried and softwood versus hardwood handsheets. The transient sheet-scale \\textit{hydro}-expansion reveals a sudden strain and moisture content step. It is postulated that the driving mechanism is the moisture-induced softening of the so-called \"dislocated regions\" in the fiber's cellulose micro-fibrils, unlocking further fiber swelling. The strain step is negligible for restrained dried handsheets, which is attributed to the \"dislocated cellulose regions\" being locked in their stretched configuration during restrained drying, which is supported by the single fiber \\textit{hydro}-expansion measurements. Finally, an inter-fiber bond model is exploited and adapted to predict the sheet-scale \\textit{hygro}-expansion from the fiber level characteristics. The model correctly predicts the qualitative differences between freely versus restrained dried and softwood versus hardwood handsheets, yet, its simplified geometry does not allow for more quantitative predictions of the sheet-scale \\textit{hydro}-expansion.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15480v1"
    ],
    "publication_venue": "37 pages; 12 figures; 5 tables"
}