{
    "arxiv_id": "2303.16647",
    "paper_title": "Real-Time Tracking of Coherent Oscillations of Electrons in a Nanodevice by Photo-assisted Tunnelling",
    "authors": [
        "Yang Luo",
        "Frank Neubrech",
        "Alberto Martin-Jimenez",
        "Na Liu",
        "Klaus Kern",
        "Manish Garg"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics",
        "quant-ph"
    ],
    "abstract": "Coherent collective oscillations of electrons excited in metallic nanostructures (localized surface plasmons) can confine incident light to atomic scales and enable strong light-matter interactions, which depend nonlinearly on the local field. Direct sampling of such collective electron oscillations in real-time is crucial to performing petahertz scale optical modulation, control, and readout in a quantum nanodevice. Here, we demonstrate real-time tracking of collective electron oscillations in an Au bowtie nanoantenna, by recording photo-assisted tunnelling currents generated by such oscillations in this quantum nanodevice. The collective electron oscillations show a noninstantaneous response to the driving laser fields with a decay time of nearly 10 femtoseconds. The temporal evolution of nonlinear electron oscillations resulting from the coherent nonlinear optical response of the nanodevice were also traced in real-time. The contributions of linear and nonlinear electron oscillations in the generated tunnelling currents in the nanodevice were precisely determined. A coherent control of electron oscillations in the nanodevice is illustrated directly in the time domain. Functioning in ambient conditions, the excitation, coherent control, and read-out of coherent electron oscillations pave the way toward on-chip light-wave electronics in quantum nanodevices.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16647v1"
    ],
    "publication_venue": null
}