{
    "arxiv_id": "2303.12207",
    "paper_title": "Hydrodynamical Evolution of Black-Hole Binaries Embedded in AGN Discs: III. The Effects of Viscosity",
    "authors": [
        "Rixin Li",
        "Dong Lai"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "Stellar-mass binary black holes (BBHs) embedded in active galactic nucleus (AGN) discs offer a distinct dynamical channel to produce black hole mergers detected in gravitational waves by LIGO/Virgo. To understand their orbital evolution through interactions with the disc gas, we perform a suite of 2D high-resolution, local shearing box, viscous hydrodynamical simulations of equal-mass binaries. We find that viscosity not only smooths the flow structure around prograde circular binaries, but also greatly raises their accretion rates. The overwhelming positive torque associated with the accretion dominates over the gravitational torque, and drives binary orbital expansion. However, retrograde binaries still experience rapid orbital decay, and prograde eccentric binaries still experience eccentricity damping, despite undergoing outspiral. Our numerical experiments further show that prograde binaries may experience inspiral if the physical sizes of the accretors are sufficiently small, such that the net binary accretion is reduced. Such a dependence of the binary accretion rate on the accretor size can be weaken through boosted accretion either due to a high viscosity or a more isothermal-like equation of state (EOS). Our results widen the explored parameter space for the hydrodynamics of embedded BBHs and demonstrate that their orbital evolution in AGN discs is a complex, multifaceted problem.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12207v1"
    ],
    "publication_venue": "10 pages, 6 figures, submitted to MNRAS. arXiv admin note: text overlap with arXiv:2207.01125"
}