{
    "arxiv_id": "2303.09094",
    "paper_title": "The measurement of bovine pericardium density and its implications on leaflet stress distribution in bioprosthetic heart valves",
    "authors": [
        "Masod Sadipour",
        "Ali N. Azadani"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2024-01-23"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.TO"
    ],
    "abstract": "Purpose: Bioprosthetic Heart Valves (BHVs) are currently in widespread use with promising outcomes. Computational modeling provides a framework for quantitatively describing BHVs in the preclinical phase. To obtain reliable solutions in computational modeling, it is essential to consider accurate leaflet properties such as mechanical properties and density. Bovine pericardium (BP) is widely used as BHV leaflets. Previous computational studies assume BP density to be close to the density of water or blood. However, BP leaflets undergo multiple treatments such as fixation and anti-calcification. The present study aims to measure the density of the BP used in BHVs and determine its effect on leaflet stress distribution.\n  Methods: We determined the density of eight square BP samples laser cut from Edwards BP patches. The weight of specimens was measured using an A&D Analytical Balance, and volume was measured by high-resolution imaging. Finite element models of a BHV similar to PERIMOUNT Magna were developed in ABAQUS.\n  Results: The average density value of the BP samples was 1410 kg/m3. In the acceleration phase of a cardiac cycle, the maximum stress value reached 1.89 MPa for a density value of 1410 kg/m3 , and 2.47 MPa for a density of 1000 kg/m3(30.7% difference). In the deceleration, the maximum stress value reached 713 and 669 kPa, respectively.\n  Conclusion: Stress distribution and deformation of BHV leaflets are dependent upon the magnitude of density. Ascertaining an accurate value for the density of BHV leaflets is essential for computational models.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09094v1"
    ],
    "publication_venue": "13 pages, 7 figures",
    "doi": "10.1007/s13239-023-00692-0"
}