{
    "arxiv_id": "2303.13039",
    "paper_title": "High-fidelity interconversion between Greenberger-Horne-Zeilinger and $W$ states through Floquet-Lindblad engineering in Rydberg atom arrays",
    "authors": [
        "X. Q. Shao",
        "F. Liu",
        "X. W. Xue",
        "W. L. Mu",
        "Weibin Li"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Greenberger-Horne-Zeilinger and $W$ states feature genuine tripartite entanglement that cannot be converted into each other by local operations and classical communication. Here, we present a dissipative protocol for deterministic interconversion between the Greenberger-Horne-Zeilinger and the $W$ states of three neutral $^{87}$Rb atoms arranged in an equilateral triangle of a two-dimensional array. With three atomic levels and diagonal van der Waals interactions of Rydberg atoms, the interconversion between tripartite entangled states can be efficiently accomplished in the Floquet-Lindblad framework through the periodic optical pump and dissipation engineering. We evaluate the feasibility of the existing methodology using the experimental parameters accessible to current neutral-atom platforms. We find that our scheme is robust against typical noises, such as laser phase noise and geometric imperfection of the atom array. In addition, our scheme can integrate the Gaussian soft quantum control technique, which further reduces the overall conversion time and increases the resilience to timing errors and interatomic distance fluctuations. The high-fidelity and robust tripartite entanglement interconversion protocol provides a route to save physical resources and enhance the computational efficiency of quantum networks formed by neutral-atom arrays.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13039v1"
    ],
    "publication_venue": "16 pages, 13 figures, and comments are welcome"
}