{
    "arxiv_id": "2303.17476",
    "paper_title": "Differentiable Environment Primitives for Contact State Estimation",
    "authors": [
        "Kevin Haninger",
        "Kangwagye Samuel",
        "Filippo Rozzi",
        "Sehoon Oh",
        "Loris Roveda"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 2,
    "categories": [
        "cs.RO"
    ],
    "abstract": "In contact-rich manipulation, the robot dynamics are coupled with an environment that has application-specific dynamic properties (stiffness, inertia) and geometry (contact normal). Knowledge of these environmental parameters can improve control and monitoring, but they are often unobserved and may vary, either online or between task instances. Observers, such as the extended Kalman filter, can be used to estimate these parameters, but such model-based techniques can require too much engineering work to scale up to complex environments, such as multi-point contact.\n  To accelerate environment modeling, we propose environment primitives: parameterized environment dynamics that can be connected in parallel and are expressed in an automatic differentiation framework. This simplifies offline gradient-based optimization to fit model parameters and linearization of the coupled dynamics for an observer. This method is implemented for stiffness contact models, allowing the fitting of contact geometry and stiffness offline or their online estimation by an extended Kalman filter. This method is applied to a collaborative robot, estimating external force, contact stiffness, and contact geometry from the motor position and current. The estimates of external force and stiffness are compared with a momentum observer and direct force measurements.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17476v1",
        "http://arxiv.org/pdf/2303.17476v2"
    ],
    "publication_venue": "Submitted ICRA23 Code available at https://github.com/khaninger/full-state-estimator"
}