{
    "arxiv_id": "2303.10651",
    "paper_title": "Topology, Analysis, and Modulation Strategy of a Fully Controlled Modular Battery Pack with Interconnected Output Ports",
    "authors": [
        "Nima Tashakor",
        "Jan Kacetl",
        "Davood Keshavarzi",
        "Stefan Goetz"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY"
    ],
    "abstract": "Modular battery integrated converters or so called dynamically reconfigurable battery packs are expanding into emerging applications, including electromobility and grid storage. Although they offer many degrees of freedom, the state of the art focuses on single output systems and mostly neglects potential of such systems in generating multiple controlled outputs. This paper investigates the use of the extra degrees of freedom that a reconfigurable battery offers to generate multiple outputs for the adjustable supply of various independent loads. The technology offers the potential for functional integration, exploiting already existing transistors, and for a reduction of separate dedicated power conversion stages. Interleaved output ports, where some modules are shared among different outputs, can further reduce the necessary power electronics and cost. However, using conventional modulation techniques in particular phase-shifted carrier modulation can be challenging with shared modules among multiple ports, and different control objectives can adversely impact the overall performance. Therefore, this paper proposes a strategy to decouple the control of multiple ports to enable further simplification of required power electronics. The proposed system does not require any additional active switches for the isolated port and can operate with a wide range of output voltages. Simulation and experiments verify the developed analysis.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10651v1"
    ],
    "publication_venue": null
}