{
    "arxiv_id": "2303.10775",
    "paper_title": "Noninvasive in vivo photoacoustic measurement of internal jugular venous oxygenation in humans",
    "authors": [
        "Alejandro Garcia-Uribe",
        "Todd N. Erpelding",
        "Haixin Ke",
        "Kavya Narayana Reddy",
        "Anshuman Sharma",
        "Lihong V. Wang"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.med-ph"
    ],
    "abstract": "In many clinical conditions, such as head trauma, stroke, and low cardiac output states, the brain is at risk for hypoxic-ischemic injury. The metabolic rate and oxygen consumption of the brain are reflected in internal jugular venous oxygen saturation (sijvO2). The current gold standard for monitoring brain oxygenation is invasive; it requires jugular vein catheterization under fluoroscopic guidance and therefore is rarely used. Photoacoustic (PA) measurement, on the other hand, can estimate the oxygen consumption of the brain non-invasively in real time. Such a convenient method can potentially aid earlier detection and prevention of impending hypoxic brain injury. A dual-wavelength photoacoustic tomography (PAT) and ultrasound imaging (US) system was used to image the internal jugular vein (IJV) and estimate the sijvO2 in seven healthy volunteers. The system captured simultaneous co-registered PAT and US images at a rate of five frames per second. For each volunteer, the internal jugular vein was identified under ultrasound guidance, then, additional PA images from two optical wavelengths were collected and used to estimate the oxygen saturation of the internal jugular vein. For each volunteer, the oxygen saturation was calculated from transverse and longitudinal views of the internal jugular vein. The average sijvO2 was 72 +/- 7 %. The preliminary results are encouraging and agree with those reported in the literature. Photoacoustic images were successfully used to calculate the blood hemoglobin oxygen saturation in the internal jugular vein. These results raise confidence that this emerging technology can be used clinically for accurate, noninvasive estimation of sijvO2. In addition, the fast co-registration with US images makes the technique suitable for studying the temporal variations of oxygen saturation in response to physiologic challenges in clinical settings.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10775v1"
    ],
    "publication_venue": null
}