{
    "arxiv_id": "2303.13469",
    "paper_title": "JWST MIRI flight performance: The Medium-Resolution Spectrometer",
    "authors": [
        "Ioannis Argyriou",
        "Alistair Glasse",
        "David R. Law",
        "Alvaro Labiano",
        "Javier Álvarez-Márquez",
        "Polychronis Patapis",
        "Patrick J. Kavanagh",
        "Danny Gasman",
        "Michael Mueller",
        "Kirsten Larson",
        "Bart Vandenbussche",
        "Adrian M. Glauser",
        "Pierre Royer",
        "Daniel Dicken",
        "Jake Harkett",
        "Beth A. Sargent",
        "Michael Engesser",
        "Olivia C. Jones",
        "Sarah Kendrew",
        "Alberto Noriega-Crespo",
        "Bernhard Brandl",
        "George H. Rieke",
        "Gillian S. Wright",
        "David Lee",
        "Martyn Wells"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM"
    ],
    "abstract": "The Medium-Resolution Spectrometer (MRS) provides one of the four operating modes of the Mid-Infrared Instrument (MIRI) on board the James Webb Space Telescope (JWST). The MRS is an integral field spectrometer, measuring the spatial and spectral distributions of light across the 5-28 $μm$ wavelength range with a spectral resolving power between 3700-1300. We present the MRS' optical, spectral, and spectro-photometric performance, as achieved in flight, and report on the effects that limit the instrument's ultimate sensitivity. The MRS flight performance has been quantified using observations of stars, planetary nebulae, and planets in our Solar System. The precision and accuracy of this calibration is checked against celestial calibrators with well known flux levels and spectral features. We find that the MRS geometric calibration has a distortion solution accuracy relative to the commanded position of 8 mas at 5 $μm$ and 23 mas at 28 $μm$. The wavelength calibration is accurate to within 9 km/sec at 5 $μm$ and 27 km/sec at 28 $μm$. The uncertainty in the absolute spectro-photometric calibration accuracy is estimated at 5.6 +- 0.7 %. The MIRI calibration pipeline is able to suppress the amplitude of spectral fringes to below 1.5 % for both extended and point sources across the entire wavelength range. The MRS PSF is 60 % broader than the diffraction limit along its long axis at 5 $μm$ and is 15 % broader at 28 $μm$. The MRS flight performance is found to be better than pre-launch expectations. The MRS is one of the most subscribed observing modes of JWST and is yielding many high-profile publications. It is currently humanity's most powerful instrument for measuring the mid-infrared spectra of celestial sources and is expected to continue as such for many years to come.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13469v1"
    ],
    "publication_venue": "15 pages, 21 figures"
}