{
    "arxiv_id": "2303.10783",
    "paper_title": "Benchmark modeling and 3D applications of solidification and macro-segregation based on an operator-splitting and fully decoupled scheme with term-wise matrix assembly",
    "authors": [
        "Xiaoyu Feng",
        "Huangxin Chen",
        "Bo Yu",
        "Shuyu Sun"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "The solidification and macro-segregation problem involving unsteady multi-physics and multi-phase fields is typically a complex process with mass, momentum, heat, and species transfers among solid, mushy, and liquid phase regions. The quantitative prediction of phase change, chemical heterogeneities, and multi-phase and multi-component flows plays critical roles in many natural scenarios and industrial applications that involve many disciplines, like material, energy, and even planet science. In view of this, some scholars and research institutions have called for more contributors to join the benchmark analysis of solidification and segregation problems. Our work proposes an operator-splitting and matrix-based method to avoid non-linear systems. Also, the combination of vectorization and forward equation-based matrix assembly techniques enhances the implementability of extensions of 3D applications. Lastly, the novel scheme is well validated through a bunch of 2D and 3D benchmark cases. The numerical results also illustrate that this method can ensure accurate prediction and adequately capture the physical details of phenomena caused by the solutally and thermally driven flow, which include channel segregation, the formation of freckles, edge effect, aspect ratio effect, and 3D effect.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10783v1"
    ],
    "publication_venue": "keyword: Solidification, Macro-segregation, Multi-phase, Operator-splitting, matrix-based, matrix assembly techniques, Benchmark modeling"
}