{
    "arxiv_id": "2303.10066",
    "paper_title": "Line positions and intensities of the $ν_1$ band of $^{12}$CH$_3$I using mid-infrared optical frequency comb Fourier transform spectroscopy",
    "authors": [
        "Adrian Hjältén",
        "Aleksandra Foltynowicz",
        "Ibrahim Sadiek"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-06-22"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph"
    ],
    "abstract": "We present a new spectral analysis of the $ν_1$ and $ν_3$+$ν_1$-$ν_3$ bands of $^{12}$CH$_3$I around 2971 cm$^{-1}$ based on a high-resolution spectrum spanning from 2800 cm$^{-1}$ to 3160 cm$^{-1}$, measured using an optical frequency comb Fourier transform spectrometer. From this spectrum, we previously assigned the $ν_4$ and $ν_3$+$ν_4$-$ν_3$ bands around 3060 cm$^{-1}$ using PGOPHER, and the line list was incorporated in the HITRAN database. Here, we treat the two fundamental bands, $ν_1$ and $ν_4$, together with the perturbing states, 2$ν_2$+$ν_3$ and $ν_2$+2$ν_6$$^{\\pm2}$, as a four-level system connected via Coriolis and Fermi interactions. A similar four-level system is assumed to connect the $ν_3$+$ν_1$-$ν_3$ and $ν_3$+$ν_4$-$ν_3$ hot bands, which appear due to the population of the low-lying $ν_3$ state at room temperature, with the 2$ν_2$+2$ν_3$ and $ν_2$+$ν_3$-$ν_6$$^{\\pm2}$ perturbing states. This treatment provides a good global agreement of the simulated spectra with experiment, and hence accurate line lists and band parameters of the four connected vibrational states in each system. Overall, we assign 4665 transitions in the fundamental band system, with an average error of 0.00071 cm$^{-1}$, a factor of two better than earlier work on the $ν_1$ band using conventional Fourier transform infrared spectroscopy. The $ν_1$ band shows hyperfine splitting, resolvable for transitions with J $\\le$ 2 x K. Finally, the spectral intensities of 65 lines of the $ν_1$ band and 7 lines of the $ν_3$+$ν_1$-$ν_3$ band are reported for the first time using the Voigt line shape as a model in multispectral fitting.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10066v1"
    ],
    "publication_venue": null,
    "doi": "10.1016/j.jqsrt.2023.108646"
}