{
    "arxiv_id": "2303.13048",
    "paper_title": "Quantum Dot Source-Drain Transport Response at Microwave Frequencies",
    "authors": [
        "Harald Havir",
        "Subhomoy Haldar",
        "Waqar Khan",
        "Sebastian Lehmann",
        "Kimberly A. Dick",
        "Claes Thelander",
        "Peter Samuelsson",
        "Ville F. Maisi"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2024-01-12"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "quant-ph"
    ],
    "abstract": "Quantum dots are frequently used as charge sensitive devices in low temperature experiments to probe electric charge in mesoscopic conductors where the current running through the quantum dot is modulated by the nearby charge environment. Recent experiments have been operating these detectors using reflectometry measurements up to GHz frequencies rather than probing the low frequency current through the dot. In this work, we use an on-chip coplanar waveguide resonator to measure the source-drain transport response of two quantum dots at a frequency of 6 GHz, further increasing the bandwidth limit for charge detection. Similar to the low frequency domain, the response is here predominantly dissipative. For large tunnel coupling, the response is still governed by the low frequency conductance, in line with Landauer-Büttiker theory. For smaller couplings, our devices showcase two regimes where the high frequency response deviates from the low frequency limit and Landauer-Büttiker theory: When the photon energy exceeds the quantum dot resonance linewidth, degeneracy dependent plateaus emerge. These are reproduced by sequential tunneling calculations. In the other case with large asymmetry in the tunnel couplings, the high frequency response is two orders of magnitude larger than the low frequency conductance G, favoring the high frequency readout.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13048v1"
    ],
    "publication_venue": "12 pages 5 figures",
    "doi": "10.1103/PhysRevB.108.205417"
}