{
    "arxiv_id": "2303.10671",
    "paper_title": "Breathing pyrochlore magnet CuGaCr$_{4}$S$_{8}$: Magnetic, thermodynamic, and dielectric properties",
    "authors": [
        "M. Gen",
        "H. Ishikawa",
        "A. Miyake",
        "T. Yajima",
        "H. O. Jeschke",
        "H. Sagayama",
        "A. Ikeda",
        "Y. H. Matsuda",
        "K. Kindo",
        "M. Tokunaga",
        "Y. Kohama",
        "T. Kurumaji",
        "Y. Tokunaga",
        "T. Arima"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "We investigate the crystallographic and magnetic properties of a chromium-based thiospinel CuGaCr$_{4}$S$_{8}$. From a synchrotron x-ray diffraction experiment and structural refinement, Cu and Ga atoms are found to occupy the tetrahedral $A$-sites in an alternate way, yielding breathing pyrochlore Cr network. CuGaCr$_{4}$S$_{8}$ undergoes a magnetic transition associated with a structural distortion at 31 K in zero magnetic field, indicating that the spin-lattice coupling is responsible for relieving the geometrical frustration. When applying a pulsed high magnetic field, a sharp metamagnetic transition takes place at 40 T, followed by a 1/2-magnetization plateau up to 103 T. These phase transitions accompany dielectric anomalies, suggesting the presence of helical spin correlations in low-field phases. The density-functional-theory calculation reveals that CuGaCr$_{4}$S$_{8}$ is dominated by antiferromagnetic and ferromagnetic exchange couplings within small and large tetrahedra, respectively, in analogy with CuInCr$_{4}$S$_{8}$. We argue that $A$-site-ordered Cr thiospinels serve as an excellent platform to explore diverse magnetic phases along with pronounced magnetoelastic and magnetodielectric responses.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10671v1"
    ],
    "publication_venue": "10 pages, 11 figures"
}