{
    "arxiv_id": "2303.07880",
    "paper_title": "Run-and-tumble motion in a linear ratchet potential: analytic solution, power extraction and first-passage properties",
    "authors": [
        "Connor Roberts",
        "Zigan Zhen"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.stat-mech",
        "math-ph",
        "math.MP",
        "physics.bio-ph"
    ],
    "abstract": "We explore the properties of a system of run-and-tumble (RnT) particles\nmoving in a piecewise-linear ``ratchet'' potential, and subject to\nnon-negligible diffusion, by deriving exact analytical results for its\nsteady-state probability density, current, entropy production rate, power\noutput, and thermodynamic efficiency. The current, and thus the extractable\npower and efficiency, have non-monotonic dependencies on the diffusion\nstrength, ratchet height, and particle self-propulsion speed, peaking at finite\nvalues in each case. In the case where the particles' self-propulsion is\ncompletely suppressed by the force from the ratchet, and thus a current can be\ngenerated only by diffusion-mediated barrier crossings, the system's entropy\nproduction rate remains finite in the limit of vanishing diffusion. In the\nfinal part of this work, we consider RnT motion in a linear ratchet potential\non a bounded interval, allowing the derivation of mean first-passage times and\nsplitting probabilities for different boundary and initial conditions. The\npresent work resides at the interface of exactly solvable models of\nrun-and-tumble motion and the study of work extraction from active matter by\nproviding exact expressions pertaining to the feasibility and future design of\nactive engines. Our results are in agreement with Monte Carlo simulations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07880v1",
        "http://arxiv.org/pdf/2303.07880v2"
    ],
    "publication_venue": "14 pages (main), 23 pages (total), 17 figures"
}