{
    "arxiv_id": "2303.16137",
    "paper_title": "XRBcats: Galactic High Mass X-ray Binary Catalogue",
    "authors": [
        "Marvin Neumann",
        "Artur Avakyan",
        "Victor Doroshenko",
        "Andrea Santangelo"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "We present a new catalogue of the high-mass X-ray binaries (HMXBs) in the Galaxy improving upon the most recent such catalogue. We include new HMXBs discovered since aforementioned publication and revise the classification for several objects previously considered HMXBs or candidates. The catalogue includes both basic information such as source names, coordinates, types, and more detailed data such as distance and X-ray luminosity estimates, binary system parameters and other characteristic properties of 169 HMXBs, together with appropriate references to the literature. Finding charts in several bands from infra-red to hard X-rays are also included for each object. The aim of this catalogue is to provide the reader a list of all currently known Galactic HMXBs with some basic information on both compact objects and non-degenerate counterpart properties (where available). We also include objects tentatively classified as HXMBs in the literature and give a brief motivation for the classifcation in each relevant case. The catalogue is compiled based on a search of known HMXBs and candidates in all commonly available databases and literature published before 31 October 2022. Relevant properties in the optical and other bands were collected for all objects either from the literature or using the data provided by large-scale surveys. In the later case, the counterparts in each individual survey were found by cross-correlating positions of identified HMXBs with relevant databases. An up-to date catalogue of Galactic HMXBs is presented to facilitate research in this area. An attempt was made to collect a larger set of relevant HMXB properties in a more uniform way compared to previously published works.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16137v1"
    ],
    "publication_venue": "10 pages, 2 figures, submitted to A&A. For auxillary files, see http://astro.uni-tuebingen.de/~xrbcat/"
}