{
    "arxiv_id": "2303.16759",
    "paper_title": "Exploring celebrity influence on public attitude towards the COVID-19 pandemic: social media shared sentiment analysis",
    "authors": [
        "Brianna M White",
        "Chad A Melton",
        "Parya Zareie",
        "Robert L Davis",
        "Robert A Bednarczyk",
        "Arash Shaban-Nejad"
    ],
    "submission_date": "2023-02-23",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CL",
        "cs.IR",
        "cs.LG",
        "cs.SI"
    ],
    "abstract": "The COVID-19 pandemic has introduced new opportunities for health communication, including an increase in the public use of online outlets for health-related emotions. People have turned to social media networks to share sentiments related to the impacts of the COVID-19 pandemic. In this paper we examine the role of social messaging shared by Persons in the Public Eye (i.e. athletes, politicians, news personnel) in determining overall public discourse direction. We harvested approximately 13 million tweets ranging from 1 January 2020 to 1 March 2022. The sentiment was calculated for each tweet using a fine-tuned DistilRoBERTa model, which was used to compare COVID-19 vaccine-related Twitter posts (tweets) that co-occurred with mentions of People in the Public Eye. Our findings suggest the presence of consistent patterns of emotional content co-occurring with messaging shared by Persons in the Public Eye for the first two years of the COVID-19 pandemic influenced public opinion and largely stimulated online public discourse. We demonstrate that as the pandemic progressed, public sentiment shared on social networks was shaped by risk perceptions, political ideologies and health-protective behaviours shared by Persons in the Public Eye, often in a negative light.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16759v1"
    ],
    "publication_venue": "7 Pages, 4 Figures",
    "doi": "10.1136/bmjhci-2022-100665"
}