{
    "arxiv_id": "2303.14518",
    "paper_title": "The Past and Future of East Asia to Italy: Nearly Global VLBI",
    "authors": [
        "Gabriele Giovannini",
        "Yuzhu Cui",
        "Kazuhiro Hada",
        "Kunwoo Yi",
        "Hyunwook Ro",
        "Bong Won Sohn",
        "Mieko Takamura",
        "Salvatore Buttaccio",
        "Filippo D'Ammando",
        "Marcello Giroletti",
        "Yoshiaki Hagiwara",
        "Motoki Kino",
        "Evgeniya Kravchenko",
        "Giuseppe Maccaferri",
        "Alexey Melnikov",
        "Kota ro Niinuma",
        "Monica Orienti",
        "Kiyoaki Wajima",
        "Kazunori Akiyama",
        "Akihiro Doi",
        "Do-Young Byun",
        "Tomoya Hirota",
        "Mareki Honma",
        "Taehyun Jung",
        "Hideyuki Kobayashi",
        "Shoko Koyama",
        "Andrea Melis",
        "Carlo Migoni",
        "Yasuhiro Murata",
        "Hiroshi Nagai",
        "Satoko Sawada-Satoh",
        "Matteo Stagni"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present here the East Asia to Italy Nearly Global VLBI (EATING VLBI) project. How this project started and the evolution of the international collaboration between Korean, Japanese, and Italian researchers to study compact sources with VLBI observations is reported. Problems related to the synchronization of the very different arrays and technical details of the telescopes involved are presented and discussed. The relatively high observation frequency (22 and 43 GHz) and the long baselines between Italy and East Asia produced high-resolution images. We present example images to demonstrate the typical performance of the EATING VLBI array. The results attracted international researchers and the collaboration is growing, now including Chinese and Russian stations. New in progress projects are discussed and future possibilities with a larger number of telescopes and a better frequency coverage are briefly discussed herein.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14518v1"
    ],
    "publication_venue": "15 pages and 6 figures. This article belongs to the Special Issue Challenges in Understanding Black Hole Powered Jets with VLBI"
}