{
    "arxiv_id": "2303.11348",
    "paper_title": "On the Reionization-Era Globular Cluster in Low-Mass Galaxy Eridanus II",
    "authors": [
        "Daniel R. Weisz",
        "Alessandro Savino",
        "Andrew E. Dolphin"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Using color-magnitude diagrams from deep archival Hubble Space Telescope imaging, we self-consistently measure the star formation history of Eridanus II (Eri II), the lowest-mass galaxy ($M_{\\star}(z=0) \\sim 10^5 M_{\\odot}$) known to host a globular cluster (GC), and the age, mass, and metallicity of its GC. The GC ($\\sim13.2\\pm0.4$ Gyr, $\\langle$[Fe/H]$\\rangle = -2.75\\pm0.2$ dex) and field (mean age $\\sim13.5\\pm0.3$ Gyr, $\\langle$[Fe/H]$\\rangle = -2.6\\pm0.15$ dex) have similar ages and metallicities. Both are reionization-era relics that formed before the peak of cosmic star and GC formation ($z\\sim2-4$). The ancient star formation properties of Eri II are not extreme and appear similar to $z=0$ dwarf galaxies. We find that the GC was $\\lesssim4$ times more massive at birth than today and was $\\sim$10% of the galaxy's stellar mass at birth. At formation, we estimate that the progenitor of Eri II and its GC had $M_{\\rm UV} \\sim -7$ to $-12$, making it one of the most common type of galaxy in the early Universe, though it is fainter than direct detection limits, absent gravitational lensing. Archaeological studies of GCs in nearby low-mass galaxies may be the only way to constrain GC formation in such low-mass systems. We discuss the strengths and limitations in comparing archaeological and high redshift studies of cluster formation, including challenges stemming from the Hubble Tension, which introduces uncertainties into the mapping between age and redshift.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11348v1"
    ],
    "publication_venue": "11 pages, 3 Figures, 1 Table. Accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc328"
}