{
    "arxiv_id": "2303.13520",
    "paper_title": "Quantifying the uneven efficiency benefits of ridesharing market integration",
    "authors": [
        "Xiaohan Wang",
        "Zhan Zhao",
        "Hongmou Zhang",
        "Xiaotong Guo",
        "Jinhua Zhao"
    ],
    "submission_date": "2023-02-05",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "physics.soc-ph",
        "cs.SI"
    ],
    "abstract": "Ridesharing is recognized as one of the key pathways to sustainable urban mobility. With the emergence of Transportation Network Companies (TNCs) such as Uber and Lyft, the ridesharing market has become increasingly fragmented in many cities around the world, leading to efficiency loss and increased traffic congestion. While an integrated ridesharing market (allowing sharing across TNCs) can improve the overall efficiency, how such benefits may vary across TNCs based on actual market characteristics is still not well understood. In this study, we extend a shareability network framework to quantify and explain the efficiency benefits of ridesharing market integration using available TNC trip records. Through a case study in Manhattan, New York City, the proposed framework is applied to analyze a real-world ridesharing market with 3 TNCs$-$Uber, Lyft, and Via. It is estimated that a perfectly integrated market in Manhattan would improve ridesharing efficiency by 13.3%, or 5% of daily TNC vehicle hours traveled. Further analysis reveals that (1) the efficiency improvement is negatively correlated with the overall demand density and inter-TNC spatiotemporal unevenness (measured by network modularity), (2) market integration would generate a larger efficiency improvement in a competitive market, and (3) the TNC with a higher intra-TNC demand concentration (measured by clustering coefficient) would benefit less from market integration. As the uneven benefits may deter TNCs from collaboration, we also illustrate how to quantify each TNC's marginal contribution based on the Shapley value, which can be used to ensure equitable profit allocation. These results can help market regulators and business alliances to evaluate and monitor market efficiency and dynamically adjust their strategies, incentives, and profit allocation schemes to promote market integration and collaboration.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13520v1"
    ],
    "publication_venue": null
}