{
    "arxiv_id": "2303.08899",
    "paper_title": "The e-MANTIS emulator: fast predictions of the non-linear matter power spectrum in $f(R)$CDM cosmology",
    "authors": [
        "Iñigo Sáez-Casares",
        "Yann Rasera",
        "Baojiu Li"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "gr-qc"
    ],
    "abstract": "In order to probe modifications of gravity at cosmological scales, one needs accurate theoretical predictions. N-body simulations are required to explore the non-linear regime of structure formation but are very time consuming. In this work, we build an emulator, dubbed e-MANTIS, that performs an accurate and fast interpolation between the predictions of a given set of cosmological simulations, in $f(R)$ modified gravity, run with ECOSMOG. We sample a wide 3D parameter space given by the current background scalar field value $10^{-7} < \\left|f_{R_0} \\right| < 10^{-4}$, matter density $0.24<Ω_\\mathrm{m}<0.39$, and primordial power spectrum normalisation $0.6<σ_8<1.0$, with 110 points sampled from a Latin Hypercube. For each model we perform pairs of $f(R)$CDM and $Λ$CDM simulations covering an effective volume of $\\left(560 \\, h^{-1}\\mathrm{Mpc}\\right)^3$ with a mass resolution of $\\sim 2 \\times 10^{10} h^{-1} M_\\odot$. We compute the matter power spectrum boost due to $f(R)$ gravity $B(k)=P_{f(R)}(k)/P_{Λ\\mathrm{CDM}}(k)$ and build an emulator using a Gaussian Process Regression method. The boost is mostly independent of $h$, $n_{s}$, and $Ω_{b}$, which reduces the dimensionality of the relevant cosmological parameter space. Additionally, it is much more robust against statistical and systematic errors than the raw power spectrum, thus strongly reducing our computational needs. The resulting emulator has a maximum error of $3\\%$ across the whole cosmological parameter space, for scales $0.03 \\ h\\mathrm{Mpc}^{-1} < k < 7 \\ h\\mathrm{Mpc}^{-1}$, and redshifts $0 < z < 2$, while in most cases the accuracy is better than $1\\%$. Such an emulator could be used to constrain $f(R)$ gravity with weak lensing analyses.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08899v1"
    ],
    "publication_venue": null
}