{
    "arxiv_id": "2303.10410",
    "paper_title": "Assessing inner boundary conditions for global coronal modeling of solar maxima",
    "authors": [
        "Michaela Brchnelova",
        "Błażej Kuźma",
        "Fan Zhang",
        "Barbara Perri",
        "Andrea Lani",
        "Stefaan Poedts"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Computational Fluid Dynamics (CFD)-based global solar coronal simulations are slowly making their way into the space weather modeling toolchains to replace the semi-empirical methods such as the Wang-Sheeley-Arge (WSA) model. However, since they are based on CFD, if the assumptions in them are too strong, these codes might experience issues with convergence and unphysical solutions. Particularly the magnetograms corresponding to solar maxima can pose problems as they contain active regions with strong magnetic fields, resulting in large gradients. Combined with the approximate way in which the inner boundary is often treated, this can lead to non-physical features or even a complete divergence of the simulation in these cases. Here, we show some of the possible approaches to handle this inner boundary in our global coronal model COolfluid COrona uNstrUcTured (COCONUT) in a way that improves both convergence and accuracy. Since we know that prescribing the photospheric magnetic field for a region that represents the lower corona is not entirely physical, first, we look at the ways in which we can adjust the input magnetograms to remove the highest magnitudes and gradients. Secondly, since in the default setup we also assume a constant density, here we experiment with changing these values locally and globally to see the effect on the results. We conclude, through comparison with observations and convergence analysis, that modifying the density locally in active regions is the best way to improve the performance both in terms of convergence and physical accuracy from the tested approaches.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10410v1"
    ],
    "publication_venue": "11 pages, 4 figures"
}