{
    "arxiv_id": "2303.10048",
    "paper_title": "DEMNUni: The imprint of massive neutrinos on the cross-correlation between cosmic voids and CMB lensing",
    "authors": [
        "Pauline Vielzeuf",
        "Matteo Calabrese",
        "Carmelita Carbone",
        "Giulio Fabbian",
        "Carlo Baccigalupi"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-08-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "Cosmic voids are a powerful probe of cosmology and are one of the core observables of upcoming galaxy surveys. The cross-correlations between voids and other large-scale structure tracers such as galaxy clustering and galaxy lensing have been shown to be very sensitive probes of cosmology and among the most promising to probe the nature of gravity and the neutrino mass. However, recent measurements of the void imprint on the lensed Cosmic Microwave Background (CMB) have been shown to be in tension with expectations based on LCDM simulations, hinting to a possibility of non-standard cosmological signatures due to massive neutrinos. In this work we use the DEMNUni cosmological simulations with massive neutrino cosmologies to study the neutrino impact on voids selected in photometric surveys, e.g. via Luminous Red Galaxies, as well as on the void- CMB lensing cross-correlation. We show how the void properties observed in this way (size function, profiles) are affected by the presence of massive neutrinos compared to the neutrino massless case, and show how these can vary as a function of the selection method of the void sample. We comment on the possibility for massive neutrinos to be the source of the aforementioned tension. Finally, we identify the most promising setup to detect signatures of massive neutrinos in the voids-CMB lensing cross-correlation and define a new quantity useful to distinguish among different neutrino masses by comparing future observations against predictions from simulations including massive neutrinos.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10048v1"
    ],
    "publication_venue": "34 pages, 15 figures",
    "doi": "10.1088/1475-7516/2023/08/010"
}