{
    "arxiv_id": "2303.15565",
    "paper_title": "Effective Field Theory of Intrinsic Alignments at One Loop Order: a Comparison to Dark Matter Simulations",
    "authors": [
        "Thomas Bakx",
        "Toshiki Kurita",
        "Nora Elisa Chisari",
        "Zvonimir Vlah",
        "Fabian Schmidt"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "We test the regime of validity of the effective field theory (EFT) of intrinsic alignments (IA) at the one-loop level by comparing with 3D halo shape statistics in N-body simulations. This model is based on the effective field theory of large-scale structure (EFT of LSS) and thus a theoretically well-motivated extension of the familiar non-linear alignment (NLA) model and the tidal-alignment-tidal-torquing (TATT) model. It contains a total of $8$ free bias parameters. Specifically, we measure the dark matter halo shape-shape multipoles $P_{EE}^{(0)}(k), P_{EE}^{(2)}(k), P_{BB}^{(0)}(k), P_{BB}^{(2)}(k)$ as well as the matter-shape multipoles $P_{δE}^{(0)}(k), P_{δE}^{(2)}(k)$ from the simulations and perform a joint fit to determine the largest wavenumber $k_{\\text{max}}$ up to which the theory predictions from the EFT of IA are consistent with the measurements. We find that the EFT of IA is able to describe intrinsic alignments of dark matter halos up to $k_\\text{max}=0.30\\,h/\\text{Mpc}$ at $z=0$. This demonstrates a clear improvement over other existing alignment models like NLA and TATT, which are only accurate up to $k_\\text{max}=0.05\\,h/\\text{Mpc}$ . We examine the posterior distributions of the higher-order bias parameters, and show that their inclusion is necessary to describe intrinsic alignments in the quasi-linear regime. Further, the EFT of IA is able to accurately describe the auto-spectrum of intrinsic alignment B-modes, in contrast to the other alignment models considered.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15565v1"
    ],
    "publication_venue": "35 pages, 2 tables, 6 figures"
}