{
    "arxiv_id": "2303.09714",
    "paper_title": "Periodic X-ray sources in the Massive Globular Cluster 47 Tucanae: Evidence for Dynamically Formed Cataclysmic Variables",
    "authors": [
        "Tong Bao",
        "Zhiyuan Li",
        "Zhongqun Cheng"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "We present a systematic study of periodic X-ray sources in the massive globular cluster 47 Tuc, utilizing deep archival Chandra observations that resolve the cluster core and recently available eROSITA observations that cover the cluster outskirt. By applying the Gregory-Loredo algorithm, we detect 20 periodic signals among 18 X-ray sources, ranging between 205-95731 second. Fourteen periods are newly discovered in the X-ray band. We classify these periodic sources into four quiescent low-mass X-ray binaries, one milli-second pulsar, two coronally-active binaries and eleven cataclysmic variables (CVs), based on their X-ray temporal and spectral properties, as well as multi-band information. Despite a small sample subject to potential selection bias against faint and non-magnetic CVs, the 11 CVs together define an orbital period distribution significantly different from that of the CVs previously found in the solar neighborhood and the Galactic bulge. In particular, there exists in 47 Tuc an apparent paucity of short-period CVs below the period gap, which might be attributed to a high occupation fraction of non-magnetic CVs. Also characteristic of the 47 Tuc CVs are an overabundance of long-period CVs with a subgiant donor, a substantial fraction of CVs within the period gap, and a steep radial surface density profile. These are best understood as a group of CVs having recently formed via dynamical interactions in the dense cluster core. Despite sufficient sensitivity of the X-ray data, only one periodic source is found between one-third of the half-light radius and the tidal radius, the nature of which is unclear.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09714v1"
    ],
    "publication_venue": "20 pages, 10 figures, Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad836"
}