{
    "arxiv_id": "2303.07880",
    "paper_title": "Run-and-tumble motion in a linear ratchet potential: analytic solution, power extraction and first-passage properties",
    "authors": [
        "Connor Roberts",
        "Zigan Zhen"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.stat-mech",
        "math-ph",
        "physics.bio-ph"
    ],
    "abstract": "We explore the properties of a system of run-and-tumble (RnT) particles moving in a piecewise-linear ``ratchet'' potential, and subject to non-negligible diffusion, by deriving exact analytical results for its steady-state probability density, current, entropy production rate, power output, and thermodynamic efficiency. The current, and thus the extractable power and efficiency, have non-monotonic dependencies on the diffusion strength, ratchet height, and particle self-propulsion speed, peaking at finite values in each case. In the case where the particles' self-propulsion is completely suppressed by the force from the ratchet, and thus a current can be generated only by diffusion-mediated barrier crossings, the system's entropy production rate remains finite in the limit of vanishing diffusion. In the final part of this work, we consider RnT motion in a linear ratchet potential on a bounded interval, allowing the derivation of mean first-passage times and splitting probabilities for different boundary and initial conditions. The present work resides at the interface of exactly solvable models of run-and-tumble motion and the study of work extraction from active matter by providing exact expressions pertaining to the feasibility and future design of active engines. Our results are in agreement with Monte Carlo simulations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07880v1",
        "http://arxiv.org/pdf/2303.07880v2"
    ],
    "publication_venue": "14 pages (main), 23 pages (total), 17 figures"
}