{
    "arxiv_id": "2303.09969",
    "paper_title": "Averaging over atom snapshots in linear-response TDDFT of disordered systems: A case study of warm dense hydrogen",
    "authors": [
        "Zhandos A. Moldabekov",
        "Jan Vorberger",
        "Tobias Dornheim"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "physics.comp-ph",
        "physics.chem-ph",
        "physics.data-an",
        "physics.plasm-ph"
    ],
    "abstract": "Linear-response time-dependent density functional theory (LR-TDDFT) simulations of disordered extended systems require averaging over different snapshots of ion configurations to minimize finite size effects due to the snapshot--dependence of the electronic density response function and related properties. We present a consistent scheme for the computation of the macroscopic Kohn-Sham (KS) density response function connecting an average over snapshot values of charge density perturbations to the averaged values of KS potential variations. This allows us to formulate the LR-TDDFT within the adiabatic (static) approximation for the exchange-correlation (XC) kernel for disordered systems, where the static XC kernel is computed using the direct perturbation method [Moldabekov et al. J. Chem. Theory Comput. 19, 1286 (2023)]. The presented approach allows one to compute the macroscopic dynamic density response function as well as the dielectric function with a static XC kernel generated for any available XC functional. The application of the developed workflow is demonstrated for the example of warm dense hydrogen. We show that a naive direct arithmetic averaging of the KS response functions or of the dynamic dielectric functions computed for individual snapshots leads to uncontrolled errors that are particularly pronounced in the limit of small wave numbers. The approach presented in this work solves this problem and is applicable for various types of extended disordered systems such as warm dense matter, liquid metals, and dense plasmas.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09969v1"
    ],
    "publication_venue": null
}