{
    "arxiv_id": "2303.08802",
    "paper_title": "Review of the No-Boundary Wave Function",
    "authors": [
        "Jean-Luc Lehners"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-07-19"
    ],
    "latest_version": 2,
    "categories": [
        "hep-th",
        "gr-qc"
    ],
    "abstract": "When the universe is treated as a quantum system, it is described by a wave function. This wave function is a function not only of the matter fields, but also of spacetime. The no-boundary proposal is the idea that the wave function should be calculated by summing over geometries that have no boundary to the past, and over regular matter configurations on these geometries. Accordingly, the universe is finite, self-contained and the big bang singularity is avoided. Moreover, given a dynamical theory, the no-boundary proposal provides probabilities for various solutions of the theory. In this sense it provides a quantum theory of initial conditions.\n  This review starts with a general overview of the framework of quantum cosmology, describing both the canonical and path integral approaches, and their interpretations. After recalling several heuristic motivations for the no-boundary proposal, its consequences are illustrated with simple examples, mainly in the context of cosmic inflation. We review how to include perturbations, assess the classicality of spacetime and how probabilities may be derived. A special emphasis is given to explicit implementations in minisuperspace, to observational consequences, and to the relationship of the no-boundary wave function with string theory. At each stage, the required analytic and numerical techniques are explained in detail, including the Picard-Lefschetz approach to oscillating integrals.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08802v1",
        "http://arxiv.org/pdf/2303.08802v2"
    ],
    "publication_venue": "144 pages, 49 figures. v2: replaced with version published in Physics Reports",
    "doi": "10.1016/j.physrep.2023.06.002"
}