{
    "arxiv_id": "2303.09612",
    "paper_title": "A simply solvable model capturing the approach to statistical self-similarity for the diffusive coarsening of bubbles, droplets, and grains",
    "authors": [
        "Anthony T. Chieco",
        "Douglas J. Durian"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft"
    ],
    "abstract": "Aqueous foams and a wide range of related systems are believed to coarsen by gas diffusion between neighboring domains into a statistically self-similar scaling state, after the decay of initial transients, such that dimensionless size and shape distributions become time independent and the average grows as a power law. Partial integrodifferential equations for the time evolution of the size distribution for such phase separating systems can be formulated for arbitrary initial conditions, but these are cumbersome for analyzing data on non-scaling state preparations. Here we show that essential features of the approach to the scaling state can be captured by an exactly-solvable ordinary differential equation for the evolution of the average bubble size. The key ingredient is to characterize the the bubble size distribution approximately, using the average size of all bubbles and the average size of the critical bubbles, which instantaneously neither grow nor shrink. The difference between these two averages serves as a proxy for the width of the size distribution. To test our model, we compare with data for quasi-two dimensional dry foams created with three different initial amounts of polydispersity. This allows us to readily identify the critical radius from the average area of six-sided bubbles, whose growth rate is zero by the von~Neumann law. The growth of the average and critical radii agree quite well with exact solution, though the most monodisperse sample crosses over to the scaling state faster than expected. A simpler approximate solution of our model performs equally well. Our approach is applicable to 3d foams, which we demonstrate by re-analyzing prior data, as well as to froths of dilute droplets and to phase separation kinetics for more general systems such as emulsions, binary mixtures, and alloys.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09612v1"
    ],
    "publication_venue": null
}