{
    "arxiv_id": "2303.17242",
    "paper_title": "Coulomb collisions of hot and cold single electrons in series-coupled silicon single-electron pumps",
    "authors": [
        "Gento Yamahata",
        "Nathan Johnson",
        "Akira Fujiwara"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-10-20"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "Control of the Coulomb interaction between single electrons is vital for realizing quantum information processing using flying electrons and, particularly, for the realization of deterministic two-qubit operations. Since the strength of the Coulomb interaction increases with decreasing distance, a collision experiment of single electrons would be an ideal way to investigate it. Moreover, it would be useful to study such a Coulomb collision in silicon system, which has been extensively studied for qubit applications but so far has not been used for making Coulomb collisions at the single-electron level. Here, we made two series-coupled tunable-barrier single-electron pumps in silicon and used one to inject a hot single electron into the other pump in each pumping cycle. The hot single electron collides with a cold single electron confined in the other single-electron pump. We observed a current flow due to ejection not only of the hot single electron but also of the confined cold single electron. The latter leads to an excess current at a current plateau at a certain voltage range. We also found that increasing the number of cold electrons from one to two increased the cold-electron current by at least twofold. These results can be explained by a charging effect due to the Coulomb interaction. This observation is an important step toward quantum manipulation of flying single electrons in silicon.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17242v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevApplied.20.044043"
}