{
    "arxiv_id": "2303.13324",
    "paper_title": "A Generalised Deep Meta-Learning Model for Automated Quality Control of Cardiovascular Magnetic Resonance Images",
    "authors": [
        "Shahabedin Nabavi",
        "Hossein Simchi",
        "Mohsen Ebrahimi Moghaddam",
        "Ahmad Ali Abin",
        "Alejandro F. Frangi"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-10-02"
    ],
    "latest_version": 1,
    "categories": [
        "eess.IV"
    ],
    "abstract": "Background and Objectives: Cardiovascular magnetic resonance (CMR) imaging is a powerful modality in functional and anatomical assessment for various cardiovascular diseases. Sufficient image quality is essential to achieve proper diagnosis and treatment. A large number of medical images, the variety of imaging artefacts, and the workload of imaging centres are among the things that reveal the necessity of automatic image quality assessment (IQA). However, automated IQA requires access to bulk annotated datasets for training deep learning (DL) models. Labelling medical images is a tedious, costly and time-consuming process, which creates a fundamental challenge in proposing DL-based methods for medical applications. This study aims to present a new method for CMR IQA when there is limited access to annotated datasets. Methods: The proposed generalised deep meta-learning model can evaluate the quality by learning tasks in the prior stage and then fine-tuning the resulting model on a small labelled dataset of the desired tasks. This model was evaluated on the data of over 6,000 subjects from the UK Biobank for five defined tasks, including detecting respiratory motion, cardiac motion, Aliasing and Gibbs ringing artefacts and images without artefacts. Results: The results of extensive experiments show the superiority of the proposed model. Besides, comparing the model's accuracy with the domain adaptation model indicates a significant difference by using only 64 annotated images related to the desired tasks. Conclusion: The proposed model can identify unknown artefacts in images with acceptable accuracy, which makes it suitable for medical applications and quality assessment of large cohorts.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13324v1"
    ],
    "publication_venue": "16 pages, 1 figure, 2 tables",
    "doi": "10.1016/j.cmpb.2023.107770"
}