{
    "arxiv_id": "2303.15977",
    "paper_title": "Impact of surface reflectivity on the ultra-fast laser melting of silicon-germanium alloys",
    "authors": [
        "Damiano Ricciarelli",
        "Giovanni Mannino",
        "Ioannis Deretzis",
        "Gaetano Calogero",
        "Giuseppe Fisicaro",
        "Richard Daubriac",
        "Remi Demoulin",
        "Fuccio Cristiano",
        "Pawel P. Michalowski",
        "Pablo Acosta-Alba",
        "Jean-Michel Hartmann",
        "Sébastien Kerdilès",
        "Antonino La Magna"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-07-06"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "Ultraviolet nanosecond laser annealing (LA) is a powerful tool where strongly confined heating and melting are desirable. In semiconductor technologies the importance of LA increases with the increasing complexity of the proposed integration schemes. Optimizing the LA process along with the experimental design is challenging, especially when complex 3D nanostructured systems with various shapes and phases are involved. Within this context, reliable simulations of laser melting are required for optimizing the process parameters while reducing the number of experimental tests. This gives rise to a virtual Design of Experiments (DoE). $Si_{1-x}Ge_{x}$ alloys are nowadays used for their compatibility with silicon devices enabling to engineer properties such as strain, carrier mobilities and bandgap. In this work, the laser melting process of relaxed and strained $Si_{1-x}Ge_{x}$ is simulated with a finite element method / phase field approach. Particularly, we calibrated the dielectric functions of the alloy for its crystalline and liquid phase using experimental data. We highlighted the importance of reproducing the exact reflectivity of the interface between air and the material in its different aggregation states, to correctly mimic the process. We indirectly discovered intriguing features on the optical behavior of melt silicon-germanium.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15977v1",
        "http://arxiv.org/pdf/2303.15977v2"
    ],
    "publication_venue": null,
    "doi": "10.1016/j.mssp.2023.107635"
}