{
    "arxiv_id": "2303.09493",
    "paper_title": "Anomalous crystalline ordering of particles in a viscoelastic fluid under high shear",
    "authors": [
        "Sijie Sun",
        "Nan Xue",
        "Stefano Aime",
        "Hyoungsoo Kim",
        "Jizhou Tang",
        "Gareth H. McKinley",
        "Howard A. Stone",
        "David A. Weitz"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.soft",
        "physics.app-ph"
    ],
    "abstract": "Addition of particles to a viscoelastic suspension dramatically alters the properties of the mixture, particularly when it is sheared or otherwise processed. Shear-induced stretching of the polymers results in elastic stress that causes a substantial increase in measured viscosity with increasing shear, and an attractive interaction between particles, leading to their chaining. At even higher shear rates, the flow becomes unstable, even in the absence of particles. This instability makes it very difficult to determine the properties of a particle suspension. Here we use a fully immersed parallel plate geometry to measure the high-shear-rate behavior of a suspension of particles in a viscoelastic fluid. We find an unexpected separation of the particles within the suspension resulting in the formation of a layer of particles in the center of the cell. Remarkably, monodisperse particles form a crystalline layer which dramatically alters the shear instability. By combining measurements of the velocity field and torque fluctuations, we show that this solid layer disrupts the flow instability and introduces a new, single-frequency component to the torque fluctuations that reflects a dominant velocity pattern in the flow. These results highlight the interplay between particles and a suspending viscoelastic fluid at very high shear rates.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09493v1",
        "http://arxiv.org/pdf/2303.09493v2"
    ],
    "publication_venue": "SI Videos and future data sharing are available at https://doi.org/10.7910/DVN/K0XZ6N"
}