{
    "arxiv_id": "2303.12356",
    "paper_title": "Plasma kinetics: Discrete Boltzmann modelling and Richtmyer-Meshkov instability",
    "authors": [
        "Jiahui Song",
        "Aiguo Xu",
        "Long Miao",
        "Feng Chen",
        "Zhipeng Liu",
        "Lifeng Wang",
        "Ningfei Wang",
        "Xiao Hou"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-10-10"
    ],
    "latest_version": 2,
    "categories": [
        "physics.plasm-ph",
        "cond-mat.stat-mech",
        "nlin.CG",
        "physics.comp-ph"
    ],
    "abstract": "A discrete Boltzmann model (DBM) for plasma kinetics is proposed. The constructing of DBM mainly considers two aspects. The first is to build a physical model with sufficient physical functions before simulation. The second is to present schemes for extracting more valuable information from massive data after simulation. For the first aspect, the model is equivalent to a magnetohydrodynamic model plus a coarse-grained model for the most relevant TNE behaviors including the entropy production rate. A number of typical benchmark problems including Orszag-Tang (OT) vortex problem are used to verify the physical functions of DBM. For the second aspect, the DBM use non-conserved kinetic moments of (f-feq) to describe non-equilibrium state and behaviours of complex system. The OT vortex problem and the Richtmyer-Meshkov instability (RMI) are practical applications of the second aspect. For RMI with interface inverse and re-shock process, it is found that, in the case without magnetic field, the non-organized momentum flux shows the most pronounced effects near shock front, while the non-organized energy flux shows the most pronounced behaviors near perturbed interface. The influence of magnetic field on TNE effects shows stages: before the interface inverse, the TNE strength is enhanced by reducing the interface inverse speed; while after the interface inverse, the TNE strength is significantly reduced. Both the global average TNE strength and entropy production rate contributed by non-organized energy flux can be used as physical criteria to identify whether or not the magnetic field is sufficient to prevent the interface inverse.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12356v1",
        "http://arxiv.org/pdf/2303.12356v2"
    ],
    "publication_venue": "20 pages, 15 figures"
}