{
    "arxiv_id": "2303.15695",
    "paper_title": "Insights on the Sun birth environment in the context of star-cluster formation in hub-filament systems",
    "authors": [
        "Doris Arzoumanian",
        "Sota Arakawa",
        "Masato I. N. Kobayashi",
        "Kazunari Iwasaki",
        "Kohei Fukada",
        "Shoji Mori",
        "Yutaka Hirai",
        "Masanobu Kunitomo",
        "M. S. Nanda Kumar",
        "Eiichiro Kokubo"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.EP",
        "astro-ph.SR"
    ],
    "abstract": "Cylindrical molecular filaments are observed to be the main sites of Sun-like star formation, while massive stars form in dense hubs, at the junction of multiple filaments. The role of hub-filament configurations has not been discussed yet in relation to the birth environment of the solar system and to infer the origin of isotopic ratios of Short-Lived Radionuclides (SLR, such as $^{26}$Al) of Calcium-Aluminum-rich Inclusions (CAIs) observed in meteorites. In this work, we present simple analytical estimates of the impact of stellar feedback on the young solar system forming along a filament of a hub-filament system. We find that the host filament can shield the young solar system from the stellar feedback, both during the formation and evolution of stars (stellar outflow, wind, and radiation) and at the end of their life (supernovae). We show that the young solar system formed along a dense filament can be enriched with supernova ejecta (e.g., $^{26}$Al) during the formation timescale of CAIs. We also propose that the streamers recently observed around protostars may be channeling the SLR-rich material onto the young solar system. We conclude that considering hub-filament configurations as the birth environment of the Sun is important when deriving theoretical models explaining the observed properties of the solar system.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15695v1"
    ],
    "publication_venue": "Accepted for publication in The Astrophysical Journal Letters",
    "doi": "10.3847/2041-8213/acc849"
}