{
    "arxiv_id": "2303.16600",
    "paper_title": "Numerical analysis of a family of simultaneous distributed-boundary mixed elliptic optimal control problems and their asymptotic behaviour through a commutative diagram and error estimates",
    "authors": [
        "Carolina M. Bollo",
        "Claudia M. Gariboldi",
        "Domingo A. Tarzia"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "math.OC"
    ],
    "abstract": "In this paper, we consider a family of simultaneous distributed-boundary optimal control problems ($P_α$) on the internal energy and the heat flux for a system governed by a mixed elliptic variational equality with a parameter $α>0$ and a simultaneous distributed-boundary optimal control problem ($P$) governed also by an elliptic variational equality with a Dirichlet boundary condition on the same portion of the boundary. We formulate discrete approximations $\\left(P_{h α}\\right)$ and $\\left(P_h\\right)$ of the problems $\\left(P_α\\right)$ and $(P)$ respectively, for each $h>0$ and for each $α>0$, through the finite element method with Lagrange's triangles of type 1 with parameter $h$ (the longest side of the triangles). The goal of this paper is to study the convergence of this family of discrete simultaneous distributed-boundary mixed elliptic optimal control problems $\\left(P_{h α}\\right)$ when the parameters $α$ goes to infinity and the parameter $h$ goes to zero simultaneously. We prove the convergence of the problems $\\left(P_{h α}\\right)$ to the problem $\\left(P_h\\right)$ when $α\\rightarrow +\\infty$, for each $h>0$. We study the convergence of the problems $\\left(P_{h α}\\right)$ and $\\left(P_h\\right)$, for each $α>0$, when $h \\rightarrow 0^+$ obtaining a commutative diagram which relates the continuous and discrete optimal control problems $\\left(P_{h α}\\right),\\left(P_α\\right),\\left(P_h\\right)$ and $(P)$ by taking the limits $h \\rightarrow 0^+$ and $α\\rightarrow +\\infty$ respectively. We also study the double convergence of $\\left(P_{h α}\\right)$ to $(P)$ when $(h, α) \\rightarrow(0^+,+\\infty)$ which represents the diagonal convergence in the above commutative diagram.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16600v1"
    ],
    "publication_venue": "This paper has been published online in Nonlinear Analysis: Real World Applications. arXiv admin note: text overlap with arXiv:1512.03832"
}