{
    "arxiv_id": "2303.15903",
    "paper_title": "Small Black Hole Explosions",
    "authors": [
        "Roberta Angius",
        "Jesus Huertas",
        "Angel M. Uranga"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "hep-th"
    ],
    "abstract": "Small black holes are a powerful tool to explore infinite distances in moduli spaces. However, we show that in 4d theories with a scalar potential growing fast enough at infinity, it is energetically too costly for scalars to diverge at the core, and the small black hole puffs up into a regular black hole, or follows a runaway behaviour.\n  We derive a critical exponent characterizing the occurrence or not of such small black hole explosions, both from a 4d perspective, and in the 2d theory after an $\\bf{S}^2$ truncation. The latter setup allows a unified discussion of fluxes, domain walls and black holes, solving an apparent puzzle in the expression of their potentials in the 4d $\\cal{N}=2$ gauged supergravity context.\n  We discuss the realization of these ideas in 4d $\\cal{N}=2$ gauged supergravities. Along the way we show that many regular black hole supergravity solutions in the literature in the latter context are incomplete, due to Freed-Witten anomalies (or duals thereof), and require the emission of strings by the black hole.\n  From the 2d perspective, small black hole solutions correspond to dynamical cobordisms, with the core describing an end of the world brane. Small black hole explosions represent obstructions to completing the dynamical cobordism. We study the implications for the Cobordism Distance Conjecture, which states that in any theory there should exist dynamical cobordisms accessing all possible infinite distance limits in scalar field space. The realization of this principle using small black holes leads to non-trivial constraints on the 4d scalar potential of any consistent theory; in the 4d $\\cal{N}=2$ context, they allow to recover from a purely bottom-up perspective, several non-trivial properties of vector moduli spaces near infinity familiar from CY$_3$ compactifications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15903v1"
    ],
    "publication_venue": "40 pages + appendices"
}