{
    "arxiv_id": "2303.17133",
    "paper_title": "Classifying a frequently repeating fast radio burst, FRB 20201124A, with unsupervised machine learning",
    "authors": [
        "Bo Han Chen",
        "Tetsuya Hashimoto",
        "Tomotsugu Goto",
        "Bjorn Jasper R. Raquel",
        "Yuri Uno",
        "Seong Jin Kim",
        "Tiger Y. -Y. Hsiao",
        "Simon C. -C. Ho"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA"
    ],
    "abstract": "Fast radio bursts (FRBs) are astronomical transients with millisecond timescales. Although most of the FRBs are not observed to repeat, a few of them are detected to repeat more than hundreds of times. There exist a large variety of physical properties among these bursts, suggesting heterogeneous mechanisms of FRBs. In this paper, we conduct a categorisation on the extremely frequently repeating FRB 20201124A with the assistance of machine learning, as such techniques have the potential to use subtle differences and correlations that humans are unaware of to better classify bursts. The research is carried out by applying the unsupervised Uniform Manifold Approximation and Projection (UMAP) model on the FRB 20201124A data provided by Five-hundred-meter Aperture Spherical radio Telescope (FAST). The algorithm eventually categorises the bursts into three clusters. In addition to the two categories in previous work based on waiting time, a new way for categorisation has been found. The three clusters are either high energy, high frequency, or low frequency, reflecting the distribution of FRB energy and frequency. Importantly, a similar machine learning result is found in another frequently repeating FRB20121102A, implying a common mechanism among this kind of FRB. This work is one of the first steps towards the systematical categorisation of the extremely frequently repeating FRBs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17133v1"
    ],
    "publication_venue": "8 pages, 9 figures, accepted for publication in MNRAS. For summary video, please see https://www.youtube.com/watch?v=1PPCMKcrIf4&list=PLOpYDs2PkYlYIiKDjDz6r6aKXcXdJZXYb&index=14&ab_channel=NCHUAstronomy"
}