{
    "arxiv_id": "2303.16865",
    "paper_title": "Legged Robots for Object Manipulation: A Review",
    "authors": [
        "Yifeng Gong",
        "Ge Sun",
        "Aditya Nair",
        "Aditya Bidwai",
        "Raghuram CS",
        "John Grezmak",
        "Guillaume Sartoretti",
        "Kathryn A. Daltorio"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "cs.RO"
    ],
    "abstract": "Legged robots can have a unique role in manipulating objects in dynamic, human-centric, or otherwise inaccessible environments. Although most legged robotics research to date typically focuses on traversing these challenging environments, many legged platform demonstrations have also included \"moving an object\" as a way of doing tangible work. Legged robots can be designed to manipulate a particular type of object (e.g., a cardboard box, a soccer ball, or a larger piece of furniture), by themselves or collaboratively. The objective of this review is to collect and learn from these examples, to both organize the work done so far in the community and highlight interesting open avenues for future work. This review categorizes existing works into four main manipulation methods: object interactions without grasping, manipulation with walking legs, dedicated non-locomotive arms, and legged teams. Each method has different design and autonomy features, which are illustrated by available examples in the literature. Based on a few simplifying assumptions, we further provide quantitative comparisons for the range of possible relative sizes of the manipulated object with respect to the robot. Taken together, these examples suggest new directions for research in legged robot manipulation, such as multifunctional limbs, terrain modeling, or learning-based control, to support a number of new deployments in challenging indoor/outdoor scenarios in warehouses/construction sites, preserved natural areas, and especially for home robotics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16865v1"
    ],
    "publication_venue": "Preprint of the paper submitted to Frontiers in Mechanical Engineering"
}