{
    "arxiv_id": "2303.10562",
    "paper_title": "Impact of nuclear matrix element calculations for current and future neutrinoless double beta decay searches",
    "authors": [
        "Federica Pompa",
        "Thomas Schwetz",
        "Jing-Yu Zhu"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph"
    ],
    "abstract": "Nuclear matrix elements (NME) are a crucial input for the interpretation of neutrinoless double beta decay data. We consider a representative set of recent NME calculations from different methods and investigate the impact on the present bound on the effective Majorana mass $m_{ββ}$ by performing a combined analysis of the available data as well as on the sensitivity reach of future projects. A crucial role is played by the recently discovered short-range contribution to the NME, induced by light Majorana neutrino masses. Depending on the NME model and the relative sign of the long- and short-range contributions, the current $3σ$ bound can change between $m_{ββ} < 40$ meV and 600 meV. The sign-uncertainty may either boost the sensitivity of next-generation experiments beyond the region for $m_{ββ}$ predicted for inverted mass ordering or prevent even advanced setups to reach this region. Furthermore, we study the possibility to distinguish between different NME calculations by assuming a positive signal and by combining measurements from different isotopes. Such a discrimination will be impossible if the relative sign of the long- and short-range contribution remains unknown, but can become feasible if $m_{ββ} \\gtrsim 40$ meV and if the relative sign is known to be positive. Sensitivities will be dominated by the advanced $^{76}$Ge and $^{136}$Xe setups assumed here, but NME model-discrimination improves if data from a third isotope is added, e.g., from $^{130}$Te or $^{100}$Mo.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10562v1"
    ],
    "publication_venue": "29 pages, 14 figures"
}