{
    "arxiv_id": "2303.11250",
    "paper_title": "The continuum of metastable conical states of monoaxial chiral helimagnets",
    "authors": [
        "V. Laliena",
        "S. A. Osorio",
        "D. Bazo",
        "S. Bustingorry",
        "J. Campo"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-08-09"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "At low temperature and zero applied magnetic field, besides the equilibrium helical state, monoaxial chiral helimagnets have a continuum of helical states differing by the wave number of the modulation. The wave number of these states in units of the equilibrium state wave number is denoted here by p, and accordingly the corresponding states are called the p-states. In this work we study in detail the metastability of the p-states. The application of an external magnetic field in the direction of the chiral axis has a double effect: on one hand, it introduces a conical deformation of the p-states, and on the other hand it destabilizes some of them, shrinking the range of p in which the p-states are metastable. If a polarized current is applied along the chiral axis, the p-states reach a steady moving state with a constant velocity proportional to the current intensity. Besides this dynamical effect, the polarized current also induces a conical deformation and reduces the range of stability of the p-states. The stability diagram in the plane applied field - applied current intensity has interesting features that, among other things, permit the manipulation of p-states by a combination of applied fields and currents. These features can be exploited to devise processes to switch between p-states. In particular there are p-states with negative p, opening the possibility to helicity switching. The theoretical feasibility of such processes, crucial from the point of view of applications, is shown by micromagnetic simulations. Analogous $p$-states exists in cubic chiral helimagnets and therefore similar effects are expected in those systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11250v1"
    ],
    "publication_venue": "13 pages, 7 figures",
    "doi": "10.1103/PhysRevB.108.024425"
}