{
    "arxiv_id": "2303.15667",
    "paper_title": "Computation of Green's function by local variational quantum compilation",
    "authors": [
        "Shota Kanasugi",
        "Shoichiro Tsutsui",
        "Yuya O. Nakagawa",
        "Kazunori Maruyama",
        "Hirotaka Oshima",
        "Shintaro Sato"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-08-03"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Computation of the Green's function is crucial to study the properties of quantum many-body systems such as strongly correlated systems. Although the high-precision calculation of the Green's function is a notoriously challenging task on classical computers, the development of quantum computers may enable us to compute the Green's function with high accuracy even for classically-intractable large-scale systems. Here, we propose an efficient method to compute the real-time Green's function based on the local variational quantum compilation (LVQC) algorithm, which simulates the time evolution of a large-scale quantum system using a low-depth quantum circuit constructed through optimization on a smaller-size subsystem. Our method requires shallow quantum circuits to calculate the Green's function and can be utilized on both near-term noisy intermediate-scale and long-term fault-tolerant quantum computers depending on the computational resources we have. We perform a numerical simulation of the Green's function for the one- and two-dimensional Fermi-Hubbard model up to $4\\times4$ sites lattice (32 qubits) and demonstrate the validity of our protocol compared to a standard method based on the Trotter decomposition. We finally present a detailed estimation of the gate count for the large-scale Fermi-Hubbard model, which also illustrates the advantage of our method over the Trotter decomposition.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15667v1"
    ],
    "publication_venue": "22 pages, 13 figures",
    "doi": "10.1103/PhysRevResearch.5.033070"
}