{
    "arxiv_id": "2303.08987",
    "paper_title": "Generalized Score Matching: Beyond The IID Case",
    "authors": [
        "Jiazhen Xu",
        "Janice L. Scealy",
        "Andrew T. A. Wood",
        "Tao Zou"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "stat.ME",
        "math.ST",
        "stat.AP",
        "stat.CO"
    ],
    "abstract": "Score matching is an estimation procedure that has been developed for statistical models whose probability density function is known up to proportionality but whose normalizing constant is intractable. For such models, maximum likelihood estimation will be difficult or impossible to implement. To date, nearly all applications of score matching have focused on continuous IID (independent and identically distributed) models. Motivated by various data modelling problems for which the continuity assumption and/or the IID assumption are not appropriate, this article proposes three novel extensions of score matching: (i) to univariate and multivariate ordinal data (including count data); (ii) to INID (independent but not necessarily identically distributed) data models, including regression models with either a continuous or a discrete ordinal response; and (iii) to a class of dependent data models known as auto models. Under the INID assumption, a unified asymptotic approach to settings (i) and (ii) is developed and, under mild regularity conditions, it is proved that the proposed score matching estimators are consistent and asymptotically normal. These theoretical results provide a sound basis for score-matching-based inference and are supported by strong performance in simulation studies and a real data example involving doctoral publication data. Regarding (iii), motivated by a spatial geochemical dataset, we develop a novel auto model for spatially dependent spherical data and propose a score-matching-based Wald statistic to test for the presence of spatial dependence. Our proposed auto model exhibits a way to model spatial dependence of directions, is computationally convenient to use and is expected to be superior to composite likelihood approaches for reasons that are explained.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08987v1"
    ],
    "publication_venue": "arXiv admin note: substantial text overlap with arXiv:2203.09864"
}