{
    "arxiv_id": "2303.16468",
    "paper_title": "IMU-based Modularized Wearable Device for Human Motion Classification",
    "authors": [
        "Sahan Wijethunga",
        "Shehan Kaushalya Senavirathna",
        "Kavishka Dissanayake",
        "Janith Bandara Senanayake",
        "Eranda Somathilake",
        "Upekha Hansanie Delay",
        "Roshan Indika Godaliyadda",
        "Mervyn Parakrama Ekanayake",
        "Janaka Wijayakulasooriya"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SP",
        "eess.SY"
    ],
    "abstract": "Human motion analysis is used in many different fields and applications. Currently, existing systems either focus on one single limb or one single class of movements. Many proposed systems are designed to be used in an indoor controlled environment and must possess good technical know-how to operate. To improve mobility, a less restrictive, modularized, and simple Inertial Measurement units based system is proposed that can be worn separately and combined. This allows the user to measure singular limb movements separately and also monitor whole body movements over a prolonged period at any given time while not restricted to a controlled environment. For proper analysis, data is conditioned and pre-processed through possible five stages namely power-based, clustering index-based, Kalman filtering, distance-measure-based, and PCA-based dimension reduction. Different combinations of the above stages are analyzed using machine learning algorithms for selected case studies namely hand gesture recognition and environment and shoe parameter-based walking pattern analysis to validate the performance capability of the proposed wearable device and multi-stage algorithms. The results of the case studies show that distance-measure-based and PCA-based dimension reduction will significantly improve human motion identification accuracy. This is further improved with the introduction of the Kalman filter. An LSTM neural network is proposed as an alternate classifier and the results indicate that it is a robust classifier for human motion recognition. As the results indicate, the proposed wearable device architecture and multi-stage algorithms are cable of distinguishing between subtle human limb movements making it a viable tool for human motion analysis.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16468v1"
    ],
    "publication_venue": "10 pages, 12 figures, 28 references"
}