{
    "arxiv_id": "2303.10014",
    "paper_title": "Reliability of Tumour Classification from Multi-Dimensional DCE-MRI Variables using Data Transformations",
    "authors": [
        "S. V. Notley",
        "N. A. Thacker",
        "L. Horsley",
        "R. A. Little",
        "Y. Watson",
        "S. Mullamitha",
        "G. C. Jayson",
        "A. Jackson"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "physics.med-ph",
        "q-bio.TO"
    ],
    "abstract": "Summary mean DCE-MRI variables show a clear dependency between signal and noise variance, which can be shown to reduce the effectiveness of difference assessments. Appropriate transformation of these variables supports statistically efficient and robust comparisons. The capabilities of DCE-MRI based descriptions of hepatic colorectal tumour classification was assessed, with regard to their potential for use as imaging biomarkers. Four DCE-MRI parameters were extracted from 102 selected tumour regions. A multi-dimensional statistical distance metric was assessed for the challenging task of comparing intra- and inter- subject tumour differences. Statistical errors were estimated using bootstrap resampling. The potential for tumour classification was assessed via Monte Carlo simulation. Transformation of the variables and fusion into a single chi-squared statistic shows that inter subject variation in hepatic tumours is measurable and significantly greater than intra-subject variation at the group level. However, reliability analysis shows that, at current noise levels, individual tumour assessment is not possible. Appropriate data transforms for DCE-MRI derived parameters produce an improvement in statistical sensitivity compared to conventional approaches. Reliability analysis shows, that even with data transformation, DCI-MRI variables do not currently facilitate good tumour discrimination and a doubling of SNR is needed to support non-trivial levels of classification",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10014v1"
    ],
    "publication_venue": "18 pages and 6 figures"
}