{
    "arxiv_id": "2303.08088",
    "paper_title": "How Cosmic Web Environment Affects Galaxy Quenching Across Cosmic Time",
    "authors": [
        "Farhanul Hasan",
        "Joseph N. Burchett",
        "Alyssa Abeyta",
        "Douglas Hellinger",
        "Nir Mandelker",
        "Joel R. Primack",
        "Sandra Faber",
        "David C. Koo",
        "Oskar Elek",
        "Daisuke Nagai"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We investigate how cosmic web structures affect galaxy quenching in the IllustrisTNG (TNG-100) cosmological simulations by reconstructing the cosmic web in each snapshot using the DisPerSE framework. We measure the distance from each galaxy with stellar mass log(M*/Msun)>=8 to the nearest node (dnode) and the nearest filament spine (dfil) and study the dependence of both median specific star formation rate (<sSFR>) and median gas fraction (<fgas>) on these distances. We find that <sSFR> of galaxies is only dependent on cosmic web environment at z<2, with the dependence increasing with time. At z<=0.5, 8<=log(M*/Msun)<9 galaxies are quenched at dnode<1 Mpc, and significantly star formation-suppressed at dfil<1 Mpc, trends which are driven mostly by satellite galaxies. At z<=1, in contrast to the monotonic rise in <sSFR> of log(M*/Msun)<10 galaxies with dnode and dfil, log(M*/Msun)>=10 galaxies actually experience an upturn in <sSFR> at dnode<0.2 Mpc (this is caused by both satellites and centrals). Much of this cosmic web-dependence of star formation activity can be explained by the evolution in <fgas>. Our results suggest that in the past ~10 Gyr, low-mass satellites are quenched by rapid gas stripping in dense environments near nodes and gradual gas starvation in intermediate-density environments near filaments, while at earlier times cosmic web structures efficiently channeled cold gas into most galaxies. State-of-the-art ongoing spectroscopic surveys such as SDSS and DESI, as well as those planned with JWST and Roman are required to test our predictions against observations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08088v1"
    ],
    "publication_venue": "5 Figures, 15 pages, submitted to ApJ Letters"
}