{
    "arxiv_id": "2303.09753",
    "paper_title": "A Spatio-temporal Decomposition Method for the Coordinated Economic Dispatch of Integrated Transmission and Distribution Grids",
    "authors": [
        "Qi Wang",
        "Wenchuan Wu",
        "Chenhui Lin",
        "Bin Wang"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY",
        "math.OC"
    ],
    "abstract": "With numerous distributed energy resources (DERs) integrated into the distribution networks (DNs), the coordinated economic dispatch (C-ED) is essential for the integrated transmission and distribution grids. For large scale power grids, the centralized C-ED meets high computational burden and information privacy issues. To tackle these issues, this paper proposes a spatio-temporal decomposition algorithm to solve the C-ED in a distributed and parallel manner. In the temporal dimension, the multi-period economic dispatch (ED) of transmission grid (TG) is decomposed to several subproblems by introducing auxiliary variables and overlapping time intervals to deal with the temporal coupling constraints. Besides, an accelerated alternative direction method of multipliers (A-ADMM) based temporal decomposition algorithm with the warm-start strategy, is developed to solve the ED subproblems of TG in parallel. In the spatial dimension, a multi-parametric programming projection based spatial decomposition algorithm is developed to coordinate the ED problems of TG and DNs in a distributed manner. To further improve the convergence performance of the spatial decomposition algorithm, the aggregate equivalence approach is used for determining the feasible range of boundary variables of TG and DNs. Moreover, we prove that the proposed spatio-temporal decomposition method can obtain the optimal solution for bilevel convex optimization problems with continuously differentiable objectives and constraints. Numerical tests are conducted on three systems with different scales, demonstrating the high computational efficiency and scalability of the proposed spatio-temporal decomposition method.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09753v1"
    ],
    "publication_venue": null
}