{
    "arxiv_id": "2303.11877",
    "paper_title": "Dynamic and polarimetric VLBI imaging with a multiscalar approach",
    "authors": [
        "Hendrik Müller",
        "Andrei Lobanov"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.GA"
    ],
    "abstract": "Recently multiscale imaging approaches such as DoG-HiT were developed to solve the VLBI imaging problem and showed a promising performance: they are fast, accurate, unbiased and automatic. We extend the multiscalar imaging approach to polarimetric imaging, reconstructions of dynamically evolving sources and finally to dynamic polarimetric reconstructions. These extensions (mr-support imaging) utilize a multiscalar approach. The time-averaged Stokes I image is decomposed by a wavelet transform into single subbands. We use the set of statistically significant wavelet coefficients, the multiresolution support, computed by DoG-HiT as a prior in a constrained minimization manner: we fit the single-frame (polarimetric) observables by only varying the coefficients in the multiresolution support. The EHT is a VLBI array imaging supermassive black holes. We demonstrate on synthetic data that mr-support imaging offers ample regularization and is able to recover simple geometric dynamics at the horizon scale in a typical EHT setup. The approach is relatively lightweight, fast and largely automatic and data driven. The ngEHT is a planned extension of the EHT designed to recover movies at the event horizon scales of a supermassive black hole. We benchmark the performance of mr-support imaging for the denser ngEHT configuration demonstrating the major improvements the additional ngEHT antennas will bring to dynamic, polarimetric reconstructions. Current and upcoming instruments offer the observational possibility to do polarimetric imaging of dynamically evolving structural patterns with highest spatial and temporal resolution. State-of-the-art dynamic reconstruction methods can capture this motion with a range of temporal regularizers and priors. With this work, we add an additional, simpler regularizer to the list: constraining the reconstruction to the multiresolution support.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11877v1"
    ],
    "publication_venue": "accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202245393"
}