{
    "arxiv_id": "2303.16752",
    "paper_title": "Flow structure transition in thermal vibrational convection",
    "authors": [
        "Xili Guo",
        "Jianzhao Wu",
        "Bofu Wang",
        "Quan Zhou",
        "Kai Leong Chong"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "This study investigates the effect of vibration on the flow structure transitions in thermal vibrational convection (TVC) systems, which occur when a fluid layer with a temperature gradient is excited by vibration. Direct numerical simulations of TVC in a two-dimensional enclosed square box were performed over a range of dimensionless vibration amplitudes $0.001 \\le a \\le 0.3$ and angular frequencies $10^{2} \\le ω\\le 10^{7}$, with a fixed Prandtl number of 4.38. The flow visualisation shows the transition behaviour of flow structure upon the varying frequency, characterising three distinct regimes, which are the periodic-circulation regime, columnar regime and columnar-broken regime. Different statistical properties are distinguished from the temperature and velocity fluctuations at the boundary layer and mid-height. Upon transition into the columnar regime, columnar thermal coherent structures are formed, in contrast to the periodic oscillating circulation. These columns are contributed by merging of thermal plumes near the boundary layer, and the resultant thermal updrafts remain at almost fixed lateral position, leading to a decrease in fluctuations. We further find that the critical point of this transition can be described nicely by the vibrational Rayleigh number $Ra_\\mathrm{vib}$. As the frequency continues to increase, entering the so-called columnar-broken regime, the columnar structures are broken, and eventually the flow state becomes a large-scale circulation, characterised by a sudden increase in fluctuations. Finally, a phase diagram is constructed to summarise the flow structure transition over a wide range of vibration amplitude and frequency parameters.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16752v1"
    ],
    "publication_venue": "14 pages, 9 figures"
}