{
    "arxiv_id": "2303.11360",
    "paper_title": "The massive relic galaxy NGC 1277 is dark matter deficient. From dynamical models of integral-field stellar kinematics out to five effective radii",
    "authors": [
        "Sébastien Comerón",
        "Ignacio Trujillo",
        "Michele Cappellari",
        "Fernando Buitrago",
        "Luis E. Garduño",
        "Javier Zaragoza-Cardiel",
        "Igor A. Zinchenko",
        "Maritza A. Lara-López",
        "Anna Ferré-Mateu",
        "Sami Dib"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-06-08"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "According to the $Λ$CDM cosmology, present-day galaxies with stellar masses $M_\\star>10^{11} {\\rm M}_\\odot$ should contain a sizable fraction of dark matter within their stellar body. Models indicate that in massive early-type galaxies (ETGs) dark matter should account for $\\sim60\\%$ of the dynamical mass within five effective radii ($5 R_{\\rm e}$). Most massive ETGs have been shaped through a two-phase process: the rapid growth of a compact core was followed by the accretion of an extended envelope through mergers. The exceedingly rare galaxies that have avoided the second phase, the so-called relic galaxies, are thought to be the frozen remains of the massive ETG population at $z\\gtrsim2$. The best relic galaxy candidate discovered to date is NGC 1277, in the Perseus cluster. We used deep integral field GCMS data to revisit NGC 1277 out to an unprecedented radius of 6 kpc (corresponding to $5 R_{\\rm e}$). By using Jeans anisotropic modelling we find a negligible dark matter fraction within $5 R_{\\rm e}$ ($f_{\\rm DM}(5 R_{\\rm e})<0.05$; two-sigma confidence level), which is in tension with the expectation. Since the lack of an extended envelope would reduce dynamical friction and prevent the accretion of an envelope, we propose that NGC 1277 lost its dark matter very early or that it was dark matter deficient ab initio. We discuss our discovery in the framework of recent proposals suggesting that some relic galaxies may result from dark matter stripping as they fell in and interacted within galaxy clusters. Alternatively, NGC 1277 might have been born in a high-velocity collision of gas-rich proto-galactic fragments, where dark matter left behind a disc of dissipative baryons. We speculate that the relative velocities of $\\approx2000 {\\rm km/s}$ required for the latter process to happen were possible in the progenitors of the present-day rich galaxy clusters.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11360v1",
        "http://arxiv.org/pdf/2303.11360v2"
    ],
    "publication_venue": "Accepted for publication in A&A"
}