{
    "arxiv_id": "2303.09130",
    "paper_title": "The EUCLID NISP grisms flight models performance",
    "authors": [
        "Anne Costille",
        "A. Caillat",
        "C. Rossin",
        "S. Pascal",
        "P. Sanchez",
        "R. Barette",
        "P. Laurent",
        "B. Foulon",
        "C. Pariès"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ins-det",
        "astro-ph.IM"
    ],
    "abstract": "ESA EUCLID mission will be launched in 2020 to understand the nature of the dark energy responsible of the accelerated expansion of the Universe and to map the geometry of the dark matter. The map will investigate the distanceredshift relationship and the evolution of cosmic structures thanks to two instruments: the NISP and the VIS. The NISP (Near Infrared Spectro-Photometer) is operating in the near-IR spectral range (0.9-2$μ$m) with two observing modes: the photometric mode for the acquisition of images with broad band filters, and the spectroscopic mode for the acquisition of slitless dispersed images on the detectors. The spectroscopic mode uses four low resolution grisms to cover two spectral ranges: three ''red'' grisms for 1250-1850nm range, with three different orientations, and one ''blue'' grism for 920- 1300nm range. The NISP grisms are complex optical components combining four main optical functions: a grism function (dispersion without beam deviation of the first diffracted order) done by the grating on the prism hypotenuse, a spectral filter done by a multilayer filter deposited on the first face of the prism to select the spectral bandpass, a focus function done by the curved filter face of the prism (curvature radius of 10m) and a spectral wavefront correction done by the grating which grooves paths are nor parallel, neither straight. The development of these components have been started since 10 years at the Laboratoire d'Astrophysique de Marseille (LAM) and was linked to the project phases: prototypes have been developed to demonstrate the feasibility, then engineering and qualification models to validate the optical and mechanical performance of the component, finally the flight models have been manufactured and tested and will be installed on NISP instrument. In this paper, we present the optical performance of the four EUCLID NISP grisms flight models characterized at LAM: wavefront error, spectral transmission and grating groove profiles. The test devices and the methods developed for the characterization of these specific optical components are described. The analysis of the test results have shown that the grisms flight models for NISP are within specifications with an efficiency better than 70% on the spectral bandpass and a wavefront error on surfaces better than 30nm RMS. The components have withstood vibration qualification level up to 11.6g RMS in random test and vacuum cryogenics test down to 130K with measurement of optical quality in transmission. The EUCLID grisms flight models have been delivered to NISP project in November 2017 after the test campaign done at LAM that has demonstrated the compliance to the specifications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09130v1"
    ],
    "publication_venue": null,
    "doi": "10.1117/12.2309493"
}