{
    "arxiv_id": "2303.14740",
    "paper_title": "Chaotic dynamics of off-equatorial orbits around pseudo-Newtonian compact objects with dipolar halos",
    "authors": [
        "Saikat Das",
        "Suparna Roychowdhury"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-08-17"
    ],
    "latest_version": 2,
    "categories": [
        "gr-qc",
        "astro-ph.HE",
        "nlin.CD"
    ],
    "abstract": "In this paper, we implement a generalised pseudo-Newtonian potential and prescribe a numerical fitting formalism to study the off-equatorial orbits inclined at a certain angle with the equatorial plane around both Schwarzschild and Kerr-like compact object primaries surrounded by a dipolar halo of matter. The chaotic dynamics of the orbits are detailed for both non-relativistic and special-relativistic test particles. The dependence of the degree of chaos on the rotation parameter $a$ and the inclination angle $i$ is established individually using widely used indicators, such as the Poincaré Map and the Lyapunov Characteristic Number. We find that although the chaoticity of the orbits has a positive correlation with $i$, the growth in the chaotic behaviour is not systematic. There exists a threshold value of the inclination angle $i_{\\text{c}}$, after which the degree of chaos shows a sharp increase. On the other hand, the chaoticity of the inclined orbits anti-correlates with $a$ throughout its entire range. However, the negative correlation is systematic at lower values of the inclination angle. At higher values of $i$, the degree of chaos is maximum for the maximally counter-rotating compact objects, the Kerr parameter of which is below a threshold value $a_{\\text{c}}$. Above this threshold value, the correlation becomes weak. Furthermore, we establish a qualitative correlation between the threshold values and the overall chaoticity. The studies performed with different orbital parameters and several initial conditions reveal the intricate nature of the system.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14740v1",
        "http://arxiv.org/pdf/2303.14740v2"
    ],
    "publication_venue": "27 pages, 13 figures"
}