{
    "arxiv_id": "2303.16735",
    "paper_title": "Comparison principles for nonlinear potential theories and PDEs with fiberegularity and sufficient monotonicity",
    "authors": [
        "Marco Cirant",
        "Kevin R. Payne",
        "Davide F. Redaelli"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "math.AP"
    ],
    "abstract": "We present some recent advances in the productive and symbiotic interplay between general potential theories (subharmonic functions associated to closed subsets $\\mathcal{F} \\subset \\mathcal{J}^2(X)$ of the 2-jets on $X \\subset \\mathbb{R}^n$ open) and subsolutions of degenerate elliptic and parabolic PDEs of the form $F(x,u,Du,D^2u) = 0$. We will implement the monotonicity-duality method begun by Harvey and Lawson in 2009 (in the pure second order constant coefficient case) for proving comparison principles for potential theories where $\\mathcal{F}$ has sufficient monotonicity and fiberegularity (in variable coefficient settings) and which carry over to all differential operators $F$ which are compatible with $\\mathcal{F}$ in a precise sense for which the correspondence principle holds. We will consider both elliptic and parabolic versions of the comparison principle in which the effect of boundary data is seen on the entire boundary or merely on a proper subset of the boundary. Particular attention will be given to gradient dependent examples with the requisite sufficient monotonicity of proper ellipticity and directionality in the gradient. Example operators we will discuss include the degenerate elliptic operators of optimal transport in which the target density is strictly increasing in some directions as well as operators which are weakly parabolic in the sense of Krylov. Further examples, modeled on hyperbolic polynomials in the sense of Gårding give a rich class of examples with directionality in the gradient. Moreover we present a model example in which the comparison principle holds, but standard viscosity structural conditions fail to hold.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16735v1"
    ],
    "publication_venue": "52 pages"
}