{
    "arxiv_id": "2303.16692",
    "paper_title": "Viscous effects on morphological and thermodynamic non-equilibrium characterizations of shock-bubble interaction",
    "authors": [
        "Dejia Zhang",
        "Aiguo Xu",
        "Yanbiao Gan",
        "Yudong Zhang",
        "Jiahui Song",
        "Yingjun Li"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-08-16"
    ],
    "latest_version": 2,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "A two-fluid discrete Boltzmann model (DBM) with a flexible Prandtl number is formulated to study the shock-bubble interaction (SBI). This paper mainly focuses on the viscous effects on morphological and Thermodynamic Non-equilibrium (TNE) characterizations during the SBI process. Morphologically, viscosity affects the configuration of the vortex pair, increases both the gradients of density and temperature of the fluid field and reduces circulation of the bubble. As a higher viscosity fluid absorbs more energy from the shock wave, it leads to an increase in both the proportion of the high-density region and the corresponding boundary length for a fixed density threshold. The spatiotemporal features of TNE quantities are analyzed from multiple perspectives. The spatial configuration of these TNE quantities exhibit interesting symmetry, which aids in understanding the way and extent to which fluid unit deviating from equilibrium state. Theoretically, viscosity influences these TNE quantities by affecting the transport coefficient and gradients of macroscopic quantity. Meanwhile, the viscosity increases the entropy production rate originating from the non-organized momentum flux mainly through amplifying the transport coefficient, and enhances the entropy production rate contributed by the non-organized energy flux by rasing the temperature gradient. These multi-perspective results collectively provide a relatively comprehensive depiction of the SBI.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16692v1",
        "http://arxiv.org/pdf/2303.16692v2"
    ],
    "publication_venue": null
}