{
    "arxiv_id": "2303.13584",
    "paper_title": "The clumpy structure of $ε$ Eridani's debris disc revisited by ALMA",
    "authors": [
        "Mark Booth",
        "Tim D. Pearce",
        "Alexander V. Krivov",
        "Mark C. Wyatt",
        "William R. F. Dent",
        "Antonio S. Hales",
        "Jean-François Lestrade",
        "Fernando Cruz-Sáenz de Miera",
        "Virginie C. Faramaz",
        "Torsten Löhne",
        "Miguel Chavez-Dagostino"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
    ],
    "abstract": "$ε$ Eridani is the closest star to our Sun known to host a debris disc. Prior observations in the (sub-)millimetre regime have potentially detected clumpy structure in the disc and attributed this to interactions with an (as yet) undetected planet. However, the prior observations were unable to distinguish between structure in the disc and background confusion. Here we present the first ALMA image of the entire disc, which has a resolution of 1.6\"$\\times$1.2\". We clearly detect the star, the main belt and two point sources. The resolution and sensitivity of this data allow us to clearly distinguish background galaxies (that show up as point sources) from the disc emission. We show that the two point sources are consistent with background galaxies. After taking account of these, we find that resolved residuals are still present in the main belt, including two clumps with a $>3σ$ significance -- one to the east of the star and the other to the northwest. We perform $n$-body simulations to demonstrate that a migrating planet can form structures similar to those observed by trapping planetesimals in resonances. We find that the observed features can be reproduced by a migrating planet trapping planetesimals in the 2:1 mean motion resonance and the symmetry of the most prominent clumps means that the planet should have a position angle of either ${\\sim10^\\circ}$ or ${\\sim190^\\circ}$. Observations over multiple epochs are necessary to test whether the observed features rotate around the star.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13584v1"
    ],
    "publication_venue": "16 pages, 10 figures, accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad938"
}