{
    "arxiv_id": "2303.14616",
    "paper_title": "The Wave Energy Density and Growth Rate for the Resonant Instability in Relativistic Plasmas",
    "authors": [
        "Seong-Yeop Jeong",
        "Clare Watt"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "physics.space-ph"
    ],
    "abstract": "The wave instability acts in astrophysical plasmas to redistribute energy and momentum in the absence of frequent collisions. There are many different types of waves, and it is important to quantify the wave energy density and growth rate for understanding what type of wave instabilities are possible in different plasma regimes. There are many situations throughout the universe where plasmas contain a significant fraction of relativistic particles. Theoretical estimates for the wave energy density and growth rate are constrained to either field-aligned propagation angles, or non-relativistic considerations. Based on linear theory, we derive the analytic expressions for the energy density and growth rate of an arbitrary resonant wave with an arbitrary propagation angle in relativistic plasmas. For this derivation, we calculate the Hermitian and anti-Hermitian parts of the relativistic-plasma dielectric tensor. We demonstrate that our analytic expression for the wave energy density presents an explicit energy increase of resonant waves in the wavenumber range where the analytic expression for the growth rate is positive (i.e., where a wave instability is driven). For this demonstration, we numerically analyse the loss-cone driven instability, as a specific example, in which the whistler-mode waves scatter relativistic electrons into the loss cone in the radiation belt. Our analytic results further develop the basis for linear theory to better understand the wave instability, and have the potential to combine with quasi-linear theory, which allows to study the time evolution of not only the particle momentum distribution function but also resonant wave properties through an instability.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14616v1"
    ],
    "publication_venue": "accepted in MNRAS",
    "doi": "10.1093/mnras/stad934"
}