{
    "arxiv_id": "2303.12035",
    "paper_title": "Quantum gas-enabled direct mapping of active current density in percolating networks of nanowires",
    "authors": [
        "J. Fekete",
        "T. M. James",
        "R. Shah",
        "A. Gadge",
        "S. Bhumbra",
        "F. Oručević",
        "P. Krüger"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "physics.atom-ph",
        "quant-ph"
    ],
    "abstract": "Electrically percolating networks made of nanowires are amongst the most promising candidates for next generation transparent electrodes. The inherent heterogeneity of the spatial distribution of current in these materials is at the centre of interest for development as it leads to phenomena like re-routing of the percolation pathways or localized self-heating, which may result in irreversible damage. In the absence of an experimental technique that can spatially resolve the current distribution and a nonlinear percolation model suitable to interpret it, one relies on empirical rules and safety factors to engineer these materials. In this paper, we introduce a novel quantum sensing technology as a solution to the long standing problem of imaging active current flow in 2D electrically conductive materials. We report on Bose-Einstein condensate microscopy (BEC-M) achieving the performance and technology levels where investigating the dynamic re-distribution of current pathways in electrically percolating networks becomes feasible. Better measurement and understanding of the networks can have far reaching consequences. We show that the current density characterization, combined with existing thermal imaging methods, will for the first time avoid intermediate assumptions on the link between thermal and conductive properties in these nonlinear networks. This will enable testing and modeling individual junction behaviour and hot spot formation over the network. Investigating reversible and irreversible mechanisms will aid the development of devices with better macroscopic performance and higher stability and reliability.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12035v1"
    ],
    "publication_venue": null
}