{
    "arxiv_id": "2303.15197",
    "paper_title": "Additive manufacturing of solid diffractive optical elements via near index matching",
    "authors": [
        "Reut Kedem Orange",
        "Nadav Opatovski",
        "Dafei Xiao",
        "Boris Ferdman",
        "Onit Alalouf",
        "Sushanta Kumar Pal",
        "Ziyun Wang",
        "Henrik von der Emde",
        "Michael Weber",
        "Steffen J. Sahl",
        "Aleks Ponjavic",
        "Ady Arie",
        "Stefan W. Hell",
        "Yoav Shechtman"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics"
    ],
    "abstract": "Diffractive optical elements (DOEs) have a wide range of applications in optics and photonics, thanks to their capability to perform complex wavefront shaping in a compact form. However, widespread applicability of DOEs is still limited, because existing fabrication methods are cumbersome and expensive. Here, we present a simple and cost-effective fabrication approach for solid, high-performance DOEs. The method is based on conjugating two nearly refractive index-matched solidifiable transparent materials. The index matching allows for extreme scaling up of the elements in the axial dimension, which enables simple fabrication of a template using commercially available 3D printing at tens-of-micrometer resolution. We demonstrated the approach by fabricating and using DOEs serving as microlens arrays, vortex plates, including for highly sensitive applications such as vector beam generation and super-resolution microscopy using MINSTED, and phase-masks for three-dimensional single-molecule localization microscopy. Beyond the advantage of making DOEs widely accessible by drastically simplifying their production, the method also overcomes difficulties faced by existing methods in fabricating highly complex elements, such as high-order vortex plates, and spectrum-encoding phase masks for microscopy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15197v1"
    ],
    "publication_venue": null
}