{
    "arxiv_id": "2303.11799",
    "paper_title": "Investigation of a small X-ray flaring event in NLS1 galaxy NGC 4051",
    "authors": [
        "Neeraj Kumari",
        "Arghajit Jana",
        "Sachindra Naik",
        "Prantik Nandi"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
    ],
    "abstract": "We performed a detailed broadband spectral and timing analysis of a small flaring event of ~120 ks in a narrow-line Seyfert 1 galaxy NGC 4051 using simultaneous XMM-Newton and NuSTAR observations. The ~300 ks long NuSTAR observation and the overlapping XMM-Newton exposure were segregated into pre-flare, flare, and post-flare segments. During the flare, the NuSTAR count rate peaked at 2.5 times the mean count rate before the flare. Using various physical and phenomenological models, we examined the 0.3-50 keV X-ray spectrum, which consists of a primary continuum, reprocessed emission, warm absorber and ultra-fast outflows in different timescales. The mass of the central black hole is estimated to be >1.32*10^5 solar mass from the spectral analysis. The absence of correlation between flux in 6-7 keV and 10-50 keV bands suggests different origins of the iron emission line and the Compton hump. From the spectral analysis, we found that the reflection fraction drops significantly during the flare, accompanied by an increase in the coronal height above the disc. The spectrum became soft during the flare supporting the \"softer when brighter\" nature of the source. After the alleviation of the flare, the coronal height drops and the corona heats up. This indicates that there could be inflation of the corona during the flare. We found no significant change in the inner accretion disc or the seed photon temperature. These results suggest that the flaring event occurred due to the change in the coronal properties rather than any notable change in the accretion disc.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11799v1"
    ],
    "publication_venue": "14 pages, 14 figures, Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad867"
}