{
    "arxiv_id": "2303.17534",
    "paper_title": "The cosmic Galois group, the sunrise Feynman integral, and the relative completion of $Γ_1(6)$",
    "authors": [
        "Matija Tapušković"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "math.AG",
        "math-ph",
        "math.NT"
    ],
    "abstract": "In the first part of this paper we study the coaction dual to the action of the cosmic Galois group on the motivic lift of the sunrise Feynman integral with generic masses and momenta, and we express its conjugates in terms of motivic lifts of Feynman integrals associated to related Feynman graphs. Only one of the conjugates of the motivic lift of the sunrise, other than itself, can be expressed in terms of motivic lifts of Feynman integrals of subquotient graphs. To relate the remaining conjugates to Feynman integrals we introduce a general tool: subdiving edges of a graph. We show that all motivic lifts of Feynman integrals associated to graphs obtained by subdividing edges from a graph $G$ are motivic periods of $G$ itself. This was conjectured by Brown in the case of graphs with no kinematic dependence. We also look at the single-valued periods associated to the functions on the motivic Galois group, i.e. the `de Rham periods', which appear in the coaction on the sunrise, and show that they are generalisations of Brown's non-holomorphic modular forms with two weights. In the second part of the paper we consider the relative completion of the torsor of paths on a modular curve and its periods, the theory of which is due to Brown and Hain. Brown studied the motivic periods of the relative completion of $\\mathcal{M}_{1,1}$ with respect to the tangential base-point at infinity, and we generalise this to the case of the torsor of paths on any modular curve. We apply this to reprove the claim that the sunrise Feynman integral in the equal-mass case can be expressed in terms of Eichler integrals, periods of the underlying elliptic curve defined by one of the associated graph hypersurfaces, and powers of $2πi$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17534v1"
    ],
    "publication_venue": null
}