{
    "arxiv_id": "2303.10191",
    "paper_title": "Unsupervised Domain Transfer with Conditional Invertible Neural Networks",
    "authors": [
        "Kris K. Dreher",
        "Leonardo Ayala",
        "Melanie Schellenberg",
        "Marco Hübner",
        "Jan-Hinrich Nölke",
        "Tim J. Adler",
        "Silvia Seidlitz",
        "Jan Sellner",
        "Alexander Studier-Fischer",
        "Janek Gröhl",
        "Felix Nickel",
        "Ullrich Köthe",
        "Alexander Seitel",
        "Lena Maier-Hein"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2024-01-17"
    ],
    "latest_version": 1,
    "categories": [
        "eess.IV",
        "cs.CV",
        "cs.LG"
    ],
    "abstract": "Synthetic medical image generation has evolved as a key technique for neural network training and validation. A core challenge, however, remains in the domain gap between simulations and real data. While deep learning-based domain transfer using Cycle Generative Adversarial Networks and similar architectures has led to substantial progress in the field, there are use cases in which state-of-the-art approaches still fail to generate training images that produce convincing results on relevant downstream tasks. Here, we address this issue with a domain transfer approach based on conditional invertible neural networks (cINNs). As a particular advantage, our method inherently guarantees cycle consistency through its invertible architecture, and network training can efficiently be conducted with maximum likelihood training. To showcase our method's generic applicability, we apply it to two spectral imaging modalities at different scales, namely hyperspectral imaging (pixel-level) and photoacoustic tomography (image-level). According to comprehensive experiments, our method enables the generation of realistic spectral data and outperforms the state of the art on two downstream classification tasks (binary and multi-class). cINN-based domain transfer could thus evolve as an important method for realistic synthetic data generation in the field of spectral imaging and beyond.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10191v1"
    ],
    "publication_venue": null,
    "doi": "10.1007/978-3-031-43907-0_73"
}