{
    "arxiv_id": "2303.17731",
    "paper_title": "$β^{4}$-IRT: A New $β^{3}$-IRT with Enhanced Discrimination Estimation",
    "authors": [
        "Manuel Ferreira-Junior",
        "Jessica T. S. Reinaldo",
        "Telmo M. Silva Filho",
        "Eufrasio A. Lima Neto",
        "Ricardo B. C. Prudencio"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "stat.ML"
    ],
    "abstract": "Item response theory aims to estimate respondent's latent skills from their responses in tests composed of items with different levels of difficulty. Several models of item response theory have been proposed for different types of tasks, such as binary or probabilistic responses, response time, multiple responses, among others. In this paper, we propose a new version of $β^3$-IRT, called $β^{4}$-IRT, which uses the gradient descent method to estimate the model parameters. In $β^3$-IRT, abilities and difficulties are bounded, thus we employ link functions in order to turn $β^{4}$-IRT into an unconstrained gradient descent process. The original $β^3$-IRT had a symmetry problem, meaning that, if an item was initialised with a discrimination value with the wrong sign, e.g. negative when the actual discrimination should be positive, the fitting process could be unable to recover the correct discrimination and difficulty values for the item. In order to tackle this limitation, we modelled the discrimination parameter as the product of two new parameters, one corresponding to the sign and the second associated to the magnitude. We also proposed sensible priors for all parameters. We performed experiments to compare $β^{4}$-IRT and $β^3$-IRT regarding parameter recovery and our new version outperformed the original $β^3$-IRT. Finally, we made $β^{4}$-IRT publicly available as a Python package, along with the implementation of $β^3$-IRT used in our experiments.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17731v1"
    ],
    "publication_venue": null
}