{
    "arxiv_id": "2303.10661",
    "paper_title": "Cosmological constraints with the linear point from the BOSS survey",
    "authors": [
        "Mengfan He",
        "Cheng Zhao",
        "Huanyuan Shan"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-08-02"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "The {\\it Linear Point} (LP), defined as the midpoint between the BAO peak and the associated left dip of the two-point correlation function (2PCF), $ξ(s)$, is proposed as a new standard ruler which is insensitive to nonlinear effects. In this paper, we use a Bayesian sampler to measure the LP and estimate the corresponding statistical uncertainty, and then perform cosmological parameter constraints with LP measurements. Using the Patchy mock catalogues, we find that the measured LPs are consistent with theoretical predictions at 0.6 per cent level. We find constraints with midpoints identified from the rescaled 2PCF ($s^2 ξ$) more robust than those from the traditional LP based on $ξ$, as the BAO peak is not always prominent when scanning the cosmological parameter space, with the cost of 2--4 per cent increase of statistical uncertainty. This problem can also be solved by an additional dataset that provides strong parameter constraints. Measuring LP from the reconstructed data slightly increases the systematic error but significantly reduces the statistical error, resulting in more accurate measurements. The 1$\\,σ$ confidence interval of distance scale constraints from LP measurements are 20--30 per cent larger than those of the corresponding BAO measurements. For the reconstructed SDSS DR12 data, the constraints on $H_0$ and $Ω_{\\rm m}$ in a flat-$Λ$CDM framework with the LP are generally consistent with those from BAO. When combined with Planck cosmic microwave background data, we obtain $H_0=68.02_{-0.37}^{+0.36}$ ${\\rm km}\\,{\\rm s}^{-1}\\,{\\rm Mpc}^{-1}$ and $Ω_{\\rm m}=0.3055_{-0.0048}^{+0.0049}$ with the LP.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10661v1"
    ],
    "publication_venue": "13 pages, 12 figures, submitted to MNRAS",
    "doi": "10.1093/mnras/stad2207"
}