{
    "arxiv_id": "2303.12867",
    "paper_title": "Maximum tolerable excess noise in CV-QKD and improved lower bound on two-way capacities",
    "authors": [
        "Francesco Anna Mele",
        "Ludovico Lami",
        "Vittorio Giovannetti"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-05-05"
    ],
    "latest_version": 3,
    "categories": [
        "quant-ph"
    ],
    "abstract": "The two-way capacities of quantum channels determine the ultimate entanglement and secret-key distribution rates achievable by two distant parties that are connected by a noisy transmission line, in absence of quantum repeaters. Since repeaters will likely be expensive to build and maintain, a central open problem of quantum communication is to understand what performances are achievable without them. In this paper, we find a new lower bound on the energy-constrained and unconstrained two-way quantum and secret-key capacities of all phase-insensitive bosonic Gaussian channels, namely thermal attenuator, thermal amplifier, and additive Gaussian noise, which are realistic models for the noise affecting optical fibres or free-space links. Ours is the first nonzero lower bound on the two-way quantum capacity in the parameter range where the (reverse) coherent information becomes negative, and it shows explicitly that entanglement distribution is always possible when the channel is not entanglement breaking. This completely solves a crucial open problem of the field, namely, establishing the maximum excess noise which is tolerable in continuous-variable quantum key distribution. In addition, our construction is fully explicit, i.e. we devise and optimise a concrete entanglement distribution and distillation protocol that works by combining recurrence and hashing protocols",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12867v1",
        "http://arxiv.org/pdf/2303.12867v2",
        "http://arxiv.org/pdf/2303.12867v3"
    ],
    "publication_venue": "51 pages, 12 figures"
}