{
    "arxiv_id": "2303.15921",
    "paper_title": "Pole-skipping of gravitational waves in the backgrounds of four-dimensional massive black holes",
    "authors": [
        "Sašo Grozdanov",
        "Mile Vrbica"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2024-05-02"
    ],
    "latest_version": 2,
    "categories": [
        "hep-th",
        "gr-qc",
        "math-ph"
    ],
    "abstract": "Pole-skipping is a property of gravitational waves dictated by their behaviour at horizons of black holes. It stems from the inability to unambiguously impose ingoing boundary conditions at the horizon at an infinite discrete set of Fourier modes. The phenomenon has been best understood, when such a description exists, in terms of dual holographic (AdS/CFT) correlation function that take the value of '0/0' at these special points. In this work, we investigate details of pole-skipping purely from the point of view of classical gravity in 4d massive black hole geometries with flat, spherical and hyperbolic horizons, and with an arbitrary cosmological constant. We show that pole-skipping points naturally fall into two categories: the algebraically special points and a set of pole-skipping points that is common to the even and odd channels of perturbations. Our analysis utilises and generalises (to arbitrary maximally symmetric horizon topology and cosmological constant) the 'integrable' structure of the Darboux transformations, which relate the master field equations that describe the evolution of gravitational perturbations in the two channels. Finally, we provide new insights into a number of special cases: spherical black holes, asymptotically Anti-de Sitter black branes and pole-skipping at the cosmological horizon in de Sitter space.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15921v1",
        "http://arxiv.org/pdf/2303.15921v2"
    ],
    "publication_venue": "v1: 37 pages, 4 figures",
    "doi": "10.1140/epjc/s10052-023-12273-5"
}