{
    "arxiv_id": "2303.17737",
    "paper_title": "Comparative Density Functional Theory Study of Magnetic Exchange Coupling in Di-nuclear Transition Metal Complexes",
    "authors": [
        "Henry C. Fitzhugh",
        "James W. Furness",
        "Mark R. Pederson",
        "Juan E. Peralta",
        "Jianwei Sun"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Multi-center transition metal complexes (MCTMs) with magnetically interacting ions have been proposed as components for information processing devices and storage units. For any practical application of MCTMs as magnetic units, it is crucial to characterize their magnetic behavior, and in particular the isotropic magnetic exchange coupling, J, between its magnetic centers. Due to the large size of typical MCTMs, density functional theory (DFT) is the only practical electronic structure method for evaluating the J coupling. Here we assess the accuracy of different density functional approximations for predicting the magnetic couplings of seven di-metal transition metal complexes with known reliable experimental J couplings spanning from ferromagnetic to strong antiferromagnetic. The density functionals considered include global hybrid functionals which mix semilocal density functional approximations and exact exchange with a fixed admixing parameter, six local hybrid functionals where the admixing parameters are extended to be spatially dependent, the SCAN and r$^2$SCAN meta-generalized gradient approximations (GGAs), and two widely used GGAs. We found that global hybrids have a tendency to over-correct the error in magnetic coupling parameters from the Perdew-Burke-Ernzerhof (PBE) GGA, while the performance of local hybrid density functionals is scattered without a clear trend, suggesting that more efforts are needed for the extension from global to local hybrid density functionals for this particular property. The SCAN and r$^2$SCAN meta-GGAs are found to perform as well or better than the global and local hybrids on most tested complexes. We further analyze the charge density redistribution of meta-GGAs as well as global and local hybrid density functionals with respect to that of PBE, in connection to the self-interaction error (SIE) or delocalization error.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17737v1"
    ],
    "publication_venue": null
}