{
    "arxiv_id": "2303.08830",
    "paper_title": "The Empirical Limits of Gyrochronology",
    "authors": [
        "Luke G. Bouma",
        "Elsa K. Palumbo",
        "Lynne A. Hillenbrand"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-04-19"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
    ],
    "abstract": "The promise of gyrochronology is that given a star's rotation period and mass, its age can be inferred. The reality of gyrochronology is complicated by effects other than ordinary magnetized braking that alter stellar rotation periods. In this work, we present an interpolation-based gyrochronology framework that reproduces the time- and mass-dependent spin-down rates implied by the latest open cluster data, while also matching the rate at which the dispersion in initial stellar rotation periods decreases as stars age. We validate our technique for stars with temperatures of 3800-6200 K and ages of 0.08-2.6 gigayears (Gyr), and use it to reexamine the empirical limits of gyrochronology. In line with previous work, we find that the uncertainty floor varies strongly with both stellar mass and age. For Sun-like stars (5800 K), the statistical age uncertainties improve monotonically from $\\pm$38% at 0.2 Gyr to $\\pm12$% at 2 Gyr, and are caused by the empirical scatter of the cluster rotation sequences combined with the rate of stellar spin-down. For low-mass K-dwarfs (4200 K), the posteriors are highly asymmetric due to stalled spin-down, and $\\pm$1$σ$ age uncertainties vary non-monotonically between 10% and 50% over the first few gigayears. High-mass K-dwarfs (5000 K) older than 1.5 Gyr yield the most precise ages, with limiting uncertainties currently set by possible changes in the spin-down rate (12% systematic), the calibration of the absolute age scale (8% systematic), and the width of the slow sequence (4% statistical). An open-source implementation, called gyro-interp, is available online at https://github.com/lgbouma/gyro-interp",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08830v1"
    ],
    "publication_venue": "ApJL accepted. Data behind Fig1 are uploaded. Code documentation is at https://gyro-interp.readthedocs.io/",
    "doi": "10.3847/2041-8213/acc589"
}