{
    "arxiv_id": "2303.16849",
    "paper_title": "Dwarf Galaxy Discoveries from the KMTNet Supernova Program III. the Milky-Way Analog NGC~2997 Group",
    "authors": [
        "Tony Junjing Fan",
        "Dae-Sik Moon",
        "Hong Soo Park",
        "Dennis Zaritsky",
        "Sang Chul Kim",
        "Youngdae Lee",
        "Ting S. Li",
        "Yuan Qi Ni",
        "Jeehye Shin",
        "Sang-Mok Cha",
        "Yongseok Lee"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present the discovery of 48 new and the analysis of 55, including 7 previously discovered, dwarf galaxy candidates around the giant spiral galaxy NGC~2997 using deep $BVI$ images from the KMTNet Supernova Program. Their $V$-band central surface brightness and total absolute magnitudes range between 20.3--26.7 mag arcsec$^{-2}$ and --(8.02--17.69) mag, respectively, while the $I$-band effective radii are between 0.14 and 2.97 kpc. We obtain $α$ $\\simeq$ --1.43 $\\pm$ 0.02 for the faint-end slope of their luminosity function, comparable to previously measured values but shallower than theoretical predictions based on $Λ$CDM models. The distance-independent distributions of their mass and color from the host galaxy NGC~2997 suggest that the group could be dynamically young, prior to the development of significant mass segregation or radial color gradients. The systematically bluer colors of the brighter candidates than the fainter ones indicate higher star formation activities in brighter members. We suggest that the higher-mass dwarf galaxies in the group have maintained star-formation activities by effectively retaining gas content, while environmental quenching is only effective for the lower-mass galaxies. The interpretation of early evolutionary stage of this group is also consistent with the overall morphological distribution of the dwarf galaxy candidates showing a lack of morphologically evolved candidates but a plethora of irregularly shaped ones. Our detection rate of dwarf galaxy candidates in the NGC~2997 group and their inferred star formation activities are largely comparable to those found in Milky Way analog systems from the SAGA survey within the magnitude limit M$_{V}$ $\\lesssim$ --13 mag, as well as those found in the ELVES survey.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16849v1"
    ],
    "publication_venue": null
}