{
    "arxiv_id": "2303.13979",
    "paper_title": "Exclusive diffractive bremsstrahlung of one and two photons at forward rapidities: possibilities for experimental studies in $pp$ collisions at the LHC",
    "authors": [
        "Piotr Lebiedowicz",
        "Otto Nachtmann",
        "Antoni Szczurek"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph",
        "hep-ex"
    ],
    "abstract": "We evaluate the cross section for diffractive bremsstrahlung of a single photon in the $pp \\to pp γ$ reaction at high energies and at forward photon rapidities. Several differential distributions, for instance, in ${\\rm y}$, $k_{\\perp}$ and $ω$, the rapidity, the absolute value of the transverse momentum, and the energy of the photon, respectively, are presented. We compare the results for our ``exact'' model with two versions of soft-photon-approximations, SPA1 and SPA2, where the radiative amplitudes contain only the leading terms proportional to $ω^{-1}$. The SPA1, which does not have the correct energy-momentum relations, performs surprisingly well in the kinematic range considered. We discuss also azimuthal correlations between outgoing particles. The azimuthal distributions are not isotropic and are different for our exact model and SPAs. We discuss also the possibility of a measurement of two-photon-bremsstrahlung in the $pp \\to pp γγ$ reaction. In our calculations we impose a cut on the relative energy loss ($0.02 < ξ_{i} < 0.1$, $i = 1,2$) of the protons where measurements by the ATLAS Forward Proton (AFP) detectors are possible. The AFP requirement for both diffractively scattered protons and one forward photon (measured at LHCf) reduces the cross section for $p p \\to p p γ$ almost to zero. On the other hand, much less cross-section reduction occurs for $pp \\to pp γγ$ when photons are emitted in opposite sides of the ATLAS interaction point and can be measured by two different arms of LHCf. For the SPA1 ansatz we find $σ(pp \\to pp γγ) \\simeq 0.03$ nb at $\\sqrt{s} = 13$ TeV and with the cuts $0.02 < ξ_{i} < 0.1$, $8.5 < {\\rm y}_{3} < 9$, $-9 < {\\rm y}_{4}< -8.5$. Our predictions can be verified by ATLAS and LHCf combined experiments.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13979v1"
    ],
    "publication_venue": "16 pages, 8 figures"
}