{
    "arxiv_id": "2303.12016",
    "paper_title": "Automatic evaluation of herding behavior in towed fishing gear using end-to-end training of CNN and attention-based networks",
    "authors": [
        "Orri Steinn Guðfinnsson",
        "Týr Vilhjálmsson",
        "Martin Eineborg",
        "Torfi Thorhallsson"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV"
    ],
    "abstract": "This paper considers the automatic classification of herding behavior in the cluttered low-visibility environment that typically surrounds towed fishing gear. The paper compares three convolutional and attention-based deep action recognition network architectures trained end-to-end on a small set of video sequences captured by a remotely controlled camera and classified by an expert in fishing technology. The sequences depict a scene in front of a fishing trawl where the conventional herding mechanism has been replaced by directed laser light. The goal is to detect the presence of a fish in the sequence and classify whether or not the fish reacts to the lasers. A two-stream CNN model, a CNN-transformer hybrid, and a pure transformer model were trained end-to-end to achieve 63%, 54%, and 60% 10-fold classification accuracy on the three-class task when compared to the human expert. Inspection of the activation maps learned by the three networks raises questions about the attributes of the sequences the models may be learning, specifically whether changes in viewpoint introduced by human camera operators that affect the position of laser lines in the video frames may interfere with the classification. This underlines the importance of careful experimental design when capturing scientific data for automatic end-to-end evaluation and the usefulness of inspecting the trained models.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12016v1"
    ],
    "publication_venue": "15 pages, 10 figures. To appear in Proceedings of the 5th Workshop on Computer Vision for Analysis of Underwater Imagery (CVAUI) 2022, published as part of the CVPR 2022 Proceedings"
}