{
    "arxiv_id": "2303.16498",
    "paper_title": "Effect of shatterproof polymer film application on the fracture types and strength of glass subject to bending load",
    "authors": [
        "Tomohisa Kojima",
        "Ryohei Momokawa",
        "Takuma Matsuo",
        "Mitsuo Notomi"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.app-ph"
    ],
    "abstract": "Shatterproof polymer films are widely for windows used because they can be easily installed on existing glass windows to improve safety. Applying them to glass plates has been reported to not only prevent fragments from scattering but also increase load-bearing capacity and penetration resistance. However, the clarification of their mechanism and quantitative evaluation are still insufficient because the effect of film application on the strength and failure mode of glass under quasi-static loading has not been investigated. In this study, three-point bending tests and fracture surface observations were conducted on a float glass with a shatterproof polymer film. The stress field formed inside the glass was visualised during the tests using the photoelastic method. By varying the support span of the specimen, the deformation mode was varied to generate three types of failures: bending, shear caused by Hertzian contact stress, and mixed-mode failures. Under the conditions in the present study, the breaking loads of the specimens with and without film were almost the same; however, the fracture surface observation indicated that the area subjected to shear failure caused by Hertzian contact stress was larger with film application. Finally, the effect of the film thickness on the breaking load due to bending deformation was theoretically predicted.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16498v1"
    ],
    "publication_venue": "In press",
    "doi": "10.1016/j.engfailanal.2023.107220"
}