{
    "arxiv_id": "2303.14328",
    "paper_title": "Optimizing Sepsis Care through Heuristics Methods in Process Mining: A Trajectory Analysis",
    "authors": [
        "Alireza Bakhshi",
        "Erfan Hassannayebi",
        "Amir Hossein Sadeghi"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CY",
        "eess.SY"
    ],
    "abstract": "Process mining can help acquire insightful knowledge and heighten the system's performance. In this study, we surveyed the trajectories of 1050 sepsis patients in a regional hospital in the Netherlands from the registration to the discharge phase. Based on this real-world case study, the event log comprises events and activities related to the emergency ward, admission to hospital wards, and discharge enriched with data from lab experiments and triage checklists. At first, we aim to discover this process through Heuristics Miner (HM) and Inductive Miner (IM) methods. Then, we analyze a systematic process model based on organizational information and knowledge. Besides, we address conformance checking given medical guidelines for these patients and monitor the related flows on the systematic process model. The results show that HM and IM are inadequate in identifying the relevant process. However, using a systematic process model based on expert knowledge and organizational information resulted in an average fitness of 97.8%, a simplicity of 77.7%, and a generalization of 80.2%. The analyses demonstrate that process mining can shed light on the patient flow in the hospital and inspect the day-to-day clinical performance versus medical guidelines. Also, the process models obtained by the HM and IM methods cannot provide a concrete comprehension of the process structure for stakeholders compared to the systematic process model. The implications of our findings include the potential for process mining to improve the quality of healthcare services, optimize resource allocation, and reduce costs. Our study also highlights the importance of considering expert knowledge and organizational information in developing effective process models.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14328v1"
    ],
    "publication_venue": "22 pages, 6 figures, 1 table"
}