{
    "arxiv_id": "2303.10163",
    "paper_title": "Anatomy of plasmons in generic Luttinger semimetals",
    "authors": [
        "Jing Wang",
        "Ipsita Mandal"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-10-12"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.str-el",
        "cond-mat.mes-hall"
    ],
    "abstract": "We investigate the parameter regimes favourable for the emergence of plasmons in isotropic, anisotropic, and band-mass symmetric and asymmetric Luttinger semimetals (LSMs). An LSM harbours a quadratic band-crossing point (QBCP) in its bandstructure, where the upper and lower branches of dispersion are doubly degenerate. While a nonzero temperature ($T$) can excite particle-hole pairs about the Fermi level due to thermal effects (even at zero doping), a finite doping ($μ$) sets the Fermi level away from the QBCP at any $T$, leading to a finite Fermi surface (rather than a Fermi point). Both these conditions naturally give rise to a finite density of states. A nonzero value of $T$ or $μ$ is thus a necessary condition for a plasmon to exist, as otherwise the zero density of states at the QBCP can never lead to the appearance of this collective mode. In addition to $T$ and $μ$, we consider the effects of all possible parameters like cubic anisotropy, band-mass asymmetry, and a material-dependent variable $X$ that is proportional to the mass (of the quasiparticle) and the number of fermion flavours. We implement a random-phase-approximation to compute the quasiparticle decay rate $ τ^{-1} $ (also known as the the inelastic scattering rate) resulting from screened Coulomb interactions. A well-defined sharp peak in the profile of $τ^{-1}$ signals the appearance of a plasmon. From our results, we conclude that $X$ turns out to be a crucial tuning parameter, as higher values of $X$ assist in the emergence of plasmons. On the other hand, the features are broadly insensitive to cubic anisotropy and band-mass asymmetry.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10163v1",
        "http://arxiv.org/pdf/2303.10163v2"
    ],
    "publication_venue": "journal version to appear in EPJ B",
    "doi": "10.1140/epjb/s10051-023-00596-x"
}