{
    "arxiv_id": "2303.09208",
    "paper_title": "Exact results of dynamical structure factor of Lieb-Liniger model",
    "authors": [
        "Run-Tian Li",
        "Song Cheng",
        "Yang-Yang Chen",
        "Xi-Wen Guan"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-08-15"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.quant-gas"
    ],
    "abstract": "The dynamical structure factor (DSF) represents a measure of dynamical density-density correlations in a quantum many-body system. Due to the complexity of many-body correlations and quantum fluctuations in a system of an infinitely large Hilbert space, such kind of dynamical correlations often impose a big theoretical challenge. For one dimensional (1D) quantum many-body systems, qualitative predictions of dynamical response functions are usually carried out by using the Tomonaga-Luttinger liquid (TLL) theory. In this scenario, a precise evaluation of the DSF for a 1D quantum system with arbitrary interaction strength remains a formidable task. In this paper, we use the form factor approach based on algebraic Bethe ansatz theory to calculate precisely the DSF of Lieb-Liniger model with an arbitrary interaction strength at a large scale of particle number. We find that the DSF for a system as large as 2000 particles enables us to depict precisely its line-shape from which the power-law singularity with corresponding exponents in the vicinities of spectral thresholds naturally emerge. It should be noted that, the advantage of our algorithm promises an access to the threshold behavior of dynamical correlation functions, further confirming the validity of nonlinear TLL theory besides Kitanine et. al. 2012 J. Stat. Mech. P09001. Finally we discuss a comparison of results with the results from the ABACUS method by J.-S. Caux 2009 J. Math. Phys. 50 095214 as well as from the strongly coupling expansion by Brand and Cherny 2005 Phys. Rev. A 72 033619.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09208v1"
    ],
    "publication_venue": "20 pages, 5 figures",
    "doi": "10.1088/1751-8121/ace80f"
}