{
    "arxiv_id": "2303.15026",
    "paper_title": "Probing Complex-energy Topology via Non-Hermitian Absorption Spectroscopy in a Trapped Ion Simulator",
    "authors": [
        "Mingming Cao",
        "Kai Li",
        "Wending Zhao",
        "Weixuan Guo",
        "Bingxiag Qi",
        "Xiuying Chang",
        "Zichao Zhou",
        "Yong Xu",
        "Luming Duan"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-04-28"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "cond-mat.mes-hall",
        "cond-mat.quant-gas"
    ],
    "abstract": "Non-Hermitian systems generically have complex energies, which may host topological structures, such as links or knots. While there has been great progress in experimentally engineering non-Hermitian models in quantum simulators, it remains a significant challenge to experimentally probe complex energies in these systems, thereby making it difficult to directly diagnose complex-energy topology. Here, we experimentally realize a two-band non-Hermitian model with a single trapped ion whose complex eigenenergies exhibit the unlink, unknot or Hopf link topological structures. Based on non-Hermitian absorption spectroscopy, we couple one system level to an auxiliary level through a laser beam and then experimentally measure the population of the ion on the auxiliary level after a long period of time. Complex eigenenergies are then extracted, illustrating the unlink, unknot or Hopf link topological structure. Our work demonstrates that complex energies can be experimentally measured in quantum simulators via non-Hermitian absorption spectroscopy, thereby opening the door for exploring various complex-energy properties in non-Hermitian quantum systems, such as trapped ions, cold atoms, superconducting circuits or solid-state spin systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15026v1"
    ],
    "publication_venue": "12 pages, 8 figures",
    "doi": "10.1103/PhysRevLett.130.163001"
}