{
    "arxiv_id": "2303.09394",
    "paper_title": "Dynamics of Voltage Driven Self-Sustained Oscillations in NdNiO$_3$ Neuristors",
    "authors": [
        "Upanya Khandelwal",
        "Qikai Guo",
        "Beatriz Noheda",
        "Pavan Nukala",
        "Saurabh Chandorkar"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Active memristor elements, also called neuristors, are self-oscillating devices that are very good approximations to biological neuronal functionality and are crucial to the development of low-power neuromorphic hardware. Materials that show conduction mechanisms that depend superlinearly with temperature can lead to negative differential resistance (NDR) regimes, which may further be engineered as self-oscillators. Thermal runaway, insulator to metal phase transitions (IMT) can lead to such superlinearity and are being extensively studied in systems such as TaO$_x$, NbO$_x$ and VO$_2$. However, ReNiO$_3$ systems that offer large tunability in metal-insulator transition temperatures are less explored so far. Here we demonstrate all-or-nothing neuron-like self-oscillations at MHz frequency and low temperatures on thin films of NdNiO$_3$, a model charge transfer insulator, and their frequency coding behavior. We study the temperature dependence of NDR and show that it vanishes even at temperatures below the IMT temperature. We also show that the threshold voltages scale with device size and that a simple electrothermal device model captures all these salient features. In contrast to existing models, our model correctly predicts the independence of oscillation amplitude with the applied voltage, offering crucial insights about the nature of fixed points in the NDR region, and the dynamics of non-linear oscillations about them. KEYWORDS: NDR, oscillations, thermal model.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09394v1"
    ],
    "publication_venue": "4 figures in the manuscript and 3 in Supplementary"
}