{
    "arxiv_id": "2303.17070",
    "paper_title": "Towards Quantitative Analysis of Deuterium Absorption in Ferrite and Austenite during Electrochemical Charging by Comparing Cyclic Voltammetry and Cryogenic Transfer Atom Probe Tomography",
    "authors": [
        "Dallin J. Barton",
        "Dan-Thien Nguyen",
        "Daniel E. Perea",
        "Kelsey A. Stoerzinger",
        "Reyna Morales Lumagui",
        "Sten V. Lambeets",
        "Mark G. Wirth",
        "Arun Devaraj"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Hydrogen embrittlement mechanisms of steels have been studied for several decades. Understanding hydrogen diffusion behavior in steels is crucial towards both developing predictive models for hydrogen embrittlement and identifying mitigation strategies. However, because hydrogen has a low atomic mass, it is extremely challenging to detect by most analytical methods. In recent years, cryogenic-transfer atom probe tomography (APT) of electrochemically-deuterium-charged steels has provided invaluable qualitative analysis of nanoscale deuterium traps such as carbides, dislocations, grain boundaries and interfaces between ferrite and cementite. Independently, cyclic voltammetry (CV) has provided valuable analysis of bulk hydrogen diffusion in steels. In this work, we use a combination of CV and cryogenic-transfer APT for quantitative analysis of deuterium pickup in electrolytically charged pure Fe (ferrite) and a model austenitic Fe18Cr14Ni alloy without any second phase or defect trap sites. The high solubility and low diffusivity of hydrogen in austenite versus ferrite are highlighted to result in clear observable signatures in CV and cryogenic-transfer APT results. The remaining challenges and pathway for enabling quantitative analysis of hydrogen pick up in steels is also discussed.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17070v1"
    ],
    "publication_venue": null
}