{
    "arxiv_id": "2303.15503",
    "paper_title": "Wind-Fed GRMHD Simulations of Sagittarius A*: Tilt and Alignment of Jets and Accretion Discs, Electron Thermodynamics, and Multi-Scale Modeling of the Rotation Measure",
    "authors": [
        "Sean M. Ressler",
        "Christopher J. White",
        "Eliot Quataert"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Wind-fed models offer a unique way to form predictive models of the accretion flow surrounding Sagittarius A*. We present 3D, wind-fed MHD and GRMHD simulations spanning the entire dynamic range of accretion from parsec scales to the event horizon. We expand on previous work by including nonzero black hole spin and dynamically evolved electron thermodynamics. Initial conditions for these simulations are generated from simulations of the observed Wolf-Rayet stellar winds in the Galactic Centre. The resulting flow tends to be highly magnetized ($β\\approx 2$) with an $\\sim$ $r^{-1}$ density profile independent of the strength of magnetic fields in the winds. Our simulations reach the MAD state for some, but not all cases. In tilted flows, SANE jets tend to align with the angular momentum of the gas at large scales, even if that direction is perpendicular to the black hole spin axis. Conversely, MAD jets tend to align with the black hole spin axis. The gas angular momentum shows similar behavior: SANE flows tend to only partially align while MAD flows tend to fully align. With a limited number of dynamical free parameters, our models can produce accretion rates, 230 GHz flux, and unresolved linear polarization fractions roughly consistent with observations for several choices of electron heating fraction. Absent another source of large-scale magnetic field, winds with a higher degree of magnetization (e.g., where the magnetic pressure is 1/100 of the ram pressure in the winds) may be required to get a sufficiently large RM with consistent sign.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15503v1"
    ],
    "publication_venue": "Accepted by MNRAS. Animations for several figures in the paper are available at https://www.youtube.com/playlist?list=PL3pLmTeUPcqSd4jVBnRubYQpa-Dma25ir"
}