{
    "arxiv_id": "2303.13699",
    "paper_title": "Minuscule corrections to near-surface solar internal rotation using mode-coupling",
    "authors": [
        "Srijan Bharati Das",
        "Samarth G. Kashyap",
        "Deniz Oktay",
        "Shravan M. Hanasoge",
        "Jeroen Tromp"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-04-26"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "The observed solar oscillation spectrum is influenced by internal perturbations such as flows and structural asphericities. These features induce splitting of characteristic frequencies and distort the resonant-mode eigenfunctions. Global axisymmertric flow -- differential rotation -- is a very prominent perturbation. Tightly constrained rotation profiles as a function of latitude and radius are products of established helioseismic pipelines that use observed Dopplergrams to generate frequency-splitting measurements at high precision. However, the inference of rotation using frequency-splittings do not consider the effect of mode-coupling. This approximation worsens for high-angular-degree modes, as they become increasingly proximal in frequency. Since modes with high angular degrees probe the near-surface layers of the Sun, inversions considering coupled modes could potentially lead to more accurate estimates of rotation very close to the surface. In order to investigate if this is indeed the case, we perform inversions for solar differential rotation, considering coupling of modes for angular degrees $160 \\leq \\ell \\leq 300$ in the surface gravity $f$-branch and first-overtone $p$ modes. In keeping with the character of mode coupling, we carry out a non-linear inversion using an eigenvalue solver. Differences in inverted profiles for frequency splitting measurements from MDI and HMI are compared and discussed. We find that corrections to the near-surface differential rotation profile, when accounting for mode-coupling effects, are smaller than 0.003 nHz and hence are insignificant. These minuscule corrections are found to be correlated with the solar cycle. We also present corrections to even-order splitting coefficients, which could consequently impact inversions for structure and magnetic fields.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13699v1"
    ],
    "publication_venue": "21 pages; 15 figures; Accepted for publication in the Astrophysical Journal Supplement Series",
    "doi": "10.3847/1538-4365/acc796"
}