{
    "arxiv_id": "2303.07938",
    "paper_title": "Controllable Mesh Generation Through Sparse Latent Point Diffusion Models",
    "authors": [
        "Zhaoyang Lyu",
        "Jinyi Wang",
        "Yuwei An",
        "Ya Zhang",
        "Dahua Lin",
        "Bo Dai"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [],
    "latest_version": 1,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Mesh generation is of great value in various applications involving computer\ngraphics and virtual content, yet designing generative models for meshes is\nchallenging due to their irregular data structure and inconsistent topology of\nmeshes in the same category. In this work, we design a novel sparse latent\npoint diffusion model for mesh generation. Our key insight is to regard point\nclouds as an intermediate representation of meshes, and model the distribution\nof point clouds instead. While meshes can be generated from point clouds via\ntechniques like Shape as Points (SAP), the challenges of directly generating\nmeshes can be effectively avoided. To boost the efficiency and controllability\nof our mesh generation method, we propose to further encode point clouds to a\nset of sparse latent points with point-wise semantic meaningful features, where\ntwo DDPMs are trained in the space of sparse latent points to respectively\nmodel the distribution of the latent point positions and features at these\nlatent points. We find that sampling in this latent space is faster than\ndirectly sampling dense point clouds. Moreover, the sparse latent points also\nenable us to explicitly control both the overall structures and local details\nof the generated meshes. Extensive experiments are conducted on the ShapeNet\ndataset, where our proposed sparse latent point diffusion model achieves\nsuperior performance in terms of generation quality and controllability when\ncompared to existing methods.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07938v1"
    ],
    "publication_venue": "Accepted to CVPR 2023. Project page is at https://slide-3d.github.io"
}