{
    "arxiv_id": "2303.11179",
    "paper_title": "Spectroscopic Evidence for Dirac Nodal Surfaces and Nodal Rings in Superconductor NaAlSi",
    "authors": [
        "Chunyao Song",
        "Lei Jin",
        "Pengbo Song",
        "Hongtao Rong",
        "Wenpei Zhu",
        "Bo Liang",
        "Shengtao Cui",
        "Zhe Sun",
        "Lin Zhao",
        "Youguo Shi",
        "Xiaoming Zhang",
        "Guodong Liu",
        "X. J. Zhou"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "cond-mat.supr-con"
    ],
    "abstract": "The discovery of the topological states has become a key topic in condensed matter physics with the focus evolving from the Dirac or Weyl points to high-dimension topological states of the nodal lines and nodal surfaces. For a topological material to manifest its quantum properties and become useful in applications, the topological states need to be genuine and clean so that they lie close to the Fermi level without other trivial bands existing at the Fermi level. While a number of high-dimension topological materials are predicted, only a few of them have been synthesized and confirmed and the genuine and clean ones are especially scarce. Here we report the realization of the genuine clean multiple high-dimension topological states in NaAlSi. By performing high-resolution angle-resolved photoemission measurements and band structure calculations, we have observed two sets of nodal surfaces and the formation of two homocentric nodal ring states in NaAlSi. The observed nodal rings are distinct in that the inner one is a type-{\\uppercase\\expandafter{\\romannumeral1}} nodal ring while the outer one is a type-{\\uppercase\\expandafter{\\romannumeral1}} nodal ring embedded with four type-{\\uppercase\\expandafter{\\romannumeral3}} nodal points. All the bands involved in the nodal rings lie very close to the Fermi level with no other trivial bands coexisting at the Fermi level. These observations make NaAlSi a desirable topological material to explore for novel quantum states and exotic properties.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11179v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevB.105.L161104"
}