{
    "arxiv_id": "2303.13216",
    "paper_title": "A Case Study on AI Engineering Practices: Developing an Autonomous Stock Trading System",
    "authors": [
        "Marcel Grote",
        "Justus Bogner"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2024-09-12"
    ],
    "latest_version": 1,
    "categories": [
        "cs.SE",
        "cs.AI"
    ],
    "abstract": "Today, many systems use artificial intelligence (AI) to solve complex problems. While this often increases system effectiveness, developing a production-ready AI-based system is a difficult task. Thus, solid AI engineering practices are required to ensure the quality of the resulting system and to improve the development process. While several practices have already been proposed for the development of AI-based systems, detailed practical experiences of applying these practices are rare.\n  In this paper, we aim to address this gap by collecting such experiences during a case study, namely the development of an autonomous stock trading system that uses machine learning functionality to invest in stocks. We selected 10 AI engineering practices from the literature and systematically applied them during development, with the goal to collect evidence about their applicability and effectiveness. Using structured field notes, we documented our experiences. Furthermore, we also used field notes to document challenges that occurred during the development, and the solutions we applied to overcome them. Afterwards, we analyzed the collected field notes, and evaluated how each practice improved the development. Lastly, we compared our evidence with existing literature.\n  Most applied practices improved our system, albeit to varying extent, and we were able to overcome all major challenges. The qualitative results provide detailed accounts about 10 AI engineering practices, as well as challenges and solutions associated with such a project. Our experiences therefore enrich the emerging body of evidence in this field, which may be especially helpful for practitioner teams new to AI engineering.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13216v1"
    ],
    "publication_venue": "Accepted for publication at the International Conference on AI Engineering (CAIN) 2023",
    "doi": "10.1109/CAIN58948.2023.00032"
}