{
    "arxiv_id": "2303.15603",
    "paper_title": "Transverse flow under oscillating stimulation in helical square ducts with cochlea-like geometrical curvature and torsion",
    "authors": [
        "Noëlle Harte",
        "Dominik Obrist",
        "Marco Caversaccio",
        "Guillaume P. R. Lajoinie",
        "Wilhelm Wimmer"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn",
        "physics.bio-ph",
        "physics.med-ph"
    ],
    "abstract": "The cochlea is our fluid-filled organ of hearing with a unique spiral shape. The physiological role of this shape remains unclear. Previous research has paid only little attention to the occurrence of transverse flow in the cochlea, in particular in relation to the cochlea's shape. To better understand its influence on fluid dynamics, this study aims to characterize transverse flow due to harmonically oscillating axial flow in square ducts with curvature and torsion, similar to the shape of human cochleae. Four geometries were investigated to study curvature and torsion effects on axial and transverse fluid flow components. Twelve frequencies from 0.125 Hz to 256 Hz were studied, covering infrasound and low-frequency hearing, with mean inlet velocity amplitudes representing levels expected for normal conversations or louder situations. Our simulations show that torsion contributes significantly to transverse flow in unsteady conditions, and that its contribution increases with increasing oscillation frequencies. Curvature has a small effect on transverse flow, which decreases rapidly for increasing frequencies. Strikingly, the combined effect of curvature and torsion on transverse flow is greater than expected from a simple superposition of the two effects, especially when the relative contribution of curvature alone becomes negligible. These findings could be relevant to understand physiological processes in the cochlea, including metabolite transport and wall shear stresses. Further studies are needed to investigate possible implications on cochlear mechanics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15603v1"
    ],
    "publication_venue": "26 pages, 7 figures"
}