{
    "arxiv_id": "2303.11539",
    "paper_title": "The 300 parsec resolution imaging of a z = 8.31 galaxy: Turbulent ionized gas and potential stellar feedback 600 million years after the Big Bang",
    "authors": [
        "Yoichi Tamura",
        "Tom J. L. C. Bakx",
        "Akio K. Inoue",
        "Takuya Hashimoto",
        "Tsuyoshi Tokuoka",
        "Chihiro Imamura",
        "Bunyo Hatsukade",
        "Minju M. Lee",
        "Kana Moriwaki",
        "Takashi Okamoto",
        "Kazuaki Ota",
        "Hideki Umehata",
        "Naoki Yoshida",
        "Erik Zackrisson",
        "Masato Hagimoto",
        "Hiroshi Matsuo",
        "Ikkoh Shimizu",
        "Yuma Sugahara",
        "Tsutomu T. Takeuchi"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present the results of 300 pc resolution ALMA imaging of the [OIII] 88 $μ$m line and dust continuum emission from a $z = 8.312$ Lyman break galaxy MACS0416_Y1. The velocity-integrated [OIII] emission has three peaks which are likely associated with three young stellar clumps of MACS0416_Y1, while the channel map shows a complicated velocity structure with little indication of a global velocity gradient unlike what was found in [CII] 158 $μ$m at a larger scale, suggesting random bulk motion of ionized gas clouds inside the galaxy. In contrast, dust emission appears as two individual clumps apparently separating or bridging the [OIII]/stellar clumps. The cross correlation coefficient between dust and ultraviolet-related emission (i.e., [OIII] and ultraviolet continuum) is unity on a galactic scale, while it drops at < 1 kpc, suggesting well mixed geometry of multi-phase interstellar media on sub-kpc scales. If the cutoff scale characterizes different stages of star formation, the cutoff scale can be explained by gravitational instability of turbulent gas. We also report on a kpc-scale off-center cavity embedded in the dust continuum image. This could be a superbubble producing galactic-scale outflows, since the energy injection from the 4 Myr starburst suggested by a spectral energy distribution analysis is large enough to push the surrounding media creating a kpc-scale cavity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11539v1"
    ],
    "publication_venue": "18 pages, 6 figures, 1 table, submitted to ApJ after revisions in response to the first referee report"
}