{
    "arxiv_id": "2303.14965",
    "paper_title": "Disruption Precursor Onset Time Study Based on Semi-supervised Anomaly Detection",
    "authors": [
        "Xinkun Ai",
        "Wei Zheng",
        "Ming Zhang",
        "Dalong Chen",
        "Chengshuo Shen",
        "Bihao Guo",
        "Bingjia Xiao",
        "Yu Zhong",
        "Nengchao Wang",
        "Zhoujun Yang",
        "Zhipeng Chen",
        "Zhongyong Chen",
        "Yonghua Ding",
        "Yuan Pan",
        "J-TEXT team"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-12-07"
    ],
    "latest_version": 1,
    "categories": [
        "physics.plasm-ph",
        "cs.AI",
        "cs.LG"
    ],
    "abstract": "The full understanding of plasma disruption in tokamaks is currently lacking, and data-driven methods are extensively used for disruption prediction. However, most existing data-driven disruption predictors employ supervised learning techniques, which require labeled training data. The manual labeling of disruption precursors is a tedious and challenging task, as some precursors are difficult to accurately identify, limiting the potential of machine learning models. To address this issue, commonly used labeling methods assume that the precursor onset occurs at a fixed time before the disruption, which may not be consistent for different types of disruptions or even the same type of disruption, due to the different speeds at which plasma instabilities escalate. This leads to mislabeled samples and suboptimal performance of the supervised learning predictor. In this paper, we present a disruption prediction method based on anomaly detection that overcomes the drawbacks of unbalanced positive and negative data samples and inaccurately labeled disruption precursor samples. We demonstrate the effectiveness and reliability of anomaly detection predictors based on different algorithms on J-TEXT and EAST to evaluate the reliability of the precursor onset time inferred by the anomaly detection predictor. The precursor onset times inferred by these predictors reveal that the labeling methods have room for improvement as the onset times of different shots are not necessarily the same. Finally, we optimize precursor labeling using the onset times inferred by the anomaly detection predictor and test the optimized labels on supervised learning disruption predictors. The results on J-TEXT and EAST show that the models trained on the optimized labels outperform those trained on fixed onset time labels.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14965v1"
    ],
    "publication_venue": "21 pages, 11 figures",
    "doi": "10.1016/j.net.2023.12.004"
}