{
    "arxiv_id": "2303.12962",
    "paper_title": "Shadow molecular dynamics and atomic cluster expansions for flexible charge models",
    "authors": [
        "James Goff",
        "Yu Zhang",
        "Christian F. A. Negre",
        "Andrew Rohskopf",
        "Anders M. N. Niklasson"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "A shadow molecular dynamics scheme for flexible charge models is presented, where the shadow Born-Oppenheimer potential is derived from a coarse-grained approximation of range-separated density functional theory. The interatomic potential, including the atomic electronegativities and the charge-independent short-range part of the potential and force terms, are modeled by the linear atomic cluster expansion (ACE), which provides a computationally efficient alternative to many machine learning methods. The shadow molecular dynamics scheme is based on extended Lagrangian (XL) Born-Oppenheimer molecular dynamics (BOMD) [Eur. Phys. J. B 94, 164 (2021)]. XL-BOMD provides a stable dynamics, while avoiding the costly computational overhead associated with solving an all-to-all system of equations, which normally is required to determine the relaxed electronic ground state prior to each force evaluation. To demonstrate the proposed shadow molecular dynamics scheme for flexible charge models using the atomic cluster expansion, we emulate the dynamics generated from self-consistent charge density functional tight-binding (SCC-DFTB) theory using a second-order charge equilibration (QEq) model. The charge-independent potentials and electronegativities of the QEq model are trained for a supercell of uranium oxide (UO2) and a molecular system of liquid water. The combined ACE + XL-QEq dynamics are stable over a wide range of temperatures both for the oxide and the molecular systems, and provide a precise sampling of the Born-Oppenheimer potential energy surfaces. Accurate ground Coulomb energies are produced by the ACE-based electronegativity model during an NVE simulation of UO2, predicted to be within 1 meV of those from SCC-DFTB on average during comparable simulations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12962v1"
    ],
    "publication_venue": null
}