{
    "arxiv_id": "2303.10711",
    "paper_title": "Asymptotic typicality degrees of properties over finite structures",
    "authors": [
        "Athanassios Tzouvaras"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 2,
    "categories": [
        "math.LO"
    ],
    "abstract": "In previous work we defined and studied a notion of typicality, originated with B. Russell, for properties and objects in the context of general infinite first-order structures. In this paper we consider this notion in the context of finite structures. In particular we define the typicality degree of a property $φ(x)$ over finite $L$-structures, for a language $L$, as the limit of the probability of $φ(x)$ to be typical in an arbitrary $L$-structure ${\\cal M}$ of cardinality $n$, when $n$ goes to infinity. This poses the question whether the 0-1 law holds for typicality degrees for certain kinds of languages. One of the results of the paper is that, in contrast to the classical well-known fact that the 0-1 law holds for the sentences of every relational language, the 0-1 law fails for degrees of properties of relational languages containing unary predicates. On the other hand it is shown that the 0-1 law holds for degrees of some basic properties of graphs, and this gives rise to the conjecture that the 0-1 law holds for relational languages without unary predicates. Another theme is the ``neutrality'' degree of a property $φ(x)$ ( i.e., the fraction of $L$-structures in which neither $φ$ nor $\\neg φ$ is typical), and in particular the ``regular'' properties (i.e., those with limit neutrality degree $0$). All properties we dealt with, either of a relational or a functional language, are shown to be regular, but the question whether {\\em every} such property is regular is open.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10711v1",
        "http://arxiv.org/pdf/2303.10711v2"
    ],
    "publication_venue": "32 pages, 3 figures"
}