{
    "arxiv_id": "2303.17633",
    "paper_title": "Interplay of many-body interactions and quasiperiodic disorder in the all-band-flat diamond chain",
    "authors": [
        "Aamna Ahmed",
        "Nilanjan Roy",
        "Auditya Sharma"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-06-09"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.dis-nn"
    ],
    "abstract": "We study the effects of quasiperiodic Aubry-André (AA) disorder and interactions on a one-dimensional all-band-flat (ABF) diamond chain. We consider the application of disorder in two ways: a symmetric one, where the same disorder is applied to the top and bottom sites of a unit cell, and an antisymmetric one, where the disorder applied to the top and bottom sites are of equal magnitude but with opposite signs. The single-particle wave-packet dynamics for the clean system and when the disorder is applied symmetrically show quantum caging; in the antisymmetric case, the wave-packet spreads over the entire lattice. These results agree with our previous work, where compact localization was observed in the case of the clean system and for symmetrically disordered diamond lattices. In the presence of nearest-neighbour interactions, nonergodic phases are observed in the case of a clean system and symmetrical disorder; at higher disorder strengths, we find an MBL-like phase in the symmetric case. However, many-body non-equilibrium dynamics of the system from carefully engineered initial states exhibit quantum caging. In the antisymmetric case, a nonergodic mixed phase, a thermal phase and an MBL-like phases, respectively, are observed at low, intermediate and high disorder strengths. We observe an absence of caging and initial state dependence (except at the intermediate disorder strength) in the study of non-equilibrium dynamics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17633v1"
    ],
    "publication_venue": "18 pages, 25 figures",
    "doi": "10.1103/PhysRevB.107.245110"
}