{
    "arxiv_id": "2303.17049",
    "paper_title": "Light induced decoupling of electronic and magnetic properties in manganites",
    "authors": [
        "Henry Navarro",
        "Ali C. Basaran",
        "Fernando Ajejas",
        "Lorenzo Fratino",
        "Soumen Bag",
        "Tianxing D. Wang",
        "Erbin Qiu",
        "Victor Rouco",
        "Isabel Tenreiro",
        "Felipe Torres",
        "Alberto Rivera-Calzada",
        "Jacobo Santamaria",
        "Marcelo Rozenberg",
        "Ivan K. Schuller"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-04-27"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "The strongly correlated material La0.7Sr0.3MnO3 (LSMO) exhibits metal-to-insulator and magnetic transition near room temperature. Although the physical properties of LSMO can be manipulated by strain, chemical doping, temperature, or magnetic field, they often require large external stimuli. To include additional flexibility and tunability, we developed a hybrid optoelectronic heterostructure that uses photocarrier injection from cadmium sulfide (CdS) to an LSMO layer to change its electrical conductivity. LSMO exhibits no significant optical response, however, the CdS/LSMO heterostructures show an enhanced conductivity, with ~ 37 % resistance drop, at the transition temperature under light stimuli. This enhanced conductivity in response to light is comparable to the effect of a 9 T magnetic field in pure LSMO. Surprisingly, the optical and magnetic responses of CdS/LSMO heterostructures are decoupled and exhibit different effects when both stimuli are applied. This unexpected behavior shows that heterostructuring strongly correlated oxides may require a new understanding of the coupling of physical properties across the transitions and provide the means to implement new functionalities.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17049v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevApplied.19.044077"
}