{
    "arxiv_id": "2303.16339",
    "paper_title": "High-energy dipole scattering amplitude from evolution of low-energy proton light-cone wave functions",
    "authors": [
        "Adrian Dumitru",
        "Heikki Mäntysaari",
        "Risto Paatelainen"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph",
        "nucl-th"
    ],
    "abstract": "The forward scattering amplitude of a small dipole at high energies is given in the mean field approximation by the Balitsky-Kovchegov (BK) evolution equation. It requires an initial condition $N(r; x_0)$ describing the scattering of a dipole with size $r$ off the target that is probed at momentum fraction $x_0$. Rather than using ad hoc parameterizations tuned to high-energy data at $x\\ll x_0$, here we attempt to construct an initial scattering amplitude that is consistent with low-energy, large-$x$ properties of the proton. We start from a non-perturbative three quark light-cone model wave function from the literature. We add ${\\cal O}(g)$ corrections due to the emission of a gluon, and ${\\cal O}(g^2)$ virtual corrections due to the exchange of a gluon, computed in light-cone perturbation theory with exact kinematics. We provide numerical data as well as analytic parameterizations of the resulting $N(r; x_0)$ for $x_0=0.01 - 0.05$. Solving the BK equation in the leading logarithmic (LL) approximation towards lower $x$, we obtain a fair description of the charm cross section in deeply inelastic scattering measured at HERA by fitting one parameter, the coupling constant $α_s\\simeq 0.2$. However, without the option to tune the initial amplitude at $x_0$, the fit of the high precision data results in $χ^2/N_\\text{dof} = 2.3$ at $N_\\text{dof} =38$, providing clear statistical evidence for the need of systematic improvement e.g. of the photon wave function, evolution equation, and initial condition.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16339v1"
    ],
    "publication_venue": "11 pages, 10 figures. Obtained dipole-proton amplitudes at different x are included in the ancillary files"
}