{
    "arxiv_id": "2303.11882",
    "paper_title": "Far-Ultraviolet Spectroscopy Of Active Galactic Nuclei With AstroSat/UVIT",
    "authors": [
        "Shrabani Kumar",
        "G. C. Dewangan",
        "K. P. Singh",
        "P. Gandhi",
        "I. E. Papadakis",
        "P. Tripathi",
        "L. Mallick"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "$\\require{mediawiki-texvc}$ We study accretion disk emission from eight Seyfert $1 - 1.5$ active galactic nuclei (AGN) using far ultra-violet ($1300-1800$ $Å$) slit-less grating spectra acquired with AstroSat/UVIT. We correct for the Galactic and intrinsic extinction, contamination from the host galaxies, narrow and broad-line regions, Fe II emission and Balmer continuum, and derive the intrinsic continua. We use HST COS/FOS spectra to account for the emission/absorption lines in the low-resolution UVIT spectra. We find generally redder power-law ($f_ν\\propto ν^α$) slopes ($α\\sim -1.1 - 0.3$) in the far UV band than predicted by the standard accretion disk model in the optical/UV band. We fit accretion disk models such as the multi-temperature disk blackbody ($\\texttt{DISKBB}$) and relativistic disk ($\\texttt{ZKERRBB}$, $\\texttt{OPTXAGNF}$) models to the observed intrinsic continuum emission. We measure the inner disk temperatures using the $\\texttt{DISKBB}$ model for seven AGN. These temperatures in the range $\\sim 3.6-5.8$ eV are lower than the peak temperatures predicted for standard disks around maximally spinning super-massive black holes accreting at Eddington rates. The inner disks in two AGN, NGC 7469 and Mrk 352, appear to be truncated at $\\sim 35-125r_{g}$ and $50-135r_{g}$, respectively. While our results show that the intrinsic FUV emission from the AGN are consistent with the standard disks, it is possible that UV continua may be affected by the presence of soft X-ray excess emission, X-ray reprocessing, and thermal Comptonisation in the hot corona. Joint spectral modeling of simultaneously acquired UV/X-ray data may be necessary to further investigate the nature of accretion disks in AGN.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11882v1"
    ],
    "publication_venue": "29 pages, 12 figures, accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc941"
}