{
    "arxiv_id": "2303.11788",
    "paper_title": "Solution-processed NiPS3 thin films from Liquid Exfoliated Inks with Long-Lived Spin-Entangled Excitons",
    "authors": [
        "Andrii Shcherbakov",
        "Kevin Synnatschke",
        "Stanislav Bodnar",
        "Johnathan Zerhoch",
        "Lissa Eyre",
        "Felix Rauh",
        "Markus W. Heindl",
        "Shangpu Liu",
        "Jan Konecny",
        "Ian D. Sharp",
        "Zdenek Sofer",
        "Claudia Backes",
        "Felix Deschler"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Antiferromagnets are promising materials for future opto-spintronic applications since they show spin dynamics in the THz range and no net magnetization. Recently, layered van der Waals (vdW) antiferromagnets have been reported, which combine low-dimensional excitonic properties with complex spin-structure. While various methods for the fabrication of vdW 2D crystals exist, formation of large area and continuous thin films is challenging because of either limited scalability, synthetic complexity, or low opto-spintronic quality of the final material. Here, we fabricate centimeter-scale thin films of the van der Waals 2D antiferromagnetic material NiPS3, which we prepare using a crystal ink made from liquid phase exfoliation (LPE). We perform statistical atomic force microscopy (AFM) and scanning electron microscopy (SEM) to characterize and control the lateral size and number of layers through this ink-based fabrication. Using ultrafast optical spectroscopy at cryogenic temperatures, we resolve the dynamics of photoexcited excitons. We find antiferromagnetic spin arrangement and spin-entangled Zhang-Rice multiplet excitons with lifetimes in the nanosecond range, as well as ultranarrow emission linewidths, despite the disordered nature of our films. Thus, our findings demonstrate scalable thin-film fabrication of high-quality NiPS3, which is crucial for translating this 2D antiferromagnetic material into spintronic and nanoscale memory devices and further exploring its complex spin-light coupled states.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11788v1"
    ],
    "publication_venue": null
}