{
    "arxiv_id": "2303.13719",
    "paper_title": "Implicit electric field Conjugation: Data-driven focal plane control",
    "authors": [
        "S. Y. Haffert",
        "J. R. Males",
        "K. Ahn",
        "K. Van Gorkom",
        "O. Guyon",
        "L. M. Close",
        "J. D. Long",
        "A. D. Hedglen",
        "L. Schatz",
        "M. Kautz",
        "J. Lumbres",
        "A. Rodack",
        "J. M. Knight",
        "K. Miller"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
    ],
    "abstract": "Direct imaging of Earth-like planets is one of the main science cases for the next generation of extremely large telescopes. This is very challenging due to the star-planet contrast that must be overcome. Most current high-contrast imaging instruments are limited in sensitivity at small angular separations due to non-common path aberrations (NCPA). The NCPA leak through the coronagraph and create bright speckles that limit the on-sky contrast and therefore also the post-processed contrast. We aim to remove the NCPA by active focal plane wavefront control using a data-driven approach. We developed a new approach to dark hole creation and maintenance that does not require an instrument model. This new approach is called implicit Electric Field Conjugation (iEFC) and it can be empirically calibrated. This makes it robust for complex instruments where optical models might be difficult to realize. Numerical simulations have been used to explore the performance of iEFC for different coronagraphs. The method was validated on the internal source of the Magellan Adaptive Optics eXtreme (MagAO-X) instrument to demonstrate iEFC's performance on a real instrument. Numerical experiments demonstrate that iEFC can achieve deep contrast below $10^{-9}$ with several coronagraphs. The method is easily extended to broadband measurements and the simulations show that a bandwidth up to 40% can be handled without problems. Experiments with MagAO-X showed a contrast gain of a factor 10 in a broadband light and a factor 20 to 200 in narrowband light. A contrast of $5\\cdot10^{-8}$ was achieved with the Phase Apodized Pupil Lyot Coronagraph at 7.5 $λ/D$. The new iEFC method has been demonstrated to work in numerical and lab experiments. It is a method that can be empirically calibrated and it can achieve deep contrast. This makes it a valuable approach for complex ground-based high-contrast imaging systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13719v1"
    ],
    "publication_venue": "13 pages, 12 figures accepted by A&A",
    "doi": "10.1051/0004-6361/202244960"
}