{
    "arxiv_id": "2303.16923",
    "paper_title": "JWST/NIRCam discovery of the first Y+Y brown dwarf binary: WISE J033605.05$-$014350.4",
    "authors": [
        "Per Calissendorff",
        "Matthew De Furio",
        "Michael Meyer",
        "Loïc Albert",
        "Christian Aganze",
        "Mohamad Ali-Dib",
        "Daniella C. Bardalez Gagliuffi",
        "Frederique Baron",
        "Charles A. Beichman",
        "Adam J. Burgasser",
        "Michael C. Cushing",
        "Jacqueline Kelly Faherty",
        "Clémence Fontanive",
        "Christopher R. Gelino",
        "John E. Gizis",
        "Alexandra Z. Greenbaum",
        "J. Davy Kirkpatrick",
        "Sandy K. Leggett",
        "Frantz Martinache",
        "David Mary",
        "Mamadou N'Diaye",
        "Benjamin J. S. Pope",
        "Thomas L Roellig",
        "Johannes Sahlmann",
        "Anand Sivaramakrishnan",
        "Daniel Peter Thorngren",
        "Marie Ygouf",
        "Thomas Vandal"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
    ],
    "abstract": "We report the discovery of the first brown dwarf binary system with a Y dwarf primary, WISE J033605.05$-$014350.4, observed with NIRCam on JWST with the F150W and F480M filters. We employed an empirical point spread function binary model to identify the companion, located at a projected separation of 84 milliarcseconds, position angle of 295 degrees, and with contrast of 2.8 and 1.8 magnitudes in F150W and F480M, respectively. At a distance of 10$\\,$pc based on its Spitzer parallax, and assuming a random inclination distribution, the physical separation is approximately 1$\\,$au. Evolutionary models predict for that an age of 1-5 Gyr, the companion mass is about 4-12.5 Jupiter masses around the 7.5-20 Jupiter mass primary, corresponding to a companion-to-host mass fraction of $q=0.61\\pm0.05$. Under the assumption of a Keplerian orbit the period for this extreme binary is in the range of 5-9 years. The system joins a small but growing sample of ultracool dwarf binaries with effective temperatures of a few hundreds of Kelvin. Brown dwarf binaries lie at the nexus of importance for understanding the formation mechanisms of these elusive objects, as they allow us to investigate whether the companions formed as stars or as planets in a disk around the primary.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16923v1"
    ],
    "publication_venue": "8 pages, 3 figures, 1 table. Accepted for publication in Astrophysical Journal Letters",
    "doi": "10.3847/2041-8213/acc86d"
}