{
    "arxiv_id": "2303.13686",
    "paper_title": "Mixed-Variable PSO with Fairness on Multi-Objective Field Data Replication in Wireless Networks",
    "authors": [
        "Dun Yuan",
        "Yujin Nam",
        "Amal Feriani",
        "Abhisek Konar",
        "Di Wu",
        "Seowoo Jang",
        "Xue Liu",
        "Greg Dudek"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cs.NI",
        "eess.SP"
    ],
    "abstract": "Digital twins have shown a great potential in supporting the development of wireless networks. They are virtual representations of 5G/6G systems enabling the design of machine learning and optimization-based techniques. Field data replication is one of the critical aspects of building a simulation-based twin, where the objective is to calibrate the simulation to match field performance measurements. Since wireless networks involve a variety of key performance indicators (KPIs), the replication process becomes a multi-objective optimization problem in which the purpose is to minimize the error between the simulated and field data KPIs. Unlike previous works, we focus on designing a data-driven search method to calibrate the simulator and achieve accurate and reliable reproduction of field performance. This work proposes a search-based algorithm based on mixedvariable particle swarm optimization (PSO) to find the optimal simulation parameters. Furthermore, we extend this solution to account for potential conflicts between the KPIs using α-fairness concept to adjust the importance attributed to each KPI during the search. Experiments on field data showcase the effectiveness of our approach to (i) improve the accuracy of the replication, (ii) enhance the fairness between the different KPIs, and (iii) guarantee faster convergence compared to other methods.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13686v1"
    ],
    "publication_venue": "Accepted in International Conference on Communications (ICC) 2023"
}