{
    "arxiv_id": "2303.17556",
    "paper_title": "Measuring the ICM velocity structure in the Ophiuchus cluster",
    "authors": [
        "Efrain Gatuzz",
        "J. S. Sanders",
        "K. Dennerl",
        "A. Liu",
        "A. C. Fabian",
        "C. Pinto",
        "D. Eckert",
        "H. Russell",
        "T. Tamura",
        "S. A. Walker",
        "J. ZuHone"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-04-26"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE"
    ],
    "abstract": "We have found evidence of bulk velocities following active galactic nucleus (AGN) bubbles in the Virgo cluster and galaxy motions in the Centaurus cluster. In order to increase the sample and improve our understanding of the intracluster medium (ICM), we present the results of a detailed mapping of the Ophiuchus cluster with {\\it XMM-Newton} to measure bulk flows through very accurate Fe~K measurements. To measure the gas velocities we use a novel EPIC-pn energy scale calibration, which uses the Cu K$α$ instrumental line as reference for the line emission. We created 2D spectral maps for the velocity, metallicity, temperature, density, entropy and pressure with a spatial resolution of 0.25$'$ ($\\sim 26$~kpc). The ICM velocities in the central regions where AGN feedback is most important are similar to the velocity of the brightest cluster galaxy (BCG). We have found a large interface region where the velocity changes abruptly from blueshifted to redshifted gas which follows a sharp surface brightness discontinuity. We also found that the metallicities and temperatures do not change as we move outwards from the giant radio fossil previously identified in radio observations of the cluster. Finally, we have found a contribution from the kinetic component of $<25\\%$to the total energy budget for large distances.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17556v1"
    ],
    "publication_venue": "15 pages, 20 figures. This paper is part of a series on the ICM velocity structure using XMM-Newton observations. Related series papers: arXiv:2109.06213, arXiv:2203.12635",
    "doi": "10.1093/mnras/stad1132"
}