{
    "arxiv_id": "2303.10241",
    "paper_title": "Diffusive Excitonic Bands from Frustrated Triangular Sublattice in a Singlet-Ground-State System",
    "authors": [
        "Bin Gao",
        "Tong Chen",
        "Xiao-Chuan Wu",
        "Michael Flynn",
        "Chunruo Duan",
        "Lebing Chen",
        "Chien-Lung Huang",
        "Jesse Liebman",
        "Shuyi Li",
        "Feng Ye",
        "Matthew B. Stone",
        "Andrey Podlesnyak",
        "Douglas L. Abernathy",
        "Devashibhai T. Adroja",
        "Manh Duc Le",
        "Qingzhen Huang",
        "Andriy H. Nevidomskyy",
        "Emilia Morosan",
        "Leon Balents",
        "Pengcheng Dai"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-04-17"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el"
    ],
    "abstract": "Magnetic order in most materials occurs when magnetic ions with finite moments in a crystalline lattice arrange in a particular pattern below the ordering temperature determined by exchange interactions between the ions. However, when the crystal electric field (CEF) effect results in a spin-singlet ground state on individual magnetic sites, the collective ground state of the system can either remain non-magnetic, or more intriguingly, the exchange interactions between neighboring ions, provided they are sufficiently strong, can admix the excited CEF levels, resulting in a magnetically ordered ground state. The collective magnetic excitations in such a state are so-called spin excitons that describe the CEF transitions propagating through the lattice. In most cases, spin excitons originating from CEF levels of a localized single ion are dispersion-less in momentum (reciprocal) space and well-defined in both the magnetically ordered and paramagnetic states. Here we use thermodynamic and neutron scattering experiments to study stoichiometric Ni2Mo3O8 without site disorder, where Ni2+ ions form a bipartite honeycomb lattice comprised of two triangular lattices, with ions subject to the tetrahedral and octahedral crystalline environment, respectively. We find that in both types of ions, the CEF excitations have nonmagnetic singlet ground states, yet the material has long-range magnetic order. Furthermore, CEF spin excitons from the triangular-lattice arrangement of tetrahedral sites form, in both the antiferromagnetic and paramagnetic states, a dispersive diffusive pattern around the Brillouin zone boundary in reciprocal space. The present work thus demonstrates that spin excitons in an ideal triangular lattice magnet can have dispersive excitations, irrespective of the existence of static magnetic order, and this phenomenon is most likely due to spin entanglement and geometric frustrations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10241v1"
    ],
    "publication_venue": null,
    "doi": "10.1038/s41467-023-37669-5"
}