{
    "arxiv_id": "2303.14764",
    "paper_title": "The $Z$ resonance, inelastic dark matter, and new physics anomalies in the Simple Extension of the Standard Model (SESM) with general scalar potential",
    "authors": [
        "Wenxing Zhang",
        "Tianjun Li",
        "Xiangwei Yin"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph"
    ],
    "abstract": "We consider the generic scalar potential with CP-violation, and study the $Z$ resonance and inelastic dark matter in the Simple Extension of the Standard Model (SESM), which can explain the dark matter as well as new physics anomalies such as the B physics anomalies and muon anomalous magnetic moment, etc. With the new scalar potential terms, we obtain the mass splittings for the real and imaginary parts of scalar fields. And thus we can have the DM co-annihilation process mediated by $Z$ boson, which couples exclusively to the CP-even and CP-odd parts of scalar fields. This is a brand new feature compared to the previous study. For the CP conserving case, we present the viable parameter space for the Higgs and $Z$ resonances, which can explain the B physics anomalies, muon anomalous magnetic moment, and dark matter relic density, as well as evade the constraint from the XENON1T direct detection simultaneously. For the CP-violating case, we consider the inelastic dark matter, and study four concrete scenarios for the inelastic DM-nucleon scatterings mediated by the Higgs and $Z$ bosons in details. Also, we present the benchmark points which satisfy the aforementioned constraints. Furthermore, we investigate the constraints from the dark matter-electron inelastic scattering processes mediated by the Higgs and $Z$ bosons in light of the XENONnT data. We show that the constraint on the $Z$ mediated process is weak, while the Higgs mediated process excludes the dark matter with mass around several MeV.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14764v1"
    ],
    "publication_venue": "22 pages, 6 figures, 5 tables"
}