{
    "arxiv_id": "2303.15501",
    "paper_title": "Ongoing hierarchical massive cluster assembly: the LISCA II structure in the Perseus complex",
    "authors": [
        "A. Della Croce",
        "E. Dalessandro",
        "A. Livernois",
        "E. Vesperini",
        "C. Fanelli",
        "L. Origlia",
        "M. Bellazzini",
        "E. Oliva",
        "N. Sanna",
        "A. L. Varri"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "We report on the identification of a massive ($\\sim10^5$ M$_\\odot$) sub-structured stellar system in the Galactic Perseus complex likely undergoing hierarchical cluster assembly. Such a system comprises nine star clusters (including the well-known clusters NGC 654 and NGC 663) and an extended and low-density stellar halo. Gaia-DR3 and available spectroscopic data show that all its components are physically consistent in the 6D phase-space (position, parallax, and 3D motion), homogeneous in age (14 $-$ 44 Myr), and chemical content (half-solar metallicity). In addition, the system's global stellar density distribution is that of typical star clusters and shows clear evidence of mass segregation. We find that the hierarchical structure is mostly contracting towards the center with a speed of up to $\\simeq4-5$ km s$^{-1}$, while the innermost regions expand at a lower rate (about $\\simeq1$ km s$^{-1}$) and are dominated by random motions. Interestingly, this pattern is dominated by the kinematics of massive stars, while low-mass stars ($M<2$ M$_\\odot$) are characterized by contraction across the entire cluster. Finally, the nine star clusters in the system are all characterized by a relatively flat velocity dispersion profile possibly resulting from ongoing interactions and tidal heating. We show that the observational results are generally consistent with those found in $N$-body simulations following the cluster violent relaxation phase strongly suggesting that the system is a massive cluster in the early assembly stages. This is the second structure with these properties identified in our Galaxy and, following the nomenclature of our previous work, we named it LISCA II.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15501v1"
    ],
    "publication_venue": "21 pages, 24 figures, 1 table; accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202346095"
}