{
    "arxiv_id": "2303.16744",
    "paper_title": "Frequency-redshift relation of the Cosmic Microwave Background",
    "authors": [
        "Ralf Hofmann",
        "Janning Meinert"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "hep-th"
    ],
    "abstract": "We point out that a modified temperature-redshift relation ($T$-$z$ relation) of the cosmic microwave background (CMB) can not be deduced by any observational method that appeals to an a priori thermalisation to the CMB temperature $T$ of the excited states in a probe environment of independently determined redshift $z$. For example, this applies to quasar-light absorption by a damped Lyman-alpha system due to atomic as well as ionic fine-splitting transitions or molecular rotational bands. Similarly, the thermal Sunyaev-Zel'dovich (thSZ) effect cannot be used to extract the CMB's $T$-$z$ relation. This is because the relative line strengths between ground and excited states in the former and the CMB spectral distortion in the latter case both depend, apart from environment specific normalisations, solely on the dimensionless spectral variable $x=\\frac{hν}{k_B T}$. Since literature on extractions of the CMB's $T$-$z$ relation always assumes (i) $ν(z)=(1+z)ν(z=0)$ where $ν(z=0)$ is the observed frequency in the heliocentric rest frame, the finding (ii) $T(z)=(1+z)T(z=0)$ just confirms the expected blackbody nature of the interacting CMB at $z>0$. In contrast to emission of isolated, directed radiation, whose frequency-redshift relation ($ν$-$z$ relation) is subject to (i), a non-conventional $ν$-$z$ relation $ν(z)=f(z)ν(z=0)$ of pure, isotropic blackbody radiation, subject to adiabatically slow cosmic expansion, necessarily has to follow that of the $T$-$z$ relation $T(z)=f(z)T(z=0)$ and vice versa. In general, the function $f(z)$ is determined by energy conservation of the CMB fluid in a Friedmann-Lemaitre-Robertson-Walker universe. If the pure CMB is subject to an SU(2) rather than a U(1) gauge principle, then $f(z)= \\left({1/4}\\right)^{1/3}(1+z)$ for $z\\gg 1$, and $f(z)$ is nonlinear for $z\\sim 1$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16744v1"
    ],
    "publication_venue": "7 pages, 2 figures"
}