{
    "arxiv_id": "2303.09927",
    "paper_title": "Integrated investment, retrofit and abandonment planning of energy systems with short-term and long-term uncertainty using enhanced Benders decomposition",
    "authors": [
        "Hongyu Zhang",
        "Ignacio E. Grossmann",
        "Brage Rugstad Knudsen",
        "Ken McKinnon",
        "Rodrigo Garcia Nava",
        "Asgeir Tomasgard"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "math.OC"
    ],
    "abstract": "We propose the REORIENT (REnewable resOuRce Investment for the ENergy Transition) model for energy systems planning with the following novelties: (1) integrating capacity expansion, retrofit and abandonment planning, and (2) using multi-horizon stochastic mixed-integer linear programming with short-term and long-term uncertainty. We apply the model to the European energy system considering: (a) investment in new hydrogen infrastructures, (b) capacity expansion of the European power system, (c) retrofitting oil and gas infrastructures in the North Sea region for hydrogen production and distribution, and abandoning existing infrastructures, and (d) long-term uncertainty in oil and gas prices and short-term uncertainty in time series parameters. We utilise the special structure of multi-horizon stochastic programming and propose an enhanced Benders decomposition to solve the model efficiently. We first conduct a sensitivity analysis on retrofitting costs of oil and gas infrastructures. We then compare the REORIENT model with a conventional investment planning model regarding costs and investment decisions. Finally, the computational performance of the algorithm is presented. The results show that: (1) when the retrofitting cost is below 20% of the cost of building new ones, retrofitting is economical for most of the existing pipelines, (2) platform clusters keep producing oil due to the massive profit, and the clusters are abandoned in the last investment stage, (3) compared with a traditional investment planning model, the REORIENT model yields 24% lower investment cost in the North Sea region, and (4) the enhanced Benders algorithm is up to 6.8 times faster than the reference algorithm.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09927v1"
    ],
    "publication_venue": null
}