{
    "arxiv_id": "2303.16195",
    "paper_title": "When to be critical? Performance and evolvability in different regimes of neural Ising agents",
    "authors": [
        "Sina Khajehabdollahi",
        "Jan Prosi",
        "Emmanouil Giannakakis",
        "Georg Martius",
        "Anna Levina"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-11-20"
    ],
    "latest_version": 3,
    "categories": [
        "cs.NE"
    ],
    "abstract": "It has long been hypothesized that operating close to the critical state is beneficial for natural, artificial and their evolutionary systems. We put this hypothesis to test in a system of evolving foraging agents controlled by neural networks that can adapt agents' dynamical regime throughout evolution. Surprisingly, we find that all populations that discover solutions, evolve to be subcritical. By a resilience analysis, we find that there are still benefits of starting the evolution in the critical regime. Namely, initially critical agents maintain their fitness level under environmental changes (for example, in the lifespan) and degrade gracefully when their genome is perturbed. At the same time, initially subcritical agents, even when evolved to the same fitness, are often inadequate to withstand the changes in the lifespan and degrade catastrophically with genetic perturbations. Furthermore, we find the optimal distance to criticality depends on the task complexity. To test it we introduce a hard and simple task: for the hard task, agents evolve closer to criticality whereas more subcritical solutions are found for the simple task. We verify that our results are independent of the selected evolutionary mechanisms by testing them on two principally different approaches: a genetic algorithm and an evolutionary strategy. In summary, our study suggests that although optimal behaviour in the simple task is obtained in a subcritical regime, initializing near criticality is important to be efficient at finding optimal solutions for new tasks of unknown complexity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16195v1",
        "http://arxiv.org/pdf/2303.16195v2",
        "http://arxiv.org/pdf/2303.16195v3"
    ],
    "publication_venue": "arXiv admin note: substantial text overlap with arXiv:2103.12184",
    "doi": "10.1162/artl_a_00383"
}