{
    "arxiv_id": "2303.16420",
    "paper_title": "Multi-Attribute Utility Preference Robust Optimization: A Continuous Piecewise Linear Approximation Approach",
    "authors": [
        "Qiong Wu",
        "Sainan Zhang",
        "Wei Wang",
        "Huifu Xu"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "math.OC"
    ],
    "abstract": "In this paper, we consider a multi-attribute decision making problem where the decision maker's (DM's) objective is to maximize the expected utility of outcomes but the true utility function which captures the DM's risk preference is ambiguous. We propose a maximin multi-attribute utility preference robust optimization (UPRO) model where the optimal decision is based on the worst-case utility function in an ambiguity set of plausible utility functions constructed using partially available information such as the DM's specific preferences between some lotteries. Specifically, we consider a UPRO model with two attributes, where the DM's risk attitude is multivariate risk-averse and the ambiguity set is defined by a linear system of inequalities represented by the Lebesgue-Stieltjes (LS) integrals of the DM's utility functions. To solve the maximin problem, we propose an explicit piecewise linear approximation (EPLA) scheme to approximate the DM's true unknown utility so that the inner minimization problem reduces to a linear program, and we solve the approximate maximin problem by a derivative-free (Dfree) method. Moreover, by introducing binary variables to locate the position of the reward function in a family of simplices, we propose an implicit piecewise linear approximation (IPLA) representation of the approximate UPRO and solve it using the Dfree method. Such IPLA technique prompts us to reformulate the approximate UPRO as a single mixed-integer program (MIP) and extend the tractability of the approximate UPRO to the multi-attribute case. Furthermore, we extend the model to the expected utility maximization problem with expected utility constraints where the worst-case utility functions in the objective and constraints are considered simultaneously. Finally, we report the numerical results about performances of the proposed models.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16420v1"
    ],
    "publication_venue": "50 pages,18 figures"
}