{
    "arxiv_id": "2303.17705",
    "paper_title": "Incorporating patient-reported outcomes in dose-finding clinical trials with continuous patient enrollment",
    "authors": [
        "Anaïs Andrillon",
        "Lucie Biard",
        "Shing M. Lee"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "stat.AP"
    ],
    "abstract": "Dose-finding clinical trials in oncology aim to estimate the maximum tolerated dose (MTD), based on safety traditionally obtained from the clinician's perspective. While the collection of patient-reported outcomes (PROs) has been advocated to better inform treatment tolerability, there is a lack of guidance and methods on how to use PROs for dose assignments and recommendations. The PRO continual reassessment method (PRO-CRM) has been proposed to formally incorporate PROs to estimate the MTD, requiring complete follow-up of both clinician and patient toxicity information per dose cohort to assign the next cohort of patients. In this paper, we propose two extensions of the PRO-CRM, allowing continuous enrollment of patients and handling longer toxicity observation windows to capture late-onset or cumulative toxicities. The first method, the TITE-PRO-CRM, uses a weighted likelihood to include the partial follow-up information from PRO in estimating the MTD during and at the end of the trial. The second method, the TITE-CRM+PRO, uses clinician's information solely to inform dose assignments during the trial and incorporates PRO at the end of the trial for dose recommendation. Simulation studies show that the TITE-PRO-CRM performs similarly to the PRO-CRM in terms of dose recommendation and assignments during the trial while reducing trial duration. The TITE-CRM + PRO slightly underperforms compared to the TITE-PRO-CRM, but similar performance can be attained by requiring larger sample sizes. We also show that the proposed methods have similar performance under higher accrual rates, different toxicity hazards, and correlated time-to-clinician toxicity and time-to-patient toxicity data.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17705v1"
    ],
    "publication_venue": "23 pages, 1 figure, 4 tables"
}