{
    "arxiv_id": "2303.09780",
    "paper_title": "Mpox-AISM: AI-Mediated Super Monitoring for Mpox and Like-Mpox",
    "authors": [
        "Yubiao Yue",
        "Minghua Jiang",
        "Xinyue Zhang",
        "Jialong Xu",
        "Huacong Ye",
        "Fan Zhang",
        "Zhenzhang Li",
        "Yang Li"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2024-03-22"
    ],
    "latest_version": 3,
    "categories": [
        "eess.IV",
        "cs.CV",
        "cs.LG"
    ],
    "abstract": "The key to preventing the spread of mpox (monkeypox) lies in timely, convenient, and accurate diagnosis for earlier-stage infected individuals. Unfortunately, the resemblances between common skin diseases and mpox and the need for professional diagnosis inevitably deteriorated the diagnosis of earlier-stage patients with Mpox and contributed to its widespread outbreak in crowded areas. Here, we proposed a real-time visualization strategy called \"Super Monitoring\" using artificial intelligence and Internet technology, thereby performing a low-cost, convenient, timely, and unspecialized diagnosis for earlier-stage mpox. Specifically, such AI-mediated \"super monitoring\" (Mpox-AISM) invokes a framework assembled by deep learning models, data augmentation, self-supervised learning, and cloud services. Verified by publicly available datasets, the Precision, Recall, Specificity, and F1-score of Mpox-AISM in diagnosing mpox achieved 99.3%, 94.1%, 99.9%, and 96.6%, respectively. Furthermore, Mpox-AISM's overall accuracy reaches 94.51% in diagnosing mpox, six like-mpox skin diseases, and normal skin. We also employed gradient-weighted class activation mapping to explain the decision-making process of Mpox-AISM, thus handily understanding the specific characteristics that may indicate the mpox's onset and improving its reliability. With the help of the Internet and communication terminal, Mpox-AISM can perform a real-time, low-cost, and convenient diagnosis for earlier-stage mpox in various real-world settings, thereby effectively curbing the spread of mpox virus.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09780v1",
        "http://arxiv.org/pdf/2303.09780v2",
        "http://arxiv.org/pdf/2303.09780v3"
    ],
    "publication_venue": null
}