{
    "arxiv_id": "2303.12835",
    "paper_title": "Compact and Quiescent Circumgalactic Medium and Ly$α$ Halos around Extremely Red Quasars (ERQs)",
    "authors": [
        "Jarred Gillette",
        "Marie Wingyee Lau",
        "Fred Hamann",
        "Serena Perrotta",
        "David S. N. Rupke",
        "Dominika Wylezalek",
        "Nadia L. Zakamska",
        "Andrey Vayner"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Red quasars may represent a young stage of galaxy evolution that provide important feedback to their host galaxies. We are studying a population of extremely red quasars (ERQs) with exceptionally fast and powerful outflows, at median redshift $z$ = 2.6. We present Keck/KCWI integral field spectra of 11 ERQs, which have a median color $i-W3$ = 5.9~mag, median $\\left\\langle L_{\\text{bol}} \\right\\rangle$ $\\approx$ 5 $\\times$ $10^{47}$ erg s$^{-1}$, Ly$α$ halo luminosity $\\left\\langle L_{\\text{halo}} \\right\\rangle$ $=$ 5 $\\times$ $10^{43}$ erg s$^{-1}$, and maximum linear size $>128$ kpc. The ERQ halos are generally similar to those of blue quasars, following known trends with $L_{\\text{bol}}$ in halo properties. ERQs have halo symmetries similar to Type-I blue quasars, suggesting Type-I spatial orientations. ERQ $\\left\\langle L_{\\text{halo}} \\right\\rangle$ is $\\sim$2 dex below blue quasars, which is marginal due to scatter, but consistent with obscuration lowering photon escape fractions. ERQ halos tend to have more compact and circularly symmetric inner regions than blue quasars, with median exponential scale lengths of $\\sim$9 kpc, compared to $\\sim$16 kpc for blue quasars. When we include the central regions not available in blue quasar studies (due to PSF problems), the true median ERQ halo scale length is just $\\sim$6 kpc. ERQ halos are also kinematically quiet, with median velocity dispersion 293 km s$^{-1}$, consistent with expected virial speeds. Overall we find no evidence for feedback on circumgalactic scales, and the current episode of quasar activity, perhaps due to long outflow travel times, has not been around long enough to affect the circumgalactic medium. We confirm the narrow Ly$α$ emission spikes found in ERQ aperture spectra are halo features, and are useful for systemic redshifts and measuring outflow speeds in other features.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12835v1"
    ],
    "publication_venue": "19 pages, 9 figures, submitted to Monthly Notices of the Royal Astronomical Society"
}