{
    "arxiv_id": "2303.08833",
    "paper_title": "Feedback in the merging galaxy group NGC6338",
    "authors": [
        "Gerrit Schellenberger",
        "Ewan O'Sullivan",
        "Simona Giacintucci",
        "Jan Vrtilek",
        "Laurence P. David",
        "Francoise Combes",
        "Laura Bîrzan",
        "Hsi-An Pan",
        "Lihwai Lin"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "The galaxy group NGC6338 is one of the most violent group-group mergers known to date. While the central dominant galaxies rush at each other at 1400km/s along the line of sight, with dramatic gas heating and shock fronts detected, the central gas in the BCGs remains cool. There are also indications of feedback from active galactic nuclei (AGNs), and neither subcluster core has been disrupted. With our deep radio uGMRT data at 383MHz and 650MHz we clearly detect a set of large, old lobes in the southern BCG coinciding with the X-ray cavities, while the northern, and smaller BCG appears slightly extended in the radio. The southern BCG also hosts a smaller younger set of lobes, perpendicular to the larger lobes, but also coinciding with the inner X-ray cavities, and matching the jet direction in the parsec-resolution VLBA image. Our spectral analysis confirms the history of two feedback cycles. The high radio frequency analysis classifies the compact source in the southern BCG with a powerlaw, while ruling out a significant contribution from accretion. The radio lightcurve over 3 decades shows a change about 10 years ago, which might be related to ongoing feedback in the core. The southern BCG in the NGC6338 merger remains another prominent case where the direction of jet-mode feedback between two cycles changed dramatically.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08833v1"
    ],
    "publication_venue": "19 pages, 12 figures, accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc52e"
}