{
    "arxiv_id": "2303.14468",
    "paper_title": "Autoregressive Conditional Neural Processes",
    "authors": [
        "Wessel P. Bruinsma",
        "Stratis Markou",
        "James Requiema",
        "Andrew Y. K. Foong",
        "Tom R. Andersson",
        "Anna Vaughan",
        "Anthony Buonomo",
        "J. Scott Hosking",
        "Richard E. Turner"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "stat.ML",
        "cs.LG"
    ],
    "abstract": "Conditional neural processes (CNPs; Garnelo et al., 2018a) are attractive meta-learning models which produce well-calibrated predictions and are trainable via a simple maximum likelihood procedure. Although CNPs have many advantages, they are unable to model dependencies in their predictions. Various works propose solutions to this, but these come at the cost of either requiring approximate inference or being limited to Gaussian predictions. In this work, we instead propose to change how CNPs are deployed at test time, without any modifications to the model or training procedure. Instead of making predictions independently for every target point, we autoregressively define a joint predictive distribution using the chain rule of probability, taking inspiration from the neural autoregressive density estimator (NADE) literature. We show that this simple procedure allows factorised Gaussian CNPs to model highly dependent, non-Gaussian predictive distributions. Perhaps surprisingly, in an extensive range of tasks with synthetic and real data, we show that CNPs in autoregressive (AR) mode not only significantly outperform non-AR CNPs, but are also competitive with more sophisticated models that are significantly more computationally expensive and challenging to train. This performance is remarkable given that AR CNPs are not trained to model joint dependencies. Our work provides an example of how ideas from neural distribution estimation can benefit neural processes, and motivates research into the AR deployment of other neural process models.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14468v1"
    ],
    "publication_venue": "57 pages; accepted to the 11th International Conference on Learning Representations (ICLR 2023)"
}