{
    "arxiv_id": "2303.12049",
    "paper_title": "Calibration of the convective parameters in stellar pulsation hydrocodes",
    "authors": [
        "Gábor B. Kovács",
        "Róbert Szabó",
        "János Nuspl"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Despite the appearance of two- and three-dimensional models thanks to the rapid growth of computing performance, numerical hydrocodes used to model radial stellar pulsations still apply a one-dimensional stellar envelope model without any realistic atmosphere, in which a significant improvement was the inclusion of turbulent convection. However, turbulent convection is an inherently multi-dimensional physical process in the vicinity of the ionization zones that generate pulsation. The description of these processes in one dimension can only be approximated based on simplified theoretical considerations involving several undetermined dimensionless parameters.\n  In this work, we confront two one-dimensional numerical codes, namely the Budapest-Florida code (BpF) and the MESA Radial Stellar Pulsations module (RSP), with radial velocity observations of several non-modulated RRab stars of the M3 globular cluster and specified the undetermined convective parameters by the measured data for both codes independently.\n  Our determination shows that some of the parameters depend on the effective temperature, which dependence is established for the first time in this work, and we also found some degeneracy between the parameters. This procedure gives as by-product suggestions for parameters of the publicly available RSP code extensively used recently by researchers through the MESA package.\n  This work is part of the preparatory work to establish a theoretical framework required to make progress based on the results of one-dimensional models to couple them with multi-dimensional ones for further detailed analysis of physical processes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12049v1"
    ],
    "publication_venue": "Accepted in MNRAS, 19 pages, 14 figures, for associated mp4 video see https://konkoly.hu/KIK/data_en.html#PM",
    "doi": "10.1093/mnras/stad884"
}