{
    "arxiv_id": "2303.12521",
    "paper_title": "The Fundamental Patterns of Sea Surface Temperature",
    "authors": [
        "J. Xavier Prochaska",
        "Erdong Guo",
        "Peter C. Cornillon",
        "Christian E. Buckingham"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ao-ph"
    ],
    "abstract": "For over 40 years, remote sensing observations of the Earth's oceans have yielded global measurements of sea surface temperature (SST). With a resolution of approximately 1km, these data trace physical processes like western boundary currents, cool upwelling at eastern boundary currents, and the formation of mesoscale and sub-mesoscale eddies. To discover the fundamental patterns of SST on scales smaller than 10km, we developed an unsupervised, deep contrastive learning model named Nenya. We trained Nenya on a subset of 8 million cloud-free cutout images (~80x80km^2) from the MODIS sensor, with image augmentations to impose invariance to rotation, reflection, and translation. The 256-dimension latent space of Nenya defines a vocabulary to describe the complexity of SST and associates images with like patterns and features. We used a dimensionality reduction algorithm to explore cutouts with a temperature interval of DT=0.5-1K, identifying a diverse set of patterns with temperature variance on a wide range of scales. We then demonstrated that SST data with large-scale features arise preferentially in the Pacific and Atlantic Equatorial Cold Tongues and exhibit a strong seasonal variation, while data with predominantly sub-mesoscale structure preferentially manifest in western boundary currents, select regions with strong upwelling, and along the Antarctic Circumpolar Current. We provide a web-based user interface to facilitate the geographical and temporal exploration of the full MODIS dataset. Future efforts will link specific SST patterns to select dynamics (e.g., frontogenesis) to examine their distribution in time and space on the globe.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12521v1"
    ],
    "publication_venue": "23 pages, 21 figures; Submitted to IEEE TGRS"
}