{
    "arxiv_id": "2303.16671",
    "paper_title": "Towards responsible quantum technology, safeguarding, engaging and advancing Quantum R&D",
    "authors": [
        "Mauritz Kop",
        "Mateo Aboy",
        "Eline De Jong",
        "Urs Gasser",
        "Timo Minssen",
        "I. Glenn Cohen",
        "Mark Brongersma",
        "Teresa Quintel",
        "Luciano Floridi",
        "Raymond Laflamme"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "physics.soc-ph"
    ],
    "abstract": "The expected societal impact of quantum technologies (QT) urges us to proceed and innovate responsibly. This article proposes a conceptual framework for Responsible QT that seeks to integrate considerations about ethical, legal, social, and policy implications (ELSPI) into quantum R&D, while responding to the Responsible Research and Innovation dimensions of anticipation, inclusion, reflection and responsiveness. After examining what makes QT unique, we argue that quantum innovation should be guided by a methodological framework for Responsible QT, aimed at jointly safeguarding against risks by proactively addressing them, engaging stakeholders in the innovation process, and continue advancing QT (SEA). We further suggest operationalizing the SEA-framework by establishing quantum-specific guiding principles. The impact of quantum computing on information security is used as a case study to illustrate (1) the need for a framework that guides Responsible QT, and (2) the usefulness of the SEA-framework for QT generally. Additionally, we examine how our proposed SEA-framework for responsible innovation can inform the emergent regulatory landscape affecting QT, and provide an outlook of how regulatory interventions for QT as base-layer technology could be designed, contextualized, and tailored to their exceptional nature in order to reduce the risk of unintended counterproductive effects of policy interventions. Laying the groundwork for a responsible quantum ecosystem, the research community and other stakeholders are called upon to further develop the recommended guiding principles, and discuss their operationalization into best practices and real-world applications. Our proposed framework should be considered a starting point for these much needed, highly interdisciplinary efforts.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16671v1"
    ],
    "publication_venue": null
}