{
    "arxiv_id": "2303.09442",
    "paper_title": "Nucleosynthesis in neutrino-heated ejecta and neutrino-driven winds of core-collapse supernovae; neutrino-induced nucleosynthesis",
    "authors": [
        "Shinya Wanajo"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The innermost ejecta of core-collapse supernovae are considered to be the sources of some iron-group and heavier nuclei. The ejecta are predominantly driven by neutrino heating, principally due to neutrino capture on free neutrons and protons. Such neutrino interaction plays a crucial role for setting neutron richness in the ejecta. Recent hydrodynamics work with sophisticated neutrino transport indicates that the ejecta are only mildly neutron rich or even proton rich. In such conditions a wide variety of trans-iron isotopes are synthesized, while the neutron richness is insufficient for the production of r-process nuclei. In this capter, basic concepts of nucleosynthesis in neutrino-heated ejecta and neutrino-driven winds of core-collapse supernovae are presented along with latest studies. Neutrino-heated ejecta indicate the early ejecta component within the first few seocnds in which anisotropic convective activities of material above the neutrinosphere become important for nucleosynthesis. Then, neutrino-driven winds follow, which are approximately isotropic outflows emerging from the surface of a proto-neutron star . According to such characteristics, studies of nucleosynthesis here are based on recent multi-dimentional hydrodynamics simulations and semi-alalytic wind solutions, respectively. These studies suggest that trans-iron species up to the atomic mass number of 90, as well as some rare isotopes such as 48Ca and 92Mo, are produced in the neutrino-heated ejecta. Neutrino-driven winds are unlikely sources of r-process nuclei, but rather promising sources of proton-rich isotopes up to the atomic number of 110.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09442v1"
    ],
    "publication_venue": "33 pages, 18 figures, chapter to appear in Handbook of Nuclear Physics (Springer)"
}