{
    "arxiv_id": "2303.13949",
    "paper_title": "An evaluation of the LLC4320 global ocean simulation based on the submesoscale structure of modeled sea surface temperature fields",
    "authors": [
        "Katharina Gallmeier",
        "J. Xavier Prochaska",
        "Peter C. Cornillon",
        "Dimitris Menemenlis",
        "Madolyn Kelm"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ao-ph"
    ],
    "abstract": "We extracted ~2.8M nearly cloud-free 144x144 km^2 cutout images from the 2012-2020 Level-2 VIIRS Sea Surface Temperature (SST) dataset to quantitatively compare with MIT ocean general circulation model outputs, specifically the one year LCC4320 1/48 deg global-ocean simulation starting on November 17, 2011, matched in geography and day-of-year to VIIRS observations. We analyzed these cutouts using an unsupervised probabilistic autoencoder (PAE) to learn the SST structure on ~10-to-80 km scales (submesoscale-to-mesoscale). A key finding is that, in general, the LLC4320 simulation accurately reproduces the observed SST patterns, both globally and regionally. Global structure distribution medians match within 2 sigma for 65% of the ocean, despite a modest, latitude-dependent offset. Regionally, model outputs mimic mesoscale SST pattern variations in VIIRS data revealed by PAE, including subtle features influenced by bathymetry variations. There are however some areas showing significant differences in the distribution of SST patterns: (1) near western boundary currents' separation from the continental margin, (2) in the ACC, particularly in the eastern half of the Indian Ocean, and (3) in an equatorial band equatorward of 15 deg. The discrepancy in (1) results from premature separation of simulated western boundary currents. In (2), the Southern Indian Ocean, the model output predicts more structure than observed, possibly due to mixed layer misrepresentation or energy dissipation and stirring inaccuracies in the simulation. The differences in (3), the equatorial band, may also stem from model errors, potentially arising from the simulation's shortness or insufficient high-frequency/wavenumber atmospheric forcing. While the exact causes of these model-data differences remain uncertain, such comparisons are expected to guide future developments in high-resolution global-ocean simulations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13949v1"
    ],
    "publication_venue": "31 pages, 22 figures; Submitted to Geoscientific Model Development",
    "doi": "10.5194/gmd-2023-39"
}