{
    "arxiv_id": "2303.10998",
    "paper_title": "The maximum refractive index of an atomic crystal $\\unicode{x2013}$ from quantum optics to quantum chemistry",
    "authors": [
        "Francesco Andreoli",
        "Bennet Windt",
        "Stefano Grava",
        "Gian Marcello Andolina",
        "Michael J. Gullans",
        "Alexander A. High",
        "Darrick E. Chang"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "physics.optics"
    ],
    "abstract": "All known optical materials have an index of refraction of order unity. Despite the tremendous implications that an ultrahigh index could have for optical technologies, little research has been done on why the refractive index of materials is universally small, and whether this observation is fundamental. Here, we investigate the index of an ordered arrangement of atoms, as a function of atomic density. At dilute densities, this problem falls into the realm of quantum optics, where atoms do not interact with one another except via the scattering of light. On the other hand, when the lattice constant becomes comparable to the Bohr radius, the electronic orbitals begin to overlap, giving rise to quantum chemistry. We present a minimal model that allows for a unifying theory of index spanning these two regimes. A key aspect is the treatment of multiple light scattering, which can be highly non-perturbative over a large density range, and which is the reason that conventional theories of the index break down. In the quantum optics regime, we show that ideal light-matter interactions can have a single-mode nature, allowing for a purely real refractive index that grows with density as $(N/V)^{1/3}$. At the onset of quantum chemistry, we show how two physical mechanisms (excited electron tunneling dynamics and the buildup of electronic density-density correlations) can open up inelastic or spatial multi-mode light scattering processes, which ultimately reduce the index back to order unity while introducing absorption. Around the onset of chemistry, our theory predicts that ultrahigh index ($n\\sim 30$), low-loss materials could in principle be allowed by the laws of nature.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10998v1"
    ],
    "publication_venue": "31 pages, 12 figures"
}