{
    "arxiv_id": "2303.16121",
    "paper_title": "Detection of ethanol, acetone, and propanal in TMC-1: New O-bearing complex organics in cold sources",
    "authors": [
        "M. Agundez",
        "J. C. Loison",
        "K. M. Hickson",
        "V. Wakelam",
        "R. Fuentetaja",
        "C. Cabezas",
        "N. Marcelino",
        "B. Tercero",
        "P. de Vicente",
        "J. Cernicharo"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present the detection of ethanol (C2H5OH), acetone (CH3COCH3), and propanal (C2H5CHO) toward the cyanopolyyne peak of TMC-1. These three O-bearing complex organic molecules are known to be present in warm interstellar clouds, but had never been observed in a starless core. The addition of these three new pieces to the puzzle of complex organic molecules in cold interstellar clouds stresses the rich chemical diversity of cold dense cores in stages prior to the onset of star formation. The detections of ethanol, acetone, and propanal were made in the framework of QUIJOTE, a deep line survey of TMC-1 in the Q band that is being carried out with the Yebes 40m telescope. We derive column densities of (1.1 +/- 0.3)e12 cm-2 for C2H5OH, (1.4 +/- 0.6)e11 cm-2 for CH3COCH3, and (1.9 +/- 0.7)e11 cm-2 for C2H5CHO. The formation of these three O-bearing complex organic molecules is investigated with the aid of a detailed chemical model which includes gas and ice chemistry. The calculated abundances at a time around 2e5 yr are in reasonable agreement with the values derived from the observations. The formation mechanisms of these molecules in our chemical model are as follows. Ethanol is formed on grains by addition of atomic carbon on methanol followed by hydrogenation and non-thermal desorption. Acetone and propanal are produced by the gas-phase reaction between atomic oxygen and two different isomers of the C3H7 radical, where the latter follows from the hydrogenation of C3 on grains followed by non-thermal desorption. A gas-phase route involving the formation of (CH3)2COH+ through several ion-neutral reactions followed by its dissociative recombination with electrons do also contribute to the formation of acetone.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16121v1"
    ],
    "publication_venue": "Accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202346076"
}