{
    "arxiv_id": "2303.11280",
    "paper_title": "Exclusive semileptonic $B_s\\to K \\ell ν$ decays on the lattice",
    "authors": [
        "Jonathan M. Flynn",
        "Ryan C. Hill",
        "Andreas Jüttner",
        "Amarjit Soni",
        "J. Tobias Tsang",
        "Oliver Witzel"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "hep-lat",
        "hep-ph"
    ],
    "abstract": "Semileptonic $B_s \\to K \\ell ν$ decays provide an alternative $b$-decay channel to determine the CKM matrix element $|V_{ub}|$, and to obtain a $R$-ratio to investigate lepton-flavor-universality violations. Results for the CKM matrix element may also shed light on the discrepancies seen between analyses of inclusive or exclusive decays. We calculate the decay form factors using lattice QCD with domain-wall light quarks and a relativistic $b$-quark. We analyze data at three lattice spacings with unitary pion masses down to $268\\,\\mathrm{MeV}$. Our numerical results are interpolated/extrapolated to physical quark masses and to the continuum to obtain the vector and scalar form factors $f_+(q^2)$ and $f_0(q^2)$ with full error budgets at $q^2$ values spanning the range accessible in our simulations. We provide a possible explanation of tensions found between results for the form factor from different lattice collaborations. Model- and truncation-independent $z$-parameterization fits following a recently proposed Bayesian-inference approach extend our results to the entire allowed kinematic range. Our results can be combined with experimental measurements of $B_s \\to D_s$ and $B_s\\to K$ semileptonic decays to determine $|V_{ub}|=3.8(6)\\times 10^{-3}$. The error is currently dominated by experiment. We compute differential branching fractions and two types of $R$ ratios, the one commonly used as well as a variant better suited to test lepton-flavor universality.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11280v1"
    ],
    "publication_venue": "30 pages, 13 Figures, supplementary data file"
}