{
    "arxiv_id": "2303.14834",
    "paper_title": "Scale invariance and critical balance in electrostatic drift-kinetic turbulence",
    "authors": [
        "T. Adkins",
        "P. G. Ivanov",
        "A. A. Schekochihin"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-08-02"
    ],
    "latest_version": 3,
    "categories": [
        "physics.plasm-ph"
    ],
    "abstract": "The equations of electrostatic drift kinetics are observed to possess a symmetry associated with their intrinsic scale invariance. Under the assumptions of spatial periodicity, stationarity, and locality, this symmetry implies a particular scaling of the turbulent heat flux with the system's parallel size, from which its scaling with the equilibrium temperature gradient can be deduced under some additional assumptions. This macroscopic transport prediction is then confirmed numerically for a reduced model of electron-temperature-gradient-driven turbulence in slab geometry. The system realises this scaling through a turbulent cascade from large to small perpendicular spatial scales. The route of this cascade through wavenumber space (i.e. the relationship between parallel and perpendicular scales in the inertial range) is shown to be determined by a balance between nonlinear-decorrelation and parallel-dissipation timescales. This type of `critically balanced' cascade, which maintains a constant energy flux despite the presence of parallel dissipation throughout the inertial range (as well as order-unity dissipative losses at the outer scale) is expected to be a generic feature of plasma turbulence. The outer scale of the turbulence, on which the turbulent heat flux depends, is determined by the breaking of drift-kinetic scale invariance due to the existence of large-scale parallel inhomogeneity (the parallel system size).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14834v1",
        "http://arxiv.org/pdf/2303.14834v2",
        "http://arxiv.org/pdf/2303.14834v3"
    ],
    "publication_venue": "44 pages, 15 figures",
    "doi": "10.1017/S0022377823000600"
}