{
    "arxiv_id": "2303.14047",
    "paper_title": "Dark Energy on Astrophysical Scales and Its Detection in the Milky Way",
    "authors": [
        "Rui Zhang",
        "Zhen Zhang"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-06-23"
    ],
    "latest_version": 3,
    "categories": [
        "physics.gen-ph"
    ],
    "abstract": "The origin and nature of dark energy is one of the most significant challenges in modern science. This research aims to investigate dark energy on astrophysical scales and provide a cosmology-independent method to measure its equation-of-state parameter $w$. To accomplish this, we introduce the concept of a perfect fluid in any static, curved spacetime, and express the energy-momentum tensor of the perfect fluid in a general isotropic form, namely Weinberg's isotropic form. This enables us to define an equation-of-state parameter in a physical and global manner. Within this theoretical framework, we demonstrate that the energy-momentum tensor of dark energy on different scales can take the general isotropic form. Furthermore, we explore the SdS$_{w}$ spacetime and establish its connection with dark energy in cosmology through the equation-of-state parameter $w$. In the SdS$_{w}$ spacetime, a repulsive dark force can be induced by dark energy locally. We then apply the concept of the dark force to realistic astrophysical systems using the Poisson equation. Finally, we find that an anomaly in the Milky Way rotation curve can be quantitatively interpreted by the dark force. By fitting the galactic curve, we are able to obtain the value of the equation-of-state parameter of dark energy, independently of specific dark energy models.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14047v1",
        "http://arxiv.org/pdf/2303.14047v2",
        "http://arxiv.org/pdf/2303.14047v3"
    ],
    "publication_venue": "36 pages, 5 figures, 2 tables, published in JCAP",
    "doi": "10.1088/1475-7516/2023/06/031"
}