{
    "arxiv_id": "2303.12868",
    "paper_title": "Gravitational waves from an eccentric population of primordial black holes orbiting Sgr A$^{\\star}$",
    "authors": [
        "Stefano Bondani",
        "Matteo Bonetti",
        "Luca Broggi",
        "Francesco Haardt",
        "Alberto Sesana",
        "Massimo Dotti"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Primordial black holes (PBH), supposedly formed in the very early Universe, have been proposed as a possible viable dark matter candidate. In this work we characterize the expected gravitational wave (GW) losses from a population of PBHs orbiting Sgr A$^{\\star}$, the super-massive black hole at the Galactic center, and assess the signal detectability by the planned space-borne interferometer LISA and by the proposed next generation space-borne interferometer $μ$Ares. Assuming that PBHs indeed form the entire diffuse mass allowed to reside within the orbit of the S2 star, we compute an upper limit to the expected GW signal both from resolved and non-resolved sources, under the further assumptions of monochromatic mass function and thermally distributed eccentricities. By comparing with our previous work where PBHs on circular orbits were assumed, we show how the GW signal from high harmonics over a 10 year data stream increases by a factor of six the chances of LISA detectability, from the $\\approx 10\\%$ of the circular case, to $\\approx 60\\%$, whereas multiple sources can be identified in $20\\%$ of our mock populations. The background signal, made by summing up all non resolved sources, should be detectable thanks to the PBHs with higher eccentricity evolving under two body relaxation. In the case of $μ$Ares, because of its improved sensitivity in the $μ$Hz band, one third of the entire population of PBHs orbiting Sgr A$^{\\star}$ would be resolved. The background noise from the remaining non resolved sources should be detectable as well.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12868v1"
    ],
    "publication_venue": "11 pages, 9 figures"
}