{
    "arxiv_id": "2303.13610",
    "paper_title": "Artificial-intelligence-based molecular classification of diffuse gliomas using rapid, label-free optical imaging",
    "authors": [
        "Todd C. Hollon",
        "Cheng Jiang",
        "Asadur Chowdury",
        "Mustafa Nasir-Moin",
        "Akhil Kondepudi",
        "Alexander Aabedi",
        "Arjun Adapa",
        "Wajd Al-Holou",
        "Jason Heth",
        "Oren Sagher",
        "Pedro Lowenstein",
        "Maria Castro",
        "Lisa Irina Wadiura",
        "Georg Widhalm",
        "Volker Neuschmelting",
        "David Reinecke",
        "Niklas von Spreckelsen",
        "Mitchel S. Berger",
        "Shawn L. Hervey-Jumper",
        "John G. Golfinos",
        "Matija Snuderl",
        "Sandra Camelo-Piragua",
        "Christian Freudiger",
        "Honglak Lee",
        "Daniel A. Orringer"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
    ],
    "abstract": "Molecular classification has transformed the management of brain tumors by enabling more accurate prognostication and personalized treatment. However, timely molecular diagnostic testing for patients with brain tumors is limited, complicating surgical and adjuvant treatment and obstructing clinical trial enrollment. In this study, we developed DeepGlioma, a rapid ($< 90$ seconds), artificial-intelligence-based diagnostic screening system to streamline the molecular diagnosis of diffuse gliomas. DeepGlioma is trained using a multimodal dataset that includes stimulated Raman histology (SRH); a rapid, label-free, non-consumptive, optical imaging method; and large-scale, public genomic data. In a prospective, multicenter, international testing cohort of patients with diffuse glioma ($n=153$) who underwent real-time SRH imaging, we demonstrate that DeepGlioma can predict the molecular alterations used by the World Health Organization to define the adult-type diffuse glioma taxonomy (IDH mutation, 1p19q co-deletion and ATRX mutation), achieving a mean molecular classification accuracy of $93.3\\pm 1.6\\%$. Our results represent how artificial intelligence and optical histology can be used to provide a rapid and scalable adjunct to wet lab methods for the molecular screening of patients with diffuse glioma.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13610v1"
    ],
    "publication_venue": "Paper published in Nature Medicine",
    "doi": "10.1038/s41591-023-02252-4"
}