{
    "arxiv_id": "2303.15301",
    "paper_title": "PeakNet: An Autonomous Bragg Peak Finder with Deep Neural Networks",
    "authors": [
        "Cong Wang",
        "Po-Nan Li",
        "Jana Thayer",
        "Chun Hong Yoon"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-06-29"
    ],
    "latest_version": 2,
    "categories": [
        "physics.ins-det",
        "cs.LG"
    ],
    "abstract": "Serial crystallography at X-ray free electron laser (XFEL) and synchrotron facilities has experienced tremendous progress in recent times enabling novel scientific investigations into macromolecular structures and molecular processes. However, these experiments generate a significant amount of data posing computational challenges in data reduction and real-time feedback. Bragg peak finding algorithm is used to identify useful images and also provide real-time feedback about hit-rate and resolution. Shot-to-shot intensity fluctuations and strong background scattering from buffer solution, injection nozzle and other shielding materials make this a time-consuming optimization problem. Here, we present PeakNet, an autonomous Bragg peak finder that utilizes deep neural networks. The development of this system 1) eliminates the need for manual algorithm parameter tuning, 2) reduces false-positive peaks by adjusting to shot-to-shot variations in strong background scattering in real-time, 3) eliminates the laborious task of manually creating bad pixel masks and the need to store these masks per event since these can be regenerated on demand. PeakNet also exhibits exceptional runtime efficiency, processing a 1920-by-1920 pixel image around 90 ms on an NVIDIA 1080 Ti GPU, with the potential for further enhancements through parallelized analysis or GPU stream processing. PeakNet is well-suited for expert-level real-time serial crystallography data analysis at high data rates.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15301v1",
        "http://arxiv.org/pdf/2303.15301v2"
    ],
    "publication_venue": null
}