{
    "arxiv_id": "2303.07905",
    "paper_title": "Off-axis Point Spread Function Reconstruction for Single Conjugate Adaptive Optics",
    "authors": [
        "Roland Wagner",
        "Jenny Niebsch",
        "Ronny Ramlau"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM"
    ],
    "abstract": "Modern Giant Segmented Mirror Telescopes (GSMTs) like the Extremely Large Telescope, which is currently under construction, depend heavily on Adaptive Optics (AO) systems to correct for atmospheric distortions. However, a residual blur always remains in the astronomical images corrected by Single Conjugate AO (SCAO) systems due to fitting and bandwidth errors, which can mathematically be described by a convolution of the true image with a point spread function (PSF). Due to the nature of the turbulent atmosphere and its correction, the PSF is spatially varying, which is known as aniosplanatic effect. The PSF serves, e.g., as a quality measure for the science images and therefore needs to be known as accurately as possible.\n  In this paper, we present an algorithm for PSF reconstruction in directions apart from the guide star direction in an SCAO system adapted to the needs of GSMTs focused on estimating the contribution of the anisoplanatic and generalized fitting error to the PSF. In particular, the PSF reconstruction algorithm for Single Conjugate Adaptive Optics from (Wagner, 2018) is combined with an algorithm for time-dependent atmospheric tomography from (Niebsch, 2021) to obtain a direction dependent reconstruction of the post-AO PSF.\n  Results obtained in an end-to-end simulation tool show a qualitatively good reconstruction of the PSF compared to the PSF calculated directly from the simulated incoming wavefront as well as a stable performance with respect to imprecise knowledge of atmospheric parameters.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07905v1"
    ],
    "publication_venue": "arXiv admin note: text overlap with arXiv:2012.11429"
}