{
    "arxiv_id": "2303.15860",
    "paper_title": "The Wyner Variational Autoencoder for Unsupervised Multi-Layer Wireless Fingerprinting",
    "authors": [
        "Teng-Hui Huang",
        "Thilini Dahanayaka",
        "Kanchana Thilakarathna",
        "Philip H. W. Leong",
        "Hesham El Gamal"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cs.IT",
        "cs.LG"
    ],
    "abstract": "Wireless fingerprinting refers to a device identification method leveraging hardware imperfections and wireless channel variations as signatures. Beyond physical layer characteristics, recent studies demonstrated that user behaviours could be identified through network traffic, e.g., packet length, without decryption of the payload. Inspired by these results, we propose a multi-layer fingerprinting framework that jointly considers the multi-layer signatures for improved identification performance. In contrast to previous works, by leveraging the recent multi-view machine learning paradigm, i.e., data with multiple forms, our method can cluster the device information shared among the multi-layer features without supervision. Our information-theoretic approach can be extended to supervised and semi-supervised settings with straightforward derivations. In solving the formulated problem, we obtain a tight surrogate bound using variational inference for efficient optimization. In extracting the shared device information, we develop an algorithm based on the Wyner common information method, enjoying reduced computation complexity as compared to existing approaches. The algorithm can be applied to data distributions belonging to the exponential family class. Empirically, we evaluate the algorithm in a synthetic dataset with real-world video traffic and simulated physical layer characteristics. Our empirical results show that the proposed method outperforms the state-of-the-art baselines in both supervised and unsupervised settings.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15860v1"
    ],
    "publication_venue": null
}