{
    "arxiv_id": "2303.09610",
    "paper_title": "Self-assembly of atomic-scale photonic cavities",
    "authors": [
        "Ali Nawaz Babar",
        "Thor Weis",
        "Konstantinos Tsoukalas",
        "Shima Kadkhodazadeh",
        "Guillermo Arregui",
        "Babak Vosoughi Lahijani",
        "Søren Stobbe"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics",
        "physics.app-ph",
        "quant-ph"
    ],
    "abstract": "Despite tremendous progress in the research on self-assembled nanotechnological building blocks such as macromolecules, nanowires, and two-dimensional materials, synthetic self-assembly methods bridging nanoscopic to macroscopic dimensions remain unscalable and inferior to biological self-assembly. In contrast, planar semiconductor technology has had an immense technological impact owing to its inherent scalability, yet it appears unable to reach the atomic dimensions enabled by self-assembly. Here we use surface forces including Casimir-van der Waals interactions to deterministically self-assemble and self-align suspended silicon nanostructures with void features well below the length scales possible with conventional lithography and etching, despite using nothing more than conventional lithography and etching. The method is remarkably robust and the threshold for self-assembly depends monotonically on all governing parameters across thousands of measured devices. We illustrate the potential of these concepts by fabricating nanostructures, which are impossible to make with any other known method: Waveguide-coupled high-Q silicon photonic cavities that confine telecom photons to 2 nm air gaps with an aspect ratio of 100, corresponding to mode volumes more than 100 times below the diffraction limit. Scanning transmission electron microscopy measurements confirm the ability to build devices even with subnanometer dimensions. Our work constitutes the first steps towards a new generation of fabrication technology that combines the atomic dimensions enabled by self-assembly with the scalability of planar semiconductors.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09610v1"
    ],
    "publication_venue": null
}