{
    "arxiv_id": "2303.12991",
    "paper_title": "Implications for the Formation of 2005 UD from a New Convex Shape Model",
    "authors": [
        "Jay K. Kueny",
        "Colin Orion Chandler",
        "Maxime Devogèle",
        "Nicholas Moskovitz",
        "Petr Pravec",
        "Hana Kučáková",
        "Kamil Hornoch",
        "Peter Kušnirák",
        "Mikael Granvik",
        "Christina Konstantopoulou",
        "Nicholas E. Jannsen",
        "Shane Moran",
        "Lauri Siltala",
        "Grigori Fedorets",
        "Marin Ferrais",
        "Emmanuel Jehin",
        "Theodore Kareta",
        "Josef Hanuš"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "(155140) 2005 UD has a similar orbit to (3200) Phaethon, an active asteroid in a highly eccentric orbit thought to be the source of the Geminid meteor shower. Evidence points to a genetic relationship between these two objects, but we have yet to fully understand how 2005 UD and Phaethon could have separated into this associated pair. Presented herein are new observations of 2005 UD from five observatories that were carried out during the 2018, 2019, and 2021 apparitions. We implemented light curve inversion using our new data, as well as dense and sparse archival data from epochs in 2005--2021 to better constrain the rotational period and derive a convex shape model of 2005 UD. We discuss two equally well-fitting pole solutions ($λ= 116.6^{\\circ}$, $β= -53.6^{\\circ}$) and ($λ= 300.3^{\\circ}$, $β= -55.4^{\\circ}$), the former largely in agreement with previous thermophysical analyses and the latter interesting due to its proximity to Phaethon's pole orientation. We also present a refined sidereal period of $P_{\\text{sid}} = 5.234246 \\pm 0.000097$ hr. A search for surface color heterogeneity showed no significant rotational variation. An activity search using the deepest stacked image available of 2005 UD near aphelion did not reveal a coma or tail but allowed modeling of an upper limit of 0.04 to 0.37~kg s$^{-1}$ for dust production. We then leveraged our spin solutions to help limit the range of formation scenarios and the link to Phaethon in the context of nongravitational forces and timescales associated with the physical evolution of the system.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12991v1"
    ],
    "publication_venue": "22 pages, 7 figure, 7 tables"
}