{
    "arxiv_id": "2303.13111",
    "paper_title": "Boosting Convolution with Efficient MLP-Permutation for Volumetric Medical Image Segmentation",
    "authors": [
        "Yi Lin",
        "Xiao Fang",
        "Dong Zhang",
        "Kwang-Ting Cheng",
        "Hao Chen"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-08-25"
    ],
    "latest_version": 3,
    "categories": [
        "eess.IV",
        "cs.CV"
    ],
    "abstract": "Recently, the advent of vision Transformer (ViT) has brought substantial advancements in 3D dataset benchmarks, particularly in 3D volumetric medical image segmentation (Vol-MedSeg). Concurrently, multi-layer perceptron (MLP) network has regained popularity among researchers due to their comparable results to ViT, albeit with the exclusion of the resource-intensive self-attention module. In this work, we propose a novel permutable hybrid network for Vol-MedSeg, named PHNet, which capitalizes on the strengths of both convolution neural networks (CNNs) and MLP. PHNet addresses the intrinsic isotropy problem of 3D volumetric data by employing a combination of 2D and 3D CNNs to extract local features. Besides, we propose an efficient multi-layer permute perceptron (MLPP) module that captures long-range dependence while preserving positional information. This is achieved through an axis decomposition operation that permutes the input tensor along different axes, thereby enabling the separate encoding of the positional information. Furthermore, MLPP tackles the resolution sensitivity issue of MLP in Vol-MedSeg with a token segmentation operation, which divides the feature into smaller tokens and processes them individually. Extensive experimental results validate that PHNet outperforms the state-of-the-art methods with lower computational costs on the widely-used yet challenging COVID-19-20 and Synapse benchmarks. The ablation study also demonstrates the effectiveness of PHNet in harnessing the strengths of both CNNs and MLP.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13111v1",
        "http://arxiv.org/pdf/2303.13111v2",
        "http://arxiv.org/pdf/2303.13111v3"
    ],
    "publication_venue": null
}