{
    "arxiv_id": "2303.16334",
    "paper_title": "Mechanisms of drag reduction by semi-dilute inertial particles in turbulent channel flow",
    "authors": [
        "Himanshu Dave",
        "M. Houssem Kasbaoui"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "We investigate the mechanisms by which inertial particles dispersed at semi-dilute conditions cause significant drag-reduction in a turbulent channel flow at $\\mathrm{Re}_τ= 180$. We consider a series of four-way coupled Euler-Lagrange simulations where particles having friction Stokes number $\\mathrm{St}^+ = 6$ or 30 are introduced at progressively increasing mass loading from $M=0.2$ to 1.0. The simulations show that $\\mathrm{St}^+ = 30$ particles cause large drag-reduction by up to 19.74\\% at $M=1.0$, whereas $\\mathrm{St}^+ = 6$ particles cause large drag increase by up to 16.92\\% at $M=1.0$. To reveal the mechanisms underpinning drag-reduction or drag-increase, we investigate the stress distribution within the channel and the impact of the dispersed particles on the near-wall coherent structures. We find a distinctive feature of drag-reducing particles which consists in the formation of extremely long clusters, called ropes. These structures align preferentially with the low-speed streaks and contribute to their stabilization and suppression of bursting. Despite the additional stresses due to the particles, the modulation of the near-wall coherent structures leads to a greater reduction of Reynolds shear stresses and partial relaminarization of the near-wall flow. In the case of the drag-increasing particles with $\\mathrm{St}^+ = 6$, a reduction in Reynolds shear stresses is also observed, however, this reduction is insufficient to overcome the additional particle stresses which leads to drag increase.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16334v1"
    ],
    "publication_venue": null
}