{
    "arxiv_id": "2303.13114",
    "paper_title": "Universal radiation tolerant semiconductor",
    "authors": [
        "Alexander Azarov",
        "Javier García Fernández",
        "Junlei Zhao",
        "Flyura Djurabekova",
        "Huan He",
        "Ru He",
        "Øystein Prytz",
        "Lasse Vines",
        "Umutcan Bektas",
        "Paul Chekhonin",
        "Nico Klingner",
        "Gregor Hlawacek",
        "Andrej Kuznetsov"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.app-ph"
    ],
    "abstract": "Radiation tolerance is determined as an ability of crystalline materials to withstand the accumulation of the radiation induced disorder. Based on the magnitudes of such disorder levels, semiconductors are commonly grouped into the low- or high-radiation tolerant. Nevertheless, upon exposing to sufficiently high fluences, in all cases known by far, it ends up with either extremely high disorder levels or amorphization. Here we show that gamma/beta double polymorph Ga2O3 structures exhibit unprecedently high radiation tolerance. Specifically, for room temperature experiments, they tolerate a disorder equivalent to hundreds of displacements per atom, without severe degradations of crystallinity; in comparison with, e.g., Si amorphizable already with the lattice atoms displaced just once. We explain this behavior by an interesting combination of the Ga- and O-sublattice properties in gamma-Ga2O3. In particular, O-sublattice exhibits a strong recrystallization trend to recover the face-centered-cubic stacking despite high mobility of O atoms in collision cascades compared to Ga. Concurrently, the characteristic structure of the Ga-sublattice is nearly insensitive to the accumulated disorder. Jointly it explains macroscopically negligible structural deformations in gamma-Ga2O3 observed in experiment. Notably, we also explained the origin of the beta-to-gamma Ga2O3 transformation, as a function of increased disorder in beta-Ga2O3 and studied the phenomena as a function of the chemical nature of the implanted atoms. As a result, we conclude that gamma-beta double polymorph Ga2O3 structures, in terms of their radiation tolerance properties, benchmark a new class of universal radiation tolerant semiconductors.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13114v1"
    ],
    "publication_venue": null
}