{
    "arxiv_id": "2303.08791",
    "paper_title": "Halide perovskite artificial solids as a new platform to simulate collective phenomena in doped Mott insulators",
    "authors": [
        "Alessandra Milloch",
        "Umberto Filippi",
        "Paolo Franceschini",
        "Michele Galvani",
        "Selene Mor",
        "Stefania Pagliara",
        "Gabriele Ferrini",
        "Francesco Banfi",
        "Massimo Capone",
        "Dmitry Baranov",
        "Liberato Manna",
        "Claudio Giannetti"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-11-27"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el",
        "cond-mat.mes-hall",
        "cond-mat.mtrl-sci",
        "physics.optics",
        "quant-ph"
    ],
    "abstract": "The development of Quantum Simulators, artificial platforms where the predictions of many-body theories of correlated quantum materials can be tested in a controllable and tunable way, is one of the main challenges of condensed matter physics. Here we introduce artificial lattices made of lead halide perovskite nanocubes as a new platform to simulate and investigate the physics of correlated quantum materials. The ultrafast optical injection of quantum confined excitons plays the role of doping in real materials. We show that, at large photo-doping, the exciton gas undergoes an excitonic Mott transition, which fully realizes the magnetic-field-driven insulator-to-metal transition described by the Hubbard model. At lower photo-doping, the long-range interactions drive the formation of a collective superradiant state, in which the phases of the excitons generated in each single perovskite nanocube are coherently locked. Our results demonstrate that time-resolved experiments span a parameter region of the Hubbard model in which long-range and phase-coherent orders emerge out of a doped Mott insulating phase. This physics is relevant for a broad class of phenomena, such as superconductivity and charge-density waves in correlated materials whose properties are captured by doped Hubbard models.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08791v1"
    ],
    "publication_venue": null,
    "doi": "10.1021/acs.nanolett.3c03715"
}