{
    "arxiv_id": "2303.08549",
    "paper_title": "A Bregman-Kaczmarz method for nonlinear systems of equations",
    "authors": [
        "Robert Gower",
        "Dirk A. Lorenz",
        "Maximilian Winkler"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2024-02-23"
    ],
    "latest_version": 5,
    "categories": [
        "math.OC",
        "math.NA"
    ],
    "abstract": "We propose a new randomized method for solving systems of nonlinear equations, which can find sparse solutions or solutions under certain simple constraints. The scheme only takes gradients of component functions and uses Bregman projections onto the solution space of a Newton equation. In the special case of euclidean projections, the method is known as nonlinear Kaczmarz method. Furthermore, if the component functions are nonnegative, we are in the setting of optimization under the interpolation assumption and the method reduces to SGD with the recently proposed stochastic Polyak step size. For general Bregman projections, our method is a stochastic mirror descent with a novel adaptive step size. We prove that in the convex setting each iteration of our method results in a smaller Bregman distance to exact solutions as compared to the standard Polyak step. Our generalization to Bregman projections comes with the price that a convex one-dimensional optimization problem needs to be solved in each iteration. This can typically be done with globalized Newton iterations. Convergence is proved in two classical settings of nonlinearity: for convex nonnegative functions and locally for functions which fulfill the tangential cone condition. Finally, we show examples in which the proposed method outperforms similar methods with the same memory requirements.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08549v1",
        "http://arxiv.org/pdf/2303.08549v2",
        "http://arxiv.org/pdf/2303.08549v3",
        "http://arxiv.org/pdf/2303.08549v4",
        "http://arxiv.org/pdf/2303.08549v5"
    ],
    "publication_venue": null,
    "doi": "10.1007/s10589-023-00541-9"
}