{
    "arxiv_id": "2303.12888",
    "paper_title": "A dynamic risk score for early prediction of cardiogenic shock using machine learning",
    "authors": [
        "Yuxuan Hu",
        "Albert Lui",
        "Mark Goldstein",
        "Mukund Sudarshan",
        "Andrea Tinsay",
        "Cindy Tsui",
        "Samuel Maidman",
        "John Medamana",
        "Neil Jethani",
        "Aaalad Puli",
        "Vuthy Nguy",
        "Yindalon Aphinyanaphongs",
        "Nicholas Kiefer",
        "Nathaniel Smilowitz",
        "James Horowitz",
        "Tania Ahuja",
        "Glenn Fishman",
        "Judith Hochman",
        "Stuart Katz",
        "Samuel Bernard",
        "Rajesh Ranganath"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cs.AI"
    ],
    "abstract": "Myocardial infarction and heart failure are major cardiovascular diseases that affect millions of people in the US. The morbidity and mortality are highest among patients who develop cardiogenic shock. Early recognition of cardiogenic shock is critical. Prompt implementation of treatment measures can prevent the deleterious spiral of ischemia, low blood pressure, and reduced cardiac output due to cardiogenic shock. However, early identification of cardiogenic shock has been challenging due to human providers' inability to process the enormous amount of data in the cardiac intensive care unit (ICU) and lack of an effective risk stratification tool. We developed a deep learning-based risk stratification tool, called CShock, for patients admitted into the cardiac ICU with acute decompensated heart failure and/or myocardial infarction to predict onset of cardiogenic shock. To develop and validate CShock, we annotated cardiac ICU datasets with physician adjudicated outcomes. CShock achieved an area under the receiver operator characteristic curve (AUROC) of 0.820, which substantially outperformed CardShock (AUROC 0.519), a well-established risk score for cardiogenic shock prognosis. CShock was externally validated in an independent patient cohort and achieved an AUROC of 0.800, demonstrating its generalizability in other cardiac ICUs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12888v1"
    ],
    "publication_venue": null
}