{
    "arxiv_id": "2303.09444",
    "paper_title": "Search for excited $τ$-leptons and leptoquarks in the final state with $τ$-leptons and jets in pp collisions at $\\sqrt{s} = 13$ TeV with the ATLAS detector",
    "authors": [
        "ATLAS Collaboration"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-07-04"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ex"
    ],
    "abstract": "A search is reported for excited $τ$-leptons and leptoquarks in events with two hadronically decaying $τ$-leptons and two or more jets. The search uses proton-proton (pp) collision data at $\\sqrt{s} = 13$ TeV recorded by the ATLAS experiment during the Run 2 of the Large Hadron Collider in 2015-2018. The total integrated luminosity is 139 fb$^{-1}$. The excited $τ$-lepton is assumed to be produced and to decay via a four-fermion contact interaction into an ordinary $τ$-lepton and a quark-antiquark pair. The leptoquarks are assumed to be produced in pairs via the strong interaction, and each leptoquark is assumed to couple to a charm or lighter quark and a $τ$-lepton. No excess over the background prediction is observed. Excited $τ$-leptons with masses below 2.8 TeV are excluded at 95% CL in scenarios with the contact interaction scale $Λ$ set to 10 TeV. At the extreme limit of model validity where $Λ$ is set equal to the excited $τ$-lepton mass, excited $τ$-leptons with masses below 4.6 TeV are excluded. Leptoquarks with masses below 1.3 TeV are excluded at 95% CL if their branching ratio to a charm quark and a $τ$-lepton equals 1. The analysis does not exploit flavour-tagging in the signal region.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09444v1"
    ],
    "publication_venue": "43 pages in total, author list starting page 26, 8 figures, 2 tables, submitted to JHEP. All figures including auxiliary figures are available at https://atlas.web.cern.ch/Atlas/GROUPS/PHYSICS/PAPERS/EXOT-2020-18/",
    "doi": "10.1007/JHEP06(2023)199"
}