{
    "arxiv_id": "2303.12033",
    "paper_title": "The interplay between radio AGN activity and their host galaxies",
    "authors": [
        "Guilherme S. Couto",
        "Thaisa Storchi-Bergmann"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Radio activity in AGN (Active Galactic Nuclei) produce feedback on the host galaxy via the impact of the relativistic jets on the circumnuclear gas. Although radio jets can reach up to several times the optical radius of the host galaxy, in this review we focus on the observation of the feedback deposited locally in the central region of the host galaxies, in the form of outflows due to the jet-gas interaction. We begin by discussing how galaxy mergers and interactions are the most favored scenario for triggering radio AGN after gas accretion to the nuclear supermassive black hole and star formation enhancement in the nuclear region, observed in particular in the most luminous sources. We then discuss observational signatures of the process of jet-gas coupling, in particular the resulting outflows and their effects on the host galaxy. These include the presence of shock signatures and the detection of outflows not only along the radio jet but perpendicular to it in many sources. Although most of the studies are done via the observation of ionized gas, molecular gas is also being increasingly observed in outflow, contributing to the bulk of the mass outflow rate. Even though most radio sources present outflow kinetic powers that do not reach $1\\%\\,L_{bol}$, and thus do not seem to provide an immediate impact on the host galaxy, they act to heat the ISM gas, preventing star formation, slowing the galaxy mass build-up process and limiting the stellar mass growth, in a ``maintenance mode\" feedback.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12033v1"
    ],
    "publication_venue": "22 pages, 8 figures. Published in Galaxies Special Issue \"The Symbiosis between Radio Source and Galaxy Evolution\" O'Dea & Baum (guest editors). Comments are welcome",
    "doi": "10.3390/galaxies11020047"
}