{
    "arxiv_id": "2303.09812",
    "paper_title": "Intrinsic and extrinsic anomalous transport properties of Heusler ferromagnets Fe$_2$CoAl and Fe$_2$NiAl from first principles",
    "authors": [
        "Xiuxian Yang",
        "Wanxiang Feng",
        "Xiao-Ping Li",
        "Gui-Bin Liu",
        "Yuriy Mokrousov",
        "and Yugui Yao"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Recently, Heusler ferromagnets have been found to exhibit unconventional anomalous electric, thermal, and thermoelectric transport properties. In this study, we employed first-principles density functional theory calculations to systematically investigate both intrinsic and extrinsic contributions to the anomalous Hall effect (AHE), anomalous Nernst effect (ANE), and anomalous thermal Hall effect (ATHE) in two Heusler ferromagnets: Fe$_2$CoAl and Fe$_2$NiAl. Our analysis reveals that the extrinsic mechanism originating from disorder dominates the AHE and ATHE in Fe$_2$CoAl , primarily due to the steep band dispersions across the Fermi energy and corresponding high longitudinal electronic conductivity. Conversely, the intrinsic Berry phase mechanism, physically linked to nearly flat bands around the Fermi energy and gapped by spin-orbit interaction band crossings, governs the AHE and ATHE in Fe$_2$NiAl. With respect to ANE, both intrinsic and extrinsic mechanisms are competing in Fe$_2$CoAl as well as in Fe$_2$NiAl. Furthermore, Fe$_2$CoAl and Fe$_2$NiAl exhibit tunable and remarkably pronounced anomalous transport properties. For instance, the anomalous Nernst and anomalous thermal Hall conductivities in Fe$_2$NiAl attain giant values of 8.29 A/Km and 1.19 W/Km, respectively, at room temperature. To provide a useful comparison, we also thoroughly investigated the anomalous transport properties of Co$_2$MnGa. Our findings suggest that Heusler ferromagnets Fe$_2$CoAl and Fe$_2$NiAl are promising candidates for spintronics and spin-caloritronics applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09812v1"
    ],
    "publication_venue": "9 pages, 5 figures",
    "doi": "10.1103/PhysRevB.107.224405"
}