{
    "arxiv_id": "2303.15451",
    "paper_title": "Automated tuning for the parameters of linear solvers",
    "authors": [
        "Andrey Petrushov",
        "Boris Krasnopolsky"
    ],
    "submission_date": "2023-02-25",
    "revised_dates": [
        "2023-08-01"
    ],
    "latest_version": 2,
    "categories": [
        "math.NA",
        "cs.DC"
    ],
    "abstract": "Robust iterative methods for solving large sparse systems of linear algebraic equations often suffer from the problem of optimizing the corresponding tuning parameters. To improve the performance of the problem of interest, specific parameter tuning is required, which in practice can be a time-consuming and tedious task. This paper proposes an optimization algorithm for tuning the numerical method parameters. The algorithm combines the evolution strategy with the pre-trained neural network used to filter the individuals when constructing the new generation. The proposed coupling of two optimization approaches allows to integrate the adaptivity properties of the evolution strategy with a priori knowledge realized by the neural network. The use of the neural network as a preliminary filter allows for significant weakening of the prediction accuracy requirements and reusing the pre-trained network with a wide range of linear systems.\n  The detailed algorithm efficiency evaluation is performed for a set of model linear systems, including the ones from the SuiteSparse Matrix Collection and the systems from the turbulent flow simulations. The obtained results show that the pre-trained neural network can be effectively reused to optimize parameters for various linear systems, and a significant speedup in the calculations can be achieved at the cost of about 100 trial solves. The hybrid evolution strategy decreases the calculation time by more than 6 times for the black box matrices from the SuiteSparse Matrix Collection and by a factor of 1.4-2 for the sequence of linear systems when modeling turbulent flows. This results in a speedup of up to 1.8 times for the turbulent flow simulations performed in the paper.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15451v1",
        "http://arxiv.org/pdf/2303.15451v2"
    ],
    "publication_venue": null
}