{
    "arxiv_id": "2303.15238",
    "paper_title": "Understanding the chemical coupling between ground-level ozone and oxides of nitrogen in ambient air at industrial and commercial sites in central India",
    "authors": [
        "Suchetana Sadhukhan",
        "Satish Bhagwatrao Aher",
        "Pon Harshavardhanan",
        "Dharma Raj",
        "Subroto Shambhu Nandi"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ao-ph"
    ],
    "abstract": "This study investigates the hourly concentrations of Ground-level Ozone (O3), Nitric Oxide (NO), Nitrogen Dioxide (NO2), and Oxides of Nitrogen (NOx) in ambient air, along with the various meteorological parameters viz., ambient temperature, relative humidity, wind speed, and solar radiation over one year, from August 2020 to July 2021 for an industrial and commercial site in Madhya Pradesh, a central state in India. We also analyze the chemical coupling between the O3 and ambient NO, NO2, and NOx at both sites during the daytime. We focus on understanding how the concentration of the oxidant OX (a combination of ozone and nitrogen dioxide) changes in relation to levels of NOx (a combination of nitrogen oxides) to determine whether the atmospheric sources of OX are dependent on the NOx-independent or regional contributions and NOx-dependent or local contributions. We also observe a significant positive correlation of O3 with ambient temperature and solar radiation but a strong negative correlation with relative humidity for the considered period. We found the monthly variations of the pollutants' concentrations show a strong seasonality dependence. O3 concentration becomes highest/lowest during summer/monsoon for both sites. In contrast, NOx exhibits the maximum and minimum concentration during monsoon and summer for both sites. The daily variation shows the opposite trend for O3 and NOx. O3 reaches a peak at mid-day around 14: 00 Hrs when ambient temperature also goes to maximum and has the minimum value at night time due to lack of sunlight.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15238v1"
    ],
    "publication_venue": "14 pages, 8 figures, 2 tables"
}