{
    "arxiv_id": "2303.11705",
    "paper_title": "A Single-Step Multiclass SVM based on Quantum Annealing for Remote Sensing Data Classification",
    "authors": [
        "Amer Delilbasic",
        "Bertrand Le Saux",
        "Morris Riedel",
        "Kristel Michielsen",
        "Gabriele Cavallaro"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cs.CV",
        "quant-ph"
    ],
    "abstract": "In recent years, the development of quantum annealers has enabled experimental demonstrations and has increased research interest in applications of quantum annealing, such as in quantum machine learning and in particular for the popular quantum SVM. Several versions of the quantum SVM have been proposed, and quantum annealing has been shown to be effective in them. Extensions to multiclass problems have also been made, which consist of an ensemble of multiple binary classifiers. This work proposes a novel quantum SVM formulation for direct multiclass classification based on quantum annealing, called Quantum Multiclass SVM (QMSVM). The multiclass classification problem is formulated as a single Quadratic Unconstrained Binary Optimization (QUBO) problem solved with quantum annealing. The main objective of this work is to evaluate the feasibility, accuracy, and time performance of this approach. Experiments have been performed on the D-Wave Advantage quantum annealer for a classification problem on remote sensing data. The results indicate that, despite the memory demands of the quantum annealer, QMSVM can achieve accuracy that is comparable to standard SVM methods and, more importantly, it scales much more efficiently with the number of training examples, resulting in nearly constant time. This work shows an approach for bringing together classical and quantum computation, solving practical problems in remote sensing with current hardware.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11705v1"
    ],
    "publication_venue": "12 pages, 10 figures, 3 tables. Submitted to IEEE JSTARS"
}