{
    "arxiv_id": "2303.15929",
    "paper_title": "Stochastic gravitational wave background reconstruction for a non-equilateral and unequal-noise LISA constellation",
    "authors": [
        "Olaf Hartwig",
        "Marc Lilley",
        "Martina Muratore",
        "Mauro Pieroni"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-07-05"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc",
        "astro-ph.CO"
    ],
    "abstract": "We explore the impact of choosing different sets of Time-Delay Interferometry (TDI) variables for detecting and reconstructing Stochastic Gravitational Wave Background (SGWB) signals and estimating the instrumental noise in LISA. Most works in the literature build their data analysis pipelines relying on a particular set of TDI channels, the so-called AET variables, which are orthogonal under idealized conditions. By relaxing the assumption of a perfectly equilateral LISA configuration, we investigate to which degree these channels remain orthogonal and compare them to other TDI channels. We show that different sets of TDI variables are more robust under perturbations of the perfect equilateral configuration, better preserving their orthogonality and, thus, leading to a more accurate estimate of the instrumental noise. Moreover, we investigate the impact of considering the noise levels associated with each instrumental noise source to be independent of one another, generalizing the analysis from two to twelve noise parameters. We find that, in this scenario, the assumption of orthogonality is broken for all the TDI variables, leading to a misestimation of measurement error for some of the noise parameters. Remarkably, we find that for a flat power-law signal, the reconstruction of the signal parameters is nearly unaffected in these various configurations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15929v1"
    ],
    "publication_venue": "31 pages, 13 figures, and supplementary material",
    "doi": "10.1103/PhysRevD.107.123531"
}