{
    "arxiv_id": "2303.11310",
    "paper_title": "How Robust are Timely Gossip Networks to Jamming Attacks?",
    "authors": [
        "Priyanka Kaswan",
        "Sennur Ulukus"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cs.IT",
        "cs.NI",
        "eess.SP"
    ],
    "abstract": "We consider a semantics-aware communication system, where timeliness is the semantic measure, with a source which maintains the most current version of a file, and a network of $n$ user nodes with the goal to acquire the latest version of the file. The source gets updated with newer file versions as a point process, and forwards them to the user nodes, which further forward them to their neighbors using a memoryless gossip protocol. We study the average version age of the network in the presence of $\\tilde{n}$ jammers that disrupt inter-node communications, for the connectivity-constrained ring topology and the connectivity-rich fully connected topology. For the ring topology, we construct an alternate system model of mini-rings and prove that the version age of the original model can be sandwiched between constant multiples of the version age of the alternate model. We show in a ring network that when the number of jammers scales as a fractional power of the network size, i.e., $\\tilde n= cn^α$, the version age scales as $\\sqrt{n}$ when $α< \\frac{1}{2}$, and as $n^α$ when $α\\geq \\frac{1}{2}$. As version age of a ring network without any jammers scales as $\\sqrt{n}$, our result implies that version age with gossiping is robust against upto $\\sqrt{n}$ jammers in a ring network. We then study the connectivity-rich fully connected topology, where we derive a greedy approach to place $\\tilde{n}$ jammers to maximize age of the resultant network, which uses jammers to isolate as many nodes as possible, thereby consolidating all links into a single mini-fully connected network. We show in this network that version age scales as $\\log{n}$ when $\\tilde{n}=cn\\log{n}$ and as $n^{α-1}$, $1<α\\leq2$ when $\\tilde{n}=cn^α$, implying the network is robust against $n\\log{n}$ jammers, since the age in a fully connected network without jammers scales as $\\log{n}$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11310v1"
    ],
    "publication_venue": "arXiv admin note: substantial text overlap with arXiv:2205.03328"
}