{
    "arxiv_id": "2303.08751",
    "paper_title": "Advanced Analysis of Radar Cross-Section Measurements in Reverberation Environment",
    "authors": [
        "Corentin Charlo",
        "Stéphane Méric",
        "François Sarrazin",
        "Elodie Richalot",
        "Jérôme Sol",
        "Philippe Besnier"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph"
    ],
    "abstract": "Reverberation chambers (RCs) were recently reported as a low-cost alternative to anechoic chambers (ACs) to perform radar cross-section (RCS) pattern measurements. The method consists of using transmitting and receiving antennas pointing towards a target under test placed on a rotating mast. As a classical RCS characterization, the echo signal is analysed based on two measurements with and without the target in the RC. In the hypothesis of an ideal diffuse field generated in the RC, this signal difference appears as the echo signal hidden in a Gaussian noise. In case of a point-like backscattering target, observing this signal over a given frequency bandwidth allows the identification of the target response as a sinusoidal signal over this bandwidth whose period is related to the antenna-target distance measured from the measurement calibration plane positions. Therefore, the extraction of the magnitude of this sinusoidal signal requires a proper estimation of this distance. Furthermore, a sinusoidal regression processing relies on the approximation of a constant envelope over the selected frequency bandwidth, imposing some restrictions. In this paper, we introduce a two-step method that consists in identifying the most appropriate distance according to the target's orientation before estimating the magnitude of the sinusoidal signal. We highlight improvement of RCS estimation on a point-like back-scattering target compared to the one-step procedure applied so far. In addition, it is shown that the analysis performed regarding the estimated distance provides a physical insight into the position of the equivalent backscattering point.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08751v1"
    ],
    "publication_venue": null
}