{
    "arxiv_id": "2303.13349",
    "paper_title": "Inclusive and multiplicity dependent production of electrons from heavy-flavour hadron decays in pp and p$-$Pb collisions",
    "authors": [
        "ALICE Collaboration"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "nucl-ex",
        "hep-ex"
    ],
    "abstract": "Measurements of the production of electrons from heavy-flavour hadron decays in pp collisions at $\\sqrt{s} = 13$ TeV at midrapidity with the ALICE detector are presented down to a transverse momentum ($p_{\\rm T}$) of 0.2 GeV$/c$ and up to $p_{\\rm T} = 35$ GeV$/c$, which is the largest momentum range probed for inclusive electron measurements in ALICE. In p$-$Pb collisions, the production cross section and the nuclear modification factor of electrons from heavy-flavour hadron decays are measured in the $p_{\\rm T}$ range $0.5 < p_{\\rm T} < 26$ GeV$/c$ at $\\sqrt{s_{\\rm NN}} = 8.16$ TeV. The nuclear modification factor is found to be consistent with unity within the statistical and systematic uncertainties. In both collision systems, first measurements of the yields of electrons from heavy-flavour hadron decays in different multiplicity intervals normalised to the multiplicity-integrated yield (self-normalised yield) at midrapidity are reported as a function of the self-normalised charged-particle multiplicity estimated at midrapidity. The self-normalised yields in pp and p$-$Pb collisions grow faster than linear with the self-normalised multiplicity. A strong $p_{\\rm T}$ dependence is observed in pp collisions, where the yield of high-$p_{\\rm T}$ electrons increases faster as a function of multiplicity than the one of low-$p_{\\rm T}$ electrons. The measurement in p$-$Pb collisions shows no $p_{\\rm T}$ dependence within uncertainties. The self-normalised yields in pp and p$-$Pb collisions are compared with measurements of other heavy-flavour, light-flavour, and strange particles, and with Monte Carlo simulations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13349v1"
    ],
    "publication_venue": "46 pages, 17 captioned figures, 8 tables, authors from page 41, submitted to JHEP, figures at http://alice-publications.web.cern.ch/node/9209"
}