{
    "arxiv_id": "2303.16930",
    "paper_title": "Constraining the dark matter contribution of $γ$ rays in Cluster of galaxies using Fermi-LAT data",
    "authors": [
        "Mattia Di Mauro",
        "Judit Pérez-Romero",
        "Miguel A. Sánchez-Conde",
        "Nicolao Fornengo"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "hep-ph"
    ],
    "abstract": "Clusters of galaxies are the largest gravitationally-bound systems in the Universe. Their dynamics are dominated by dark matter (DM), which makes them among the best targets for indirect DM searches. We analyze 12 years of data collected by the Fermi Large Area Telescope (Fermi-LAT) in the direction of 49 clusters of galaxies selected for their proximity to the Earth and their high X-ray flux, which makes them the most promising targets. We first create physically motivated models for the DM density around each cluster considering different assumptions for the substructure distribution. Then we perform a combined search for a $γ$-ray signal in the {\\it Fermi}-LAT data between 500 MeV and 1 TeV. We find a signal of $γ$ rays potentially associated with DM that is at a statistical significance of $2.5σ-3.0σ$ when considering a slope for the subhalo mass distribution $α=1.9$ and minimum mass of $M_{\\rm{min}}=10^{-6}$ $M_{\\odot}$. The best-fit DM mass and annihilation cross-sections for a $b\\bar{b}$ annihilation channel are $m_χ=40-60$ GeV and $\\langle σv \\rangle = (2-4) \\times 10^{-25}$ cm$^3$/s. When we consider $α=2.0$ and $M_{\\rm{min}}=10^{-9}$ $M_{\\odot}$, the best-fit of the cross section reduces to $\\langle σv \\rangle = (4-10) \\times 10^{-26}$ cm$^3$/s. For both DM substructure models there is a tension between the values of $\\langle σv \\rangle$ that we find and the upper limits obtained with the non-detection of a $γ$-ray flux from Milky Way dwarf spheroidal galaxies. This signal is thus more likely associated with $γ$ rays produced in the intracluster region by cosmic rays colliding with gas and photon fields.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16930v1"
    ],
    "publication_venue": "27 Pages, 13 Figures. Accepted for publication in the PRD journal",
    "doi": "10.1103/PhysRevD.107.083030"
}