{
    "arxiv_id": "2303.10960",
    "paper_title": "Improved Benthic Classification using Resolution Scaling and SymmNet Unsupervised Domain Adaptation",
    "authors": [
        "Heather Doig",
        "Oscar Pizarro",
        "Stefan B. Williams"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV",
        "cs.RO"
    ],
    "abstract": "Autonomous Underwater Vehicles (AUVs) conduct regular visual surveys of marine environments to characterise and monitor the composition and diversity of the benthos. The use of machine learning classifiers for this task is limited by the low numbers of annotations available and the many fine-grained classes involved. In addition to these challenges, there are domain shifts between image sets acquired during different AUV surveys due to changes in camera systems, imaging altitude, illumination and water column properties leading to a drop in classification performance for images from a different survey where some or all these elements may have changed. This paper proposes a framework to improve the performance of a benthic morphospecies classifier when used to classify images from a different survey compared to the training data. We adapt the SymmNet state-of-the-art Unsupervised Domain Adaptation method with an efficient bilinear pooling layer and image scaling to normalise spatial resolution, and show improved classification accuracy. We test our approach on two datasets with images from AUV surveys with different imaging payloads and locations. The results show that generic domain adaptation can be enhanced to produce a significant increase in accuracy for images from an AUV survey that differs from the training images.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10960v1"
    ],
    "publication_venue": "7 pages, 6 figures. Accepted to IEEE International Conference on Robotics and Automation (ICRA) 2023, London UK"
}