{
    "arxiv_id": "2303.10300",
    "paper_title": "Designing mechanical response using tessellated granular metamaterials",
    "authors": [
        "Jerry Zhang",
        "Dong Wang",
        "Weiwei Jin",
        "Annie Xia",
        "Nidhi Pashine",
        "Rebecca Kramer-Bottiglio",
        "Mark D. Shattuck",
        "Corey S. O'Hern"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-09-11"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft"
    ],
    "abstract": "Jammed packings of granular materials display complex mechanical response. For example, the ensemble-averaged shear modulus $\\left\\langle G \\right\\rangle$ increases as a power-law in pressure $p$ for static packings of spherical particles that can rearrange during compression. We seek to design granular materials with shear moduli that can either increase {\\it or} decrease with pressure without particle rearrangements even in the large-system limit. To do this, we construct {\\it tessellated} granular metamaterials by joining multiple particle-filled cells together. We focus on cells that contain a small number of bidisperse disks in two dimensions. We first study the mechanical properties of individual disk-filled cells with three types of boundaries: periodic boundary conditions, fixed-length walls, and flexible walls. Hypostatic jammed packings are found for disk-filled cells with flexible walls, but not in cells with periodic boundary conditions and fixed-length walls, and they are stabilized by quartic modes of the dynamical matrix. The shear modulus of a single cell depends linearly on $p$. We find that the slope of the shear modulus with pressure, $λ_c < 0$ for all packings in single cells with periodic boundary conditions where the number of particles per cell $N \\ge 6$. In contrast, single cells with fixed-length and flexible walls can possess $λ_c > 0$, as well as $λ_c < 0$, for $N \\le 16$. We show that we can force the mechanical properties of multi-cell granular metamaterials to possess those of single cells by constraining the endpoints of the outer walls and enforcing an affine shear response. These studies demonstrate that tessellated granular metamaterials provide a novel platform for the design of soft materials with novel mechanical properties.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10300v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevE.108.034901"
}