{
    "arxiv_id": "2303.15370",
    "paper_title": "Microstructural engineering by heat treatments of multi-principal element alloys via spinodal mediated phase transformation pathways",
    "authors": [
        "Shalini Roy Koneru",
        "Kamalnath Kadirvel",
        "Hamish Fraser",
        "Yunzhi Wang"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Nanoscale multi-phase microstructures observed in multi-principal element alloys (MPEAs) such as $\\rm AlMo_{0.5}NbTa_{0.5}TiZr$, $\\rm Al_{0.5}NbTa_{0.8}Ti_{1.5}V_{0.2}Zr$, $\\rm TiZrNbTa$, $\\rm AlCoCrFeNi$ and $\\rm Fe_{15}Co_{15}Ni_{20}Mn_{20}Cu_{30}$ that exhibit promising mechanical or functional properties may have evolved through spinodal-mediated phase transformation pathways (PTPs). The microstructures in such MPEA systems could be further engineered for targeted applications by appropriately designing the alloy composition and heat-treatment schedule. In this study, we investigate systematically how different heat treatment schedules such as single-step isothermal aging, two-step isothermal aging and continuous cooling alter the interplay among the various factors associated with alloy composition, such as volume fraction of individual phases, lattice misfit and modulus mismatch between the co-existing phases. We have determined the degree to which these factors influence significantly the spinodal-mediated PTPs and the corresponding microstructures by use of high-throughput phase-field simulations. In particular, we demonstrate that the microstructural topology (i.e., which phase forms the continuous matrix and which phase forms discrete precipitates) in the same MPEA having an asymmetric miscibility gap could be inverted simply by a continuous cooling heat treatment. Further, we reveal a rich variety of novel hierarchical microstructures that could be designed using two-step isothermal aging heat treatments in MPEA systems with symmetric or asymmetric miscibility gaps. These simulation results may shed light on novel microstructure design and engineering for the above-mentioned MPEA systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15370v1"
    ],
    "publication_venue": "Preprint submitted to Acta Materialia, 31 pages, 11 figures"
}