{
    "arxiv_id": "2303.09029",
    "paper_title": "Tuning Higher Order Structure in Colloidal Fluids",
    "authors": [
        "Xiaoyue Wu",
        "Fiona C. Meldrum",
        "Katherine Skipper",
        "Yushi Yang",
        "C. Patrick Royall"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2024-12-19"
    ],
    "latest_version": 3,
    "categories": [
        "cond-mat.soft",
        "cond-mat.mtrl-sci",
        "cond-mat.stat-mech"
    ],
    "abstract": "Colloidal particles self assemble into a wide range of structures under external AC electric fields due to induced dipolar interactions [Yethiraj and Van Blaaderen Nature 421 513 (2003)]. As a result of these dipolar interactions, at low volume fraction the system is modulated between a hard-sphere like state (in the case of zero applied field) and a \"string fluid\" upon application of the field. Using both particle-resolved experiments and Brownian dynamics simulations, we investigate the emergence of the string fluid with a variety of structural measures including two-body and higher-order correlations. The higher-order structure we probe using three-body spatial correlation functions and a many-body approach based on minimum energy clusters of a dipolar-Lennard-Jones system. This yields a series of geometrically distinct minimum energy clusters upon increasing the strength of the dipolar interaction, which are echoed in the higher-order structure of the colloidal fluids we study here. We find good agreement between experiment and simulation at the two-body level, although some discrepancies are found at higher field strength, where the system falls out of equilibrium. Higher-order correlations exhibit reasonable agreement between experiment and simulation, again with more discrepancy at higher field strength for three--body correlation functions. At higher field strength, the cluster population in our experiments and simulations is dominated by the minimum energy clusters for all sizes $8 \\leq m \\leq 12$. The agreement that we find here is notable considering that there is no fit parameter in our mapping between experiment and simulation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09029v1",
        "http://arxiv.org/pdf/2303.09029v2",
        "http://arxiv.org/pdf/2303.09029v3"
    ],
    "publication_venue": "17 pages 10 figures"
}