{
    "arxiv_id": "2303.15874",
    "paper_title": "Criteria for entropic curvature on graph spaces",
    "authors": [
        "Martin Rapaport",
        "Paul-Marie Samson"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-12-25"
    ],
    "latest_version": 2,
    "categories": [
        "math.PR",
        "math.FA",
        "math.MG"
    ],
    "abstract": "This paper presents local criteria for lower bounds on entropic curvature of graph spaces along Schrödinger bridges at zero temperature, according to the definition given by the second named author in [47], in the continuity of the work by C. Léonard [31] inspired by the Lott-Sturm-Villani theory. A graph space is defined as a quadruple $({\\mathcal{X}},d,L,m)$ where ${\\mathcal{X}}$ is the set of vertices of a graph, $d$ is the combinatorial distance of the graph and $m$ is a reversible reference measure with respect to a generator $L$ of a Markov semi-group. The criteria are given by local optimization problems on balls of radius two, depending only on the generator $L$ and on the geometry of these balls. This approach is robust since it applies to a very wide range of graph spaces and also for any measure $m$, including measures with interaction potential like Ising models, as example the so-called Sherrington-Kirkpatrick model (see Section 6). We also introduce very large classes of graphs for which the local criteria give non-negative entropic curvature for the uniform measure. A Bonnet-Myers type of theorem also ensures that any graph with positive entropic curvature is finite. On any graph space $({\\mathcal{X}},d,L,m)$ with $m({\\mathcal{X}})<\\infty$, positive entropic curvature provides transport-entropy inequalities with so-called weak optimal transport costs, as well as Poincaré or modified logarithmic-Sobolev inequalities for the renormalized probability measure $μ = m/m({\\mathcal{X}})$. These functional inequalities are well known to be related to refined concentration properties, speed of convergence of semi-groups or bounds on its mixing time, associated to the measure $μ$. We also give some comparisons of our results with other notions of curvature are established, such as Bakry-Emery curvature conditions [14,15], Ollivier or Lin-Lu-Yau's curvature [42,32].",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15874v1",
        "http://arxiv.org/pdf/2303.15874v2"
    ],
    "publication_venue": "76 pages, 4 figures"
}