{
    "arxiv_id": "2303.15439",
    "paper_title": "Identifying gravitationally lensed supernovae within the Zwicky Transient Facility public survey",
    "authors": [
        "M. R. Magee",
        "A. Sainz de Murieta",
        "T. E. Collett",
        "W. Enzi"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
    ],
    "abstract": "Strong gravitational lensing of supernovae is exceedingly rare. To date, only a handful of lensed supernovae are known. Despite their rarity, lensed supernovae have emerged as one of the most promising methods for measuring the current expansion rate of the Universe and breaking the Hubble tension. We present an extensive search for gravitationally lensed supernovae within the Zwicky Transient Facility (ZTF) public survey, covering 12,524 transients with good light curves discovered during four years of observations. We crossmatch a catalogue of known and candidate lens galaxies with our transient sample and find only one coincident source, which was due to chance alignment. To search for supernovae magnified by unknown lens galaxies, we test multiple methods that have been suggested in the literature, for the first time on real data. This includes selecting objects with extremely red colours and those that appear inconsistent with the host galaxy redshift. In both cases, we find a few hundred candidates, most of which are due to contamination from activate galactic nuclei, bogus detections, or unlensed supernovae. The false positive rate from these methods presents significant challenges for future surveys. In total, 65 unique transients were identified across all of our selection methods that required detailed manual rejection, which would be infeasible for larger samples. Overall, we do not find any compelling candidates for lensed supernovae, which is broadly consistent with previous estimates for the rate of lensed supernovae in the ZTF public survey and the number expected to pass the selection cuts we apply.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15439v1"
    ],
    "publication_venue": "Submitted"
}