{
    "arxiv_id": "2303.16977",
    "paper_title": "Evidence of a Decreased Binary Fraction for Massive Stars Within 20 Milliparsecs of the Supermassive Black Hole at the Galactic Center",
    "authors": [
        "Devin S. Chu",
        "Tuan Do",
        "Andrea Ghez",
        "Abhimat K. Gautam",
        "Anna Ciurlo",
        "Kelly Kosmo O'Neil",
        "Matthew W. Hosek",
        "Aurélien Hees",
        "Smadar Naoz",
        "Shoko Sakai",
        "Jessica R. Lu",
        "Zhuo Chen",
        "Rory O. Bentley",
        "Eric E. Becklin",
        "Keith Matthews"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-05-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
    ],
    "abstract": "We present the results of the first systematic search for spectroscopic binaries within the central 2 x 3 arcsec$^2$ around the supermassive black hole at the center of the Milky Way galaxy. This survey is based primarily on over a decade of adaptive optics-fed integral-field spectroscopy (R$\\sim$4000), obtained as part of the Galactic Center Orbits Initiative at Keck Observatory, and has a limiting $K$'-band magnitude of 15.8, which is at least 4 magnitudes deeper than previous spectroscopic searches for binaries at larger radii within the central nuclear star cluster. From this primary dataset, over 600 new radial velocities are extracted and reported, increasing by a factor of 3 the number of such measurements. We find no significant periodic signals in our sample of 28 stars, of which 16 are massive, young (main-sequence B) stars and 12 are low-mass, old (M and K giant) stars. Using Monte Carlo simulations, we derive upper limits on the intrinsic binary star fraction for the young star population at 47% (at 95% confidence) located $\\sim$20 mpc from the black hole. The young star binary fraction is significantly lower than that observed in the field (70%). This result is consistent with a scenario in which the central supermassive black hole drives nearby stellar binaries to merge or be disrupted and may have important implications for the production of gravitational waves and hypervelocity stars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16977v1"
    ],
    "publication_venue": "Accepted by ApJ. 22 pages, 14 figures",
    "doi": "10.3847/1538-4357/acc93e"
}