{
    "arxiv_id": "2303.17357",
    "paper_title": "Measurement of the Sensitivity of Two-Particle Correlations in $pp$ Collisions to the Presence of Hard Scatterings",
    "authors": [
        "ATLAS Collaboration"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "nucl-ex",
        "hep-ex"
    ],
    "abstract": "A key open question in the study of multi-particle production in high-energy $pp$ collisions is the relationship between the \"ridge'' - observed azimuthal correlations between particles in the underlying event that extend over all rapidities - and hard or semi-hard scattering processes. In particular, it is not known whether jets or their soft fragments are correlated with particles in the underlying event. To address this question, two-particle correlations are measured in $pp$ collisions at $\\sqrt{s}=13$ TeV using data collected by the ATLAS experiment at the LHC, with an integrated luminosity of $15.8$ $\\mathrm{pb}^{-1}$, in two different configurations. In the first case, charged particles associated with jets are excluded from the correlation analysis, while in the second case, correlations are measured between particles within jets and charged particles from the underlying event. Second-order flow coefficients, $v_2$, are presented as a function of event multiplicity and transverse momentum. These measurements show that excluding particles associated with jets does not affect the measured correlations. Moreover, particles associated with jets do not exhibit any significant azimuthal correlations with the underlying event, ruling out hard processes contributing to the ridge.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17357v1"
    ],
    "publication_venue": "33 pages in total, author list starting page 16, 6 figures, submitted to Phys. Rev. Lett. All figures including auxiliary figures are available at https://atlas.web.cern.ch/Atlas/GROUPS/PHYSICS/PAPERS/HION-2021-08"
}