{
    "arxiv_id": "2303.14534",
    "paper_title": "Spin-momentum locking and ultrafast spin-charge conversion in ultrathin epitaxial Bi$_{1-x}$Sb$_x$ topological insulator",
    "authors": [
        "E. Rongione",
        "L. Baringthon",
        "D. She",
        "G. Patriarche",
        "R. Lebrun",
        "A. Lemaitre",
        "M. Morassi",
        "N. Reyren",
        "M. Micica",
        "J. Mangeney",
        "J. Tignon",
        "F. Bertran",
        "S. Dhillon",
        "P. Le Fevre",
        "H. Jaffres",
        "J. -M. George"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "cond-mat.mes-hall"
    ],
    "abstract": "The helicity of 3D topological insulator surface states has drawn significant attention in spintronics owing to spin-momentum locking where the carriers' spin is oriented perpendicular to their momentum. This property can provide an efficient method to convert charge currents into spin currents, and vice-versa, through the Rashba-Edelstein effect. However, experimental signatures of these surface states to the spin-charge conversion are extremely difficult to disentangle from bulk state contributions. Here, we combine spin- and angle-resolved photo-emission spectroscopy, and time-resolved THz emission spectroscopy to categorically demonstrate that spin-charge conversion arises mainly from the surface state in Bi$_{1-x}$Sb$_x$ ultrathin films, down to few nanometers where confinement effects emerge. We correlate this large conversion efficiency, typically at the level of the bulk spin Hall effect from heavy metals, to the complex Fermi surface obtained from theoretical calculations of the inverse Rashba-Edelstein response. %We demonstrate this for film thickness down to a few nanometers, Both surface state robustness and sizeable conversion efficiency in epitaxial Bi$_{1-x}$Sb$_x$ thin films bring new perspectives for ultra-low power magnetic random-access memories and broadband THz generation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14534v1"
    ],
    "publication_venue": "23 pages, 3 figures"
}