{
    "arxiv_id": "2303.16071",
    "paper_title": "Edge Selection and Clustering for Federated Learning in Optical Inter-LEO Satellite Constellation",
    "authors": [
        "Chih-Yu Chen",
        "Li-Hsiang Shen",
        "Kai-Ten Feng",
        "Lie-Liang Yang",
        "Jen-Ming Wu"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cs.NI",
        "eess.SP"
    ],
    "abstract": "Low-Earth orbit (LEO) satellites have been prosperously deployed for various Earth observation missions due to its capability of collecting a large amount of image or sensor data. However, traditionally, the data training process is performed in the terrestrial cloud server, which leads to a high transmission overhead. With the recent development of LEO, it is more imperative to provide ultra-dense LEO constellation with enhanced on-board computation capability. Benefited from it, we have proposed a collaborative federated learning over LEO satellite constellation (FedLEO). We allocate the entire process on LEOs with low payload inter-satellite transmissions, whilst the low-delay terrestrial gateway server (GS) only takes care for initial signal controlling. The GS initially selects an LEO server, whereas its LEO clients are all determined by clustering mechanism and communication capability through the optical inter-satellite links (ISLs). The re-clustering of changing LEO server will be executed once with low communication quality of FedLEO. In the simulations, we have numerically analyzed the proposed FedLEO under practical Walker-based LEO constellation configurations along with MNIST training dataset for classification mission. The proposed FedLEO outperforms the conventional centralized and distributed architectures with higher classification accuracy as well as comparably lower latency of joint communication and computing.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16071v1"
    ],
    "publication_venue": null
}