{
    "arxiv_id": "2303.13586",
    "paper_title": "Extragalactic magnetism with SOFIA (SALSA Legacy Program) -- V: First results on the magnetic field orientation of galaxies",
    "authors": [
        "Alejandro S. Borlaff",
        "Enrique Lopez-Rodriguez",
        "Rainer Beck",
        "Susan E. Clark",
        "Evangelia Ntormousi",
        "Konstantinos Tassis",
        "Sergio Martin-Alvarez",
        "Mehrnoosh Tahani",
        "Daniel A. Dale",
        "Ignacio del Moral Castro",
        "Julia Roman-Duval",
        "Pamela M. Marcum",
        "John E. Beckman",
        "Kandaswamy Subramanian"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
    ],
    "abstract": "We present the analysis of the magnetic field ($B$-field) structure of galaxies measured with far-infrared (FIR) and radio (3 and 6 cm) polarimetric observations. We use the first data release of the Survey on extragALactic magnetiSm with SOFIA (SALSA) of 14 nearby ($<20$ Mpc) galaxies with resolved (5 arcsec-18 arcsec; $90$ pc--$1$ kpc) imaging polarimetric observations using HAWC+/SOFIA from $53$ to $214$ \\um. We compute the magnetic pitch angle ($Ψ_{B}$) profiles as a function of the galactrocentric radius. We introduce a new magnetic alignment parameter ($ζ$) to estimate the disordered-to-ordered $B$-field ratio in spiral $B$-fields. We find FIR and radio wavelengths to not generally trace the same $B$-field morphology in galaxies. The $Ψ_{B}$ profiles tend to be more ordered with galactocentric radius in radio ($ζ_{\\rm{6cm}} = 0.93\\pm0.03$) than in FIR ($ζ_{\\rm{154μm}} = 0.84\\pm0.14$). For spiral galaxies, FIR $B$-fields are $2-75$\\% more turbulent than the radio $B$-fields. For starburst galaxies, we find that FIR polarization is a better tracer of the $B$-fields along the galactic outflows than radio polarization. Our results suggest that the $B$-fields associated with dense, dusty, turbulent star-forming regions, those traced at FIR, are less ordered than warmer, less-dense regions, those traced at radio, of the interstellar medium. The FIR $B$-fields seem to be more sensitive to the activity of the star-forming regions and the morphology of the molecular clouds within a vertical height of few hundred pc in the disk of spiral galaxies than the radio $B$-fields.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13586v1"
    ],
    "publication_venue": "26 pages, 13 figures"
}