{
    "arxiv_id": "2303.11961",
    "paper_title": "Accurate dust temperature and star formation rate in the most luminous $z>6$ quasar in the HYPerluminous quasars at the Epoch of ReionizatION (HYPERION) sample",
    "authors": [
        "Roberta Tripodi",
        "Chiara Feruglio",
        "Francisca Kemper",
        "Francesca Civano",
        "Tiago Costa",
        "Martin Elvis",
        "Manuela Bischetti",
        "Stefano Carniani",
        "Fabio Di Mascia",
        "Valentina D'Odorico",
        "Fabrizio Fiore",
        "Simona Gallerani",
        "Michele Ginolfi",
        "Roberto Maiolino",
        "Enrico Piconcelli",
        "Rosa Valiante",
        "Luca Zappacosta"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present ALMA Band 9 continuum observation of the ultraluminous quasi-stellar object (QSO) SDSS J0100+2802, providing a $\\sim 10σ$ detection at $\\sim 670$ GHz. SDSS J0100+2802 is the brightest QSO with the most massive super massive black hole (SMBH) known at $z>6$, and we study its dust spectral energy distribution in order to determine the dust properties and the star formation rate (SFR) of its host-galaxy. We obtain the most accurate estimate so far of the temperature, mass and emissivity index of the dust, having $T_{\\rm dust}=48.4\\pm2.3$ K, $M_{\\rm dust}=(2.29\\pm0.83)\\times 10^7$ M$_\\odot$, $β=2.63\\pm 0.23$. This allows us to measure the SFR with the smallest statistical error for this QSO, SFR$=265\\pm 32\\ \\rm M_\\odot yr^{-1}$. Our results enable us to evaluate the relative growth of the SMBH and host galaxy of J0100+2802, finding that the SMBH is dominating the process of BH-galaxy growth in this QSO at $z=6.327$, when the Universe was $865$ Myr old. Such unprecedented constraints on the host galaxy SFR and dust temperature can only be obtained through high frequency observations, and highlight the importance of ALMA Band 9 to obtain a robust overview of the build-up of the first quasars' host galaxies at $z>6$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11961v1"
    ],
    "publication_venue": "10 pages, 4 figures, 1 table. Accepted for publication in ApJL",
    "doi": "10.3847/2041-8213/acc58d"
}