{
    "arxiv_id": "2303.14010",
    "paper_title": "Magnetohydrodynamic Model of Late Accretion onto a Protoplanetary Disk: Cloudlet Encounter Event",
    "authors": [
        "Masaki Unno",
        "Tomoyuki Hanawa",
        "Shinsuke Takasao"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
    ],
    "abstract": "Recent observations suggest late accretion, which is generally nonaxisymmetric, onto protoplanetary disks. We investigated nonaxisymmetric late accretion considering the effects of magnetic fields. Our model assumes a cloudlet encounter event at a few hundred au scale, where a magnetized gas clump (cloudlet) encounters a protoplanetary disk. We studied how the cloudlet size and the magnetic field strength affect the rotational velocity profile in the disk after the cloudlet encounter. The results show that a magnetic field can either decelerate or accelerate the rotational motion of the cloudlet material, primarily depending on the relative size of the cloudlet to the disk thickness. When the cloudlet size is comparable to or smaller than the disk thickness, magnetic fields only decelerate the rotation of the colliding cloudlet material. However, if the cloudlet size is larger than the disk thickness, the colliding cloudlet material can be super-Keplerian as a result of magnetic acceleration. We found that the vertical velocity shear of the cloudlet produces a magnetic tension force that increases the rotational velocity. The acceleration mechanism operates when the initial plasma $β$ is $ β\\lesssim 2\\times 10^1 $. Our study shows that magnetic fields modify the properties of spirals formed by tidal effects. These findings may be important for interpreting observations of late accretion.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14010v1"
    ],
    "publication_venue": "18 pages, 15 figures, 1 table, published in The Astrophysical Journal",
    "doi": "10.3847/1538-4357/aca410"
}