{
    "arxiv_id": "2303.11868",
    "paper_title": "Irreversibility of symbolic time series: a cautionary tale",
    "authors": [
        "Lluis Arola-Fernandez",
        "Lucas Lacasa"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-07-19"
    ],
    "latest_version": 1,
    "categories": [
        "nlin.CD",
        "physics.data-an"
    ],
    "abstract": "Many empirical time series are genuinely symbolic: examples range from link activation patterns in network science, DNA coding or firing patterns in neuroscience to cryptography or combinatorics on words. In some other contexts, the underlying time series is actually real-valued, and symbolization is applied subsequently, as in symbolic dynamics of chaotic systems. Among several time series quantifiers, time series irreversibility (the difference between forward and backward statistics in stationary time series) is of great relevance. However, the irreversible character of symbolized time series is not always equivalent to the one of the underlying real-valued signal, leading to some misconceptions and confusion on interpretability. Such confusion is even bigger for binary time series (a classical way to encode chaotic trajectories via symbolic dynamics). In this article we aim to clarify some usual misconceptions and provide theoretical grounding for the practical analysis -- and interpretation -- of time irreversibility in symbolic time series. We outline sources of irreversibility in stationary symbolic sequences coming from frequency asymmetries of non-palindromic pairs which we enumerate, and prove that binary time series cannot show any irreversibility based on words of length m < 4, thus discussing the implications and sources of confusion. We also study irreversibility in the context of symbolic dynamics, and clarify why these can be reversible even when the underlying dynamical system is not, such as the case of the fully chaotic logistic map.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11868v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevE.108.014201"
}