{
    "arxiv_id": "2303.11496",
    "paper_title": "Stabilizing solitons of the cubic-quintic nonlinear Schrödinger equation by frequency-dependent linear gain-loss and delayed Raman response",
    "authors": [
        "Avner Peleg",
        "Debananda Chakraborty"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-06-27"
    ],
    "latest_version": 1,
    "categories": [
        "nlin.PS",
        "physics.optics"
    ],
    "abstract": "We demonstrate transmission stabilization against radiation emission by frequency-dependent linear gain-loss and perturbation-induced frequency shifting for solitons of the cubic-quintic nonlinear Schrödinger (CQNLS) equation. We consider soliton propagation in a nonlinear optical waveguide with focusing cubic nonlinearity, defocusing quintic nonlinearity, and dissipative perturbations due to weak frequency-dependent linear gain-loss, cubic loss, and delayed Raman response. The frequency shifting is induced by delayed Raman response. Our perturbation analysis and numerical simulations with the perturbed CQNLS equation show that transmission stabilization with CQNLS solitons is indeed possible, and in this way provide the first demonstration of the stabilization method for solitons of a nonintegrable nonlinear wave model. Moreover, we find that transmission stabilization with energetic CQNLS solitons is realized with significantly smaller frequency shifts and pulse distortion compared with stabilization with energetic solitons of the cubic nonlinear Schrödinger equation. Therefore, our study also demonstrates that stabilization of energetic solitons by the method is significantly improved by the presence of defocusing quintic nonlinearity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11496v1"
    ],
    "publication_venue": "The paper demonstrates stabilization of energetic solitons of the nonintegrable cubic-quintic nonlinear Schrödinger equation by a method that was developed in arXiv:1804.03226 for solitons of the integrable cubic nonlinear Schrödinger equation with moderate power. It provides the first demonstration of the stabilization method for solitons of a nonintegrable nonlinear wave model",
    "doi": "10.1016/j.physd.2023.133823"
}