{
    "arxiv_id": "2303.14086",
    "paper_title": "Finite Field Multiple Access",
    "authors": [
        "Qi-yue Yu",
        "Jiang-xuan Li",
        "Shu Lin"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2025-01-24"
    ],
    "latest_version": 6,
    "categories": [
        "cs.IT"
    ],
    "abstract": "In the past several decades, various techniques have been developed and used for multiple-access (MA) communications. With the new applications for 6G, it is desirable to find new resources, physical or virtual, to confront the fast development of MA communication systems. For binary source transmission, this paper introduces the concept of element-pair (EP), and the Cartesian product of $J$ distinct EPs can form an EP code. EPs are treated as virtual resources in finite fields to distinguish users. This approach allows for the reordering of channel encoding and multiplexing modules, effectively addressing the finite blocklength (FBL) challenge in multiuser transmission.We present methods for constructing symbol-wise EP codes with the unique sum-pattern mapping (USPM) property using finite fields. Based on the orthogonal EP code constructed over GF($2^m$), we develop a time-division mode of finite-field multiple-access (FFMA) systems over a Gaussian multiple-access channel (GMAC), including both sparse-form and diagonal-form structures. Based on the diagonal-form (DF) structure, we introduce a specific configuration referred to as polarization-adjusted DF-FFMA, which achieves both power gain and coding gain across the entire blocklength. The proposed FFMA is then applied to network layer and forms network FFMA systems for pure digital networks. Simulation results demonstrate that, compared to popular complex-field MA systems, the proposed FFMA systems can offer superior error performance in a GMAC.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14086v1",
        "http://arxiv.org/pdf/2303.14086v2",
        "http://arxiv.org/pdf/2303.14086v3",
        "http://arxiv.org/pdf/2303.14086v4",
        "http://arxiv.org/pdf/2303.14086v5",
        "http://arxiv.org/pdf/2303.14086v6"
    ],
    "publication_venue": "50 pages, 16 figures"
}