{
    "arxiv_id": "2303.14866",
    "paper_title": "Imaging Molecular Outflow in Massive Star-forming Regions with HNCO Lines",
    "authors": [
        "Jinjin Xie",
        "Juan Li",
        "Junzhi Wang",
        "Shu Liu",
        "Kai Yang",
        "Donghui Quan",
        "Siqi Zheng",
        "Yuqiang Li",
        "Jingwen Wu",
        "Yan Duan",
        "Di Li"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "Protostellar outflows are considered a signpost of star formation. These outflows can cause shocks in the molecular gas and are typically traced by the line wings of certain molecules. HNCO (4--3) has been regarded as a shock tracer because of the high abundance in shocked regions. Here we present the first imaging results of HNCO (4--3) line wings toward nine sources in a sample of twenty three massive star-forming regions using the IRAM 30\\,m telescope. We adopt the velocity range of the full width of HC$_{3}$N (10--9) and H$^{13}$CO$^+$ (1--0) emissions as the central emission values, beyond which the emission from HNCO (4--3) is considered to be from line wings. The spatial distributions of the red- and/or blue-lobes of HNCO (4--3) emission nicely associate with those lobes of HCO$^{+}$ (1--0) in most of the sources. High intensity ratios of HNCO (4--3) to HCO$^+$ (1--0) are obtained in the line wings. The derived column density ratios of HNCO to HCO$^+$ are consistent with those previously observed towards massive star-forming regions. These results provide direct evidence that HNCO could trace outflow in massive star-forming regions. This work also implies that the formation of some HNCO molecules is related to shock, either on the grain surface or within the shocked gas.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14866v1"
    ],
    "publication_venue": "18 pages, 4 tables, 4 figures, and accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc83f"
}