{
    "arxiv_id": "2303.15713",
    "paper_title": "Robust 3.7 V-Na$_{2/3}$[Cu$_{1/3}$Mn$_{2/3}$]O$_2$ Cathode for Na-ion Batteries",
    "authors": [
        "Xiaohui Rong",
        "Xingguo Qi",
        "Quan Zhou",
        "Libin Kang",
        "Dongdong Xiao",
        "Ruijuan Xiao",
        "Feixiang Ding",
        "Yang Yang",
        "Yuan Liu",
        "Yun Su",
        "Shiguang Zhang",
        "Lunhua He",
        "Yaxiang Lu",
        "Liquan Chen",
        "Yong-Sheng Hu"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Na-ion batteries (NIBs), which are recognized as a next-generation alternative technology for energy storage, still suffer from commercialization constraints due to the lack of low-cost, high-performance cathode materials. Since our first discovery of Cu$^{3+}$/Cu$^{2+}$ electrochemistry in 2014, numerous Cu-substituted/doped materials have been designed for NIBs. However for almost ten years, the potential of Cu$^{3+}$/Cu$^{2+}$ electrochemistry has been grossly underappreciated and normally regarded as a semielectrochemically active redox. Here, we re-synthesized P2-Na$_{2/3}$[Cu$_{1/3}$Mn$_{2/3}$]O$_2$ and reinterpreted it as a high-voltage, cost-efficient, air-stable, long-life, and high-rate cathode material for NIBs, which demonstrates a high operating voltage of 3.7 V and a completely active Cu$^{3+}$/Cu$^{2+}$ redox reaction. The 2.3 Ah cylindrical cells exhibit excellent cycling (93.1% capacity after 2000 cycles), high rate (97.2% capacity at 10C rate), good low-temperature performance (86.6% capacity at -30$^\\circ$C), and high safety, based on which, a 56 V-11.5 Ah battery pack for E-bikes is successfully constructed, exhibiting stable cycling (96.5% capacity at the 800th cycle) and a long driving distance (36 km, tester weight 65 kg). This work offers a commercially feasible cathode material for low-cost, high-voltage NIBs, paving the way for advanced NIBs in power and stationary energy storage applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15713v1"
    ],
    "publication_venue": "15 pages, 3 figures, 1 table"
}