{
    "arxiv_id": "2303.13205",
    "paper_title": "A spectacular jet from the bright 244-440 Orion proplyd: the MUSE NFM view",
    "authors": [
        "A. Kirwan",
        "C. F. Manara",
        "E. T. Whelan",
        "M. Robberto",
        "A. F. McLeod",
        "S. Facchini",
        "G. Beccari",
        "A. Miotella",
        "P. C. Schneider",
        "A. Murphy",
        "S. Vicente"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.EP",
        "astro-ph.SR"
    ],
    "abstract": "In this work we present the highest spatial and spectral resolution integral field observations to date of the bipolar jet from the Orion proplyd 244-440 using MUSE NFM) observations on the VLT. We observed a previously unreported chain of six distinct knots in a roughly S-shaped pattern, and by comparing them with HST images we estimated proper motions in the redshifted knots of 9.5 mas yr$^{-1}$ with an inclination angle of $73^{\\circ}$, though these quantities could not be measured for the blueshifted lobe. Analysis of the [FeII] and [NiII] lines suggests jet densities on the order of $\\sim 10^5$ cm$^{-3}$. We propose that the observed S-shaped morphology originates from a jet launched by a smaller source with $M_\\star < 0.2$ M$_{\\odot}$ in orbital motion around a larger companion of $M_\\star \\simeq 0.5$ M$_{\\odot}$ at a separation of 30-40 au. The measured luminosities of the knots using the [OI]$\\lambda6300$ and [SII]$\\lambda6731$ lines were used to estimate a lower limit to the mass-loss rate in the jet of $1.3 \\times 10^{-11}$ M$_{\\odot}$ yr$^{-1}$ and an upper limit of $10^{-9}$ M$_{\\odot}$ yr$^{-1}$, which is typical for low-mass driving sources. While the brightness asymmetry between the redshifted and blueshifted lobes is consistent with external irradiation, further analysis of the [NiII] and [FeII] lines suggests that photoionization of the jet is not likely to be a dominant factor, and that the emission is dominated by collisional excitation. The dynamical age of the jet compared to the anticipated survival time of the proplyd demonstrates that photoevaporation of the proplyd occurred prior to jet launching, and that this is still an active source. These two points suggest that the envelope of the proplyd may shield the jet from the majority of external radiation, and that photoionization of the proplyd does not appear to impact the ability of a star to launch a jet.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13205v1"
    ],
    "publication_venue": "30 pages, 20 figures",
    "doi": "10.1051/0004-6361/202245428"
}