{
    "arxiv_id": "2303.09312",
    "paper_title": "Entropy Density and Speed of Sound from Improved Energy-Momentum Tensor in Lattice QCD",
    "authors": [
        "Mushtaq Loan",
        "Nasser Demir"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 2,
    "categories": [
        "hep-lat"
    ],
    "abstract": "We present a lattice calculation of the entropy density $s/T^{3}$ and speed of sound $c_{s}^{2}$ of gluedynamics near the critical temperature, $T_{c}$, in the deconfined phase. By exploring the temperature dependence of entropy density in this region, we aim to analyse the significant discrepancies between the previous computations. The calculation of entropy density is carried out by numerical simulations of $O(a^{4})$ mean-field improved energy-momentum tensor (EMT) of SU(3) gauge theory on the lattice. We expand on reaching $O(a^{4})$ improvement using tadpole-improved Symanzik action. The entropy density is calculated directly from the expectation value of the space-time component of the improved EMT in the presence of shifted boundary conditions at several lattice spacings ($a \\approx 0.043 - 0.012$ fm). The absence of ultraviolet divergences and the minimal finite-size effects allow for the precision determination of the entropy density and its extrapolation to the continuum limit. As expected, the resulting entropy density displays the expected behaviour of rapid increase near the critical temperature in the deconfined phase followed by a slow increase in $2T_{c}\\leq T\\leq 3T_{c}$ region, suggesting a logarithmic dependence on the temperature. A quantitative comparison of $s/T^{3}$ shows good agreement with Pade approximation and lattice results of previous high-precision data obtained using the gradient flow method. We observe that at temperatures of about $3T_{c}$, deviations of entropy density from the Stefan-Boltzmann value for a free theory are about 10$\\%$. It is shown that the speed of sound in SU(3) gluedynamics is found to be $c_{s}^{2}\\leq 0.333$ in the temperature region $1.06T_{c}\\leq T\\leq 3.05T_{c}$ explored in this study. The results are found to agree with the corresponding analytic and numerical estimates.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09312v1",
        "http://arxiv.org/pdf/2303.09312v2"
    ],
    "publication_venue": "7 pages, 5 figures"
}