{
    "arxiv_id": "2303.14546",
    "paper_title": "Day 'N' Nite: Habitability of Tidally Locked Planets with Sporadic Rotation",
    "authors": [
        "Cody J. Shakespeare",
        "Jason H. Steffen"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Tidally locked worlds provide a unique opportunity for constraining the probable climates of certain exoplanets. They are unique in that few exoplanet spin and obliquity states are known or will be determined in the near future: both of which are critical in modeling climate. A recent study shows the dynamical conditions present in the TRAPPIST-1 system make rotation and large librations of the substellar point possible for these planets, which are usually assumed to be tidally locked. We independently confirm the tendency for planets in TRAPPIST-1-like systems to sporadically transition from tidally locked libration to slow rotation using N-body simulations. We examine the nature and frequency of these spin states to best inform energy balance models which predict the temperature profile of the planet's surface. Our findings show that tidally locked planets with sporadic rotation are able to be in both long-term persistent states and chaotic states: where rapid transitions between behaviors are present. Quasi-stable spin regimes, where the planet exhibits one spin behavior for up to hundreds of millennia, are likely able to form stable climate systems while the spin behavior is constant. 1D energy balance models show that tidally locked planets with sporadic rotation around M-dwarfs will experience a relatively small change in substellar temperature due to the lower albedo of ice in an infrared dominant stellar spectrum. The exact effects of large changes in temperature profiles on these planets as they rotate require more robust climate models, like 3D global circulation models, to better examine.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14546v1"
    ],
    "publication_venue": null
}