{
    "arxiv_id": "2303.16717",
    "paper_title": "The CORALIE survey for southern extrasolar planets XIX. Brown dwarfs and stellar companions unveiled by radial velocity and astrometry",
    "authors": [
        "D. Barbato",
        "D. Ségransan",
        "S. Udry",
        "N. Unger",
        "F. Bouchy",
        "C. Lovis",
        "M. Mayor",
        "F. Pepe",
        "D. Queloz",
        "N. C. Santos",
        "J. B. Delisle",
        "P. Figueira",
        "M. Marmier",
        "E. C. Matthews",
        "G. Lo Curto",
        "J. Venturini",
        "G. Chaverot",
        "M. Cretignier",
        "J. F. Otegi",
        "M. Stalport"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
    ],
    "abstract": "A historical planet-search on a sample of 1647 nearby southern main sequence stars has been ongoing since 1998 with the CORALIE spectrograph at La Silla Observatory, with a backup subprogram dedicated to the monitoring of binary stars. We review 25 years of CORALIE measurements and search for Doppler signals consistent with stellar or brown dwarf companions to produce an updated catalog of both known and previously unpublished binary stars in the planet-search sample, assessing the binarity fraction of the stellar population and providing perspective for more precise planet-search in the binary sample. We perform new analysis on the CORALIE planet-search sample radial velocity measurements, searching for stellar companions and obtaining orbital solutions for both known and new binary systems. We perform simultaneous radial velocity and proper motion anomaly fits on the subset of these systems for which Hipparcos and Gaia astrometry measurements are available, obtaining accurate estimates of true mass for the companions. We find 218 stars in the CORALIE sample to have at least one stellar companion, 130 of which are not yet published in the literature and for which we present orbital solutions. The use of proper motion anomaly allow us to derive true masses for the stellar companions in 132 systems, which we additionally use to estimate stability regions for possible planetary companions on circumprimary or circumbinary orbits. Finally, we produce detection limit maps for each star in the sample and obtain occurrence rates of $0.43^{+0.23}_{-0.11}\\%$ and $12.69^{+0.87}_{-0.77}\\%$ for brown dwarf and stellar companions respectively in the CORALIE sample.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16717v1"
    ],
    "publication_venue": "34 pages, 15 figures, accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202345874"
}