{
    "arxiv_id": "2303.12155",
    "paper_title": "WIMP cross-section limits from LOFAR observations of dwarf spheroidal galaxies",
    "authors": [
        "L. Gajović",
        "F. Welzmüller",
        "V. Heesen",
        "F. de Gasperin",
        "M. Vollmann",
        "M. Brüggen",
        "A. Basu",
        "R. Beck",
        "D. J. Schwarz",
        "D. J. Bomans",
        "A. Drabent"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "astro-ph.HE"
    ],
    "abstract": "Weakly interacting massive particles (WIMPs) can self-annihilate and thus provide us with the possibility for an indirect detection of Dark Matter (DM). Dwarf spheroidal (dSph) galaxies are excellent places to search for annihilation signals because they are rich in DM and background emission is low. If magnetic fields in dSph exist, the particles produced in DM annihilation emit synchrotron radiation. We use the non-detection of 150 MHz radio continuum emission from dSph galaxies with the LOw Frequency ARray (LOFAR) to derive constraints on the annihilation cross-section of WIMPs into electron-positron pairs. Our main underlying assumption is that the transport of the CRs can be described by the diffusion approximation which necessitates the existence of magnetic fields. We use observations of six dSph galaxies in the LOFAR Two-metre Sky Survey (LoTSS). The data are re-imaged and a radial profile is generated for each galaxy. We also use stacking to increase the sensitivity. In order to derive upper limits on the WIMP cross-section, we inject fake Gaussian sources into the data which are then detected with 2$σ$ significance in the radial profile. These sources represent the lowest emission we would have been able to detect.\n  We present limits from the observations of individual galaxies as well as from stacking. We explore the uncertainty due to the choice of diffusion and magnetic field parameters by constructing three different model scenarios: optimistic (OPT), intermediate (INT), and pessimistic (PES). Assuming monochromatic annihilation into electron-positron pairs, the limits from the INT scenario exclude thermal WIMPs below 20 GeV and the limits from the OPT scenario even exclude WIMPs below 70 GeV. The INT limits can compete with limits set by Fermi-LAT using $γ$-ray observations of multiple dwarf galaxies and they are especially strong for low WIMP masses.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12155v1"
    ],
    "publication_venue": "15 pages, 10 figures, to be published in Astronomy & Astrophysics",
    "doi": "10.1051/0004-6361/202245508"
}