{
    "arxiv_id": "2303.08387",
    "paper_title": "Learning to Place Unseen Objects Stably using a Large-scale Simulation",
    "authors": [
        "Sangjun Noh",
        "Raeyoung Kang",
        "Taewon Kim",
        "Seunghyeok Back",
        "Seongho Bak",
        "Kyoobin Lee"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-04-13"
    ],
    "latest_version": 2,
    "categories": [
        "cs.RO"
    ],
    "abstract": "Object placement is a crucial task for robots in unstructured environments as it enables them to manipulate and arrange objects safely and efficiently. However, existing methods for object placement have limitations, such as the requirement for a complete 3D model of the object or the inability to handle complex object shapes, which restrict the applicability of robots in unstructured scenarios. In this paper, we propose an Unseen Object Placement (UOP) method that directly detects stable planes of unseen objects from a single-view and partial point cloud. We trained our model on large-scale simulation data to generalize over relationships between the shape and properties of stable planes with a 3D point cloud. We verify our approach through simulation and real-world robot experiments, demonstrating state-of-the-art performance for placing single-view and partial objects. Our UOP approach enables robots to place objects stably, even when the object's shape and properties are not fully known, providing a promising solution for object placement in unstructured environments. Our research has potential applications in various domains such as manufacturing, logistics, and home automation. Additional results can be viewed on https://sites.google.com/view/uop-net-anonymous/, and we will release our code, dataset upon publication.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08387v1",
        "http://arxiv.org/pdf/2303.08387v2"
    ],
    "publication_venue": "9 pages (main) + 3 pages (supplementary information)"
}