{
    "arxiv_id": "2303.14658",
    "paper_title": "Fast Rate Information-theoretic Bounds on Generalization Errors",
    "authors": [
        "Xuetong Wu",
        "Jonathan H. Manton",
        "Uwe Aickelin",
        "Jingge Zhu"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2024-11-01"
    ],
    "latest_version": 2,
    "categories": [
        "cs.IT",
        "cs.LG",
        "stat.ML"
    ],
    "abstract": "The generalization error of a learning algorithm refers to the discrepancy between the loss of a learning algorithm on training data and that on unseen testing data. Various information-theoretic bounds on the generalization error have been derived in the literature, where the mutual information between the training data and the hypothesis (the output of the learning algorithm) plays an important role. Focusing on the individual sample mutual information bound by Bu et al., which itself is a tightened version of the first bound on the topic by Russo et al. and Xu et al., this paper investigates the tightness of these bounds, in terms of the dependence of their convergence rates on the sample size $n$. It has been recognized that these bounds are in general not tight, readily verified for the exemplary quadratic Gaussian mean estimation problem, where the individual sample mutual information bound scales as $O(\\sqrt{1/n})$ while the true generalization error scales as $O(1/n)$. The first contribution of this paper is to show that the same bound can in fact be asymptotically tight if an appropriate assumption is made. In particular, we show that the fast rate can be recovered when the assumption is made on the excess risk instead of the loss function, which was usually done in existing literature. A theoretical justification is given for this choice. The second contribution of the paper is a new set of generalization error bounds based on the $(η, c)$-central condition, a condition relatively easy to verify and has the property that the mutual information term directly determines the convergence rate of the bound. Several analytical and numerical examples are given to show the effectiveness of these bounds.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14658v1",
        "http://arxiv.org/pdf/2303.14658v2"
    ],
    "publication_venue": "32 pages, 1 figure. arXiv admin note: substantial text overlap with arXiv:2205.03131"
}