{
    "arxiv_id": "2303.10679",
    "paper_title": "Room Temperature Fiber-Coupled single-photon devices based on Colloidal Quantum Dots and SiV centers in Back Excited Nanoantennas",
    "authors": [
        "Boaz Lubotzky",
        "Alexander Nazarov",
        "Hamza Abudayyeh",
        "Lukas Antoniuk",
        "Niklas Lettner",
        "Viatcheslav Agafonov",
        "Anastasia V. Bennett",
        "Jennifer A. Hollingsworth",
        "Alexander Kubanek",
        "Ronen Rapaport"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics",
        "physics.app-ph",
        "quant-ph"
    ],
    "abstract": "We demonstrate an important step towards on chip integration of single photon sources operating at room temperature fiber coupling of a directional quantum emitter with back-excitation. Directionality is achieved with a hybrid metal-dielectric bullseye antenna, while back-excitation is permitted by placement of the emitter at or in a sub-wavelength hole positioned at the bullseye center. Overall, the unique design enables a direct laser excitation from the back of the on-chip device and very efficient coupling of the highly collimated photon emission to either low numerical aperture (NA) free space optics or directly to an optical fiber from the front. To show the versatility of the concept, we fabricate devices containing either a colloidal quantum dot or a silicon-vacancy center containing nanodiamond, which are accurately coupled to the nano-antenna using two different nano-positioning methods. Both back-excited devices display front collection efficiencies of about 70 % at NAs as low as 0.5. Moreover, the combination of back-excitation with forward low-NA directionality enables direct coupling of the emitted photons into a proximal optical fiber without the need of any coupling optics, thereby facilitating and greatly simplifying future integration.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10679v1"
    ],
    "publication_venue": null
}