{
    "arxiv_id": "2303.15514",
    "paper_title": "Abell 1201: Detection of an Ultramassive Black Hole in a Strong Gravitational Lens",
    "authors": [
        "James. W. Nightingale",
        "Russell J. Smith",
        "Qiuhan He",
        "Conor M. O'Riordan",
        "Jacob A. Kegerreis",
        "Aristeidis Amvrosiadis",
        "Alastair C. Edge",
        "Amy Etherington",
        "Richard G. Hayes",
        "Ash Kelly",
        "John R. Lucey",
        "Richard J. Massey Richard J. Massey"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.IM",
        "gr-qc"
    ],
    "abstract": "Supermassive black holes (SMBHs) are a key catalyst of galaxy formation and evolution, leading to an observed correlation between SMBH mass $M_{\\rm BH}$ and host galaxy velocity dispersion $σ_{\\rm e}$. Outside the local Universe, measurements of $M_{\\rm BH}$ are usually only possible for SMBHs in an active state: limiting sample size and introducing selection biases. Gravitational lensing makes it possible to measure the mass of non-active SMBHs. We present models of the $z=0.169$ galaxy-scale strong lens Abell~1201. A cD galaxy in a galaxy cluster, it has sufficient `external shear' that a magnified image of a $z = 0.451$ background galaxy is projected just $\\sim 1$ kpc from the galaxy centre. Using multi-band Hubble Space Telescope imaging and the lens modeling software $\\texttt{PyAutoLens}$ we reconstruct the distribution of mass along this line of sight. Bayesian model comparison favours a point mass with $M_{\\rm BH} = 3.27 \\pm 2.12\\times10^{10}\\,$M$_{\\rm \\odot}$ (3$σ$ confidence limit); an ultramassive black hole. One model gives a comparable Bayesian evidence without a SMBH, however we argue this model is nonphysical given its base assumptions. This model still provides an upper limit of $M_{\\rm BH} \\leq 5.3 \\times 10^{10}\\,$M$_{\\rm \\odot}$, because a SMBH above this mass deforms the lensed image $\\sim 1$ kpc from Abell 1201's centre. This builds on previous work using central images to place upper limits on $M_{\\rm BH}$, but is the first to also place a lower limit and without a central image being observed. The success of this method suggests that surveys during the next decade could measure thousands more SMBH masses, and any redshift evolution of the $M_{\\rm BH}$--$σ_{\\rm e}$ relation. Results are available at https://github.com/Jammy2211/autolens_abell_1201.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15514v1"
    ],
    "publication_venue": "Accepted in MNRAS, 27 pages, 22 figures",
    "doi": "10.1093/mnras/stad587"
}