{
    "arxiv_id": "2303.14330",
    "paper_title": "Quantitative pulsatility measurements using 3D Dynamic Ultrasound Localization Microscopy",
    "authors": [
        "Chloé Bourquin",
        "Jonathan Porée",
        "Brice Rauby",
        "Vincent Perrot",
        "Nin Ghigo",
        "Hatim Belgharbi",
        "Samuel Bélanger",
        "Gerardo Ramos-Palacios",
        "Nelson Cortés",
        "Hugo Ladret",
        "Lamyae Ikan",
        "Christian Casanova",
        "Frédéric Lesage",
        "Jean Provost"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.med-ph"
    ],
    "abstract": "A rise in blood flow velocity variations (i.e., pulsatility) in the brain, caused by the stiffening of upstream arteries, is associated with cognitive impairment and neurodegenerative diseases. The study of this phenomenon requires brain-wide pulsatility measurements, with high penetration depth and high spatiotemporal resolution. The development of Dynamic Ultrasound Localization Microscopy (DULM), based on ULM, has enabled pulsatility measurements in the rodent brain in 2D. However, 2D imaging accesses only one slice of the brain and measures biased velocities due to 2D projection. Herein, we present 3D DULM, which can extract quantitative pulsatility measurements in the cat brain with craniotomy and in the whole mouse brain through the skull, showing a wide range of flow hemodynamics in both large and small vessels. We highlighted a decrease in pulsatility along the vascular tree in the cat brain, and performed an intra-animal validation of the method by showing consistent measurements between the two sides of the Willis circle in the mouse brain. Our study provides the first step towards a new biomarker that would allow the detection of dynamic abnormalities in microvessels in the whole brain volume, which could be linked to early signs of neurodegenerative diseases.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14330v1"
    ],
    "publication_venue": "10 pages, 6 figures. Supplementary materials 1 (video): https://youtu.be/DQ3Cf4w1J_0 ; Supplementary materials 2 (video): https://youtu.be/U1V7m6rtyYM"
}