{
    "arxiv_id": "2303.15208",
    "paper_title": "Revisiting $f(R,T)$ cosmologies",
    "authors": [
        "Ana Paula Jeakel",
        "Jonas Silva",
        "Hermano Velten"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-09-06"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.CO",
        "gr-qc"
    ],
    "abstract": "We review the status of $f(R,T)$ theories. We start focusing on the modified Friedmann equations for the case of a minimally coupled gravitational Lagrangian of the type $f(R,T)=R +αe^{βT} + γ_{n} T^{n}$. With this choice one covers all existing proposals in the literature via four free parameters. All relevant $f(R,T)$ models as well as the $Λ$CDM model can be achieved in the appropriate limit. We show that in such a minimally coupled case there exists a useful constraining relation between the effective fractionary total matter density with an arbitrary equation of state parameter and the modified gravity parameters. This is one of the most important aspects of this work. Then, with this association the modified gravity sector can be independently constrained using estimations of the gas mass fraction in galaxy clusters. Further, using cosmological background cosmic chronometers data and demanding the universe is old enough to accommodate the existence of Galactic globular clusters with estimated age of at least $\\sim 14$ Gyrs we find a narrow range of the modified gravity free parameter space in which this class of theories remains viable for the late time cosmological evolution. As expected, this preferred parameter space region accommodates the $Λ$CDM limit of $f(R,T)$ models. We also work out the non-minimally coupled case in the metric-affine formalism and find that there are no viable cosmologies in the latter situation. However, when analysing the cosmological dynamics including a radiation component, we find that this energy density interacts with the matter field and it does not scale according to the typical $a^{-4}$ behavior, being $a$ the scale factor. We conclude stating that $f(R,T)$ gravity is not able to provide a full cosmological scenario and should be ruled out as a modified gravity alternative to the dark energy phenomena.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15208v1",
        "http://arxiv.org/pdf/2303.15208v2"
    ],
    "publication_venue": "V2. New section added to include the effects of raditation. Results partially changed. 9 pages, 6 figures"
}