{
    "arxiv_id": "2303.10362",
    "paper_title": "The H$α$ broadband photometric reverberation mapping of four Seyfert 1 galaxies",
    "authors": [
        "Qinchun Ma",
        "Xue-Bing Wu",
        "Huapeng Gu",
        "Yuhan Wen",
        "Yuming Fu"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-05-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Broadband photometric reverberation mapping (PRM) have been investigated for AGNs in recent years, but mostly on accretion disk continuum RM. Due to the small fraction of broad emission lines in the broadband, PRM for emission lines is very challenging. Here we present an ICCF-Cut method for broadband PRM to obtain the H$α$ broad line lag and apply it to four Seyfert 1 galaxies, MCG+08-11-011, NGC 2617, 3C 120 and NGC 5548. All of them have high quality broadband lightcurves with daily/sub-daily cadence, which enables us to extract H$α$ lightcurves from the line band by subtracting the contributions from the continuum and host galaxy. Their extracted H$α$ lightcurves are compared with the lagged continuum band lightcurves, as well as the lagged H$β$ lightcurves obtained by spectroscopic RM (SRM) at the same epochs. The consistency of these lightcurves and the comparison with the SRM H$β$ lags provide supports to the H$α$ lags of these AGNs, in a range from 9 to 19 days, obtained by the ICCF-Cut, JAVELIN and $χ^2$ methods. The simulations to evaluate the reliability of H$α$ lags and the comparisons between SRM H$β$ and PRM H$α$ lags indicate that the consistency of the ICCF-Cut, JAVELIN and $χ^2$ results can ensure the reliability of the derived H$α$ lags. These methods may be used to estimate the broad line region sizes and black hole masses of a large sample of AGNs in the large multi-epoch high cadence photometric surveys such as LSST in the future.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10362v1"
    ],
    "publication_venue": "22 pages, 19 figures, accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc4c1"
}