{
    "arxiv_id": "2303.17771",
    "paper_title": "Scalable Determination of Multipartite Entanglement in Quantum Networks",
    "authors": [
        "Wei-Ting Kao",
        "Chien-Ying Huang",
        "Tung-Ju Tsai",
        "Shih-Hsuan Chen",
        "Sheng-Yan Sun",
        "Yu-Cheng Li",
        "Teh-Lu Liao",
        "Chih-Sung Chuu",
        "He Lu",
        "Che-Ming Li"
    ],
    "submission_date": "2023-03-31",
    "revised_dates": [
        "2024-07-31"
    ],
    "latest_version": 4,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Quantum networks comprised of entangled end nodes serve stronger than the classical correlation for unparalleled quantum internet applications. However, practical quantum networking is affected by noise, which at its worst, causes end nodes to be described by pre-existing classical data. In such untrusted networks, determining quantum network fidelity and genuine multi-node entanglement becomes crucial. Here, we show that determining quantum network fidelity and genuine $N$-node entanglement in an untrusted star network requires only $N+1$ measurement settings. This method establishes a semi-trusted framework, allowing some nodes to relax their assumptions. Our network determination method is enabled by detecting genuine $N$-node Einstein-Podolsky-Rosen steerability. Experimentally, using spontaneous parametric down-conversion entanglement sources, we demonstrate the determinations of genuine 3-photon and 4-photon quantum networks and the false positives of the widely used entanglement witness, the fidelity criterion of $1/2$. Our results provide a scalable method for the determination of multipartite entanglement in realistic quantum networks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17771v1",
        "http://arxiv.org/pdf/2303.17771v2",
        "http://arxiv.org/pdf/2303.17771v3",
        "http://arxiv.org/pdf/2303.17771v4"
    ],
    "publication_venue": "Accepted for publication in npj Quantum Information"
}