{
    "arxiv_id": "2303.09979",
    "paper_title": "Two-component $GW$ calculations: Cubic scaling implementation and comparison of partially self-consistent variants",
    "authors": [
        "Arno Förster",
        "Erik van Lenthe",
        "Edoardo Spadetto",
        "Lucas Visscher"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph"
    ],
    "abstract": "We report an all-electron, atomic orbital (AO) based, two-component (2C) implementation of the $GW$ approximation (GWA) for closed-shell molecules. Our algorithm is based on the space-time formulation of the GWA and uses analytical continuation of the self-energy, and pair-atomic density fitting (PADF) to switch between AO and auxiliary basis. By calculating the dynamical contribution to the $GW$ self-energy at a quasi-one-component level, our 2C $GW$ algorithm is only about a factor of two to three slower than in the scalar relativistic case. Additionally, we present a 2C implementation of the simplest vertex correction to the self-energy, the statically screened $G3W2$ correction. Comparison of first ionization potentials of a set of 60 molecules with heavy elements (a subset of the SOC81 set) calculated with our implementation against results from the WEST code reveals mean absolute deviations of around 140 meV for $G_0W_0$@PBE and 150 meV for $G_0W_0$@PBE0. These are most likely due to technical differences in both implementations, most notably the use of different basis sets, pseudopotential approximations, different treatment of the frequency dependency of the self-energy and the choice of the 2C-Hamiltonian. How much each of these differences contribute to the observed discrepancies is unclear at the moment. Finally, we assess the performance of some variants of the GWA for the calculation of first IPs for a set of 81 molecules with heavy elements (SOC81). Quasi-particle self-consistent $GW$ (qs$GW$) and eigenvalue-only self-consistent $GW$ (ev$GW$) agree best with vertical experimental reference values, even though they systematically overestimate the IPs. We further show that the perturbative $G3W2$ correction worsens the agreement with experiment and that explicit treatment of spin-orbit effects at the 2C level is crucial for systematic agreement with experiment.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09979v1"
    ],
    "publication_venue": null
}