{
    "arxiv_id": "2303.17164",
    "paper_title": "Optical information transfer through random unknown diffusers using electronic encoding and diffractive decoding",
    "authors": [
        "Yuhang Li",
        "Tianyi Gan",
        "Bijie Bai",
        "Cagatay Isil",
        "Mona Jarrahi",
        "Aydogan Ozcan"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-08-29"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics",
        "physics.app-ph"
    ],
    "abstract": "Free-space optical information transfer through diffusive media is critical in many applications, such as biomedical devices and optical communication, but remains challenging due to random, unknown perturbations in the optical path. In this work, we demonstrate an optical diffractive decoder with electronic encoding to accurately transfer the optical information of interest, corresponding to, e.g., any arbitrary input object or message, through unknown random phase diffusers along the optical path. This hybrid electronic-optical model, trained using supervised learning, comprises a convolutional neural network (CNN) based electronic encoder and successive passive diffractive layers that are jointly optimized. After their joint training using deep learning, our hybrid model can transfer optical information through unknown phase diffusers, demonstrating generalization to new random diffusers never seen before. The resulting electronic-encoder and the optical-decoder model were experimentally validated using a 3D-printed diffractive network that axially spans less than 70 x lambda, where lambda = 0.75 mm is the illumination wavelength in the terahertz spectrum, carrying the desired optical information through random unknown diffusers. The presented framework can be physically scaled to operate at different parts of the electromagnetic spectrum, without retraining its components, and would offer low-power and compact solutions for optical information transfer in free space through unknown random diffusive media.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17164v1"
    ],
    "publication_venue": "32 Pages, 9 Figures",
    "doi": "10.1117/1.AP.5.4.046009"
}