{
    "arxiv_id": "2303.10723",
    "paper_title": "Reconstructing real algebraic maps locally like moment-maps with prescribed images and compositions with the canonical projections to the $1$-dimensional real affine space",
    "authors": [
        "Naoki Kitazawa"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2024-05-16"
    ],
    "latest_version": 7,
    "categories": [
        "math.AG",
        "math.GN",
        "math.GT"
    ],
    "abstract": "We present new real algebraic maps of non-positive codimensions with prescribed images whose boundaries consist of explicit non-singular real algebraic hypersurfaces satisfying so-called \"transversality\" as follows. Explicit information on important real polynomials is given. Preimages are one-point sets or products of spheres. They are locally like so-called moment maps.\n  Celebrated theory of Nash and Tognoli says that smooth closed manifolds are {\\it non-singular} real algebraic manifolds and the zero sets of some real polynomial maps. In general, we can approximate smooth functions or more generally, maps, by real algebraic ones. It is in general difficult to have explicit examples. We have constructed maps of a specific class of the present class containing the canonical projections of the unit spheres previously where preimages are one-point sets or spheres.\n  We also present explicit families of functions represented as compositions of such maps with the canonical projections.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10723v1",
        "http://arxiv.org/pdf/2303.10723v2",
        "http://arxiv.org/pdf/2303.10723v3",
        "http://arxiv.org/pdf/2303.10723v4",
        "http://arxiv.org/pdf/2303.10723v5",
        "http://arxiv.org/pdf/2303.10723v6",
        "http://arxiv.org/pdf/2303.10723v7"
    ],
    "publication_venue": "24 pages, 6 figures, STEP 1-2 of our proof of Main Theorem 1 revised where the previous version has contained a stupid error in \"arguments on submanifolds\" which are not crucial in main ingredients, some small revisions, this version is submitted to a refereed journal"
}