{
    "arxiv_id": "2303.14030",
    "paper_title": "Preservation and enhancement of quantum correlations under Stark effect",
    "authors": [
        "Nitish Kumar Chandra",
        "Rajiuddin Sk",
        "Prasanta K. Panigrahi"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-06-06"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "We analyze the dynamics of quantum correlations by obtaining the exact expression of Bures distance entanglement, trace distance discord, and local quantum uncertainty of two two-level atoms. Here, the atoms undergo two-photon transitions mediated through an intermediate virtual state where each atom is separately coupled to a dissipative reservoir at zero temperature in the presence of the Stark shift effect. We have investigated the dynamics of this atomic system for two different initial conditions of the environment. In the first case, we have assumed the environment's state to be in ground state and in the other case, we have assumed the state to be in first excited state. The second initial condition is significant as it shows the role played by both the Stark shift parameters in contrast to only one of the Stark shift parameters for the first initial condition. Our results demonstrate that quantum correlations can be sustained for an extended period in the presence of Stark shift effect in the case of both Markovian and non-Markovian reservoirs. The effect in the non-Markovian reservoir is more prominent than the Markovian reservoir, even for a very small value of the Stark shift parameter. We observe that among the correlation measures considered, only local quantum uncertainty is accompanied by a sudden change phenomenon, i.e., an abrupt change in the decay rate of a correlation measure. Our findings are significant as preserving quantum correlations is one of the essential aspects in attaining optimum performance in quantum information tasks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14030v1"
    ],
    "publication_venue": null,
    "doi": "10.1080/09500340.2023.2219779"
}