{
    "arxiv_id": "2303.11856",
    "paper_title": "Link between interlayer hybridization and ultrafast charge transfer in WS$_2$-graphene heterostructures",
    "authors": [
        "Niklas Hofmann",
        "Leonard Weigl",
        "Johannes Gradl",
        "Neeraj Mishra",
        "Giorgio Orlandini",
        "Stiven Forti",
        "Camilla Coletti",
        "Simone Latini",
        "Lede Xian",
        "Angel Rubio",
        "Dilan Perez Paredes",
        "Raul Perea Causin",
        "Samuel Brem",
        "Ermin Malic",
        "Isabella Gierz"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Ultrafast charge separation after photoexcitation is a common phenomenon in various van-der-Waals (vdW) heterostructures with great relevance for future applications in light harvesting and detection. Theoretical understanding of this phenomenon converges towards a coherent mechanism through charge transfer states accompanied by energy dissipation into strongly coupled phonons. The detailed microscopic pathways are material specific as they sensitively depend on the band structures of the individual layers, the relative band alignment in the heterostructure, the twist angle between the layers, and interlayer interactions resulting in hybridization. We used time- and angle-resolved photoemission spectroscopy combined with tight binding and density functional theory electronic structure calculations to investigate ultrafast charge separation and recombination in WS$_2$-graphene vdW heterostructures. We identify several avoided crossings in the band structure and discuss their relevance for ultrafast charge transfer. We relate our own observations to existing theoretical models and propose a unified picture for ultrafast charge transfer in vdW heterostructures where band alignment and twist angle emerge as the most important control parameters.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11856v1"
    ],
    "publication_venue": "8 pages, 5 figures"
}