{
    "arxiv_id": "2303.15097",
    "paper_title": "Control-oriented modeling of a LiBr/H2O absorption heat pumping device and experimental validation",
    "authors": [
        "Sandra Staudt",
        "Viktor Unterberger",
        "Markus Gölles",
        "Michael Wernhart",
        "René Rieberer",
        "Martin Horn"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY"
    ],
    "abstract": "Absorption heat pumping devices (AHPDs, comprising absorption heat pumps and chillers) are devices that use thermal energy instead of electricity to generate heating and cooling, thereby facilitating the use of waste heat and renewable energy sources such as solar or geothermal energy. Despite this benefit, widespread use of AHPDs is still limited. One reason for this is partly unsatisfactory control performance under varying operating conditions, which can result in poor modulation and part load capability. A promising approach to tackle this issue is using dynamic, model-based control strategies, whose effectiveness, however, strongly depend on the model being used. This paper therefore focuses on the derivation of a viable dynamic model to be used for such model-based control strategies for AHPDs such as state feedback or model-predictive control. The derived model is experimentally validated, showing good modeling accuracy. Its modeling accuracy is also compared to alternative model versions, that contain other heat transfer correlations, as a benchmark. Although the derived model is mathematically simple, it does have the structure of a nonlinear differential-algebraic system of equations. To obtain an even simpler model structure, linearization at an operating point is discussed to derive a model in linear state space representation. The experimental validation shows that the linear model does have slightly worse steady-state accuracy, but that the dynamic accuracy seems to be almost unaffected by the linearization. The presented new modeling approach is considered suitable to be used as a basis for the design of advanced, model-based control strategies, ultimately aiming to improve the modulation and part load capability of AHPDs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15097v1"
    ],
    "publication_venue": null
}