{
    "arxiv_id": "2303.09113",
    "paper_title": "Security--Throughput Tradeoff of Nakamoto Consensus under Bandwidth Constraints",
    "authors": [
        "Lucianna Kiffer",
        "Joachim Neu",
        "Srivatsan Sridhar",
        "Aviv Zohar",
        "David Tse"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2024-05-30"
    ],
    "latest_version": 3,
    "categories": [
        "cs.CR",
        "cs.DC"
    ],
    "abstract": "For Nakamoto's longest-chain consensus protocol, whose proof-of-work (PoW) and proof-of-stake (PoS) variants power major blockchains such as Bitcoin and Cardano, we revisit the classic problem of the security-performance tradeoff: Given a network of nodes with limited capacities, against what fraction of adversary power is Nakamoto consensus (NC) secure for a given block production rate? State-of-the-art analyses of Nakamoto's protocol fail to answer this question because their bounded-delay model does not capture realistic constraints such as limited communication- and computation-resources. We develop a new analysis technique to prove a refined security-performance tradeoff for PoW Nakamoto consensus in a bounded-bandwidth model. In this model, we show that, in contrast to the classic bounded-delay model, Nakamoto's private attack is no longer the worst attack, and a new attack strategy we call the teasing strategy, that exploits the network congestion caused by limited bandwidth, is strictly worse. In PoS, equivocating blocks can exacerbate congestion, making the traditional PoS Nakamoto consensus protocol insecure except at very low block production rates. To counter such equivocation spamming, we present a variant of the PoS NC protocol we call Blanking NC (BlaNC), which achieves the same resilience as PoW NC.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09113v1",
        "http://arxiv.org/pdf/2303.09113v2",
        "http://arxiv.org/pdf/2303.09113v3"
    ],
    "publication_venue": "ACM Conference on Computer and Communications Security 2024"
}