{
    "arxiv_id": "2303.16036",
    "paper_title": "Scalar Love numbers and Love symmetries of 5-dimensional Myers-Perry black hole",
    "authors": [
        "Panagiotis Charalambous",
        "Mikhail M. Ivanov"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "hep-th",
        "astro-ph.HE",
        "gr-qc",
        "hep-ph"
    ],
    "abstract": "The near-zone ``Love'' symmetry resolves the naturalness issue of black hole Love number vanishing with $\\text{SL}\\left(2,\\mathbb{R}\\right)$ representation theory. Here, we generalize this proposal to $5$-dimensional asymptotically flat and doubly spinning (Myers-Perry) black holes. We consider the scalar response of Myers-Perry black holes and extract its static scalar Love numbers. In agreement with the naturalness arguments, these Love numbers are, in general, non-zero and exhibit logarithmic running unless certain resonant conditions are met; these conditions include new cases with no previously known analogs. We show that there exist two near-zone truncations of the equations of motion that exhibit enhanced $\\text{SL}\\left(2,\\mathbb{R}\\right)$ Love symmetries that explain the vanishing of the static scalar Love numbers in the resonant cases. These Love symmetries can be interpreted as local $\\text{SL}\\left(2,\\mathbb{R}\\right)\\times\\text{SL}\\left(2,\\mathbb{R}\\right)$ near-zone symmetries spontaneously broken down to global $\\text{SL}\\left(2,\\mathbb{R}\\right)\\times U\\left(1\\right)$ symmetries by the periodic identification of the azimuthal angles. We also discover an infinite-dimensional extension of the Love symmetry into $\\text{SL}\\left(2,\\mathbb{R}\\right)\\ltimes\\hat{U}\\left(1\\right)_{\\mathcal{V}}^2$ that contains both Love symmetries as particular subalgebras, along with a family of $\\text{SL}\\left(2,\\mathbb{R}\\right)$ subalgebras that reduce to the exact near-horizon Myers-Perry black hole isometries in the extremal limit. Finally, we show that the Love symmetries acquire a geometric interpretation as isometries of subtracted (effective) black hole geometries that preserve the internal structure of the black hole and interpret these non-extremal $\\text{SL}\\left(2,\\mathbb{R}\\right)$ structures as remnants of the enhanced isometry of the near-horizon extremal geometries.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16036v1"
    ],
    "publication_venue": "45+16 pages, 3 Figures"
}