{
    "arxiv_id": "2303.09077",
    "paper_title": "Towards the Understanding of Receptivity and Affect in EMAs using Physiological based Machine Learning Method: Analysis of Receptivity and Affect",
    "authors": [
        "Zachary D King",
        "Han Yu",
        "Thomas Vaessen",
        "Iniz Myin-Germeys",
        "Akane Sano"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "cs.HC"
    ],
    "abstract": "As mobile health (mHealth) studies become increasingly productive due to the advancements in wearable and mobile sensor technology, our ability to monitor and model human behavior will be constrained by participant receptivity. Many health constructs are dependent on subjective responses, and without such responses, researchers are left with little to no ground truth to accompany our ever-growing biobehavioral data. We examine the factors that affect participants' responsiveness to ecological momentary assessments (EMA) in a 10 day wearable and EMA based affect sensing mHealth study. We study the physiological relationships indicative of receptivity and affect while also analyzing the interaction between the two constructs. We collected the data from 45 healthy participants wearing two devices measuring electrodermal activity, acceleration, electrocardiography, and skin temperature while answering 10 EMAs a day containing questions related to perceived mood. Due to the nature of our constructs, we can only obtain ground truth measures for both affect and receptivity during a response. Therefore, we utilized unsupervised and supervised learning methods to infer affect when a participant did not respond. Based on our findings we showed that using a receptivity model to trigger EMAs will decrease the reported negative affect by more than 3 points or 0.29 standard deviation using our psychological instrument scored between 13 and 91. The findings also showed a bimodal distribution of our predicted affect during nonresponses. Our results showed a clear relationship between affect and receptivity. This relationship can affect the efficacy of a mHealth study, particularly those studies that employ a learning algorithm to trigger EMAs. Therefore, we propose a smart trigger that promotes EMA and JITI receptivity without influencing affect during sampled time points as future work.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09077v1"
    ],
    "publication_venue": null
}