{
    "arxiv_id": "2303.15659",
    "paper_title": "Boundary-to-Solution Mapping for Groundwater Flows in a Toth Basin",
    "authors": [
        "Jingwei Sun",
        "Jun Li",
        "Yonghong Hao",
        "Cuiting Qi",
        "Chunmei Ma",
        "Huazhi Sun",
        "Negash Begashaw",
        "Gurcan Comet",
        "Yi Sun",
        "Qi Wang"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-05-31"
    ],
    "latest_version": 1,
    "categories": [
        "physics.geo-ph",
        "cs.LG"
    ],
    "abstract": "In this paper, the authors propose a new approach to solving the groundwater flow equation in the Toth basin of arbitrary top and bottom topographies using deep learning. Instead of using traditional numerical solvers, they use a DeepONet to produce the boundary-to-solution mapping. This mapping takes the geometry of the physical domain along with the boundary conditions as inputs to output the steady state solution of the groundwater flow equation. To implement the DeepONet, the authors approximate the top and bottom boundaries using truncated Fourier series or piecewise linear representations. They present two different implementations of the DeepONet: one where the Toth basin is embedded in a rectangular computational domain, and another where the Toth basin with arbitrary top and bottom boundaries is mapped into a rectangular computational domain via a nonlinear transformation. They implement the DeepONet with respect to the Dirichlet and Robin boundary condition at the top and the Neumann boundary condition at the impervious bottom boundary, respectively. Using this deep-learning enabled tool, the authors investigate the impact of surface topography on the flow pattern by both the top surface and the bottom impervious boundary with arbitrary geometries. They discover that the average slope of the top surface promotes long-distance transport, while the local curvature controls localized circulations. Additionally, they find that the slope of the bottom impervious boundary can seriously impact the long-distance transport of groundwater flows. Overall, this paper presents a new and innovative approach to solving the groundwater flow equation using deep learning, which allows for the investigation of the impact of surface topography on groundwater flow patterns.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15659v1"
    ],
    "publication_venue": null,
    "doi": "10.1016/j.advwatres.2023.104448"
}