{
    "arxiv_id": "2303.16193",
    "paper_title": "TOI-5375 B: A Very Low Mass Star at the Hydrogen-Burning Limit Orbiting an Early M-type Star",
    "authors": [
        "Mika Lambert",
        "Chad F. Bender",
        "Shubham Kanodia",
        "Caleb I. Cañas",
        "Andrew Monson",
        "Guðmundur Stefánsson",
        "William D. Cochran",
        "Mark E. Everett",
        "Arvind F. Gupta",
        "Fred Hearty",
        "Henry A. Kobulnicky",
        "Jessica E. Libby-Roberts",
        "Andrea S. J. Lin",
        "Suvrath Mahadevan",
        "Joe P. Ninan",
        "Brock A. Parker",
        "Paul Robertson",
        "Christian Schwab",
        "Ryan C. Terrien"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
    ],
    "abstract": "The TESS mission detected a companion orbiting TIC 71268730, categorized it as a planet candidate, and designated the system TOI-5375. Our follow-up analysis using radial velocity data from the Habitable-zone Planet Finder (HPF), photometric data from Red Buttes Observatory (RBO), and speckle imaging with NN-EXPLORE Exoplanet Stellar Speckle Imager (NESSI) determined that the companion is a very low mass star (VLMS) near the hydrogen-burning mass limit with a mass of 0.080$\\pm{0.002} M_{\\Sun}$ ($83.81\\pm{2.10} M_{J}$), a radius of 0.1114$^{+0.0048}_{-0.0050} R_{\\Sun}$ (1.0841$^{0.0467}_{0.0487} R_{J}$), and brightness temperature of $2600\\pm{70}$ K. This object orbits with a period of 1.721553$\\pm{0.000001}$ days around an early M dwarf star ($0.62\\pm{0.016}M_{\\Sun}$). TESS photometry shows regular variations in the host star's TESS light curve, which we interpreted as activity-induced variation of $\\sim$2\\%, and used this variability to measure the host star's stellar rotation period of 1.9716$^{+0.0080}_{-0.0083}$ days. The TOI-5375 system provides tight constraints on stellar models of low-mass stars at the hydrogen-burning limit and adds to the population in this important region.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16193v1"
    ],
    "publication_venue": "15 pages, 8 figures, Accepted to the Astronomical Journal",
    "doi": "10.3847/1538-3881/acc651"
}