{
    "arxiv_id": "2303.10471",
    "paper_title": "Vehicular Applications of Koopman Operator Theory -- A Survey",
    "authors": [
        "Waqas Manzoor",
        "Samir Rawashdeh",
        "Alireza Mohammadi"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY",
        "cs.RO",
        "math.DS"
    ],
    "abstract": "Koopman operator theory has proven to be a promising approach to nonlinear system identification and global linearization. For nearly a century, there had been no efficient means of calculating the Koopman operator for applied engineering purposes. The introduction of a recent computationally efficient method in the context of fluid dynamics, which is based on the system dynamics decomposition to a set of normal modes in descending order, has overcome this long-lasting computational obstacle. The purely data-driven nature of Koopman operators holds the promise of capturing unknown and complex dynamics for reduced-order model generation and system identification, through which the rich machinery of linear control techniques can be utilized. Given the ongoing development of this research area and the many existing open problems in the fields of smart mobility and vehicle engineering, a survey of techniques and open challenges of applying Koopman operator theory to this vibrant area is warranted. This review focuses on the various solutions of the Koopman operator which have emerged in recent years, particularly those focusing on mobility applications, ranging from characterization and component-level control operations to vehicle performance and fleet management. Moreover, this comprehensive review of over 100 research papers highlights the breadth of ways Koopman operator theory has been applied to various vehicular applications with a detailed categorization of the applied Koopman operator-based algorithm type. Furthermore, this review paper discusses theoretical aspects of Koopman operator theory that have been largely neglected by the smart mobility and vehicle engineering community and yet have large potential for contributing to solving open problems in these areas.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10471v1"
    ],
    "publication_venue": "Following a fruitful discussion with Professor Igor Mezic, the authors are providing a more detailed account of the roots of the modern-day engineering applications of the Koopman Operator Theory in this arXiv version",
    "doi": "10.1109/ACCESS.2023.3257109"
}