{
    "arxiv_id": "2303.12577",
    "paper_title": "Detection of Dust in High-Velocity Cloud Complex C -- Enriched Gas Accreting onto the Milky Way",
    "authors": [
        "Andrew J. Fox",
        "Frances H. Cashman",
        "Gerard A. Kriss",
        "Gisella de Rosa",
        "Rachel Plesha",
        "Yasaman Homayouni",
        "Philipp Richter"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present the first detection of dust depletion in Complex C, a massive, infalling, low-metallicity high-velocity cloud in the northern Galactic hemisphere that traces the ongoing accretion of gas onto the Milky Way. We analyze a very high signal-to-noise HST/COS spectrum of AGN Mrk 817 formed by coadding 165 individual exposures taken under the AGN STORM 2 program, allowing us to determine dust-depletion patterns in Complex C at unprecedented precision. By fitting Voigt components to the O I, S II, N I, Si II, Fe II, and Al II absorption and applying ionization corrections from customized Cloudy photoionization models, we find sub-solar elemental abundance ratios of [Fe/S]=-0.42+/-0.08, [Si/S]=-0.29+/-0.05, and [Al/S]=-0.53+/-0.08. These ratios indicate the depletion of Fe, Si, and Al into dust grains, since S is mostly undepleted. The detection of dust provides an important constraint on the origin of Complex C, as dust grains indicate the gas has been processed through galaxies, rather than being purely extragalactic. We also derive a low metallicity of Complex C of [S/H]=-0.51+/-0.16 (31% solar), confirming earlier results from this sightline. We discuss origin models that could explain the presence of dust in Complex C, including Galactic fountain models, tidal stripping from the Magellanic Clouds or other satellite galaxies, and precipitation of coronal gas onto dust-bearing ``seed\" clouds.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12577v1"
    ],
    "publication_venue": "8 pages, 3 figures, accepted for publication in ApJ Letters"
}