{
    "arxiv_id": "2303.08487",
    "paper_title": "A multi-wavelength view of the multiple activity cycles of $ε$~Eridani",
    "authors": [
        "B. Fuhrmeister",
        "M. Coffaro",
        "B. Stelzer",
        "M. Mittag",
        "S. Czesla",
        "P. C. Schneider"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-04-19"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.HE"
    ],
    "abstract": "$ε$ Eridani is a highly active young K2 star with an activity cycle of about three years established using Ca II H & K line index measurements (S_MWO). This relatively short cycle has been demonstrated to be consistent with X-ray and magnetic flux measurements. Recent work suggested a change in the cyclic behaviour. Here we report new X-ray flux and S_MWO measurements and also include S_MWO measurements from the historical Mount Wilson program. This results in an observational time baseline of over 50 years for the S_MWO data and of over 7 years in X-rays. Moreover, we include Ca II infrared triplet (IRT) index measurements (S_IRT) from 2013-2022 in our study. With the extended X-ray data set, we can now detect the short cycle for the first time using a periodogram analysis. Near-simultaneous S_MWO data and X-ray fluxes, which are offset by 20 days at most, are moderately strongly correlated when only the lowest activity state (concerning short-term variability) is considered in both diagnostics. In the S_MWO data, we find strong evidence for a much longer cycle of about 34 years and an 11-year cycle instead of the formerly proposed $12$-year cycle in addition to the known 3-year cycle. The superposition of the three periods naturally explains the recent drop in S_MWO measurements. The two shorter cycles are also detected in the S_IRT data, although the activity cycles exhibit lower amplitudes in the S_IRT than in the S_MWO data. Finally, the rotation period of $ε$Eri can be found more frequently in the S_MWO as well as in the S_IRT data for times near the minimum of the long cycle. This may be explained by a scenario in which the filling factor for magnetically active regions near cycle maximum is too high to allow for notable short-term variations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08487v1"
    ],
    "publication_venue": "accepted to A&A",
    "doi": "10.1051/0004-6361/202245201"
}