{
    "arxiv_id": "2303.13094",
    "paper_title": "Polymorphic phase transitions in bulk triglyceride mixtures",
    "authors": [
        "Diana Cholakova",
        "Slavka Tcholakova",
        "Nikolai Denkov"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Triacylglycerols (TAGs) are among the most important ingredients in food, cosmetic and pharmaceutical products. Many physical properties of such products, incl. morphology, texture and rheology, are determined by the phase behaviour of the included TAGs. Triglycerides are also of special interest for the production of solid lipid nanoparticles, applied for controlled drug delivery and for encapsulation of bioactive ingredients. In this paper, we study the polymorphic behaviour of complex TAG mixtures, composed of 2 to 6 mixed TAGs, by differential scanning calorimetry and X-ray scattering techniques, aiming to reveal the general rules for their phase behaviour upon cooling and heating. The results show that two or more coexisting phases form upon solidification $(α$, $β'$ and/or $β)$, the number of which depends strongly on the cooling rate and on the number of components in the mixture. No completely miscible $α$- or $β'$-phases were observed. The structure of the most stable $β$ polymorphs, formed upon subsequent heating of the solidified samples, does not depend on the thermal history of the samples. For all mixtures studied, we observed one-component $β$ domains, coexisting with binary mixed $β$ domains with composition and structure which do not depend on the specific TAG ratio in the mixture. In other words, for a mixture with $k$ saturated TAGs we observed $(2k-1)$ different $β$ phases. These conclusions provide some predictive power when analysing the phase transition properties of TAG mixtures.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13094v1"
    ],
    "publication_venue": null,
    "doi": "10.1021/acs.cgd.2c01021"
}