{
    "arxiv_id": "2303.10846",
    "paper_title": "A conservative implicit scheme for three-dimensional steady flows of diatomic gases in all flow regimes using unstructured meshes in the physical and velocity spaces",
    "authors": [
        "Rui Zhang",
        "Sha Liu",
        "Jianfeng Chen",
        "Chengwen Zhong",
        "Congshan Zhuo"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn",
        "physics.comp-ph"
    ],
    "abstract": "A computationally accurate and efficient numerical method under a unified framework is crucial to various multi-scale scientific and engineering problems. So far, many numerical methods have encountered various challenges in efficiently solving multi-scale non-equilibrium flows that cover a wide range of Knudsen numbers, especially the three-dimensional hypersonic flows. In this study, a conservative implicit scheme is further presented for three-dimensional steady flows of diatomic gases in all flow regimes, where both the implicit microscopic kinetic equations based on Rykov model and the corresponding implicit macroscopic governing equations are solved synchronously. Furthermore, a simplified multi-scale numerical flux inspired by the strategy of discrete unified gas kinetic scheme (DUGKS) is proposed to relieve the limitation of grid size and time step in all flow regimes. The flux is constructed through a backward Euler difference scheme with the consideration of collision effect in the physical reconstruction of the gas distribution function on the cell interface. Meanwhile, its asymptotic preserving property in the continuum limit is analyzed. In order to pursue high computational efficiency in three-dimensional flow simulations, the unstructured discrete velocity space (DVS) and MPI parallel in DVS are adopted to further speed up the calculation. Additionally, based on numerical experiments of Apollo 6 command module, an empirical generation criterion for three-dimensional unstructured DVS is proposed. Numerical results indicate that, the present method is about one to two orders of magnitude faster than the explicit conserved DUGKS method. The present method is proved to accurately and efficiently predict aerothermodynamic properties of hypersonic rarefied gas flows.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10846v1"
    ],
    "publication_venue": null
}