{
    "arxiv_id": "2303.14719",
    "paper_title": "Dense Forests Constructed from Grids",
    "authors": [
        "Victor Shirandami"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "math.NT",
        "math.MG"
    ],
    "abstract": "A dense forest is a set $F \\subset \\mathbb{R}^n$ with the property that for all $\\varepsilon > 0$ there exists a number $V(\\varepsilon) > 0$ such that all line segments of length $V(\\varepsilon)$ are $\\varepsilon$-close to a point in $F$. The function $V$ is called a visibility function of $F$. In this paper we study dense forests constructed from finite unions of translated lattices (grids). First, we provide a necessary and sufficient condition for a finite union of grids to be a dense forest in terms of the irrationality properties of the matrices defining them. This answers a question raised by Adiceam, Solomon, and Weiss (2022). To complement this, we further show that such sets generically admit effective visibility bounds in the following sense: for all $η> 0$, there exists a $k \\in \\mathbb{N}$ such that almost all unions of $k$ grids are dense forests admitting a visibility function $V(\\varepsilon) \\ll \\varepsilon^{-(n-1) -η}$. This is arbitrarily close to optimal in the sense that if a finite union of grids admits a visibility function $V$, then this function necessarily satisfies $V(\\varepsilon) \\gg \\varepsilon^{-(n-1)}$. One of the main novelties of this work is that the notion of `almost all' is considered with respect to several underlying measures, which are defined according to the Iwasawa decomposition of the matrices used to define the grids. In this respect, the results obtained here vastly extend those of Adiceam, Solomon, and Weiss (2022) who provided similar effective visibility bounds for a particular family of generic unimodular lattices.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14719v1"
    ],
    "publication_venue": "18 pages"
}