{
    "arxiv_id": "2303.15209",
    "paper_title": "Radio Pulsar Emission-Beam Geometry at Low Frequency: LOFAR High Band Survey Sources Studied using Arecibo at 1.4 GHz and 327 MHz",
    "authors": [
        "Haley Wahl",
        "Joanna Rankin",
        "Arun Venkataraman",
        "Timothy Olszanski"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2025-04-30"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "This paper continues our study of radio pulsar emission-beam configurations with the primary intent of extending study to the lowest possible frequencies. Here we focus on a group of 133 more recently discovered pulsars, most of which were included in the (100-200 MHz) LOFAR High Band Survey, observed with Arecibo at 1.4 GHz and 327 MHz, and some observed at decameter wavelengths. Our analysis framework is the core/double-cone beam model, and we took opportunity to apply it as widely as possible, both conceptually and quantitatively, while highlighting situations where modeling is difficult, or where its premises may be violated. In the great majority of pulsars, beam forms consistent with the core/double-cone model were identified. Moreover, we found that each pulsar's beam structure remained largely constant over the frequency range available; where profile variations were observed, they were attributable to different component spectra and in some instances to varying conal beam sizes. As an Arecibo population, many or most of the objects tend to fall in the Galactic anticenter region and/or at high Galactic latitudes, so overall it includes a number of nearer, older pulsars. We found a number of interesting or unusual characteristics in some of the pulsars that would benefit from additional study. The scattering levels encountered for this group are low to moderate, apart from a few pulsars lying in directions more toward the inner Galaxy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15209v1",
        "http://arxiv.org/pdf/2303.15209v2"
    ],
    "publication_venue": "74 pages with Appendix, many figures. arXiv admin note: text overlap with arXiv:2210.10896. Errors in a few polarization profiles were found in the Appendix as originally published due to incorrect calibration. These have now been corrected and the Appendix has been appropriately revised. No other part of the paper or its overall conclusions were affected",
    "doi": "10.1093/mnras/stac3613"
}