{
    "arxiv_id": "2303.10122",
    "paper_title": "Probing the coverage of nanoparticles by biomimetic membranes through nanoplasmonics",
    "authors": [
        "Jacopo Cardellini",
        "Andrea Ridolfi",
        "Melissa Donati",
        "Valentina Giampietro",
        "Mirko Severi",
        "Marco Brucale",
        "Francesco Valle",
        "Paolo Bergese",
        "Costanza Montis",
        "Lucrezia Caselli",
        "Debora Berti"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.BM",
        "cond-mat.soft",
        "physics.bio-ph"
    ],
    "abstract": "Although promising for biomedicine, the clinical translation of inorganic nanoparticles (NPs) is limited by low biocompatibility and stability in biological fluids. A common strategy to circumvent this drawback consists in disguising the active inorganic core with a lipid bilayer coating, reminiscent of the structure of the cell membrane to redefine the chemical and biological identity of NPs. While recent reports introduced membrane coating procedures for NPs, a robust and accessible method to quantify the integrity of the bilayer coverage is not yet available. To fill this gap, we prepared SiO2 nanoparticles (SiO2NPs) with different membrane coverage degrees and monitored their interaction with AuNPs by combining microscopic, scattering, and optical techniques. The membrane-coating on SiO2NPs induces spontaneous clustering of AuNPs, whose extent depends on the coating integrity. Remarkably, we discovered a linear correlation between the membrane coverage and a spectral descriptor for the AuNPs plasmonic resonance, spanning a wide range of coating yields. These results provide a fast and cost-effective assay to monitor the compatibilization of NPs with biological environments, essential for bench tests and scale-up. In addition, we introduce a robust and scalable method to prepare SiO2NPsAuNPs hybrids through spontaneous self assembly, with a high fidelity structural control mediated by a lipid bilayer.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10122v1"
    ],
    "publication_venue": null,
    "doi": "10.1016/j.jcis.2023.02.073"
}