{
    "arxiv_id": "2303.10075",
    "paper_title": "Imaging effects due to pixel distortions in CdZnTe (CZT) detectors -- results from the HREXI Calibration Facility (HCF)",
    "authors": [
        "Arkadip Basak",
        "Branden Allen",
        "Jaesub Hong",
        "Daniel P. Violette",
        "Jonathan Grindlay"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM",
        "astro-ph.HE",
        "hep-ex"
    ],
    "abstract": "ProtoEXIST2 (P2) was a prototype imaging X-ray detector plane developed for wide-field Time Domain Astrophysics (TDA) in the 5 - 200 keV energy band. It was composed of an 8 $\\times$ 8 array of 5 mm thick, 2cm $\\times$ 2cm pixelated (32 $\\times$ 32) CdZnTe (CZT) detectors with a 0.6 mm pitch that utilize the NuSTAR ASIC(NuASIC) for readout. During the initial detector development process leading up to post-flight examination of the entire detector plane, distortions in expected pixel positions and shapes were observed in a significant fraction of the detectors. The HREXI (High Resolution Energetic X-ray Imager) Calibration Facility (HCF) was designed and commissioned to improve upon these early experiments and to rapidly map out and characterize pixel non-uniformities and defects within CZT detector planes at resolutions down to 50 $\\rm μ$m. Using this facility, the sub-pixel level detector response of P2 was measured at 100 $\\rm μ$m resolution and analyzed to extract and evaluate the area and profile of individual pixels, their morphology across the entire P2 detector plane for comparison with previous measurements and to provide additional characterization. In this article, we evaluate the imaging performance of a coded-aperture telescope using the observed pixel morphology for P2 detectors. This investigation will serve as an initial guide for detector selection in the development of HREXI detector planes, for the future implementation of the 4pi X-Ray Imaging Observatory (4piXIO) mission which aims to provide simultaneous and continuous imaging of the full sky ($\\rm 4π$ sr) in the 3-200 keV energy band with $\\rm \\simeq$ 2 arcmin angular resolution and $\\simeq$ 10 arcsec source localization, as well as other, future coded-aperture instruments.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10075v1"
    ],
    "publication_venue": null,
    "doi": "10.1117/1.JATIS.9.1.018005"
}