{
    "arxiv_id": "2303.09907",
    "paper_title": "Biochars at the molecular level. Part 2 -- Development of realistic molecular models of biochars",
    "authors": [
        "Rosie Wood",
        "Ondrej Masek",
        "Valentina Erastova"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Biochars have been attracting renewed attention as economical and environmentally friendly carbon sequestration materials with a diverse range of applications. However, experimental developments may be limited by the lack of molecular-level knowledge of the key interactions driving these applications. Molecular modelling techniques, such as molecular dynamics simulations, offer a systematic and reproducible alternative and yield atomistic insights into physicochemical processes, allowing the identification of adsorption mechanisms and, through this, informing and guiding experimental development. In this work, on the basis of the critical assessment of the analytical techniques for characterisation of biochars and collation of a large volume of experimental data, we develop molecular models of three woody biochar materials, representative of those produced under low-, medium-, and high-temperature treatments. We characterise these models, validating them against experimental data, and share them with the research community. Furthermore, we detail our iterative approach to the design of these biochar models, discuss what we have learned about the relationship between biochar composition and its morphology, and finally share all of the building blocks used to create these biochar models. With this work, we hope to speed up the uptake of molecular dynamics simulations for the study and development of biochar materials and, to this end, we distribute our easy-to-use surface-exposed biochar models ready for the adsorption studies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09907v1"
    ],
    "publication_venue": null
}