{
    "arxiv_id": "2303.14853",
    "paper_title": "Homochiral antiferromagnetic merons, antimerons and bimerons realized in synthetic antiferromagnets",
    "authors": [
        "Mona Bhukta",
        "Takaaki Dohi",
        "Venkata Krishna Bharadwaj",
        "Ricardo Zarzuela",
        "Maria-Andromachi Syskaki",
        "Michael Foerster",
        "Miguel Angel Niño",
        "Jairo Sinova",
        "Robert Frömter",
        "Mathias Kläui"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2024-05-16"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "The ever-growing demand for device miniaturization and energy efficiency in data storage and computing technology has prompted a shift towards antiferromagnetic (AFM) topological spin textures as information carriers, owing to their negligible stray fields, leading to possible high device density and potentially ultrafast dynamics. We realize, in this work, such chiral in-plane (IP) topological antiferromagnetic spin textures, namely merons, antimerons, and bimerons in synthetic antiferromagnets by concurrently engineering the effective perpendicular magnetic anisotropy, the interlayer exchange coupling, and the magnetic compensation ratio. We demonstrate by three-dimensional vector imaging of the Néel order parameter, the topology of those spin textures and reveal globally a well-defined chirality, which is a crucial requirement for controlled current-induced dynamics. Our analysis reveals that the interplay between interlayer exchange and interlayer magnetic dipolar interactions plays a key role in significantly reducing the critical strength of the Dzyaloshinskii-Moriya interaction required to stabilize topological spin textures, such as AFM merons, making synthetic antiferromagnets a promising platform for next-generation spintronics applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14853v1"
    ],
    "publication_venue": "18pages, 5 figures",
    "doi": "10.1038/s41467-024-45375-z"
}