{
    "arxiv_id": "2303.17117",
    "paper_title": "Reliable Representation Learning for Incomplete Multi-View Missing Multi-Label Classification",
    "authors": [
        "Chengliang Liu",
        "Jie Wen",
        "Yong Xu",
        "Bob Zhang",
        "Liqiang Nie",
        "Min Zhang"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2025-03-14"
    ],
    "latest_version": 3,
    "categories": [
        "cs.CV"
    ],
    "abstract": "As a cross-topic of multi-view learning and multi-label classification, multi-view multi-label classification has gradually gained traction in recent years. The application of multi-view contrastive learning has further facilitated this process, however, the existing multi-view contrastive learning methods crudely separate the so-called negative pair, which largely results in the separation of samples belonging to the same category or similar ones. Besides, plenty of multi-view multi-label learning methods ignore the possible absence of views and labels. To address these issues, in this paper, we propose an incomplete multi-view missing multi-label classification network named RANK. In this network, a label-driven multi-view contrastive learning strategy is proposed to leverage supervised information to preserve the intra-view structure and perform the cross-view consistency alignment. Furthermore, we break through the view-level weights inherent in existing methods and propose a quality-aware sub-network to dynamically assign quality scores to each view of each sample. The label correlation information is fully utilized in the final multi-label cross-entropy classification loss, effectively improving the discriminative power. Last but not least, our model is not only able to handle complete multi-view multi-label data, but also works on datasets with missing instances and labels. Extensive experiments confirm that our RANK outperforms existing state-of-the-art methods.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17117v1",
        "http://arxiv.org/pdf/2303.17117v2",
        "http://arxiv.org/pdf/2303.17117v3"
    ],
    "publication_venue": "Accepted by TPAMI. Please contact me if you have any questions: liucl1996@163.com",
    "doi": "10.1109/TPAMI.2025.3546356"
}