{
    "arxiv_id": "2303.09891",
    "paper_title": "The role of fluid's viscoelasticity on the self-assembly of particle chains in simple shear flow",
    "authors": [
        "Matthew G. Smith",
        "Graham M. Gibson",
        "Andreas Link",
        "Thomas Franke",
        "Manlio Tassieri"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn",
        "cond-mat.soft"
    ],
    "abstract": "Flow-Induced Self-Assembly (FISA) is the phenomena of particle chaining in viscoelastic fluids while experiencing shear flow. FISA has many applications across many fields including material science, food processing and the biomedical field. Although this phenomena is currently not fully understood it is accepted that the shear-thinning nature of the complex fluid plays a role in enhancing FISA. In this work, a bespoke cone and plate shear cell is used to provide new insights on the FISA dynamics. In particular, we have fine tuned the applied shear rates to investigate the particle chaining phenomenon across a Weissenberg number of 1, on a particle suspension made by a viscoelastic fluid characterised by a clear transition between a Newtonian-like behaviour (at relatively low shear rates) and a shear-thinning one (at relatively high shear rates). This has allowed us to reveal phenomena never reported previously in literature before; e.g., we have corroborated that for Weissenberg number higher than 1, the shear thinning nature of the viscoelastic fluid strongly enhances FISA and that particle chains break apart when a constant shear is applied for sufficiently long-time (i.e. much longer than the fluids' longest relaxation time). We speculate that this latter point could be explained by a ''disentanglement'' process of the polymer chains constituting the viscoelastic fluid.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09891v1"
    ],
    "publication_venue": null
}