{
    "arxiv_id": "2303.15989",
    "paper_title": "Continuous time crystal in an electron-nuclear spin system: stability and melting of periodic auto-oscillations",
    "authors": [
        "A. Greilich",
        "N. E. Kopteva",
        "A. N. Kamenskii",
        "P. S. Sokolov",
        "V. L. Korenev",
        "M. Bayer"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2024-02-29"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "cond-mat.other",
        "nlin.CD"
    ],
    "abstract": "Crystals spontaneously break the continuous translation symmetry in space, despite the invariance of the underlying energy function. This has triggered suggestions of time crystals analogously lifting translational invariance in time. Originally suggested for closed thermodynamic systems in equilibrium, no-go theorems prevent the existence of time crystals. Proposals for open systems out of equilibrium led to the observation of discrete time crystals subject to external periodic driving to which they respond with a sub-harmonic response. A continuous time crystal is an autonomous system that develops periodic auto-oscillations when exposed to a continuous, time-independent driving, as recently demonstrated for the density in an atomic Bose-Einstein condensate with a crystal lifetime of a few ms. Here we demonstrate an ultra-robust continuous time crystal in the nonlinear electron-nuclear spin system of a tailored semiconductor with a coherence time exceeding hours. Varying the experimental parameters reveals huge stability ranges of this time crystal, but allows one also to enter chaotic regimes, where aperiodic behavior appears corresponding to melting of the crystal. This novel phase of matter opens the possibility to study systems with nonlinear interactions in an unprecedented way.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15989v1"
    ],
    "publication_venue": "12 figures, 17 pages",
    "doi": "10.1038/s41567-023-02351-6"
}