{
    "arxiv_id": "2303.14400",
    "paper_title": "Reconfigurable Intelligent Surface-Aided Full-Duplex mmWave MIMO: Channel Estimation, Passive and Hybrid Beamforming",
    "authors": [
        "Songjie Yang",
        "Wanting Lyu",
        "Yunis Xanthos",
        "Zhongpei Zhang",
        "Chadi Assi",
        "Chau Yuen"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.IT",
        "eess.SP"
    ],
    "abstract": "Millimeter wave (mmWave) full-duplex (FD) is a promising technique for improving capacity by maximizing the utilization of both time and the rich mmWave frequency resources. Still, it has restrictions due to FD self-interference (SI) and mmWave's limited coverage. Therefore, this study dives into FD mmWave MIMO with the assistance of reconfigurable intelligent surfaces (RIS) for capacity improvement. First, we demonstrate the angular-domain reciprocity of FD antenna arrays under the far-field planar wavefront assumption. Accordingly, a strategy for joint downlink-uplink (DL-UL) channel estimation is presented. For estimating the SI channel, the direct channel, and the cascaded channel, the Khatri-Rao product-based compressive sensing (KR-CS), distributed CS (D-CS), and two-stage multiple measurement vector-based D-CS (M-D-CS) frameworks are proposed, respectively. Additionally, we propose a passive beamforming optimization solution based on the angular-domain cascaded channel. With hybrid beamforming architectures, a novel hybrid weighted minimum mean squared error method for SI cancellation (H-WMMSE-SIC) is proposed. Simulations have revealed that joint DL-UL processing significantly improves estimation performance in comparison to separate DL/UL channel estimation. Particularly, when the interference-to-noise ratio is less than 35 dB, our proposed H-WMMSE-SIC offers spectral efficiency performance comparable to fully-digital WMMSE-SIC. Finally, the computational complexity is analyzed for our proposed methods.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14400v1"
    ],
    "publication_venue": null
}