{
    "arxiv_id": "2303.14032",
    "paper_title": "Stability of the Modulator in a Plasma-Modulated Plasma Accelerator",
    "authors": [
        "Johannes J. van de Wetering",
        "Simon M. Hooker",
        "Roman Walczak"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-08-02"
    ],
    "latest_version": 1,
    "categories": [
        "physics.plasm-ph",
        "physics.acc-ph"
    ],
    "abstract": "We explore the regime of operation of the modulator stage of a recently proposed laser-plasma accelerator scheme [Phys. Rev. Lett. 127, 184801 (2021)], dubbed the Plasma-Modulated Plasma Accelerator (P-MoPA). The P-MoPA scheme offers a potential route to high-repetition-rate, GeV-scale plasma accelerators driven by picosecond-duration laser pulses from, for example, kilohertz thin-disk lasers. The first stage of the P-MoPA scheme is a plasma modulator in which a long, high-energy 'drive' pulse is spectrally modulated by co-propagating in a plasma channel with the low-amplitude plasma wave driven by a short, low-energy 'seed' pulse. The spectrally modulated drive pulse is converted to a train of short pulses, by introducing dispersion, which can resonantly drive a large wakefield in a subsequent accelerator stage with the same on-axis plasma density as the modulator. In this paper we derive the 3D analytic theory for the evolution of the drive pulse in the plasma modulator and show that the spectral modulation is independent of transverse coordinate, which is ideal for compression into a pulse train. We then identify a transverse mode instability (TMI), similar to the TMI observed in optical fiber lasers, which sets limits on the energy of the drive pulse for a given set of laser-plasma parameters. We compare this analytic theory with particle-in-cell (PIC) simulations and find that even higher energy drive pulses can be modulated than those demonstrated in the original proposal.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14032v1"
    ],
    "publication_venue": "8 pages, 5 figures plus supplementary materials",
    "doi": "10.1103/PhysRevE.108.015204"
}