{
    "arxiv_id": "2303.08337",
    "paper_title": "A mimetic finite difference based quasi-static magnetohydrodynamic solver for force-free plasmas in tokamak disruptions",
    "authors": [
        "Zakariae Jorti",
        "Qi Tang",
        "Konstantin Lipnikov",
        "Xian-Zhu Tang"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "physics.plasm-ph",
        "math.NA",
        "physics.comp-ph"
    ],
    "abstract": "Force-free plasmas are a good approximation where the plasma pressure is tiny compared with the magnetic pressure, which is the case during the cold vertical displacement event (VDE) of a major disruption in a tokamak. On time scales long compared with the transit time of Alfven waves, the evolution of a force-free plasma is most efficiently described by the quasi-static magnetohydrodynamic (MHD) model, which ignores the plasma inertia. Here we consider a regularized quasi-static MHD model for force-free plasmas in tokamak disruptions and propose a mimetic finite difference (MFD) algorithm. The full geometry of an ITER-like tokamak reactor is treated, with a blanket module region, a vacuum vessel region, and the plasma region. Specifically, we develop a parallel, fully implicit, and scalable MFD solver based on PETSc and its DMStag data structure for the discretization of the five-field quasi-static perpendicular plasma dynamics model on a 3D structured mesh. The MFD spatial discretization is coupled with a fully implicit DIRK scheme. The algorithm exactly preserves the divergence-free condition of the magnetic field under the resistive Ohm's law. The preconditioner employed is a four-level fieldsplit preconditioner, which is created by combining separate preconditioners for individual fields, that calls multigrid or direct solvers for sub-blocks or exact factorization on the separate fields. The numerical results confirm the divergence-free constraint is strongly satisfied and demonstrate the performance of the fieldsplit preconditioner and overall algorithm. The simulation of ITER VDE cases over the actual plasma current diffusion time is also presented.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08337v1"
    ],
    "publication_venue": "43 pages"
}