{
    "arxiv_id": "2303.09287",
    "paper_title": "Semitopology: a survey of a topological approach to distributed collaborative action",
    "authors": [
        "Murdoch Gabbay",
        "Giuliano Losa"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2024-05-30"
    ],
    "latest_version": 4,
    "categories": [
        "cs.LO",
        "cs.DC",
        "math.GN",
        "math.LO"
    ],
    "abstract": "We introduce semitopologies, a generalisation of point-set topology that removes the restriction that intersections of open sets need necessarily be open. The intuition is that points are participants in some distributed system, and an open set is a collection of participants that can collaborate to update their local state by taking a distributed collaborative action; we call this an actionable coalition. What constitutes an actionable coalition depends on what actions we want to model. Intuitive examples include 'a group of people that is collectively strong enough to lift a rock', where the state update is very simply 'holding rock low' to 'holding rock high' and this update is common to all participants in the actionable coalition. Or, consider 'two people wishing to barter a can of juice for a bar of chocolate', in which case the coalition is any such pair and the state updates differ between participants to flip them between 'has/has no juice' and 'has/has no chocolate'. A characteristic of these systems is that state updates are local to the coalition, voluntary, may vary between participants, and are not assumed subject to permission or synchronisation by a central authority. Peer-to-peer computer networks, including filesharing and blockchain systems, provide motivating examples from computing. This paper presents a mathematics that is inspired by these considerations. It is interesting in and of itself, much like point-set topology is; and it provides a conceptual framework within which to understand a useful class of distributed systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09287v1",
        "http://arxiv.org/pdf/2303.09287v2",
        "http://arxiv.org/pdf/2303.09287v3",
        "http://arxiv.org/pdf/2303.09287v4"
    ],
    "publication_venue": "See also arXiv:2310.00956, which takes a point-free algebraic approach (\"semiframes\"). This update updates the license to CC-BY 4.0"
}