{
    "arxiv_id": "2303.11878",
    "paper_title": "Direct confirmation of long-range magnetic order and evidence for multipoles in Ce$_{2}$O$_{3}$",
    "authors": [
        "Alexandra Cote",
        "J. Eddie Slimak",
        "Astha Sethi",
        "Dalmau Reig-i-Plessis",
        "Qiang Zhang",
        "Yang Zhao",
        "Devashibhai Adroja",
        "Gerald Morris",
        "Taras Kolodiazhnyi",
        "Alannah M. Hallas",
        "Jeffrey W. Lynn",
        "S. Lance Cooper",
        "Gregory J. MacDougall"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el"
    ],
    "abstract": "The sesquioxide, Ce$_{2}$O$_{3}$, has been a material of intense interest in recent years due to reports of an anomalous giant magnetodielectric effect and emergent mixed crystal field-phonon (vibronic) excitations below a putative antiferromagnetic transition at T$_{N}$ = 6.2 K. The claim of long-range magnetic order in this material is based on heat capacity and temperature-dependent susceptibility measurements; however, multiple neutron diffraction studies have been unable to distinguish any magnetic Bragg peaks. In this article, we present the results of a comprehensive investigation of the low-temperature phase in symmetry-broken polycrystalline Ce$_{2}$O$_{3}$ using a combination of magnetic susceptibility, heat capacity, neutron diffraction, triple-axis and time-of-flight (TOF) inelastic neutron scattering (INS), and muon spin rotation ($μ$SR). Our measurements and subsequent analysis confirm that the transition at T$_{N}$ can be associated with the ordering of moments on the Ce$^{3+}$ site. Both a spontaneous magnetic order observed with $μ$SR and a dispersive spin-wave spectrum observed with inelastic neutron scattering suggest a model wherein planar dipoles order antiferromagnetically. Notable inconsistencies between $μ$SR and neutron scattering data within the dipole picture provide strong evidence for the ordering of higher-order moments.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11878v1"
    ],
    "publication_venue": "12 pages, 8 figures"
}