{
    "arxiv_id": "2303.09376",
    "paper_title": "Detection of a high-velocity sodium feature on the ultra-hot Jupiter WASP-121 b",
    "authors": [
        "J. V. Seidel",
        "F. Borsa",
        "L. Pino",
        "D. Ehrenreich",
        "M. Stangret",
        "M. R. Zapatero Osorio",
        "E. Palle",
        "Y. Alibert",
        "R. Allart",
        "V. Bourrier",
        "P. Di Marcantonio",
        "P. Figueira",
        "J. I. Gonzalez Hernandez",
        "J. Lillo-Box",
        "C. Lovis",
        "C. J. A. P. Martins",
        "A. Mehner",
        "P. Molaro",
        "N. J. Nunes",
        "F. Pepe",
        "N. C. Santos",
        "A. Sozzetti"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
    ],
    "abstract": "Ultra-hot Jupiters, with their high equilibrium temperatures and resolved spectral lines, have emerged as a perfect testbed for new analysis techniques in the study of exoplanet atmospheres. In particular, the resolved sodium doublet as a resonant line has proven a powerful indicator to probe the atmospheric structure over a wide pressure range. We explore an atmospheric origin of the observed blueshifted feature next to the sodium doublet of the ultra-hot Jupiter WASP-121~b, using a partial transit obtained with the 4-UT mode of ESPRESSO. We study its atmospheric dynamics visible across the terminator by splitting the data into mid-transit and egress. We determine that the blueshifted high-velocity absorption component is generated only during the egress part of the transit when a larger fraction of the day side of the planet is visible. For the egress data, MERC retrieves the blueshifted high-velocity absorption component as an equatorial day-to-night side wind across the evening limb, with no zonal winds visible on the morning terminator with weak evidence compared to a model with only vertical winds. For the mid-transit data, the observed line broadening is attributed to a vertical, radial wind. We attribute the equatorial day-to-night side wind over the evening terminator to a localised jet and restrain its existence between the substellar point and up to $10^\\circ$ to the terminator in longitude, an opening angle of the jet of at most $60^\\circ$ in latitude, and a lower boundary in altitude between [1.08, 1.15] $R_p$. Due to the partial nature of the transit, we cannot make any statements on whether the jet is truly super-rotational and one-sided or part of a symmetric day-to-night side atmospheric wind from the hotspot.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09376v1"
    ],
    "publication_venue": "15 pages, 10 figures, 2 appendixes, accepted for publication in A&A on March 10th, 2023",
    "doi": "10.1051/0004-6361/202245800"
}