{
    "arxiv_id": "2303.08352",
    "paper_title": "Broken Symmetry Effects due to Polarization on Resonant Tunneling Transport in Double-Barrier Nitride Heterostructures",
    "authors": [
        "Jimy Encomendero",
        "Vladimir Protasenko",
        "Berardi Sensale-Rodriguez",
        "Patrick Fay",
        "Farhan Rana",
        "Debdeep Jena",
        "Huili Grace Xing"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "The phenomenon of resonant tunneling transport through polar double-barrier heterostructures is systematically investigated using a combined experimental and theoretical approach. On the experimental side, GaN/AlN RTDs are grown by MBE. In-situ electron diffraction is employed to monitor the number of monolayers incorporated into each tunneling barrier. Using this precise epitaxial control at the monolayer level, we demonstrate exponential modulation of the resonant tunneling current as a function of barrier thickness. Both the peak voltage and characteristic threshold bias exhibit a dependence on barrier thickness as a result of the intense electric fields present in the polar heterostructures. To get further insight into the asymmetric tunneling injection, we present an analytical theory for tunneling transport across polar heterostructures. A general expression for the resonant tunneling current with contributions from coherent and sequential tunneling processes is introduced. After applying this theory to the case of GaN/AlN RTDs, their experimental current-voltage characteristics are reproduced over both bias polarities, with tunneling currents spanning several orders of magnitude. This agreement allows us to elucidate the role played by the internal polarization fields on the magnitude of the tunneling current and broadening of the resonant line shape. Under reverse bias, we identify new tunneling features originating from highly attenuated resonant tunneling phenomena, which are completely captured by our model. Our analytical model, provides a simple expression which reveals the connection between the polar RTD design parameters and its current-voltage characteristics. This new theory paves the way for the design of polar resonant tunneling devices exhibiting efficient resonant current injection and enhanced tunneling dynamics, as required in various practical applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08352v1"
    ],
    "publication_venue": "13 pages, 3 figures",
    "doi": "10.1103/PhysRevApplied.11.034032"
}