{
    "arxiv_id": "2303.11413",
    "paper_title": "Structural Vibration Signal Denoising Using Stacking Ensemble of Hybrid CNN-RNN",
    "authors": [
        "Youzhi Liang",
        "Wen Liang",
        "Jianguo Jia"
    ],
    "submission_date": "2023-03-11",
    "revised_dates": [
        "2023-04-14"
    ],
    "latest_version": 3,
    "categories": [
        "eess.SP",
        "cs.AI",
        "cs.LG"
    ],
    "abstract": "Vibration signals have been increasingly utilized in various engineering fields for analysis and monitoring purposes, including structural health monitoring, fault diagnosis and damage detection, where vibration signals can provide valuable information about the condition and integrity of structures. In recent years, there has been a growing trend towards the use of vibration signals in the field of bioengineering. Activity-induced structural vibrations, particularly footstep-induced signals, are useful for analyzing the movement of biological systems such as the human body and animals, providing valuable information regarding an individual's gait, body mass, and posture, making them an attractive tool for health monitoring, security, and human-computer interaction. However, the presence of various types of noise can compromise the accuracy of footstep-induced signal analysis. In this paper, we propose a novel ensemble model that leverages both the ensemble of multiple signals and of recurrent and convolutional neural network predictions. The proposed model consists of three stages: preprocessing, hybrid modeling, and ensemble. In the preprocessing stage, features are extracted using the Fast Fourier Transform and wavelet transform to capture the underlying physics-governed dynamics of the system and extract spatial and temporal features. In the hybrid modeling stage, a bi-directional LSTM is used to denoise the noisy signal concatenated with FFT results, and a CNN is used to obtain a condensed feature representation of the signal. In the ensemble stage, three layers of a fully-connected neural network are used to produce the final denoised signal. The proposed model addresses the challenges associated with structural vibration signals, which outperforms the prevailing algorithms for a wide range of noise levels, evaluated using PSNR, SNR, and WMAPE.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11413v1",
        "http://arxiv.org/pdf/2303.11413v2",
        "http://arxiv.org/pdf/2303.11413v3"
    ],
    "publication_venue": "10 pages, 4 figures"
}