{
    "arxiv_id": "2303.12250",
    "paper_title": "Breakdown of Boltzmann-type Models for Nematic Alignment of Self-propelled Rods",
    "authors": [
        "Patrick Murphy",
        "Misha Perepelitsa",
        "Ilya Timofeyev",
        "Matan Lieber-Kotz",
        "Brandon Islas",
        "Oleg A. Igoshin"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-04-27"
    ],
    "latest_version": 2,
    "categories": [
        "physics.bio-ph"
    ],
    "abstract": "Studies in active matter systems and in the collective motility of organisms utilize a range of analytical approaches to formulate continuous kinetic models of collective dynamics from the rules or equations describing agent interactions. However, the derivation of these models often relies on Boltzmann's hypothesis of \"molecular chaos\", often simply called statistical independence. While it is often the simplest way to derive tractable models it is not clear whether the statistical independence assumption is valid in practice. In this work, we develop a Boltzmann-type kinetic model for the nematic alignment of self-propelled rods where rod reorientation occurs upon binary collisions. We identify relevant parameters and derive kinetic equations for the corresponding asymptotic regime. By comparing numerical solutions of the kinetic equations to an agent-based model that implements our microscopic alignment rules, we examine the accuracy of the continuous model. The results indicate that our kinetic model fails to replicate the underlying dynamics due to the formation of clusters that violate statistical independence. Additionally, we show that a mechanism limiting cluster formation helps to improve the agreement between the analytical model and agent simulations. These results highlight the need to improve modeling approaches for active matter systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12250v1",
        "http://arxiv.org/pdf/2303.12250v2"
    ],
    "publication_venue": null
}