{
    "arxiv_id": "2303.17443",
    "paper_title": "A Bright First Day for Tidal Disruption Event",
    "authors": [
        "Xiaoshan Huang",
        "Shane W. Davis",
        "Yan-fei Jiang"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Stream-stream collision may be an important pre-peak energy dissipation mechanism in tidal disruption events (TDEs). We perform local three-dimensional radiation hydrodynamic simulations in a wedge geometry including the gravity to study stream self-crossing, with emphasis on resolving the collision and following the subsequent outflow. We find that the collision can contribute to pre-peak optical emissions by converting $\\gtrsim5\\%$ of stream kinetic energy to radiation, yielding prompt emission of $\\sim10^{42-44}\\rm erg~s^{-1}$. The radiative efficiency is sensitive to stream mass fallback rates, and strongly depends on the downstream gas optical depth. Even for a sub-Eddington ($10\\%$) mass fallback rate, the strong radiation pressure produced in the collision can form a local super-Eddington region near the collision site, where a fast, aspherical outflow is launched. Higher mass fallback rate usually leads to more optically-thick outflow and lower net radiative efficiency. For $\\dot{M}\\gtrsim0.1\\dot{M}_{\\rm Edd}$, the estimated photosphere size of the outflow can expand by one to two orders of magnitudes reaching $\\sim10^{14}\\rm cm$. The average gas temperature at this photospheric surface is a few $\\times10^{4}$K, roughly consistent with inferred pre-peak photosphere properties for some optical TDEs. We find that the dynamics is sensitive to collision angle and collision radius, but the radiative efficiency or outflow properties show more complex dependency than is often assumed in ballistic models.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17443v1"
    ],
    "publication_venue": "18 pages, 18 figures, Submitted to ApJ. Comments are welcomed and appreciated!"
}