{
    "arxiv_id": "2303.12275",
    "paper_title": "Physical conditions for dust grain alignment in Class 0 protostellar cores II. The role of the radiation field in models aligning/disrupting dust grains",
    "authors": [
        "Valentin J. M. Le Gouellec",
        "Anaëlle J. Maury",
        "Charles L. H. Hull",
        "Antoine Verliat",
        "Patrick Hennebelle",
        "Valeska Valdivia"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-07-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "The polarized dust emission observed in Class 0 protostellar cores at high angular resolution with ALMA has raised several concerns about the grain alignment conditions in these regions. We aim to study the role of the radiation field on the grain alignment mechanisms occurring in the interior (<1000 au) of Class 0 protostars. We produce synthetic observations of the polarized dust emission from a MHD model of protostellar formation, using the POLARIS dust radiative transfer tool, which includes dust alignment with Radiative Torques Alignment (RATs). We test how the polarized dust emission from the model core depends on the irradiation conditions in the protostellar envelope, by varying the radiation due to accretion luminosity propagating from the central protostellar embryo throughout the envelope. The level of grain alignment efficiency obtained in the radiative transfer models is then compared to (sub-) millimeter ALMA dust polarization observations of Class 0 protostars. Our radiative transfer calculations have a central irradiation that reproduces the protostellar luminosities typically observed towards low- to intermediate-mass protostars, as well as super-paramagnetic grains, and grains >10 micron, which are required to bring the dust grain alignment efficiencies of the synthetic observations up to observed levels. Our radiative transfer calculations show that irradiation plays an important role in the mechanisms that dictate the size range of aligned grains in Class 0 protostars. Regions of the envelope that are preferentially irradiated harbor strong polarized dust emission but can be affected by the rotational disruption of dust grains. Episodes of high luminosity could affect grain alignment and trigger grain disruption mechanisms. [abridged]",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12275v1"
    ],
    "publication_venue": null,
    "doi": "10.1051/0004-6361/202245346"
}