{
    "arxiv_id": "2303.14002",
    "paper_title": "Operational Quantum Reference Frame Transformations",
    "authors": [
        "Titouan Carette",
        "Jan Głowacki",
        "Leon Loveridge"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2024-08-27"
    ],
    "latest_version": 3,
    "categories": [
        "quant-ph",
        "math-ph"
    ],
    "abstract": "Quantum reference frames are needed in quantum theory for much the same reasons that reference frames are in classical theories: to manifest invariance in line with fundamental relativity principles and to provide a basis for the definition of observable quantities. Though around since the 1960s, and used in a wide range of applications, only recently has the means for transforming descriptions between different quantum reference frames been tackled in detail. In this work, we provide a general, operationally motivated framework for quantum reference frames and their transformations, holding for locally compact groups. The work is built around the notion of operational equivalence, in which quantum states that cannot be physically distinguished are identified. For example, we describe the collection of relative observables as a subspace of the algebra of invariants on the composite of system and frame, and from here the set of relative states is constructed through the identification of states which cannot be distinguished by relative observables. Through the notion of framed observables -- the formation of joint observables of system and frame -- of which the relative observables can be understood as examples, quantum reference frame transformations are then maps between equivalence classes of relative states which respect the framing. We give an explicit realisation in the setting that the initial frame admits a highly localized state with respect to the frame observable. The transformations are invertible exactly when the final frame also has such a localizability property. The procedure we present is in operational agreement with other recent inequivalent constructions on the domain of common applicability, but extends them in a number of ways, and weakens claims of entanglement generation through frame changes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14002v1",
        "http://arxiv.org/pdf/2303.14002v2",
        "http://arxiv.org/pdf/2303.14002v3"
    ],
    "publication_venue": null
}