{
    "arxiv_id": "2303.11222",
    "paper_title": "Widespread Hot Ammonia in the Central Kiloparsec of the Milky Way",
    "authors": [
        "Tierra M. Candelaria",
        "E. A. C Mills",
        "David S. Meier",
        "Juergen Ott",
        "Natalie Butterfield"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
    ],
    "abstract": "The inner 300-500 pc of the Milky Way has some of the most extreme gas conditions in our Galaxy. Physical properties of the Central Molecular Zone (CMZ), including temperature, density, thermal pressure, and turbulent pressure, are key factors for characterizing gas energetics, kinematics, and evolution. The molecular gas in this region is more than an order of magnitude hotter than gas in the Galactic disk, but the mechanism responsible for heating the gas remains uncertain. We characterize the temperature for 16 regions, extending out to a projected radius of $\\sim$450 pc. We observe \\am\\, J,K=(1,1)-(6,6) inversion transitions from SWAG (Survey of Water and Ammonia in the Galactic Center) using the Australia Telescope Compact Array (ATCA), and ammonia lines (J,K) = (8,8)-(14,14) using the 100\\,m Green Bank Telescope. Using these two samples we create full Boltzmann plots for every source and fit two rotational temperature components to the data. For the cool component we detect rotational temperatures ranging from 20-80\\,K, and for the hot component we detect temperature ranging from 210-580\\,K. With this sample of 16 regions, we identify some of the most extreme molecular gas temperatures detected in the Galactic center thus far. We do not find a correlation between gas temperature and Galactocentric radius, and we confirm that these high temperatures are not exclusively associated with actively star-forming clouds. We also investigate temperature and line widths and find (1) no correlation between temperature and line width and (2) the lines are non-thermally broadened indicating that non-thermal motions are dominant over thermal.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11222v1"
    ],
    "publication_venue": "39 pages, 42 figures, 7 tables"
}