{
    "arxiv_id": "2303.12460",
    "paper_title": "Multi-Task Diffusion Incentive Design for Mobile Crowdsourcing in Social Networks",
    "authors": [
        "Jianxiong Guo",
        "Qiufen Ni",
        "Weili Wu",
        "Ding-Zhu Du"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-09-01"
    ],
    "latest_version": 1,
    "categories": [
        "cs.SI",
        "cs.GT"
    ],
    "abstract": "Mobile Crowdsourcing (MCS) is a novel distributed computing paradigm that recruits skilled workers to perform location-dependent tasks. A number of mature incentive mechanisms have been proposed to address the worker recruitment problem in MCS systems. However, they all assume that there is a large enough worker pool and a sufficient number of users can be selected. This may be impossible in large-scale crowdsourcing environments. To address this challenge, we consider the MCS system defined on a location-aware social network provided by a social platform. In this system, we can recruit a small number of seed workers from the existing worker pool to spread the information of multiple tasks in the social network, thus attracting more users to perform tasks. In this paper, we propose a Multi-Task Diffusion Maximization (MT-DM) problem that aims to maximize the total utility of performing multiple crowdsourcing tasks under the budget. To accommodate multiple tasks diffusion over a social network, we create a multi-task diffusion model, and based on this model, we design an auction-based incentive mechanism, MT-DM-L. To deal with the high complexity of computing the multi-task diffusion, we adopt Multi-Task Reverse Reachable (MT-RR) sets to approximate the utility of information diffusion efficiently. Through both complete theoretical analysis and extensive simulations by using real-world datasets, we validate that our estimation for the spread of multi-task diffusion is accurate and the proposed mechanism achieves individual rationality, truthfulness, computational efficiency, and $(1-1/\\sqrt{e}-\\varepsilon)$ approximation with at least $1-δ$ probability.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12460v1"
    ],
    "publication_venue": "14 pages",
    "doi": "10.1109/TMC.2023.3310383"
}