{
    "arxiv_id": "2303.10703",
    "paper_title": "CCTV-Gun: Benchmarking Handgun Detection in CCTV Images",
    "authors": [
        "Srikar Yellapragada",
        "Zhenghong Li",
        "Kevin Bhadresh Doshi",
        "Purva Makarand Mhasakar",
        "Heng Fan",
        "Jie Wei",
        "Erik Blasch",
        "Haibin Ling"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-04-04"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Gun violence is a critical security problem, and it is imperative for the computer vision community to develop effective gun detection algorithms for real-world scenarios, particularly in Closed Circuit Television (CCTV) surveillance data. Despite significant progress in visual object detection, detecting guns in real-world CCTV images remains a challenging and under-explored task. Firearms, especially handguns, are typically very small in size, non-salient in appearance, and often severely occluded or indistinguishable from other small objects. Additionally, the lack of principled benchmarks and difficulty collecting relevant datasets further hinder algorithmic development. In this paper, we present a meticulously crafted and annotated benchmark, called \\textbf{CCTV-Gun}, which addresses the challenges of detecting handguns in real-world CCTV images. Our contribution is three-fold. Firstly, we carefully select and analyze real-world CCTV images from three datasets, manually annotate handguns and their holders, and assign each image with relevant challenge factors such as blur and occlusion. Secondly, we propose a new cross-dataset evaluation protocol in addition to the standard intra-dataset protocol, which is vital for gun detection in practical settings. Finally, we comprehensively evaluate both classical and state-of-the-art object detection algorithms, providing an in-depth analysis of their generalizing abilities. The benchmark will facilitate further research and development on this topic and ultimately enhance security. Code, annotations, and trained models are available at https://github.com/srikarym/CCTV-Gun.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10703v1",
        "http://arxiv.org/pdf/2303.10703v2"
    ],
    "publication_venue": null
}