{
    "arxiv_id": "2303.09819",
    "paper_title": "Muon radiography experiments on the subway overburden structure detection",
    "authors": [
        "Xin Mao",
        "Zhiwei Li",
        "Shuning Dong",
        "Jingtai Li",
        "Jianming Zhang",
        "Jie Pang",
        "Yaping Cheng",
        "Bin Liao",
        "Xiaoping Ouyang",
        "Ran Han"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-07-19"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ins-det",
        "physics.app-ph"
    ],
    "abstract": "Muon radiography is an innovative and non-destructive technique for internal density structure imaging, based on measuring the attenuation of cosmic-ray muons after they penetrate the target. Due to the strong penetration ability of muons, the detection range of muon radiography can reach the order of hundreds of meters or even kilometers. Using a portable muon detector composed of plastic scintillators and silicon photomultipliers, we performed a short-duration(1h) flux scanning experiment of the overburden above the platform and tunnel of the Xiaoying West Road subway station under construction. With the observation direction facing up, the detector is placed on the north side of the track and moved eastward from the platform section inside the station to the tunnel section. The scanning length is 264m and a total of 21 locations are observed. By comparing the observed and predicted values of the muon survival ratio at different locations, the experiment accurately detects the jump in thickness at the interface of the platform section and tunnel section. Furthermore, unknown anomalies caused by random placed light brick piles and side passage mouth above the observation locations are detected and confirmed later. This experiment verifies the feasibility of using natural muons to quickly detect abnormal structures of the overburden of tunnel, and shows that muon radiography has broad application prospects in tunnel safety and other similar aspects.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09819v1"
    ],
    "publication_venue": "30 pages, 10 figures",
    "doi": "10.1016/j.nima.2023.168391"
}