{
    "arxiv_id": "2303.13698",
    "paper_title": "Acceleration of 1I/`Oumuamua from radiolytically produced H$_2$ in H$_2$O ice",
    "authors": [
        "Jennifer Bergner",
        "Darryl Seligman"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-08-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "In 2017, 1I/`Oumuamua was identified as the first known interstellar object in the Solar System. Although typical cometary activity tracers were not detected, `Oumuamua exhibited a significant non-gravitational acceleration. To date there is no explanation that can reconcile these constraints. Due to energetic considerations, outgassing of hyper-volatile molecules is favored over heavier volatiles like H$_2$O and CO$_2$. However, there are are theoretical and/or observational inconsistencies with existing models invoking the sublimation of pure H$_2$, N$_2$, and CO. Non-outgassing explanations require fine-tuned formation mechanisms and/or unrealistic progenitor production rates. Here we report that the acceleration of `Oumuamua is due to the release of entrapped molecular hydrogen which formed through energetic processing of an H$_2$O-rich icy body. In this model, `Oumuamua began as an icy planetesimal that was irradiated at low temperatures by cosmic rays during its interstellar journey, and experienced warming during its passage through the Solar System. This explanation is supported by a large body of experimental work showing that H$_2$ is efficiently and generically produced from H$_2$O ice processing, and that the entrapped H$_2$ is released over a broad range of temperatures during annealing of the amorphous water matrix. We show that this mechanism can explain many of `Oumuamua's peculiar properties without fine-tuning. This provides further support that `Oumuamua originated as a planetesimal relic broadly similar to Solar System comets.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13698v1"
    ],
    "publication_venue": "Author's version; 23 pages, 3 figures",
    "doi": "10.1038/s41586-022-05687-w"
}