{
    "arxiv_id": "2303.17187",
    "paper_title": "Efficient variational quantum circuit structure for correlated topological phases",
    "authors": [
        "Rong-Yang Sun",
        "Tomonori Shirakawa",
        "Seiji Yunoki"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "cond-mat.stat-mech",
        "cond-mat.str-el"
    ],
    "abstract": "We propose an efficient circuit structure of variational quantum circuit \\textit{Ansätze} used for the variational quantum eigensolver (VQE) algorithm in calculating gapped topological phases on the currently feasible noisy intermediate-scale quantum computers. An efficient circuit \\textit{Ansatz} should include two layers: the initialization layer and the variational layer. In the initialization layer, a fixed depth circuit state with a compatible entanglement structure to the target topological phase is constructed. The circuit state is further adjusted subsequently to capture the details of the local correlations, which is dictated with the Hamiltonian, in the parametrized variational layer. Based on this strategy, we design a circuit \\textit{Ansatz} to investigate the symmetry-protected topological Haldane phase in a \\textit{non-exactly} solvable alternating spin-$1/2$ Heisenberg chain by VQE calculations. Main characterizations of the Haldane phase, including the long-ranged string order, the four-fold nearly degenerate ground states associated with four different localized edge mode patterns for the system with open boundaries, and the two-fold degeneracy of the entanglement spectrum, are all observed for the optimized shallow circuit state with only one depth variational layer both in numerical simulations and on real quantum computers. We further demonstrate that the computational capacity (i.e., expressibility) of this quantum circuit \\textit{Ansatz} is determined not by the system size but only by the intrinsic correlation length of the system, thus implying that the scalable VQE calculation is possible.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17187v1"
    ],
    "publication_venue": "15 pages, 14 figures"
}