{
    "arxiv_id": "2303.14849",
    "paper_title": "Thermal emission from the Earth-sized exoplanet TRAPPIST-1 b using JWST",
    "authors": [
        "Thomas P. Greene",
        "Taylor J. Bell",
        "Elsa Ducrot",
        "Achrène Dyrek",
        "Pierre-Olivier Lagage",
        "Jonathan J. Fortney"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "The TRAPPIST-1 system is remarkable for its seven planets that are similar in size, mass, density, and stellar heating to the rocky planets Venus, Earth, and Mars in our own Solar System (Gillon et al. 2017). All TRAPPIST-1 planets have been observed with the transmission spectroscopy technique using the Hubble or Spitzer Space Telescopes, but no atmospheric features have been detected or strongly constrained (Ducrot et al. 2018; de Wit et al. 2018; Zhang et al. 2018; Garcia et al. 2022). TRAPPIST-1 b is the closest planet to the system's M dwarf star, and it receives 4 times as much irradiation as Earth receives from the Sun. This relatively large amount of stellar heating suggests that its thermal emission may be measurable. Here we present photometric secondary eclipse observations of the Earth-sized TRAPPIST-1 b exoplanet using the F1500W filter of the MIRI instrument on JWST. We detect the secondary eclipse in each of five separate observations with 8.7-sigma confidence when all data are combined. These measurements are most consistent with the re-radiation of the TRAPPIST-1 star's incident flux from only the dayside hemisphere of the planet. The most straightforward interpretation is that there is little or no planetary atmosphere redistributing radiation from the host star and also no detectable atmospheric absorption from carbon dioxide (CO$_2$) or other species.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14849v1"
    ],
    "publication_venue": "Submitted to Nature"
}