{
    "arxiv_id": "2303.11252",
    "paper_title": "Electroweak baryogenesis via top-charm mixing",
    "authors": [
        "Shinya Kanemura",
        "Yushi Mura"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph"
    ],
    "abstract": "We investigate a scenario of electroweak baryogenesis in the two Higgs doublet model with quark flavor mixing. In general, off-diagonal components of quark Yukawa interactions with additional Higgs bosons are strongly constrained by the data for flavor changing neutral currents. However, top-charm quark mixing is not the case, so that a large off-diagonal element can be taken, which can contribute to generating baryon asymmetry of the universe. It turns out that CP violating phases of the off-diagonal element in the source term in the Boltzmann equation are eliminated by the rephasing. This result is somewhat different from previous works on electroweak baryogenesis by flavor off-diagonal Yukawa couplings. Instead, we find that the absolute value of the top-charm off-diagonal element enhances CP violating phases in the Higgs potential, by which sufficient amount of the baryon number can be generated to explain the observed baryon asymmetry of the universe. We find that such a scenario is viable under the current experimental data. The model can be tested by the current and future measurements of various flavor experiments like Kaon rare decays, in addition to high energy collider experiments as well as gravitational wave observations. Characteristic predictions of our model would be deviations in Kaon rare decays. Branching ratios of $K^+ \\to π^+ ν\\overlineν$ and $K_L \\to π^0 ν\\overlineν$ can deviate by the order of 10% and 1%, respectively, which may be tested at future Kaon experiments such as NA62 and KOTO step-2.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11252v1"
    ],
    "publication_venue": "26 pages, 4 figures"
}