{
    "arxiv_id": "2303.11051",
    "paper_title": "Additive manufacturing and performance of bioceramic scaffolds with different hollow strut geometries",
    "authors": [
        "Shumin Pang",
        "Dongwei Wu",
        "Aleksander Gurlo",
        "Jens Kurreck",
        "Dorian A H Hanaor"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.app-ph",
        "physics.bio-ph",
        "physics.med-ph"
    ],
    "abstract": "Additively manufactured hollow strut bioceramic scaffolds present a promising strategy towards enhanced performance in patient-tailored bone tissue engineering. The channels in such scaffolds offer pathways for nutrient and cell transport and facilitate effective osseointegration and vascularization. In this study, we report an approach for the slurry based additive manufacturing of modified diopside bioceramics that enables the production of hollow-strut scaffolds with diverse cross-sectional forms, distinguished by different configurations of channel and strut geometries. The prepared scaffolds exhibit levels of porosity and mechanical strength that are well suited for osteoporotic bone repair. Mechanical characterization in orthogonal orientations revealed that a square outer cross-section for hollow struts in woodpile scaffolds gives rise to levels of compressive strength that are higher than those of conventional solid cylindrical strut scaffolds despite a significantly lower density. Finite element analysis confirms that this improved strength arises from lower stress concentration in such geometries. It was shown that hollow struts in bioceramic scaffolds dramatically increase cell attachment and proliferation, potentially promoting new bone tissue formation within the scaffold channel. This work provides an easily controlled method for the extrusion-based 3D printing of hollow strut scaffolds. We show here how the production of hollow struts with controllable geometry can serve to enhance both the functional and mechanical performance of porous structures, with particular relevance for bone tissue engineering scaffolds.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11051v1"
    ],
    "publication_venue": null,
    "doi": "10.1088/1758-5090/acb387"
}