{
    "arxiv_id": "2303.16225",
    "paper_title": "Deciphering Lyman-$α$ Emission Deep into the Epoch of Reionisation",
    "authors": [
        "Callum Witten",
        "Nicolas Laporte",
        "Sergio Martin-Alvarez",
        "Debora Sijacki",
        "Yuxuan Yuan",
        "Martin G. Haehnelt",
        "William Baker",
        "James S. Dunlop",
        "Richard S. Ellis",
        "Norman Grogin",
        "Garth Illingworth",
        "Harley Katz",
        "Anton M. Koekemoer",
        "Daniel Magee",
        "Roberto Maiolino",
        "William McClymont",
        "Pablo G. Pérez-González",
        "David Puskas",
        "Guido Roberts-Borsani",
        "Paola Santini",
        "Charlotte Simmonds"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "A major event in cosmic history is the genesis of the first starlight in our Universe, ending the ''Dark Ages''. During this epoch, the earliest luminous sources were enshrouded in neutral and pristine gas, which was gradually ionised in a process called ''reionisation''. Hence, one of the brightest emission lines in star-forming galaxies, Lyman-$α$ (Ly-$α$), was predicted to emerge only towards the end of the epoch of reionisation, about one billion years after the Big Bang. However, this picture has been challenged over the past decade by the surprising detection of Ly-$α$ in galaxies less than 500 million years old. Here we show, by taking advantage of both high-resolution and high-sensitivity images from the James Webb Space Telescope programs PRIMER, CEERS and FRESCO, that all galaxies in our sample of Ly-$α$ emitters deep in the epoch of reionisation have close companions. To understand the physical processes that lead to the observed Ly-$α$ emission in our sample, we take advantage of novel on-the-fly radiative transfer magnetohydrodynamical simulations with cosmic ray feedback. We find that in the early Universe, the rapid build up of mass through frequent galactic mergers leads to very bursty star formation which in turn drives episodes of high intrinsic Ly-$α$ emission and facilitates the escape of Ly-$α$ photons along channels cleared of neutral gas. These merging galaxies reside in clustered environments thus creating sufficiently large ionised bubbles. This presents a solution to the long-standing puzzle of the detection of Ly-$α$ emission deep into the epoch of reionisation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16225v1"
    ],
    "publication_venue": "Submitted to Nature. 38 pages, 9 figures, 2 tables"
}