{
    "arxiv_id": "2303.17831",
    "paper_title": "Impact of extended long-range electrostatics on the correlation of liquid-liquid equilibria in aqueous ionic liquid systems",
    "authors": [
        "Hugo Marques",
        "Andrés González de Castilla",
        "Simon Müller",
        "Irina Smirnova"
    ],
    "submission_date": "2023-03-31",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft",
        "cond-mat.stat-mech",
        "physics.chem-ph",
        "physics.comp-ph"
    ],
    "abstract": "Recently an improved long-range model for electrolyte solutions was developed that is applicable from infinite dilution to pure salt. This paper tests this claim for the first time applying it to the calculation of liquid-liquid equilibria for mixtures of different ionic liquids (ILs) and water. The conventional Pitzer-Debye-Hückel (PDH) equation is compared to two of its new, thermodynamically consistent extensions. Both development stages, the extended PDH term and the modified-extended PDH, account for concentration dependent mixture properties instead of using solvent properties. The latter one additionally introduces a modified parameter of closest approach which improves the overall performance of the model for high electrolyte concentrations in systems with variable or low permittivities. To account for the short-range interactions, these long-range models are coupled with the UNIversal QUAsi-Chemical (UNIQUAC) model. Three modeling strategies were tested for the short-range contribution. First, the UNIQUAC parameters were adjusted to each system individually, then the binary interaction parameters were the same for each binary interaction type for all the systems and lastly a linear function of the carbon number was used where possible. For all systems and all modeling strategies tested, the predictive performance increased from PDH to E-PDH and then to ME-PDH. Overall, an introduction of concentration dependent properties and the modification added to ME-PDH enhanced modeling performance when describing these systems, showing the general applicability of this novel longrange term.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17831v1"
    ],
    "publication_venue": null,
    "doi": "10.1016/j.fluid.2023.113765"
}