{
    "arxiv_id": "2303.12567",
    "paper_title": "Self-Aware Transport of Economic Agents",
    "authors": [
        "Andrew Lyasoff"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2024-08-15"
    ],
    "latest_version": 10,
    "categories": [
        "econ.GN",
        "math.OC"
    ],
    "abstract": "The paper is concerned with the simultaneous solution of a very large number of optimization problems the structure of which is not given in the outset and is dynamically agreed upon while a large number of optimizers work in an orchestra. The proposed new approach to such problems was prompted by the surprising discovery that the common strategy, adopted in a large body of research, for producing time-invariant equilibrium in the classical Aiyagari-Bewley-Huggett model fails to achieve its objective in a widely cited benchmark study, with the implication that a central problem in macroeconomics has been without an adequate solution, and despite recent advances based on novel mathematical techniques borrowed from the theory of mean field games. It is shown that the intrinsic structure of a generic heterogeneous agent incomplete market model imposes connections across time that existing mathematical frameworks cannot capture. The new technique is shown to provide numerically verifiable equilibria in some widely researched, yet still unsolved, concrete instances of heterogeneous agent models. The scope of \"the approximate aggregation conjecture\" of Krusell and Smith (still an open problem in macroeconomics) is clarified and a new computational strategy, which does not rely on simulation or the need to postulate infinite time horizon, for models with common shocks is developed. New insights about the fluctuations in the population distribution in such models are drawn and some novel closed-form expressions are obtained.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12567v1",
        "http://arxiv.org/pdf/2303.12567v2",
        "http://arxiv.org/pdf/2303.12567v3",
        "http://arxiv.org/pdf/2303.12567v4",
        "http://arxiv.org/pdf/2303.12567v5",
        "http://arxiv.org/pdf/2303.12567v6",
        "http://arxiv.org/pdf/2303.12567v7",
        "http://arxiv.org/pdf/2303.12567v8",
        "http://arxiv.org/pdf/2303.12567v9",
        "http://arxiv.org/pdf/2303.12567v10"
    ],
    "publication_venue": "53 pages, 16 figures"
}