{
    "arxiv_id": "2303.17473",
    "paper_title": "A hard look at the X-ray spectral variability of NGC 7582",
    "authors": [
        "Mehdy Lefkir",
        "Elias Kammoun",
        "Didier Barret",
        "Peter Boorman",
        "Gabriele Matzeu",
        "Jon M. Miller",
        "Emanuele Nardini",
        "Abderahmen Zoghbi"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
    ],
    "abstract": "NGC 7582 (z = 0.005264; D = 22.5 Mpc) is a highly variable, changing-look AGN. In this work, we explore the X-ray properties of this source using XMM-Newton and NuSTAR archival observations in the 3-40 keV range, from 2001 to 2016. NGC 7582 exhibits a long-term variability between observations but also a short-term variability in two observations that has not been studied before. To study the variability, we perform a time-resolved spectral analysis using a phenomenological model and a physically-motivated model (uxclumpy). The spectral fitting is achieved using a nested sampling Monte Carlo method. uxclumpy enables testing various geometries of the absorber that may fit AGN spectra. We find that the best model is composed of a fully covering clumpy absorber. From this geometry, we estimate the velocity, size and distance of the clumps. The column density of the absorber in the line of sight varies from Compton-thin to Compton-thick between observations. Variability over the timescale of a few tens of kilo-seconds is also observed within two observations. The obscuring clouds are consistent with being located at a distance not larger than 0.6 pc, moving with a transverse velocity exceeding $\\sim 700$ km s$^{-1}$. We could put only a lower limit on the size of the obscuring cloud being larger than $10^{13}$ cm. Given the sparsity of the observations, and the limited exposure time per observation available, we cannot determine the exact structure of the obscuring clouds. The results are broadly consistent with comet-like obscuring clouds or spherical clouds with a non-uniform density profile.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17473v1"
    ],
    "publication_venue": "14 pages, 12 figures, accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad995"
}