{
    "arxiv_id": "2303.10810",
    "paper_title": "Scaling anisotropy with stationary background field in the near-Sun solar wind turbulence",
    "authors": [
        "Honghong Wu",
        "Jiansen He",
        "Shiyong Huang",
        "Liping Yang",
        "Xin Wang",
        "Zhigang Yuan"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-04-26"
    ],
    "latest_version": 1,
    "categories": [
        "physics.space-ph",
        "astro-ph.SR",
        "physics.plasm-ph"
    ],
    "abstract": "The scaling of magnetic fluctuations provides crucial information for the understanding of solar wind turbulence. However, the observed magnetic fluctuations contain not only turbulence but also magnetic structures, leading to the violation of the time stationarity. This violation would conceal the true scaling and influence the determination of the sampling angle with respect to the local background magnetic field. Here, to investigate the scaling anisotropy, we utilize an easy but effective criterion $φ<10^\\circ$ to ensure the time stationarity of the magnetic field, where $φ$ is the angle between the two averaged magnetic fields after cutting the interval into two halves. We study the scaling anisotropy using higher-order statistics of structure functions under the condition of stationarity for the near-Sun solar wind turbulence for the first time based on measurements obtained from Parker Solar Probe (PSP) at 0.17 au. We find that the scaling indices $ξ$ of magnetic field show a linear dependence on the order $p$ close to $ξ(p)=p/4$. The multifractal scaling of magnetic-trace structure functions becomes monoscaling close to $ξ(p)=p/3$ with the local magnetic field perpendicular to the sampling direction and close to $ξ(p)=p/4$ with the local magnetic field parallel to the sampling direction when measured with the stationary background magnetic field. The scaling of velocity-trace structure functions has similar but less significant changes. The near-Sun solar wind turbulence displays different scaling anisotropies with the near-Earth solar wind turbulence, suggesting the evolution of the nonlinear interaction process during the solar wind expansion.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10810v1"
    ],
    "publication_venue": "15 pages, 5 figures, accepted by ApJ",
    "doi": "10.3847/1538-4357/acc45d"
}