{
    "arxiv_id": "2303.14028",
    "paper_title": "Non-invasive urinary bladder volume estimation with artefact-suppressed bio-impedance measurements",
    "authors": [
        "Kanika Dheman",
        "Stefan Walser",
        "Philipp Mayer",
        "Manuel Eggimann",
        "Marko Kozomara",
        "Denise Franke",
        "Thomas Hermanns",
        "Hugo Sax",
        "Simone Schürle",
        "Michele Magno"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2024-01-23"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SP"
    ],
    "abstract": "Urine output is a vital parameter to gauge kidney health. Current monitoring methods include manually written records, invasive urinary catheterization or ultrasound measurements performed by highly skilled personnel. Catheterization bears high risks of infection while intermittent ultrasound measures and manual recording are time consuming and might miss early signs of kidney malfunction. Bioimpedance (BI) measurements may serve as a non-invasive alternative for measuring urine volume in vivo. However, limited robustness have prevented its clinical translation. Here, a deep learning-based algorithm is presented that processes the local BI of the lower abdomen and suppresses artefacts to measure the bladder volume quantitatively, non-invasively and without the continuous need for additional personnel. A tetrapolar BI wearable system called ANUVIS was used to collect continuous bladder volume data from three healthy subjects to demonstrate feasibility of operation, while clinical gold standards of urodynamic (n=6) and uroflowmetry tests (n=8) provided the ground truth. Optimized location for electrode placement and a model for the change in BI with changing bladder volume is deduced. The average error for full bladder volume estimation and for residual volume estimation was -29 +/-87.6 ml, thus, comparable to commercial portable ultrasound devices (Bland Altman analysis showed a bias of -5.2 ml with LoA between 119.7 ml to -130.1 ml), while providing the additional benefit of hands-free, non-invasive, and continuous bladder volume estimation. The combination of the wearable BI sensor node and the presented algorithm provides an attractive alternative to current standard of care with potential benefits in providing insights into kidney function.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14028v1"
    ],
    "publication_venue": null
}