{
    "arxiv_id": "2303.12384",
    "paper_title": "RegFormer: An Efficient Projection-Aware Transformer Network for Large-Scale Point Cloud Registration",
    "authors": [
        "Jiuming Liu",
        "Guangming Wang",
        "Zhe Liu",
        "Chaokang Jiang",
        "Marc Pollefeys",
        "Hesheng Wang"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-07-21"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Although point cloud registration has achieved remarkable advances in object-level and indoor scenes, large-scale registration methods are rarely explored. Challenges mainly arise from the huge point number, complex distribution, and outliers of outdoor LiDAR scans. In addition, most existing registration works generally adopt a two-stage paradigm: They first find correspondences by extracting discriminative local features, and then leverage estimators (eg. RANSAC) to filter outliers, which are highly dependent on well-designed descriptors and post-processing choices. To address these problems, we propose an end-to-end transformer network (RegFormer) for large-scale point cloud alignment without any further post-processing. Specifically, a projection-aware hierarchical transformer is proposed to capture long-range dependencies and filter outliers by extracting point features globally. Our transformer has linear complexity, which guarantees high efficiency even for large-scale scenes. Furthermore, to effectively reduce mismatches, a bijective association transformer is designed for regressing the initial transformation. Extensive experiments on KITTI and NuScenes datasets demonstrate that our RegFormer achieves competitive performance in terms of both accuracy and efficiency.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12384v1",
        "http://arxiv.org/pdf/2303.12384v2"
    ],
    "publication_venue": "Accepted by ICCV2023. Codes will be released at https://github.com/IRMVLab/RegFormer"
}