{
    "arxiv_id": "2303.09711",
    "paper_title": "Trust in Shared Automated Vehicles: Study on Two Mobility Platforms",
    "authors": [
        "Shashank Mehrotra",
        "Jacob G Hunter",
        "Matthew Konishi",
        "Kumar Akash",
        "Zhaobo Zheng",
        "Teruhisa Misu",
        "Anil Kumar",
        "Tahira Reid",
        "Neera Jain"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "cs.HC",
        "cs.RO"
    ],
    "abstract": "The ever-increasing adoption of shared transportation modalities across the United States has the potential to fundamentally change the preferences and usage of different mobilities. It also raises several challenges with respect to the design and development of automated mobilities that can enable a large population to take advantage of this emergent technology. One such challenge is the lack of understanding of how trust in one automated mobility may impact trust in another. Without this understanding, it is difficult for researchers to determine whether future mobility solutions will have acceptance within different population groups. This study focuses on identifying the differences in trust across different mobility and how trust evolves across their use for participants who preferred an aggressive driving style. A dual mobility simulator study was designed in which 48 participants experienced two different automated mobilities (car and sidewalk). The results found that participants showed increasing levels of trust when they transitioned from the car to the sidewalk mobility. In comparison, participants showed decreasing levels of trust when they transitioned from the sidewalk to the car mobility. The findings from the study help inform and identify how people can develop trust in future mobility platforms and could inform the design of interventions that may help improve the trust and acceptance of future mobility.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09711v1"
    ],
    "publication_venue": "https://trid.trb.org/view/2117834"
}