{
    "arxiv_id": "2303.09347",
    "paper_title": "CSSL-MHTR: Continual Self-Supervised Learning for Scalable Multi-script Handwritten Text Recognition",
    "authors": [
        "Marwa Dhiaf",
        "Mohamed Ali Souibgui",
        "Kai Wang",
        "Yuyang Liu",
        "Yousri Kessentini",
        "Alicia Fornés",
        "Ahmed Cheikh Rouhou"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Self-supervised learning has recently emerged as a strong alternative in document analysis. These approaches are now capable of learning high-quality image representations and overcoming the limitations of supervised methods, which require a large amount of labeled data. However, these methods are unable to capture new knowledge in an incremental fashion, where data is presented to the model sequentially, which is closer to the realistic scenario. In this paper, we explore the potential of continual self-supervised learning to alleviate the catastrophic forgetting problem in handwritten text recognition, as an example of sequence recognition. Our method consists in adding intermediate layers called adapters for each task, and efficiently distilling knowledge from the previous model while learning the current task. Our proposed framework is efficient in both computation and memory complexity. To demonstrate its effectiveness, we evaluate our method by transferring the learned model to diverse text recognition downstream tasks, including Latin and non-Latin scripts. As far as we know, this is the first application of continual self-supervised learning for handwritten text recognition. We attain state-of-the-art performance on English, Italian and Russian scripts, whilst adding only a few parameters per task. The code and trained models will be publicly available.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09347v1"
    ],
    "publication_venue": null
}