{
    "arxiv_id": "2303.14636",
    "paper_title": "Nanostructures for in-situ surface-enhanced Kretschmann-Raether ellipsometry",
    "authors": [
        "Deshabrato Mukherjee",
        "Benjamin Kalas",
        "Sven Burger",
        "Gyorgy Safran",
        "Miklos Serenyi",
        "Miklos Fried",
        "Peter Petrik"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics"
    ],
    "abstract": "Spectroscopic ellipsometry is a sensitive and optical model-supported quantitative tool to monitor interfaces. In this work, solid-liquid interfaces are studied using the Kretschmann-Raether configuration for biosensing applications. The interface layers support two purposes simultaneously: (i) chemical suitability for the adsorption of molecules to be detected and (ii) the optical enhancement of the signal to increase the sensitivity. Ellipsometry is not only used as a sensor but also as a quantitative measurement tool to study and understand the interface phenomena, and to develop the sensing layers for the largest possible optical sensitivity. Plasmonic and structured layers are of primary importance in terms of optical sensitivity. Layers structured both in lateral and vertical directions have been studied. Optical models based on both the transfer matrix and the finite element method were developed and used for the structural analysis where the material and geometrical derivatives are used in the inverse fitting process of the model data to the measurement. Structures utilizing plasmonic, diffraction, multilayer field enhancement, and other methods were analyzed as possible candidates for the improvement of the optical performance of the cell. Combinatorial and periodic plasmonic surface structures were developed to enhance the sensitivity of in-situ ellipsometry at solid-liquid interfaces utilizing the Kretschmann-Raether (KR) geometry. Ag$_x$Al$_{1-x}$ layers with variable compositions and Au layers with changing periods and critical dimensions were investigated to improve the performance of sensors based on the KR arrangement.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14636v1"
    ],
    "publication_venue": "9 pages, 3 figures, SPIE Photonics West conference contribution",
    "doi": "10.1117/12.2649080"
}