{
    "arxiv_id": "2303.16448",
    "paper_title": "A PIE Representation of Scalar Quadratic PDEs and Global Stability Analysis Using SDP",
    "authors": [
        "Declan Jagt",
        "Peter Seiler",
        "Matthew Peet"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-05-29"
    ],
    "latest_version": 3,
    "categories": [
        "math.AP",
        "math.OC"
    ],
    "abstract": "It has recently been shown that the evolution of a linear Partial Differential Equation (PDE) can be more conveniently represented in terms of the evolution of a higher spatial derivative of the state. This higher spatial derivative (termed the 'fundamental state') lies in $L_2$ - requiring no auxiliary boundary conditions or continuity constraints. Such a representation (termed a Partial Integral Equation or PIE) is then defined in terms of an algebra of bounded integral operators (termed Partial Integral (PI) operators) and is constructed by identifying a unitary map from the fundamental state to the state of the original PDE. Unfortunately, when the PDE is nonlinear, the dynamics of the associated fundamental state are no longer parameterized in terms of partial integral operators. However, in this paper we show that such dynamics can be compactly represented using a new tensor algebra of Partial Integral operators acting on the tensor product of the fundamental state. We further show that this tensor product of the fundamental state forms a natural distributed equivalent of the monomial basis used in representation of polynomials on a finite-dimensional space. This new representation is then used to provide a simple SDP-based Lyapunov test of stability of quadratic PDEs. The test is applied to three illustrative examples of quadratic PDEs with various types of boundary conditions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16448v1",
        "http://arxiv.org/pdf/2303.16448v2",
        "http://arxiv.org/pdf/2303.16448v3"
    ],
    "publication_venue": null
}