{
    "arxiv_id": "2303.08523",
    "paper_title": "Metallurgical synthesis methods for Mg-Al-Ca scientific model materials",
    "authors": [
        "W. Luo",
        "L. Tanure",
        "M. Felten",
        "J. Nowak",
        "W. Delis",
        "M. Freund",
        "N. Ayeb",
        "D. Zander",
        "C. Thomas",
        "M. Feuerbacher",
        "S. Sandlöbes-Haut",
        "S. Korte-Kerzel",
        "H. Springer"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Mg-based alloys are industrially used for structural applications, both as solid solutions alloys and as composites containing intermetallic compounds. However, a further development in terms of mechanical properties requires the investigation of underlying causalities between synthesis, processing and microstructure to adjust the mechanical and the corrosion properties, ideally down to the near atomic scale. Such fundamental scientific investigations with high resolution characterisation techniques require model materials of exceptionally high purity and strictly controlled microstructure e.g. with respect to grain size, morphology, chemical homogeneity as well as content and size of oxide inclusions. In this context, the Mg-Al-Ca system appears exceptionally challenging from a metallurgical perspective due to the high reactivity and high vapor pressures, so that conventional industrial techniques cannot be successfully deployed. Here, we demonstrate the applicability of various scientific synthesis methods from arc melting over solution growth to diffusion couples, extending to effects and parameters for thermo-mechanical processing. Suitable pathways to overcome the specific challenges of the Mg-Al-Ca system are demonstrated, as well as the persistent limitations of the current state of the art laboratory metallurgy technology.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08523v1"
    ],
    "publication_venue": "17 pages, 7 figures"
}