{
    "arxiv_id": "2303.12631",
    "paper_title": "Universality of the superfluid Kelvin-Helmholtz instability by single-vortex tracking",
    "authors": [
        "D. Hernandez-Rajkov",
        "N. Grani",
        "F. Scazza",
        "G. Del Pace",
        "W. J. Kwon",
        "M. Inguscio",
        "K. Xhani",
        "C. Fort",
        "M. Modugno",
        "F. Marino",
        "G. Roati"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.quant-gas",
        "physics.atom-ph",
        "physics.flu-dyn"
    ],
    "abstract": "At the interface between two fluid layers in relative motion, infinitesimal fluctuations can be exponentially amplified, inducing vorticity and the breakdown of the laminar flow. This process, known as the Kelvin-Helmholtz instability, is responsible for many familiar phenomena observed in the atmosphere, and the oceans, as well as in astrophysics, and it is one of the paradigmatic routes to turbulence in fluid mechanics. While in classical hydrodynamics the instability is ruled by universal scaling laws, to what extent universality emerges in quantum fluids is yet to be fully understood. Here, we shed light on this matter by triggering the Kelvin-Helmholtz instability in atomic superfluids across widely different regimes, ranging from weakly-interacting bosonic to strongly-correlated fermionic pair condensates. Upon engineering two counter-rotating flows with tunable relative velocity, we observe how their contact interface develops into an ordered circular array of quantized vortices, which loses stability and rolls up into clusters in close analogy with classical Kelvin-Helmholtz dynamics. We extract the instability growth rates by tracking the position of individual vortices and find that they follow universal scaling relations, predicted by both classical hydrodynamics and a microscopic point-vortex model. Our results connect quantum and classical fluids revealing how the motion of quantized vortices mirrors the interface dynamics and open the way for exploring a wealth of out-of-equilibrium phenomena, from vortex-matter phase transitions to the spontaneous emergence of two-dimensional quantum turbulence .",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12631v1"
    ],
    "publication_venue": null
}