{
    "arxiv_id": "2303.13304",
    "paper_title": "How to determine the local unitary equivalence of sets of generalized Bell states",
    "authors": [
        "Cai-Hong Wang",
        "Jiang-Tao Yuan",
        "Ying-Hui Yang"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2024-03-14"
    ],
    "latest_version": 2,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Classification is a common method to study quantum entanglement, and local unitary equivalence (LU-equivalence) is an effective classification tool. The purpose of this work is to show how to determine the LU-equivalence of sets of generalized Bell states (GBSs) in an arbitrary dimensional bipartite quantum system $\\mathbb{C}^{d}\\otimes \\mathbb{C}^{d}$ ($d$ is an integer no less than 3). The idea is that, for a given GBS set $\\mathcal{M}$, try to find all the GBS sets that are LU-equivalent to $\\mathcal{M}$, then we can determine whether another GBS set is LU-equivalent to $\\mathcal{M}$ by comparison. In order to accomplish this intention, we first reduce the LU-equivalence of two GBS sets to the unitary conjugate equivalence (UC-equivalence) of two generalized Pauli matrix (GPM) sets. Then we give the necessary and sufficient conditions for a 2-GPM set UC-equivalent to a special 2-GPM set $\\{ X^{a}, Z^{b} \\}$ ($a, b$ are nonnegative integers and factors of $d$). The general case, that is, the UC-equivalence of two general GPM sets, follows by the particular case. Moreover, these results are programmable, that is, we provide programs that can give all standard GPM sets that are UC-equivalent to a given GPM set, as well as programs that can determine all standard GPM sets that are unitary equivalent (U-equivalent) to a given GPM set, and then the U-equivalence of two arbitrary GPM sets (or LU-equivalence of two GBS sets) can be determined by comparison. To illustrate the role of the programs, we provide two examples, one showing that all 4-GBS sets (58905 items) in $\\mathbb{C}^{6}\\otimes \\mathbb{C}^{6}$ can be divided into 31 LU-equivalence classes, and the other providing a complete LU-equivalent classification of all 4-GBS sets in $\\mathbb{C}^{4}\\otimes \\mathbb{C}^{4}$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13304v1",
        "http://arxiv.org/pdf/2303.13304v2"
    ],
    "publication_venue": "17 pages, 16 tables"
}