{
    "arxiv_id": "2303.08425",
    "paper_title": "Investigating the image lag of a scientific CMOS sensor in X-ray detection",
    "authors": [
        "Qinyu Wu",
        "Zhixing Ling",
        "Chen Zhang",
        "Quan Zhou",
        "Xinyang Wang",
        "Weimin Yuan",
        "Shuang-Nan Zhang"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM",
        "hep-ex",
        "physics.ins-det"
    ],
    "abstract": "In recent years, scientific CMOS (sCMOS) sensors have been vigorously developed and have outperformed CCDs in several aspects: higher readout frame rate, higher radiation tolerance, and higher working temperature. For silicon image sensors, image lag will occur when the charges of an event are not fully transferred inside pixels. It can degrade the image quality for optical imaging, and deteriorate the energy resolution for X-ray spectroscopy. In this work, the image lag of a sCMOS sensor is studied. To measure the image lag under low-light illumination, we constructed a new method to extract the image lag from X-ray photons. The image lag of a customized X-ray sCMOS sensor GSENSE1516BSI is measured, and its influence on X-ray performance is evaluated. The result shows that the image lag of this sensor exists only in the immediately subsequent frame and is always less than 0.05% for different incident photon energies and under different experimental conditions. The residual charge is smaller than 0.5 e- with the highest incident photon charge around 8 ke-. Compared to the readout noise level around 3 e-, the image lag of this sensor is too small to have a significant impact on the imaging quality and the energy resolution. The image lag shows a positive correlation with the incident photon energy and a negative correlation with the temperature. However, it has no dependence on the gain setting and the integration time. These relations can be explained qualitatively by the non-ideal potential structure inside the pixels. This method can also be applied to the study of image lag for other kinds of imaging sensors.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08425v1"
    ],
    "publication_venue": "accepted by NIM A",
    "doi": "10.1016/j.nima.2023.168180"
}