{
    "arxiv_id": "2303.11792",
    "paper_title": "Searching for Time-Dependent Axion Dark Matter Signals in Pulsars",
    "authors": [
        "R. A. Battye",
        "M. J. Keith",
        "J. I. McDonald",
        "S. Srinivasan",
        "B. W. Stappers",
        "P. Weltevrede"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "astro-ph.HE",
        "gr-qc",
        "hep-ph"
    ],
    "abstract": "Axion dark matter can be converted into photons in the magnetospheres of neutron stars leading to a spectral line centred on the Compton wavelength of the axion. Due to the rotation of the star and the plasma effects in the magnetosphere the signal is predicted to be periodic with significant time variation - a unique smoking gun for axion dark matter. As a proof of principle and to develop the methodology, we carry out the first time domain search of the signal using data from PSR J2144$-$3933 taken as part of the MeerTIME project on MeerKAT telescope. We search for specific signal templates using a matched filter technique and discuss when a time-domain analysis (as is typically the case in pulsar observations) gives greater sensitivity to the axion-coupling to photons in comparison to a simple time-averaged total flux study. We do not find any candidate signals and, hence, impose an upper limit on the axion-to-photon coupling of $g_{aγγ}<4\\times 10^{-11}\\,{\\rm GeV}^{-1}$ over the mass range $m_{\\rm a}=3.9-4.7\\,μ{\\rm eV}$ using this data. This limit relies on PSR J2144$-$3933 not being an extremely aligned rotator, as strongly supported by simple arguments based on the observed pulse profile width. We discuss the possibilities of improving this limit using future observations with MeerKAT and also SKA1-mid and the possibility of using other objects. Finally, to evade modelling uncertainties in axion radio signals, we also carry out a generic ``any periodic-signal search\" in the data, finding no evidence for an axion signal.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11792v1"
    ],
    "publication_venue": "21 pages, 14 figures Comments welcome"
}