{
    "arxiv_id": "2303.16227",
    "paper_title": "The ALMA-ALPAKA survey I: high-resolution CO and [CI] kinematics of star-forming galaxies at z = 0.5-3.5",
    "authors": [
        "F. Rizzo",
        "F. Roman-Oliveira",
        "F. Fraternali",
        "D. Frickmann",
        "F. Valentino",
        "G. Brammer",
        "A. Zanella",
        "V. Kokorev",
        "G. Popping",
        "K. E. Whitaker",
        "M. Kohandel",
        "G. E. Magdis",
        "L. Di Mascolo",
        "R. Ikeda",
        "S. Jin",
        "S. Toft"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Spatially-resolved studies of the kinematics of galaxies provide crucial insights into their assembly and evolution, enabling to infer the properties of the dark matter halos, derive the impact of feedback on the ISM, characterize the outflow motions. To date, most of the kinematic studies at z=0.5-3.5 were obtained using emission lines tracing the warm, ionized gas. However, whether these provide an exhaustive or only a partial view of the dynamics of galaxies and of the properties of the ISM is still debated. Complementary insights on the cold gas kinematics are therefore needed. We present ALPAKA, a project aimed at gathering high-resolution observations of CO and [CI] emission lines of star-forming galaxies at z=0.5-3.5 from the ALMA public archive. With 147 hours of total integration time, ALPAKA assembles ~0.25'' observations for 28 star-forming galaxies, the largest sample with spatially-resolved cold gas kinematics as traced by either CO or [CI] at z>0.5. By combining multi-wavelength ancillary data, we derive the stellar masses ($M_{\\star}$) and star-formation rates (SFR) for our targets, finding values of $M_{\\star}\\gtrsim 10^{10}$ M$_{\\odot}$ and SFR of 10-3000 M$_{\\odot}$/yr. A large fraction of ALPAKA galaxies (19/28) lie in overdense regions (clusters, groups, and protoclusters). We exploit the ALMA data to infer their dynamical state and we find that 19/28 ALPAKA galaxies are rotating disks, 2 are interacting systems, while for the remaining 7 sources the classification is uncertain. The disks have velocity dispersion values that are typically larger in the innermost regions than in the outskirts, with a median value for the entire disk sample of 35$^{+11}_{-9}$ km/s. Despite the bias of our sample towards galaxies hosting very energetic mechanisms, the ALPAKA disks have high ratios of ordered-to-random motion ($V/σ$) with a median value of 9$^{+7}_{-2}$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16227v1"
    ],
    "publication_venue": "35 pages, 23 figures, 5 tables; submitted to A&A. The data and the outputs of the kinematic analysis will be made available at https://alpaka-survey.github.io/index.html once the paper is accepted. Comments are welcome"
}