{
    "arxiv_id": "2303.09169",
    "paper_title": "Solar center-to-limb variation in Rossiter-McLaughlin and exoplanet transmission spectroscopy",
    "authors": [
        "Ansgar Reiners",
        "Fei Yan",
        "Momo Ellwarth",
        "Hans-Günter Ludwig",
        "Lisa Nortmann"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
    ],
    "abstract": "Line profiles from spatially unresolved stellar observations consist of a superposition of local line profiles that result from observing the stellar atmosphere under specific viewing angles. Line profile variability caused by stellar magnetic activity or planetary transit selectively varies the weight and/or shape of profiles at individual surface positions. The effect is usually modeled with radiative transfer calculations because observations of spatially resolved stellar surfaces are not available. For the Sun, we recently obtained a broadband spectroscopic atlas of the solar center-to-limb variation (CLV). We use the atlas to study systematic differences between largely used radiative transfer calculations and solar observations. We concentrate on four strong lines useful for exoplanet transmission analysis, and we investigate the impact of CLV on transmission and Rossiter-McLaughlin (RM) curves. Solar models used to calculate synthetic spectra tend to underestimate line core depths but overestimate the effect of CLV. Our study shows that CLV can lead to significant systematic offsets in transmission curves and particularly in RM curves; transmission curves centered on individual lines are overestimated by up to a factor of two by the models, and simulations of RM curves yield amplitudes that are off by up to 5--10\\,m\\,s$^{-1}$ depending on the line. For the interpretation of transit observations, it is crucial for model spectra that accurately reproduce the solar CLV to become available which, for now, is the only calibration point available.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09169v1"
    ],
    "publication_venue": "10 pages, accepted for publication in A&A, solar spectra library available at http://www.astro.physik.uni-goettingen.de/research/solar-lib/",
    "doi": "10.1051/0004-6361/202345974"
}