{
    "arxiv_id": "2303.08037",
    "paper_title": "A Charge Conserving Exponential Predictor Corrector FEMPIC Formulation for Relativistic Particle Simulations",
    "authors": [
        "Omkar H. Ramachandran",
        "Leo C. Kempel",
        "John Luginsland",
        "B. Shanker"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "math.NA",
        "physics.comp-ph"
    ],
    "abstract": "The state of art of charge-conserving electromagnetic finite element particle-in-cell has grown by leaps and bounds in the past few years. These advances have primarily been achieved for leap-frog time stepping schemes for Maxwell solvers, in large part, due to the method strictly following the proper space for representing fields, charges, and measuring currents. Unfortunately, leap-frog based solvers (and their other incarnations) are only conditionally stable. Recent advances have made Electromagnetic Finite Element Particle-in-Cell (EM-FEMPIC) methods built around unconditionally stable time stepping schemes were shown to conserve charge. Together with the use of a quasi-Helmholtz decomposition, these methods were both unconditionally stable and satisfied Gauss' Laws to machine precision. However, this architecture was developed for systems with explicit particle integrators where fields and velocities were off by a time step. While completely self-consistent methods exist in the literature, they follow the classic rubric: collect a system of first order differential equations (Maxwell and Newton equations) and use an integrator to solve the combined system. These methods suffer from the same side-effect as earlier--they are conditionally stable. Here we propose a different approach; we pair an unconditionally stable Maxwell solver to an exponential predictor-corrector method for Newton's equations. As we will show via numerical experiments, the proposed method conserves energy within a PIC scheme, has an unconditionally stable EM solve, solves Newton's equations to much higher accuracy than a traditional Boris solver and conserves charge to machine precision. We further demonstrate benefits compared to other polynomial methods to solve Newton's equations, like the well known Boris push.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08037v1"
    ],
    "publication_venue": "12 pages, 15 figures",
    "doi": "10.1109/TPS.2023.3244030"
}