{
    "arxiv_id": "2303.08846",
    "paper_title": "On the Dynamical Heating of Dwarf Galaxies in a Fuzzy Dark Matter Halo",
    "authors": [
        "Dhruba Dutta Chowdhury",
        "Frank C. van den Bosch",
        "Pieter van Dokkum",
        "Victor Robles",
        "Hsi-Yu Schive",
        "Tzihong Chiueh"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Fuzzy Dark Matter (FDM), consisting of ultralight bosons, is an intriguing alternative to Cold Dark Matter. Numerical simulations solving the Schrödinger-Poisson (SP) equation, which governs FDM dynamics, show that FDM halos consist of a central solitonic core (representing the ground state of the SP equation), surrounded by a large envelope of excited states. Wave interference gives rise to order unity density fluctuations throughout the envelope and causes the soliton to undergo density oscillations and execute a confined random walk in the central region of the halo. The resulting gravitational potential perturbations are an efficient source of dynamical heating. Using high-resolution numerical simulations of a $6.6 \\times 10^{9} \\rm M_{\\odot}$ FDM halo with boson mass, $m_{\\rm b}=8 \\times 10^{-23} \\ \\rm eV$, we investigate the impact of this dynamical heating on the structure and kinematics of spheroidal dwarf galaxies of a fixed mass but different initial sizes and ellipticities. The galaxies are set up in equilibrium in the time-and-azimuthally averaged halo potential and evolved for $10 \\ \\rm Gyr$ in the live FDM halo. We find that they continuously increase their sizes and central velocity dispersions. In addition, their kinematic structures become strongly radially anisotropic, especially in the outskirts. Dynamical heating also causes initially ellipsoidal galaxies to become more spherical over time from the inside out and gives rise to distorted, non-concentric isodensity contours. These tell-tale characteristics of dynamical heating of dwarf galaxies in FDM halos can potentially be used to constrain the boson mass.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08846v1"
    ],
    "publication_venue": "18 pages, 11 figures, submitted to ApJ"
}