{
    "arxiv_id": "2303.17498",
    "paper_title": "Weak-anchoring effects in a thin pinned ridge of nematic liquid crystal",
    "authors": [
        "Joseph R. L. Cousins",
        "Akhshay S. Bhadwal",
        "Lindsey T. Corson",
        "Brian R. Duffy",
        "Ian C. Sage",
        "Carl V. Brown",
        "Nigel J. Mottram",
        "Stephen K. Wilson"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft"
    ],
    "abstract": "A theoretical investigation of weak-anchoring effects in a thin two-dimensional pinned static ridge of nematic liquid crystal resting on a flat solid substrate in an atmosphere of passive gas is performed. Specifically, we solve a reduced version of the general system of governing equations recently derived by Cousins et al. [Proc. Roy. Soc. A}, 478(2259):20210849, 2022] valid for a symmetric thin ridge under the one-constant approximation of the Frank--Oseen bulk elastic energy with pinned contact lines to determine the shape of the ridge and the behaviour of the director within it. Numerical investigations covering a wide range of parameter values indicate that the energetically-preferred solutions can be classified in terms of the Jenkins--Barratt--Barbero--Barberi critical thickness into five qualitatively different types of solution. In particular, the theoretical results suggest that anchoring breaking occurs close to the contact lines. The theoretical predictions are supported by the results of physical experiments for a ridge of the nematic 4'-pentyl-4-biphenylcarbonitrile (5CB). In particular, these experiments show that the homeotropic anchoring at the gas--nematic interface is broken close to the contact lines by the stronger rubbed planar anchoring at the nematic--substrate interface. A comparison between the experimental values of and the theoretical predictions for the effective refractive index of the ridge gives a first estimate of the anchoring strength of an interface between air and 5CB to be $(9.80\\pm1.12)\\times10^{-6}\\,{\\rm N m}^{-1}$ at a temperature of $(22\\pm1.5)^\\circ$C.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17498v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevE.107.034702"
}