{
    "arxiv_id": "2303.08782",
    "paper_title": "Vorticity generation in cosmology and the role of shell crossing",
    "authors": [
        "Obinna Umeh"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-05-29"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.CO",
        "gr-qc"
    ],
    "abstract": "There is no source for cosmic vorticity within the cold dark matter cosmology. However, vorticity has been observed in the universe, especially on the scales of clusters, filaments, galaxies, etc. Recent results from high-resolution general relativistic N-body simulation show that the vorticity power spectrum dominates over the power spectrum of the divergence of the peculiar velocity field on scales where the effective field theory of large-scale structure breaks down. Incidentally, this scale also corresponds to the scale where shell-crossing occurs. Several studies have suggested a link between shell crossing in the dark matter fluid and the vorticity generation in the universe, however, no clear proof of how it works exists yet. We describe for the first time how vorticity is generated in a universe such as ours with expanding and collapsing regions. We show how vorticity is generated at the boundary of the expanding and collapsing regions. Our result indicates that the amplitude of the generated vorticity is determined by the difference in gradients of the gravitational potential, pressure and the expansion rate of a one-parameter family of geodesics across the boundary. Additionally, we argue that the presence of vorticity in the matter fields implies a non-vanishing magnetic part of the Weyl tensor. This has implications for the generation of Maxwell's magnetic field and the dynamics of clusters. The impact on accelerated expansion of the universe and the existence of causal limit for massive particles are discussed",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08782v1",
        "http://arxiv.org/pdf/2303.08782v2"
    ],
    "publication_venue": "References added. Few typos corrected. Now submitted to JCAP"
}