{
    "arxiv_id": "2303.17072",
    "paper_title": "Surface Composition of Pluto's Kiladze Area and Relationship to Cryovolcanism",
    "authors": [
        "A. Emran",
        "C. M. Dalle Ore",
        "D. P. Cruikshank",
        "J. C. Cook"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "A link between exposures of water (H${}_{2}$O) ice with traces of an ammoniated compound (e.g., a salt) and the probable effusion of a water-rich cryolava onto the surface of Pluto has been established in previous investigations (Dalle Ore et al. 2019). Here we present the results from the application of a machine learning technique and a radiative transfer model to a water-ice-rich exposure in Kiladze area and surroundings on Pluto. We demonstrate the presence of an ammoniated material suggestive of an undetermined but relatively recent emplacement event. Kiladze lies in a region of Pluto's surface that is structurally distinct from that of the areas where similar evidence points to cryovolcanic activity at some undetermined time in the planet's history. Although the Kiladze depression superficially resembles an impact crater, a close inspection of higher-resolution images indicates that the feature lacks the typical morphology of a crater. Here we suggest that a cryolava water carrying an ammoniated component may have come onto the surface at the Kiladze area via one or more volcanic collapses, as in a resurgent volcanic caldera complex. Large regions east of Kiladze also exhibit the presence of H${}_{2}$O ice and have graben-like structures suggestive of cryovolcanic activity, but with existing data are not amenable to the detailed search that might reveal an ammoniated component.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17072v1"
    ],
    "publication_venue": "28 pages, 11 figures, submitted to Icarus",
    "doi": "10.1016/j.icarus.2023.115653"
}