{
    "arxiv_id": "2303.13161",
    "paper_title": "Diffuse solar coronal features and their spicular footpoints",
    "authors": [
        "Nikolina Milanović",
        "Lakshmi Pradeep Chitta",
        "Hardi Peter"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "physics.plasm-ph",
        "physics.space-ph"
    ],
    "abstract": "In addition to a component of the emission that originates from clearly distinguishable coronal loops, the solar corona also exhibits extreme-ultraviolet (EUV) and X-ray ambient emission that is rather diffuse and is often considered undesirable background. Importantly, unlike the generally more structured transition region and chromosphere, the diffuse corona appears to be rather featureless. The magnetic nature of the diffuse corona, and in particular, its footpoints in the lower atmosphere, are not well understood. We study the origin of the diffuse corona above the quiet-Sun network on supergranular scales. We identified regions of diffuse EUV emission in the coronal images from the SDO/AIA. To investigate their connection to the lower atmosphere, we combined these SDO/AIA data with the transition region spectroscopic data from the IRIS and with the underlying surface magnetic field information from the SDO/HMI. The region of the diffuse emission is of supergranular size and persists for more than five hours, during which it shows no obvious substructure. It is associated with plasma at about 1 MK that is located within and above a magnetic canopy. The canopy is formed by unipolar magnetic footpoints that show highly structured spicule-like emission in the overlying transition region. Our results suggest that the diffuse EUV emission patch forms at the base of long-ranging loops, and it overlies spicular structures in the transition region. Heated material might be supplied to it by means of spicular upflows, conduction-driven upflows from coronal heating events, or perhaps by flows originating from the farther footpoint. Therefore, the question remains open how the diffuse EUV patch might be sustained. Nevertheless, our study indicates that heated plasma trapped by long-ranging magnetic loops might substantially contribute to the featureless ambient coronal emission.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13161v1"
    ],
    "publication_venue": "Article accepted for publication in A&A. Movie available at https://owncloud.gwdg.de/index.php/s/uVKpc7PMhPg9HWm",
    "doi": "10.1051/0004-6361/202245544"
}