{
    "arxiv_id": "2303.09049",
    "paper_title": "On the 3D Curvature and Dynamics of the Musca filament",
    "authors": [
        "Aidan Kaminsky",
        "Lars Bonne",
        "Doris Arzoumanian",
        "Simon Coudé"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Filaments are ubiquitous in the interstellar medium (ISM), yet their formation and evolution remains the topic of intense debate. In order to obtain a more comprehensive view of the 3D morphology and evolution of the Musca filament, we model the C$^{18}$O(2-1) emission along the filament crest with several large-scale velocity field structures. This indicates that Musca is well described by a 3D curved cylindrical filament with longitudinal mass inflow to the center of the filament unless the filament is a transient structure with a lifetime $\\lesssim$~0.1 Myr. Gravitational longitudinal collapse models of filaments appear unable to explain the observed velocity field. To better understand these kinematics, we further analyze a map of the C$^{18}$O(2-1) velocity field at the location of SOFIA HAWC+ dust polarization observations that trace the magnetic field in the filament. This unveils an organized magnetic field that is oriented roughly perpendicular to the filament crest. Although the velocity field is also organized, it progressively changes its orientation by more than 90$^{o}$ when laterally crossing the filament crest and thus appears disconnected from the magnetic field in the filament. This strong lateral change of the velocity field over the filament remains unexplained and might be associated with important longitudinal motion in the filament that can be associated to the large-scale kinematics along the filament.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09049v1"
    ],
    "publication_venue": "16 pages, 11 figures, 1 table, accepted in ApJ",
    "doi": "10.3847/1538-4357/acc462"
}