{
    "arxiv_id": "2303.15218",
    "paper_title": "Evaluating XGBoost for Balanced and Imbalanced Data: Application to Fraud Detection",
    "authors": [
        "Gissel Velarde",
        "Anindya Sudhir",
        "Sanjay Deshmane",
        "Anuj Deshmunkh",
        "Khushboo Sharma",
        "Vaibhav Joshi"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cs.AI"
    ],
    "abstract": "This paper evaluates XGboost's performance given different dataset sizes and class distributions, from perfectly balanced to highly imbalanced. XGBoost has been selected for evaluation, as it stands out in several benchmarks due to its detection performance and speed. After introducing the problem of fraud detection, the paper reviews evaluation metrics for detection systems or binary classifiers, and illustrates with examples how different metrics work for balanced and imbalanced datasets. Then, it examines the principles of XGBoost. It proposes a pipeline for data preparation and compares a Vanilla XGBoost against a random search-tuned XGBoost. Random search fine-tuning provides consistent improvement for large datasets of 100 thousand samples, not so for medium and small datasets of 10 and 1 thousand samples, respectively. Besides, as expected, XGBoost recognition performance improves as more data is available, and deteriorates detection performance as the datasets become more imbalanced. Tests on distributions with 50, 45, 25, and 5 percent positive samples show that the largest drop in detection performance occurs for the distribution with only 5 percent positive samples. Sampling to balance the training set does not provide consistent improvement. Therefore, future work will include a systematic study of different techniques to deal with data imbalance and evaluating other approaches, including graphs, autoencoders, and generative adversarial methods, to deal with the lack of labels.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15218v1"
    ],
    "publication_venue": "17 pages, 8 figures, 9 tables, Presented at NVIDIA GTC, The Conference for the Era of AI and the Metaverse, March 23, 2023. [S51129]"
}