{
    "arxiv_id": "2303.09637",
    "paper_title": "Origin of the diffuse 4-8 keV emission in M82",
    "authors": [
        "K. Iwasawa",
        "C. Norman",
        "R. Gilli",
        "P. Gandhi",
        "M. A. Perez-Torres"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
    ],
    "abstract": "We present the first spatially resolved, X-ray spectroscopic study of the 4-8 keV diffuse emission found in the central part of the nearby starburst galaxy M82 on a few arcsecond scales. The new details that we see allow a number of important conclusions to be drawn on the nature of the hot gas and its origin as well as feedback on the ISM. We use archival data from Chandra with an exposure time of 570 ks. The Fexxv emission at 6.7 keV, expected from metal-enriched hot gas, is enhanced only in a limited area close to the starburst disc and is weak or almost absent over the rest of the diffuse emission, resulting in spatial variations in EW from <0.1 keV to 1.9 keV. This shows the presence of non-thermal emission due to inverse Compton scattering of the FIR photons by radio emitting cosmic ray electrons. The morphological resemblance between the diffuse X-ray, radio, and FIR emission maps supports this concept. Our decomposition of the diffuse emission spectrum indicates that ~70% of the 4-8 keV luminosity originates from the inverse Compton emission. The metal-rich hot gas with kT~5 keV makes a minor contribution to the 4-8 keV continuum, but it accounts for the majority of the observed Fexxv line. This hot gas appears to emerge from the circumnuclear starburst ring and fill the galactic chimneys identified as mid-infrared and radio emission voids. The energetics argument suggests that much of the supernova energy in the starburst site has gone into creating the chimneys and is transported to the halo. We argue that a hot, rarefied environment produced by strong supernova feedback results in displacing the brightest X-ray and radio supernova remnants which are instead found to reside in GMC. We find a faint X-ray source with a radio counterpart, close to the kinematic centre of the galaxy and we carefully examine the possibility that this source is a low-luminosity AGN in ADAF phase.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09637v1"
    ],
    "publication_venue": "19 pages, accepted for publication in Astronomy & Astrophysics",
    "doi": "10.1051/0004-6361/202245548"
}