{
    "arxiv_id": "2303.13858",
    "paper_title": "Unveiling the gravitationally unstable disc of a massive star-forming galaxy using NOEMA and MUSE",
    "authors": [
        "Johannes Puschnig",
        "Matthew Hayes",
        "Oscar Agertz",
        "Eric Emsellem",
        "John M. Cannon",
        "Alexandra Le Reste",
        "Jens Melinder",
        "Göran Östlin",
        "Christian Herenz",
        "Veronica Menacho"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Using new high-resolution data of CO (2-1), H-alpha and H-beta obtained with the Northern Extended Millimeter Array (NOEMA) and the Multi-Unit Spectroscopic Explorer (MUSE) at the Very Large Telescope, we have performed a Toomre-Q disc stability analysis and studied star formation, gas depletion times and other environmental parameters on sub-kpc scales within the z~0 galaxy SDSS J125013.84+073444.5 (LARS 8). The galaxy hosts a massive, clumpy disc and is a proto-typical analogue of main-sequence galaxies at z~1-2. We show that the massive (molecular) clumps in LARS 8 are the result of an extremely gravitationally unstable gas disc, with large scale instabilities found across the whole extent of the rotating disc, with only the innermost 500 pc being stabilized by its bulgelike structure. The radial profiles further reveal that - contrary to typical disc galaxies - the molecular gas depletion time decreases from more than 1 Gyr in the center to less than ~100 Myr in the outskirts of the disc, supporting the findings of a Toomre-unstable disc. We further identified and analysed 12 individual massive molecular clumps. They are virialized and follow the mass-size relation, indicating that on local (cloud/clump) scales the stars form with efficiencies comparable to those in Milky Way clouds. The observed high star formation rate must thus be the result of triggering of cloud/clump formation over large scales due to disc instability. Our study provides evidence that \"in-situ\" massive clump formation (as also observed at high redshifts) is very efficiently induced by large-scale instabilities.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13858v1"
    ],
    "publication_venue": "Submitted to MNRAS",
    "doi": "10.1093/mnras/stad1820"
}