{
    "arxiv_id": "2303.17402",
    "paper_title": "Prediction of cancer driver genes and mutations: the potential of integrative computational frameworks",
    "authors": [
        "Mona Nourbakhsh",
        "Kristine Degn",
        "Astrid Saksager",
        "Matteo Tiberti",
        "Elena Papaleo"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.GN"
    ],
    "abstract": "The vast amount of sequencing data presently available allow the scientific community to explore a range of genetic variables that may drive and progress cancer. A myriad of predictive tools has been proposed, allowing researchers and clinicians to compare and prioritize driver genes and mutations and their relative pathogenicity. However, there is little consensus on the computational approach or a golden standard for comparison. Hence, benchmarking the different tools depends highly on the input data, indicating that overfitting is still a massive problem. One of the solutions is to limit the scope and usage of specific tool. However, such limitations forces researchers to walk on a tightrope between creating and using high-quality tools for a specific purpose and describing the complex alterations driving cancer. While the knowledge of cancer development increases every day, many bioinformatic pipelines rely on single nucleotide variants or alterations in a vacuum without accounting for cellular compartment, mutational burden, or disease progression. Even within bioinformatics and computational cancer biology, the research fields work in silos, risking overlooking potential synergies or breakthroughs. Here, we provide an overview of databases and datasets for building or testing predictive tools for discovery of cancer drivers. We introduce predictive tools for driver genes, driver mutations, and the impact of these based on structural analysis. Additionally, we suggest and recommend directions in the field to avoid silo-research, moving in the direction of integrative frameworks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17402v1"
    ],
    "publication_venue": "35 pages, 7 figures"
}