{
    "arxiv_id": "2303.17434",
    "paper_title": "A re-investigation of debris disc halos",
    "authors": [
        "Philippe Thebault",
        "Johan Olofsson",
        "Quentin Kral"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-07-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "A significant fraction of debris discs consist of a bright ring beyond which extends a wide halo. Such a halo should be made of small grains produced in the ring of parent bodies (PB) and pushed on high-e orbits by radiation pressure. It has been shown that, under several simplifying assumptions, the surface brightness (SB) of this halo should radially decrease as $r^{-3.5}$ in scattered light. We aim to revisit the halo phenomenon and focus on two so far unexplored issues: 1) How the unavoidable presence of small unbound grains, non-isotropic scattering phase functions (SPF) and finite instrument resolution affect scattered light SB profiles, and 2) How the halo phenomenon manifests itself at longer wavelengths. We find that unbound grains account for a significant fraction of the halo's luminosity in scattered light, and can significantly flatten the SB radial profile. Realistic size-dependent SPFs also have an effect, resulting here again in shallower SB profiles. For edge-on discs, non-resolving the vertical profile can also flatten the projected SB. We show that roughly half of the observationally-derived halo profiles found in the literature are compatible with our new results, and that roughly half of the remaining systems are probably shaped by additional processes. We also propose that, in future observational studies, the characteristics of PB belt and halos should be fitted separately. In thermal emission, wide halos should remain detectable up to the far-IR and, with the exception of the $\\sim 8-15μ$m domain, the halo accounts for more than half of the system's total flux up to $λ\\sim80-90μ$m. The halo's contribution strongly decreases in the sub-mm to mm but still represents a few percents of the system's luminosity at $λ\\sim 1$mm. For unresolved systems, the presence of a halo can also affect the determination of the disc's radius from its SED.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17434v1"
    ],
    "publication_venue": "accepted for publication in A&A (abstract significantly shortened to comply with arxiv limits)",
    "doi": "10.1051/0004-6361/202345995"
}