{
    "arxiv_id": "2303.15268",
    "paper_title": "Terahertz probing of anisotropic conductivity and morphology of CuMnAs epitaxial thin films",
    "authors": [
        "Peter Kubaščík",
        "Andrej Farkaš",
        "Kamil Olejník",
        "Tinkara Troha",
        "Matěj Hývl",
        "Filip Krizek",
        "Deep C. Joshi",
        "Tomáš Ostatnický",
        "Jiří Jechumtál",
        "Eva Schmoranzerová",
        "Richard P. Campion",
        "Jakub Zázvorka",
        "Vít Novák",
        "Petr Kužel",
        "Tomáš Jungwirth",
        "Petr Němec",
        "Lukáš Nádvorník"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "Antiferromagnetic CuMnAs thin films have attracted attention since the discovery of the manipulation of their magnetic structure via electrical, optical, and terahertz pulses of electric fields, enabling convenient approaches to the switching between magnetoresistive states of the film for the information storage. However, the magnetic structure and, thus, the efficiency of the manipulation can be affected by the film morphology and growth defects. In this study, we investigate the properties of CuMnAs thin films by probing the defect-related uniaxial anisotropy of electric conductivity by contact-free terahertz transmission spectroscopy. We show that the terahertz measurements conveniently detect the conductivity anisotropy, that are consistent with conventional DC Hall-bar measurements. Moreover, the terahertz technique allows for considerably finer determination of anisotropy axes and it is less sensitive to the local film degradation. Thanks to the averaging over a large detection area, the THz probing also allows for an analysis of strongly non-uniform thin films. Using scanning near-field terahertz and electron microscopies, we relate the observed anisotropic conductivity of CuMnAs to the elongation and orientation of growth defects, which influence the local microscopic conductivity. We also demonstrate control over the morphology of defects by using vicinal substrates.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15268v1"
    ],
    "publication_venue": "33 pages, 16 figures"
}