{
    "arxiv_id": "2303.09583",
    "paper_title": "Can we observe the ion-neutral drift velocity in prestellar cores?",
    "authors": [
        "Aris Tritsis",
        "Shantanu Basu",
        "Christoph Federrath"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "Given the low ionization fraction of molecular clouds, ambipolar diffusion is thought to be an integral process in star formation. However, chemical and radiative-transfer effects, observational challenges, and the fact that the ion-neutral drift velocity is inherently very small render a definite detection of ambipolar diffusion extremely non-trivial. Here, we study the ion-neutral drift velocity in a suite of chemodynamical, non-ideal magnetohydrodynamic (MHD), two-dimensional axisymmetric simulations of prestellar cores where we alter the temperature, cosmic-ray ionization rate, visual extinction, mass-to-flux ratio, and chemical evolution. Subsequently, we perform a number of non-local thermodynamic equilibrium (non-LTE) radiative-transfer calculations considering various idealized and non-idealized scenarios in order to assess which factor (chemistry, radiative transfer and/or observational difficulties) is the most challenging to overcome in our efforts to detect the ion-neutral drift velocity. We find that temperature has a significant effect in the amplitude of the drift velocity with the coldest modelled cores (T = 6 K) exhibiting drift velocities comparable to the sound speed. Against expectations, we find that in idealized scenarios (where two species are perfectly chemically co-evolving) the drift velocity ``survives\" radiative-transfer effects and can in principle be observed. However, we find that observational challenges and chemical effects can significantly hinder our view of the ion-neutral drift velocity. Finally, we propose that $\\rm{HCN}$ and $\\rm{HCNH^+}$, being chemically co-evolving, could be used in future observational studies aiming to measure the ion-neutral drift velocity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09583v1"
    ],
    "publication_venue": "14 pages, 11 figures. Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad829"
}