{
    "arxiv_id": "2303.15648",
    "paper_title": "Time-dependent visibility modelling of a relativistic jet in the X-ray binary MAXI J1803-298",
    "authors": [
        "C. M. Wood",
        "J. C. A. Miller-Jones",
        "A. Bahramian",
        "S. J. Tingay",
        "T. D. Russell",
        "A. J. Tetarenko",
        "D. Altamirano",
        "T. Belloni",
        "F. Carotenuto",
        "C. Ceccobello",
        "S. Corbel",
        "M. Espinasse",
        "R. P. Fender",
        "E. Körding",
        "S. Migliari",
        "D. M. Russell",
        "C. L. Sarazin",
        "G. R. Sivakoff",
        "R. Soria",
        "V. Tudose"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Tracking the motions of transient jets launched by low-mass X-ray binaries (LMXBs) is critical for determining the moment of jet ejection, and identifying any corresponding signatures in the accretion flow. However, these jets are often highly variable and can travel across the resolution element of an image within a single observation, violating a fundamental assumption of aperture synthesis. We present a novel approach in which we directly fit a single time-dependent model to the full set of interferometer visibilities, where we explicitly parameterise the motion and flux density variability of the emission components, to minimise the number of free parameters in the fit, while leveraging information from the full observation. This technique allows us to detect and characterize faint, fast-moving sources, for which the standard time binning technique is inadequate. We validate our technique with synthetic observations, before applying it to three Very Long Baseline Array (VLBA) observations of the black hole candidate LMXB MAXI J1803-298 during its 2021 outburst. We measured the proper motion of a discrete jet component to be $1.37\\pm0.14$ mas/hr, and thus we infer an ejection date of MJD $59348.08_{-0.06}^{+0.05}$, which occurs just after the peak of a radio flare observed by the Australia Telescope Compact Array (ATCA) and the Atacama Large Millimeter/Sub-Millimeter Array (ALMA), while MAXI J1803-298 was in the intermediate state. Further development of these new VLBI analysis techniques will lead to more precise measurements of jet ejection dates, which, combined with dense, simultaneous multi-wavelength monitoring, will allow for clearer identification of jet ejection signatures in the accretion flow.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15648v1"
    ],
    "publication_venue": "15 pages, 9 figures, 4 tables; Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad939"
}