{
    "arxiv_id": "2303.16851",
    "paper_title": "Inorganic Tin Perovskites with Tunable Conductivity Enabled by Organic Modifiers",
    "authors": [
        "Md Azimul Haque",
        "Tong Zhu",
        "Luis Huerta Hernandez",
        "Roba Tounesi",
        "Craig Combe",
        "Bambar Davaasuren",
        "Abdul-Hamid Emwas",
        "F. Pelayo García de Arquer",
        "Edward H. Sargent",
        "Derya Baran"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph"
    ],
    "abstract": "Achieving control over the transport properties of charge-carriers is a crucial aspect of realizing high-performance electronic materials. In metal-halide perovskites, which offer convenient manufacturing traits and tunability for certain optoelectronic applications, this is challenging: The perovskite structure itself, poses fundamental limits to maximum dopant incorporation. Here, we demonstrate an organic modifier incorporation strategy capable of modulating the electronic density of states in halide tin perovskites without altering the perovskite lattice, in a similar fashion to substitutional doping in traditional semiconductors. By incorporating organic small molecules and conjugated polymers into cesium tin iodide (CsSnI3) perovskites, we achieve carrier density tunability over 2.7 decades, transition from a semiconducting to a metallic nature, and high electrical conductivity exceeding 200 S/cm. We leverage these tunable and enhanced electronic properties to achieve a thin-film, lead free, thermoelectric material with a near room-temperature figure-of-merit (ZT) of 0.21, the highest amongst all halide perovskite thermoelectrics. Our strategy provides an additional degree of freedom in the design of halide perovskites for optoelectronic and energy applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16851v1"
    ],
    "publication_venue": null
}