{
    "arxiv_id": "2303.13167",
    "paper_title": "Harnessing van der Waals CrPS4 and Surface Oxides for unique pre-set field induced Exchange Bias in Fe3GeTe2",
    "authors": [
        "Aravind Puthirath Balan",
        "Aditya Kumar",
        "Tanja Scholz",
        "Zhongchong Lin",
        "Aga Shahee",
        "Shuai Fu",
        "Thibaud Denneulin",
        "Andras Kovacs",
        "Rafal E. Dunin-Borkowski",
        "Hai I. Wang",
        "Jinbo Yang",
        "Bettina Lotsch",
        "Ulrich Nowak",
        "Mathias Klaeui"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-08-17"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Two-dimensional van der Waals (vdW) heterostructures are an attractive platform for studying exchange bias due to their defect free and atomically flat interfaces. Chromium thiophosphate (CrPS4), an antiferromagnetic material, possesses uncompensated magnetic spins in a single layer, rendering it a promising candidate for exploring exchange bias phenomena. Recent findings have highlighted that naturally oxidized vdW ferromagnetic Fe3GeTe2 exhibits exchange bias, attributed to the antiferromagnetic coupling of its ultrathin surface oxide layer (O-FGT) with the underlying unoxidized Fe3GeTe2. Anomalous Hall measurements are employed to scrutinize the exchange bias within the CrPS4/(O-FGT)/Fe3GeTe2 heterostructure. This analysis takes into account the contributions from both the perfectly uncompensated interfacial CrPS4 layer and the interfacial oxide layer. Remarkably, a distinct and non-monotonic exchange bias trend is observed as a function of temperature below 140 K. Intriguingly, a pre-set field-induced exchange bias suggests that the predominant phase in the polycrystalline surface oxide is ferrimagnetic Fe3O4. Moreover, the exchange bias induced by the ferrimagnetic Fe3O4 is significantly modulated by the presence of the van der Waals antiferromagnetic CrPS4 layer, forming a heterostructure, along with additional iron oxide phases within the oxide layer. These findings underscore the intricate and unique nature of exchange bias in van der Waals heterostructures, highlighting their potential for tailored manipulation and control.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13167v1",
        "http://arxiv.org/pdf/2303.13167v2"
    ],
    "publication_venue": null
}