{
    "arxiv_id": "2303.13085",
    "paper_title": "AstroSat and NuSTAR observations of XTE J1739-285 during the 2019-2020 outburst",
    "authors": [
        "Aru Beri",
        "Rahul Sharma",
        "Pinaki Roy",
        "Vishal Gaur",
        "Diego Altamirano",
        "Nils Andersson",
        "Fabian Gittins",
        "T. Celora"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "We report results from a study of XTE J1739-285, a transient neutron star low mass X-ray binary observed with AstroSat and NuSTAR during its 2019-2020 outburst. We detected accretion-powered X-ray pulsations at 386 Hz during very short intervals (0.5--1 s) of X-ray flares. These flares were observed during the 2019 observation of XTE J1739-285. During this observation, we also observed a correlation between intensity and hardness ratios, suggesting an increase in hardness with the increase in intensity. Moreover, a thermonuclear X-ray burst detected in our AstroSat observation during the 2020 outburst revealed the presence of coherent burst oscillations at 383 Hz during its decay phase. The frequency drift of 3 Hz during X-ray burst can be explained with r modes. Thus, making XTE J1739-285 belong to a subset of NS-LMXBs which exhibit both nuclear- and accretion-powered pulsations. The power density spectrum created using the AstroSat-LAXPC observations in 2020 showed the presence of a quasi-periodic oscillation at ~ 0.83 Hz. Our X-ray spectroscopy revealed significant changes in the spectra during the 2019 and 2020 outburst. We found a broad iron line emission feature in the X-ray spectrum during the 2020 observation, while this feature was relatively narrow and has a lower equivalent width in 2019,~when the source was accreting at higher rates than 2020.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13085v1"
    ],
    "publication_venue": "Accepted for publication in MNRAS, 13 pages",
    "doi": "10.1093/mnras/stad902"
}