{
    "arxiv_id": "2303.08838",
    "paper_title": "Surviving the Waves: evidence for a Dark Matter cusp in the tidally disrupting Small Magellanic Cloud",
    "authors": [
        "Michele De Leo",
        "Justin I. Read",
        "Noelia E. D. Noel",
        "Denis Erkal",
        "Pol Massana",
        "Ricardo Carrera"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We use spectroscopic data for ${\\sim}6,000$ Red Giant Branch (RGB) stars in the Small Magellanic Cloud (SMC), together with proper motion data from \\textit{Gaia} Early Data Release 3 (EDR3), to build a mass model of the SMC. We test our Jeans mass modelling method (\\textsc{Binulator}+\\textsc{GravSphere}) on mock data for an SMC-like dwarf undergoing severe tidal disruption, showing that we are able to successfully remove tidally unbound interlopers, recovering the Dark Matter density and stellar velocity anisotropy profiles within our 95\\% confidence intervals. We then apply our method to real SMC data, finding that the stars of the cleaned sample are isotropic at all radii (at 95\\% confidence), and that the inner Dark Matter density profile is dense, $ρ_{\\rm DM}(150\\,{\\rm pc}) = 2.81_{-1.07}^{+0.72}\\times 10^8 M_{\\odot} \\rm kpc^{-3} $, consistent with a $Λ$ Cold Dark Matter ($Λ$CDM) cusp at least down to 400\\,pc from the SMC's centre. Our model gives a new estimate of the SMC's total mass within 3\\,kpc ($M_{\\rm tot} \\leq 3\\,{\\rm kpc})$ of $2.34\\pm0.46 \\times 10^9 M_{\\odot}$. We also derive an astrophysical \\textquote{$J$-factor} of $19.22\\pm0.14$\\, GeV$^2$\\,cm$^{-5}$ and a \\textquote{$D$-factor} of $18.80\\pm0.03$\\, GeV$^2$\\,cm$^{-5}$, making the SMC a promising target for Dark Matter annihilation and decay searches. Finally, we combine our findings with literature measurements to test models in which Dark Matter is \\textquote{heated up} by baryonic effects. We find good qualitative agreement with the Di Cintio et al. 2014 model but we deviate from the Lazar et al. 2020 model at high $M_*/M_{200} > 10^{-2}$. We provide a new, analytic, density profile that reproduces Dark Matter heating behaviour over the range $10^{-5} < M_*/M_{200} < 10^{-1}$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08838v1"
    ],
    "publication_venue": "18 pages, 17 figures, submitted to MNRAS"
}