{
    "arxiv_id": "2303.11281",
    "paper_title": "Fixed Parameter Multi-Objective Evolutionary Algorithms for the W-Separator Problem",
    "authors": [
        "Samuel Baguley",
        "Tobias Friedrich",
        "Aneta Neumann",
        "Frank Neumann",
        "Marcus Pappik",
        "Ziena Zeif"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "math.CO"
    ],
    "abstract": "Parameterized analysis provides powerful mechanisms for obtaining fine-grained insights into different types of algorithms. In this work, we combine this field with evolutionary algorithms and provide parameterized complexity analysis of evolutionary multi-objective algorithms for the $W$-separator problem, which is a natural generalization of the vertex cover problem. The goal is to remove the minimum number of vertices such that each connected component in the resulting graph has at most $W$ vertices. We provide different multi-objective formulations involving two or three objectives that provably lead to fixed-parameter evolutionary algorithms with respect to the value of an optimal solution $OPT$ and $W$. Of particular interest are kernelizations and the reducible structures used for them. We show that in expectation the algorithms make incremental progress in finding such structures and beyond. The current best known kernelization of the $W$-separator uses linear programming methods and requires a non-trivial post-process to extract the reducible structures. We provide additional structural features to show that evolutionary algorithms with appropriate objectives are also capable of extracting them. Our results show that evolutionary algorithms with different objectives guide the search and admit fixed parameterized runtimes to solve or approximate (even arbitrarily close) the $W$-separator problem.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11281v1"
    ],
    "publication_venue": null
}