{
    "arxiv_id": "2303.09845",
    "paper_title": "The `blazar sequence' in TeV band",
    "authors": [
        "Zhihao Ouyang",
        "Hubing Xiao",
        "Jianzhen Chen",
        "Anton A. Strigachev",
        "Rumen S. Bachev",
        "Xiangtao Zeng",
        "Marina Manganaro",
        "Rui Xue",
        "Zelin Li",
        "Junhui Fan"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
    ],
    "abstract": "The `blazar sequence' has been proposed for more than 20 years, yet its nature is still unclear. In this work, for the first time, we expand this topic to the TeV band by using a sample of 58 TeV blazars including 48 blazars in the quiescent state and 21 blazars in the flaring state. We investigate the correlation between the TeV luminosity, which has been compensated for attenuation from extragalactic background light, and the synchrotron peak frequency. We note that there is no correlation between TeV luminosity and peak frequency in the quiescent state and a strong anti-correlation in the flaring state for the observed value. However, there is a strong positive correlation in both the quiescent state and the flaring state for the intrinsic value. This indicates that the blazar sequence is shown in the flaring state rather than in the quiescent state for the observed value and the blazar sequence is not present in both two states after removing the beaming effect. In addition, to confirm whether the beaming effect results in the blazar sequence, we compare the \\textit{Fermi} $γ$-ray luminosity between the quiescent state and the flaring state. We find the \\textit{Fermi} $γ$-ray luminosity in the flaring state is greater than that in the quiescent state and the Doppler factor in the flaring state is greater. We suggest the blazar sequence in the flaring state may be due to the stronger beaming effect.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09845v1"
    ],
    "publication_venue": "19 pages, 4 figures and 4 tables. Accepted to APJ",
    "doi": "10.3847/1538-4357/acc329"
}