{
    "arxiv_id": "2303.17275",
    "paper_title": "Viscous tubular-body theory for plane interfaces",
    "authors": [
        "Lyndon Koens",
        "Benjamin J. Walker"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn",
        "cond-mat.soft",
        "physics.bio-ph"
    ],
    "abstract": "Filaments are ubiquitous within the microscopic world. They occur frequently in both biological and industrial environments and display varied and rich dynamics. Their wide range of applications has spurred the development of a special branch of asymptotics focused on the behaviour of filaments, called slender-body theory. Slender-body theories are typically computationally efficient and focus on the mechanics of an isolated fibre that is not too curved. However, slender-body theories that work beyond these standard limits are needed to explore more complex systems. Recently, we developed tubular-body theory for slow viscous flows, an approach similar to slender-body theory that allows the hydrodynamic traction on any isolated cable-like body in a highly viscous fluid to be determined exactly. In this paper, we extend tubular-body theory to model filaments near plane interfaces by performing an similar expansion on the single-layer boundary integral equations for bodies by a plane interface. In the derivation of the new theory, called tubular-body theory for interfaces, we established a criteria for the convergence of the tubular-body theory series representation, before comparing the result to boundary integral simulations for a prolate spheroid by a wall. The tubular-body theory for interfaces simulations are found to capture the lubrication effects when close to the plane wall. Finally we simulate the hydrodynamics of a helix beneath a free interface and a plane wall to demonstrate the broad applicability of the technique.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17275v1"
    ],
    "publication_venue": null
}