{
    "arxiv_id": "2303.08429",
    "paper_title": "Chiral phonons and phononic birefringence in ferromagnetic metal - bulk acoustic resonator hybrids",
    "authors": [
        "Manuel Müller",
        "Johannes Weber",
        "Fabian Engelhardt",
        "Victor A. S. V. Bittencourt",
        "Thomas Luschmann",
        "Mikhail Cherkasskii",
        "Sebastian T. B. Goennenwein",
        "Silvia Viola Kusminskiy",
        "Stephan Geprägs",
        "Rudolf Gross",
        "Matthias Althammer",
        "Hans Huebl"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2024-01-25"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "Magnomechanical devices, in which magnetic excitations couple to mechanical vibrations, have been discussed as efficient and broadband microwave signal transducers in the classical and quantum limit. We experimentally investigate the magnetoelastic coupling between the ferromagnetic resonance (FMR) modes in a metallic Co$_{25}$Fe$_{75}$ thin film, featuring ultra-low magnetic damping as well as sizable magnetostriction, and standing transverse elastic phonon modes in sapphire, silicon and gadolinium gallium garnet by performing broadband FMR spectroscopy at cryogenic temperatures. For all these substrate materials, we observe an interaction between the resonant acoustic and magnetic modes, which can be tailored by the propagation direction of the acoustic mode with respect to the crystallographic axes. We identify these phonon modes as transverse shear waves propagating with slightly different velocities with relative magnitudes of $Δv/v\\simeq10^{-5}$, i.e., all substrates show phononic birefringence. Upon appropriately choosing the phononic mode, the hybrid magnomechanical system enters the Purcell enhanced coupling regime.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08429v1"
    ],
    "publication_venue": "7 oages, 4 figures",
    "doi": "10.1103/PhysRevB.109.024430"
}