{
    "arxiv_id": "2303.12039",
    "paper_title": "Observation of a Kondo impurity state and universal screening using a charge pseudospin",
    "authors": [
        "C. Piquard",
        "P. Glidic",
        "C. Han",
        "A. Aassime",
        "A. Cavanna",
        "U. Gennser",
        "Y. Meir",
        "E. Sela",
        "A. Anthore",
        "F. Pierre"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "cond-mat.str-el"
    ],
    "abstract": "The Kondo effect, deriving from a local magnetic impurity mediating electron-electron interactions, constitutes a flourishing basis for understanding a large variety of intricate many-body problems. Its experimental implementation in tunable circuits has made possible important advances through well-controlled investigations. However, these have mostly concerned transport properties, whereas thermodynamic observations - notably the fundamental measurement of the spin of the Kondo impurity - remain elusive in test-bed circuits. Here, with a novel combination of a \"charge\" Kondo circuit with a charge sensor, we directly observe the state of the impurity and its progressive screening. We establish the universal renormalization flow from a single free spin to a screened singlet, the associated reduction in the magnetization, and the relationship between scaling Kondo temperature and microscopic parameters. In our device, a Kondo pseudospin is realized by two degenerate charge states of a metallic island, which we measure with a non-invasive, capacitively coupled charge sensor. Such pseudospin probe of an engineered Kondo system opens the way to the thermodynamic investigation of many exotic quantum states, including the clear observation of Majorana zero modes through their fractional entropy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12039v1"
    ],
    "publication_venue": null
}