{
    "arxiv_id": "2303.08422",
    "paper_title": "Type Ia supernovae SN 2013bz, PSN J0910+5003 and ASASSN-16ex: similar to 09dc-like?",
    "authors": [
        "S. Tiwari",
        "N. K. Chakradhari",
        "D. K. Sahu",
        "G. C. Anupama",
        "B. Kumar",
        "K. R. Sahu"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "We present optical photometric and spectroscopic studies of three supernovae (SNe) SN 2013bz, PSN J0910+5003 and ASASSN-16ex. UV-optical photometric data of ASASSN-16ex obtained with Swift-UVOT are also analyzed. These objects were initially classified as 09dc-like type Ia SNe. The decline rate parameters ($Δm_{15}(B)_{true}$) are derived as 0.92 $\\pm$ 0.04 (SN 2013bz), 0.70 $\\pm$ 0.05 (PSN J0910+5003) and 0.73 $\\pm$ 0.03 (ASASSN-16ex). The estimated $B$ band absolute magnitudes at maximum: $-$19.61 $\\pm$ 0.20 mag for SN 2013bz, $-$19.44 $\\pm$ 0.20 mag for PSN J0910+5003 and $-$19.78 $\\pm$ 0.20 mag for ASASSN-16ex indicate that all the three objects are relatively bright. The peak bolometric luminosities for these objects are derived as $\\log L_\\text{bol}^\\text{max} =$ 43.38 $\\pm$ 0.07 erg s$^{-1}$, 43.26 $\\pm$ 0.07 erg s$^{-1}$ and 43.40 $\\pm$ 0.06 erg s$^{-1}$, respectively. The spectral and velocity evolution of SN 2013bz is similar to a normal SN Ia, hence it appears to be a luminous, normal type Ia supernova. On the other hand, the light curves of PSN J0910+5003 and ASASSN-16ex are broad and exhibit properties similar to 09dc-like SNe Ia. Their spectroscopic evolution shows similarity with 09dc-like SNe, strong CII lines are seen in the pre-maximum spectra of these two events. Their photospheric velocity evolution is similar to SN 2006gz. Further, in the UV bands, ASASSN-16ex is very blue like other 09dc-like SNe Ia.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08422v1"
    ],
    "publication_venue": "19 pages, 20 figures, accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad864"
}