{
    "arxiv_id": "2303.12397",
    "paper_title": "Edge Deep Learning Model Protection via Neuron Authorization",
    "authors": [
        "Jinyin Chen",
        "Tao Liu",
        "Rongchang Li",
        "Yao Cheng",
        "Xuhong Zhang",
        "Shouling Ji",
        "Haibin Zheng"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CR",
        "cs.AI"
    ],
    "abstract": "With the development of deep learning processors and accelerators, deep learning models have been widely deployed on edge devices as part of the Internet of Things. Edge device models are generally considered as valuable intellectual properties that are worth for careful protection. Unfortunately, these models have a great risk of being stolen or illegally copied. The existing model protections using encryption algorithms are suffered from high computation overhead which is not practical due to the limited computing capacity on edge devices. In this work, we propose a light-weight, practical, and general Edge device model Pro tection method at neuron level, denoted as EdgePro. Specifically, we select several neurons as authorization neurons and set their activation values to locking values and scale the neuron outputs as the \"asswords\" during training. EdgePro protects the model by ensuring it can only work correctly when the \"passwords\" are met, at the cost of encrypting and storing the information of the \"passwords\" instead of the whole model. Extensive experimental results indicate that EdgePro can work well on the task of protecting on datasets with different modes. The inference time increase of EdgePro is only 60% of state-of-the-art methods, and the accuracy loss is less than 1%. Additionally, EdgePro is robust against adaptive attacks including fine-tuning and pruning, which makes it more practical in real-world applications. EdgePro is also open sourced to facilitate future research: https://github.com/Leon022/Edg",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12397v1"
    ],
    "publication_venue": null
}