{
    "arxiv_id": "2303.13571",
    "paper_title": "Inheriting Bayer's Legacy-Joint Remosaicing and Denoising for Quad Bayer Image Sensor",
    "authors": [
        "Haijin Zeng",
        "Kai Feng",
        "Jiezhang Cao",
        "Shaoguang Huang",
        "Yongqiang Zhao",
        "Hiep Luong",
        "Jan Aelterman",
        "Wilfried Philips"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV",
        "eess.IV"
    ],
    "abstract": "Pixel binning based Quad sensors have emerged as a promising solution to overcome the hardware limitations of compact cameras in low-light imaging. However, binning results in lower spatial resolution and non-Bayer CFA artifacts. To address these challenges, we propose a dual-head joint remosaicing and denoising network (DJRD), which enables the conversion of noisy Quad Bayer and standard noise-free Bayer pattern without any resolution loss. DJRD includes a newly designed Quad Bayer remosaicing (QB-Re) block, integrated denoising modules based on Swin-transformer and multi-scale wavelet transform. The QB-Re block constructs the convolution kernel based on the CFA pattern to achieve a periodic color distribution in the perceptual field, which is used to extract exact spectral information and reduce color misalignment. The integrated Swin-Transformer and multi-scale wavelet transform capture non-local dependencies, frequency and location information to effectively reduce practical noise. By identifying challenging patches utilizing Moire and zipper detection metrics, we enable our model to concentrate on difficult patches during the post-training phase, which enhances the model's performance in hard cases. Our proposed model outperforms competing models by approximately 3dB, without additional complexity in hardware or software.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13571v1"
    ],
    "publication_venue": null
}