{
    "arxiv_id": "2303.12136",
    "paper_title": "Improving Fabrication Fidelity of Integrated Nanophotonic Devices Using Deep Learning",
    "authors": [
        "Dusan Gostimirovic",
        "Yuri Grinberg",
        "Dan-Xia Xu",
        "Odile Liboiron-Ladouceur"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "eess.IV",
        "physics.optics"
    ],
    "abstract": "Next-generation integrated nanophotonic device designs leverage advanced optimization techniques such as inverse design and topology optimization which achieve high performance and extreme miniaturization by optimizing a massively complex design space enabled by small feature sizes. However, unless the optimization is heavily constrained, the generated small features are not reliably fabricated, leading to optical performance degradation. Even for simpler, conventional designs, fabrication-induced performance degradation still occurs. The degree of deviation from the original design not only depends on the size and shape of its features, but also on the distribution of features and the surrounding environment, presenting complex, proximity-dependent behavior. Without proprietary fabrication process specifications, design corrections can only be made after calibrating fabrication runs take place. In this work, we introduce a general deep machine learning model that automatically corrects photonic device design layouts prior to first fabrication. Only a small set of scanning electron microscopy images of engineered training features are required to create the deep learning model. With correction, the outcome of the fabricated layout is closer to what is intended, and thus so too is the performance of the design. Without modifying the nanofabrication process, adding significant computation in design, or requiring proprietary process specifications, we believe our model opens the door to new levels of reliability and performance in next-generation photonic circuits.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12136v1"
    ],
    "publication_venue": "13 pages, 8 figures"
}