{
    "arxiv_id": "2303.09501",
    "paper_title": "On the origin of the non-detection of metastable HeI in the upper atmosphere of the hot Jupiter WASP-80b",
    "authors": [
        "L. Fossati",
        "I. Pillitteri",
        "I. F. Shaikhislamov",
        "A. Bonfanti",
        "F. Borsa",
        "I. Carleo",
        "G. Guilluy",
        "M. S. Rumenskikh"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "We aim to narrow down the origin of the non-detection of the metastable HeI triplet at about 10830 A obtained for the hot Jupiter WASP-80b. We measure the X-ray flux of WASP-80 from archival observations and use it as input to scaling relations accounting for the coronal [Fe/O] abundance ratio to infer the extreme-ultraviolet (EUV) flux in the 200-504 A range, which controls the formation of metastable HeI. We run three dimensional (magneto) hydrodynamic simulations of the expanding planetary upper atmosphere interacting with the stellar wind to study the impact on the HeI absorption of the stellar high-energy emission, the He/H abundance ratio, the stellar wind, and the possible presence of a planetary magnetic field up to 1 G. For a low stellar EUV emission, which is favoured by the measured logR'HK value, the HeI non-detection can be explained by a solar He/H abundance ratio in combination with a strong stellar wind, or by a sub-solar He/H abundance ratio, or by a combination of the two. For a high stellar EUV emission, the non-detection implies a sub-solar He/H abundance ratio. A planetary magnetic field is unlikely to be the cause of the non-detection. The low EUV stellar flux, driven by the low [Fe/O] coronal abundance, is the likely primary cause of the HeI non-detection. High-quality EUV spectra of nearby stars are urgently needed to improve the accuracy of high-energy emission estimates, which would then enable one to employ the observations to constrain the planetary He/H abundance ratio and the stellar wind strength. This would greatly enhance the information that can be extracted from HeI atmospheric characterisation observations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09501v1"
    ],
    "publication_venue": "Accepted for publication on A&A, 20 pages",
    "doi": "10.1051/0004-6361/202245667"
}