{
    "arxiv_id": "2303.16311",
    "paper_title": "Thermodynamic Interpretaion of Entanglement in Canonical Nonlinearity",
    "authors": [
        "Koretaka Yuge"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.stat-mech"
    ],
    "abstract": "For classical discrete system under constant composition, typically reffered to as substitutional alloys, canonical average acts as nonlinear map F from a set of potential energy surface U to that of microscopic configuration in thermodynamic equilibrium, Q, which is called canonical nonlinearity (CN). On statistical manifold, at any given configuration, F can be divided into the sum of local and non-local contribution in terms of Kullback-Leibler (KL) divergence, where the former has strong positive correlation with time evolution of the nonlinearity (NOL) on configuration space (called anharmonicity in structural degree of freedoms (ASDF), while the latter, corresponding to entanglement in SDFs, does exhibit clear correlation with the ASDF. On the other hand, our recent work bridge the different concepts of NOL on configuration space and statistical manifold through stochastic thermodynamics. While the work successfully provides clear relationships between the changes in total NOL through system transition and heat transfer, thermodynamic interpretation of how the entanglment in SDFs contributes to thermodynamic functions, is totally unclear due mainly to its non-trivial, non-local character. The present study tackle this problem, deriving upper bound for the entanglement for any given transition in terms of the mutual information, heat transfer and free energy. The present thermodynamic interpretaion will provide quantitative description of how the entanglement in SDFs is dominated by configuration of ground-state structures on configuration space.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16311v1"
    ],
    "publication_venue": "4 pages, 1 figure"
}