{
    "arxiv_id": "2303.11263",
    "paper_title": "A young white dwarf orbiting PSR J1835-3259B in the bulge globular cluster NGC 6652",
    "authors": [
        "J. Chen",
        "M. Cadelano",
        "C. Pallanca",
        "F. Ferraro",
        "B. Lanzoni",
        "A. Istrate",
        "M. Burgay",
        "P. Freire",
        "T. Gautam",
        "A. Possenti",
        "A. Ridolfi"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
    ],
    "abstract": "We report on the discovery of the companion star to the millisecond pulsar PSR J1835-3259B in the Galactic globular cluster NGC 6652. Taking advantage of deep photometric archival observations acquired through the Hubble Space Telescope in near-ultraviolet and optical bands, we identified a bright and blue object at a position compatible with that of the radio pulsar. The companion is located along the helium-core white dwarf cooling sequence and the comparison with binary evolution models provides a mass of $0.17 \\pm 0.02~M_\\odot$, a surface temperature of $11500\\pm1900$ K and a very young cooling age of only $200\\pm100$ Myr. The mass and the age of the companion are compatible with a progenitor star of about $0.87~M_{\\odot}$, which started transferring mass to the primary during its evolution along the sub-giant branch and stopped during the early red giant branch phase. Combining together the pulsar mass function and the companion mass, we found that this system is observed at an almost edge-on orbit and hosts a neutron star with a mass of $1.44 \\pm 0.06~M_\\odot$, thus suggesting a highly non-conservative mass accretion phase. The young age of the WD companion is consistent with the scenario of a powerful, relatively young MSP indicated by the earlier detection of gamma-rays from this system.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11263v1"
    ],
    "publication_venue": "11 pages, 7 figures, accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc583"
}