{
    "arxiv_id": "2303.10518",
    "paper_title": "Terahertz-to-infrared converters for imaging the human skin cancer: challenges and feasibility",
    "authors": [
        "Kamil Moldosanov",
        "Alexander Bykov",
        "Nurlanbek Kairyev",
        "Mikhail Khodzitsky",
        "Grigory Kropotov",
        "Valery Lelevkin",
        "Igor Meglinski",
        "Andrei Postnikov",
        "Alexey Shakhmin"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.med-ph"
    ],
    "abstract": "Purpose: The terahertz (THz) medical imaging is a promising noninvasive technique for monitoring the skin's conditions, early detection of the human skin cancer, and recovery from burns and wounds. It can be applied for visualization of healing process directly through clinical dressings and restorative ointments, minimizing the frequency of dressing changes. The THz imaging technique is cost effective, as compared to the magnetic resonance method. Our aim was to develop an approach capable of providing better image resolution than the commercially available THz imaging cameras. Approach: The terahertz-to-infrared (THz-to-IR) converters can visualize the human skin cancer by converting the latter's specific contrast patterns recognizable in THz radiation range into IR patterns, detectable by a standard IR imaging camera. At the core of suggested THz-to-IR converters are flat matrices transparent both in the THz range to be visualized and in the operating range of the IR camera; these matrices contain embedded metal nanoparticles, which, when irradiated with THz rays, convert the energy of THz photons into heat and become nanosources of IR radiation detectable by an IR camera. Results: The ways of creating the simplest converter, as well as a more complex converter with wider capabilities, are considered. The first converter is a gelatin matrix with gold 8.5 nm diameter nanoparticles, the second is a polystyrene matrix with 2 nm diameter nanoparticles from copper-nickel MONEL (c) alloy 404. Conclusions: An approach with a THz-to-IR converter equipped with an IR camera is promising in that it could provide a better image of oncological pathology than the commercially available THz imaging cameras do.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10518v1"
    ],
    "publication_venue": "48 pages, 15 figures",
    "doi": "10.1117/1.JMI.10.2.023501"
}