{
    "arxiv_id": "2303.11072",
    "paper_title": "Violation of Emergent Rotational Symmetry in the Hexagonal Kagome Superconductor CsV3Sb5",
    "authors": [
        "Kazumi Fukushima",
        "Keito Obata",
        "Soichiro Yamane",
        "Yajian Hu",
        "Yongkai Li",
        "Yugui Yao",
        "Zhiwei Wang",
        "Yoshiteru Maeno",
        "Shingo Yonezawa"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2024-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con",
        "cond-mat.mtrl-sci",
        "cond-mat.str-el"
    ],
    "abstract": "Superconductivity is caused by electron pairs that are canonically isotropic, whereas some exotic superconductors are known to exhibit non-trivial anisotropy stemming from unconventional pairings. However, superconductors with hexagonal symmetry, the highest rotational symmetry allowed in crystals, exceptionally have strong constraint that is called emergent rotational symmetry (ERS): anisotropic properties should be very weak especially near the critical temperature Tc even for unconventional pairings such as d-wave states. Here, we investigate superconducting anisotropy of the recently-found hexagonal Kagome superconductor CsV3Sb5, which is known to exhibit various intriguing phenomena originating from its undistorted Kagome lattice formed by vanadium atoms. Based on calorimetry performed under accurate two-axis field-direction control, we discover a combination of six- and two-fold anisotropies in the in-plane upper critical field. Both anisotropies, robust up to very close to Tc, are beyond predictions of standard theories. We infer that this clear ERS violation with nematicity is best explained by multi-component nematic superconducting order parameter in CsV3Sb5 intertwined with symmetry breakings caused by the underlying charge-density-wave order.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11072v1"
    ],
    "publication_venue": "35 pages, 5 figures, 1 table, 7 extended figures",
    "doi": "10.1038/s41467-024-47043-8"
}