{
    "arxiv_id": "2303.17733",
    "paper_title": "Physics of Automated-Driving Vehicular Traffic",
    "authors": [
        "Boris S. Kerner"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-07-19"
    ],
    "latest_version": 1,
    "categories": [
        "physics.soc-ph",
        "nlin.CG"
    ],
    "abstract": "We have found that a variety of phase transitions occurring between three traffic phases (free flow (F), synchronized flow (S), and wide moving jam (J)) determine the spatiotemporal dynamics of traffic consisting of 100% automated-driving vehicles moving on a two-lane road with an on-ramp bottleneck. This means that three-phase traffic theory is a common framework for the description of traffic states independent of whether human-driving or automated-driving vehicles move in vehicular traffic. To prove this, we have studied automated-driving vehicular traffic with the use of classical Helly's model (1959) widely applied for automated vehicle motion. Although dynamic rules of the motion of automated-driving vehicles in a road lane are qualitatively different from those of human-driving vehicles, we have revealed that a free-flow-to-synchronized-flow transition (F$\\rightarrow$S transition) exhibits the nucleation nature, which was observed in empirical field data measured in traffic consisting of 100% human-driving vehicles. The physics of the nucleation nature of the F$\\rightarrow$S transition in automated-driving traffic is associated with a discontinuity in the rate of lane-changing that causes the discontinuity in the rate of over-acceleration. This discontinuous character of over-acceleration leads to both the existence and self-maintaining of synchronized flow at the bottleneck in automated-driving vehicular traffic as well as to the existence at any time instant of a range of highway capacities between some minimum and maximum capacities. Within the capacity range, an F$\\rightarrow$S transition can be induced; however, when the maximum capacity is exceeded, then after some time-delay a spontaneous F$\\rightarrow$S transition occurs at the bottleneck. The phases F, S, and J can coexist each other in space and time.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17733v1"
    ],
    "publication_venue": "25 pages, 37 figures",
    "doi": "10.1103/PhysRevE.108.014302"
}