{
    "arxiv_id": "2303.11321",
    "paper_title": "The ALMA REBELS Survey: The First Infrared Luminosity Function Measurement at $\\mathbf{z \\sim 7}",
    "authors": [
        "L. Barrufet",
        "P. A. Oesch",
        "R. Bouwens",
        "H. Inami",
        "L. Sommovigo",
        "H. Algera",
        "E. da Cunha",
        "M. Aravena",
        "P. Dayal",
        "A. Ferrara",
        "Y. Fudamoto",
        "V. Gonzalez",
        "L. Graziani",
        "A. Hygate",
        "I. de Looze",
        "T. Nanayakkara",
        "A. Pallottini",
        "R. Schneider",
        "M. Stefanon",
        "M. Topping",
        "P. van Der Werf"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present the first observational infrared luminosity function (IRLF) measurement in the Epoch of Reionization (EoR) based on a UV-selected galaxy sample with ALMA spectroscopic observations. Our analysis is based on the ALMA large program Reionization Era Bright Emission Line Survey (REBELS), which targets 42 galaxies at $\\mathrm{z=6.4-7.7}$ with [CII] 158$\\micron$ line scans. 16 sources exhibit a dust detection, 15 of which are also spectroscopically confirmed through the [CII] line. The IR luminosities of the sample range from $\\log L_{IR}/L_\\odot=11.4$ to 12.2. Using the UVLF as a proxy to derive the effective volume for each of our target sources, we derive IRLF estimates, both for detections and for the full sample including IR luminosity upper limits. The resulting IRLFs are well reproduced by a Schechter function with the characteristic luminosity of $\\log L_{*}/L_\\odot=11.6^{+0.2}_{-0.1}$. Our observational results are in broad agreement with the average of predicted IRLFs from simulations at $z\\sim7$. Conversely, our IRLFs lie significantly below lower redshift estimates, suggesting a rapid evolution from $z\\sim4$ to $z\\sim7$, into the reionization epoch. The inferred obscured contribution to the cosmic star-formation rate density at $z\\sim7$ amounts to $\\mathrm{log(SFRD/M_{\\odot}/yr/Mpc^{3}) = -2.66^{+0.17}_{-0.14} }$ which is at least $\\sim$10\\% of UV-based estimates. We conclude that the presence of dust is already abundant in the EoR and discuss the possibility of unveiling larger samples of dusty galaxies with future ALMA and JWST observations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11321v1"
    ],
    "publication_venue": "9 pages, 5 figures",
    "doi": "10.1093/mnras/stad1259"
}