{
    "arxiv_id": "2303.12184",
    "paper_title": "Valley-dependent topological edge states in plasma photonic crystals",
    "authors": [
        "Jianfei Li",
        "Chen Zhou",
        "Jingfeng Yyao",
        "Chengxun Yuan",
        "Ying Wang",
        "Zhongxiang Zhou",
        "Jingwen Zhang",
        "Anatoly A. Kudryavtsev"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "physics.plasm-ph",
        "physics.optics"
    ],
    "abstract": "Plasma photonic crystals designed in this paper are composed of gas discharge tubes to control the flow of electromagnetic waves. The band structures calculated by the finite element method are consistent with the experimental results in that two distinct attenuation peaks appear in the ranges of 1 GHz to 2.5 GHz and 5 GHz to 6 GHz. Electromagnetic parameters of the plasma are extracted by the Nicolson-Ross-Weir method and effective medium theory. The measured electron density is between 1e11 cm-3 and 1e12 cm-3, which verifies the correctness of the parameter used in the simulation, and the collision frequency is near 1.5e10 Hz. As the band structures are corroborated by the measured scattering parameters, we introduce the concept of photonic topological insulator based on the quantum Valley Hall effect into the plasma photonic crystal. A valley-dependent plasma photonic crystal with hexagonal lattice is constructed, and the phase transition of the valley K(K') occurs by breaking the spatial inversion symmetry. Valley-spin locked topological edge states are generated and excited by chiral sources. The frequency of the non-bulk state can be dynamically regulated by the electron density. This concept paves the way for novel, tunable topological edge states. More interestingly, the Dirac cone is broken when the electron density increases to 3.1e12 cm-3, which distinguishes from the methods of applying a magnetic field and changing the symmetry of the point group.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12184v1"
    ],
    "publication_venue": null,
    "doi": "10.1088/2058-6272/ac9347"
}