{
    "arxiv_id": "2303.08370",
    "paper_title": "Harnessing Low-Frequency Neural Fields for Few-Shot View Synthesis",
    "authors": [
        "Liangchen Song",
        "Zhong Li",
        "Xuan Gong",
        "Lele Chen",
        "Zhang Chen",
        "Yi Xu",
        "Junsong Yuan"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Neural Radiance Fields (NeRF) have led to breakthroughs in the novel view synthesis problem. Positional Encoding (P.E.) is a critical factor that brings the impressive performance of NeRF, where low-dimensional coordinates are mapped to high-dimensional space to better recover scene details. However, blindly increasing the frequency of P.E. leads to overfitting when the reconstruction problem is highly underconstrained, \\eg, few-shot images for training. We harness low-frequency neural fields to regularize high-frequency neural fields from overfitting to better address the problem of few-shot view synthesis. We propose reconstructing with a low-frequency only field and then finishing details with a high-frequency equipped field. Unlike most existing solutions that regularize the output space (\\ie, rendered images), our regularization is conducted in the input space (\\ie, signal frequency). We further propose a simple-yet-effective strategy for tuning the frequency to avoid overfitting few-shot inputs: enforcing consistency among the frequency domain of rendered 2D images. Thanks to the input space regularizing scheme, our method readily applies to inputs beyond spatial locations, such as the time dimension in dynamic scenes. Comparisons with state-of-the-art on both synthetic and natural datasets validate the effectiveness of our proposed solution for few-shot view synthesis. Code is available at \\href{https://github.com/lsongx/halo}{https://github.com/lsongx/halo}.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08370v1"
    ],
    "publication_venue": null
}