{
    "arxiv_id": "2303.11962",
    "paper_title": "Dissipative ground state preparation and the Dissipative Quantum Eigensolver",
    "authors": [
        "Toby S. Cubitt"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "math-ph"
    ],
    "abstract": "For any local Hamiltonian H, I construct a local CPT map and stopping condition which converges to the ground state subspace of H. Like any ground state preparation algorithm, this algorithm necessarily has exponential run-time in general (otherwise BQP=QMA), even for gapped, frustration-free Hamiltonians (otherwise BQP is in NP). However, this dissipative quantum eigensolver has a number of interesting characteristics, which give advantages over previous ground state preparation algorithms.\n  - The entire algorithm consists simply of iterating the same set of local measurements repeatedly.\n  - The expected overlap with the ground state subspace increases monotonically with the length of time this process is allowed to run.\n  - It converges to the ground state subspace unconditionally, without any assumptions on or prior information about the Hamiltonian.\n  - The algorithm does not require any variational optimisation over parameters.\n  - It is often able to find the ground state in low circuit depth in practice.\n  - It has a simple implementation on certain types of quantum hardware, in particular photonic quantum computers.\n  - The process is immune to errors in the initial state.\n  - It is inherently error- and noise-resilient, i.e. to errors during execution of the algorithm and also to faulty implementation of the algorithm itself, without incurring any computational overhead: the overlap of the output with the ground state subspace degrades smoothly with the error rate, independent of the algorithm's run-time.\n  I give rigorous proofs of the above claims, and benchmark the algorithm on some concrete examples numerically.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11962v1"
    ],
    "publication_venue": "58 pages, 6 tables+figures, 58 theorems etc"
}