{
    "arxiv_id": "2303.16183",
    "paper_title": "Aspect ratios of far-infrared and H i filaments in the diffuse interstellar medium at high Galactic latitudes",
    "authors": [
        "P. M. W. Kalberla",
        "U. Haud"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Dusty magnetized structures observable in the far-infrared (FIR) at high Galactic latitudes are ubiquitous and found to be closely related to HI filaments with coherent velocity structures. Considering dimensionless morphological characteristics based on Minkowski functionals, we determine the distribution of filamentarities $F$ and aspect ratios $A$ for these structures. Our data are based on Planck FIR and HI4PI HI observations. Filaments have previously been extracted by applying the Hessian operator. We trace individual filamentary structures along the plane of the sky and determine $A$ and $F$. Filaments in the diffuse interstellar medium (ISM) are seldom isolated structures, but are rather part of a network of filaments with a well-defined, continuous distribution in $A$ and $F$. This distribution is self-replicating, and the merger or disruption of individual filamentary structures leads only to a repositioning of the filament in $A$ and $F$ without changing the course of the distribution. FIR and HI filaments identified at high Galactic latitudes are a close match to model expectations for narrow filaments with approximately constant widths. This distribution is continuous without clear upper limits on the observed aspect ratios. Filaments are associated with enhanced column densities of CO-dark $H_2$. Radial velocities along the filaments are coherent and mostly linear with typical dispersions of $Δv_{\\mathrm{LSR}} = 5.24 $ km/s. The magnetic field strength in the diffuse turbulent ISM scales with hydrogen volume density as $B \\propto n_{\\mathrm{H}}^{0.58} $. At high Galactic latitudes, we determine an average turbulent magnetic field strength of $\\langle δB \\rangle = 5.3 ~μ$G and an average mean strength of the magnetic field in the plane of the sky of $\\langle B_{\\mathrm{POS}} \\rangle = 4.4 ~μ$G.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16183v1"
    ],
    "publication_venue": "22 pages, 30 figures",
    "doi": "10.1051/0004-6361/202245200"
}