{
    "arxiv_id": "2303.11813",
    "paper_title": "Conformational and state-specific effects in reactions of 2,3-dibromobutadiene with Coulomb-crystallized calcium ions",
    "authors": [
        "Ardita Kilaj",
        "Silvan Käser",
        "Jia Wang",
        "Patrik Straňák",
        "Max Schwilk",
        "Lei Xu",
        "O. Anatole von Lilienfeld",
        "Jochen Küpper",
        "Markus Meuwly",
        "Stefan Willitsch"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph"
    ],
    "abstract": "Recent advances in experimental methodology enabled studies of the quantum-state and conformational dependence of chemical reactions under precisely controlled conditions in the gas phase. Here, we generated samples of selected gauche and s-trans 2,3-dibromobutadiene (DBB) by electrostatic deflection in a molecular beam and studied their reaction with Coulomb crystals of laser-cooled $\\mathrm{Ca^{+}}$ ions in an ion trap. The rate coefficients for the total reaction were found to strongly depend on both the conformation of DBB and the electronic state of $\\mathrm{Ca^{+}}$. In the $\\mathrm{(4p)~^{2}P_{1/2}}$ and $\\mathrm{(3d)~^{2}D_{3/2}}$ excited states of $\\mathrm{Ca^{+}}$, the reaction is capture-limited and faster for the gauche conformer due to long-range ion-dipole interactions. In the $\\mathrm{(4s)~^{2}S_{1/2}}$ ground state of $\\mathrm{Ca^{+}}$, the reaction rate for s-trans DBB still conforms with the capture limit, while that for gauche DBB is strongly suppressed. The experimental observations were analysed with the help of adiabatic capture theory, ab-initio calculations and reactive molecular dynamics simulations on a machine-learned full-dimensional potential energy surface of the system. The theory yields near-quantitative agreement for s-trans-DBB, but overestimates the reactivity of the gauche-conformer compared to the experiment. The present study points to the important role of molecular geometry even in strongly reactive exothermic systems and illustrates striking differences in the reactivity of individual conformers in gas-phase ion-molecule reactions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11813v1"
    ],
    "publication_venue": null,
    "doi": "10.1039/D3CP01416A"
}