{
    "arxiv_id": "2303.13138",
    "paper_title": "Online search is more likely to lead students to validate true news than to refute false ones",
    "authors": [
        "Azza Bouleimen",
        "Luca Luceri",
        "Felipe Cardoso",
        "Luca Botturi",
        "Martin Hermida",
        "Loredana Addimando",
        "Chiara Beretta",
        "Marzia Galloni",
        "Silvia Giordano"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CY"
    ],
    "abstract": "With the spread of high-speed Internet and portable smart devices, the way people access and consume information has drastically changed. However, this presents many challenges, including information overload, personal data leakage, and misinformation diffusion. Across the spectrum of risks that Internet users can face nowadays, this work focuses on understanding how young people perceive and deal with false information. Within an experimental campaign involving 261 students, we presented to the participants six different news items and invited them to browse the Internet to assess the veracity of the presented information. Our results suggest that online search is more likely to lead students to validate true news than to refute false ones. We found that students change their opinion related to a specific piece of information more often than their global idea about a broader topic. Also, our experiment reflected that the majority of participants rely on online sources to obtain information and access the news, and those getting information from books and Internet browsing are the most accurate in assessing the veracity of a news item. This work provides a principled understanding of how young people perceive and distinguish true and false pieces of information, identifying strengths and weaknesses amidst young subjects and contributing to build tailored digital information literacy strategies for youth.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13138v1"
    ],
    "publication_venue": null
}