{
    "arxiv_id": "2303.08390",
    "paper_title": "Photometric and Spectroscopic monitoring of YSOs in nearby star forming regions. I. Eruptive YSOs",
    "authors": [
        "Carlos Contreras Peña",
        "Gregory J. Herczeg",
        "Mizna Ashraf",
        "Jessy Jose",
        "Ho-Gyu Lee",
        "Doug Johnstone",
        "Jeong-Eun Lee",
        "Xing-yu Zhou",
        "Hanpu Liu",
        "Sung-Yong Yoon"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-04-19"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Mid-infrared (mid-IR) variability in young stellar objects (YSOs) is driven by several physical mechanisms, which produce a variety of amplitudes and light curve shapes. One of these mechanisms, variable disk accretion is predicted by models of episodic accretion to drive secular variability, including in the mid-IR. Because the largest accretion bursts are rare, adding new objects to the YSO eruptive variable class aids our understanding of the episodic accretion phenomenon and its possible impact on stellar and planetary formation. A previous analysis of 6.5 yr of NeoWISE light curves (3-5 $μ$m) of ~7000 nearby YSOs found an increase in the fraction of variability and variability amplitude for objects at younger stages of evolution. To help interpret these light curves, we have obtained low- and high-resolution near-IR spectra of 78 objects from this sample of YSOs. In this work, we present the analysis of nine nearby YSOs (d$<$1 kpc) that show the characteristics of known classes of eruptive variable YSOs. We find one FUor-like source, one EX Lupi-type object, and six YSOs with mixed characteristics, or V1647 Ori-like objects. The varied characteristics observed in our sample are consistent with recent discoveries of eruptive YSOs. We discuss how a wide range in YSO outburst parameters (central mass, maximum accretion rate during outburst, evolutionary stage and/or instability leading to the outburst) may play a significant role in the observed spectro-photometric properties of YSO outbursts.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08390v1"
    ],
    "publication_venue": "17 pages, 7 figures, accepted for publication in MNRAS on 14 March 2023",
    "doi": "10.1093/mnras/stad820"
}