{
    "arxiv_id": "2303.09425",
    "paper_title": "Velocity measurement in the extensive [OIII] emission region 1.2° south-east of M31",
    "authors": [
        "P. Amram",
        "C. Adami",
        "B. Epinat",
        "L. Chemin"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "The discovery of a broad, $\\sim$1.5$^{\\circ}$ long filamentary [OIII] 5007 emission $\\sim$1.2$^{\\circ}$ south-east of the M31 nucleus has recently been reported. More than 100 hours of exposures of a wide field (3.48$^{\\circ} \\times 2.32^{\\circ}$) have allowed this pioneering detection based on 30 Å narrow-band filters and several small refractors equipped with large cameras. We report a first velocity measurement in this extensive [OIII] emission line region. We used the low-resolution spectrograph MISTRAL (R $\\sim$ 750), a facility of the Haute-Provence Observatory 193 cm telescope. The velocity measurement is based on the H$α$, [NII], [SII] and [OIII] lines. The best solution to fit the spectrum indicates that the H$α$ and [OIII] emissions are at the same heliocentric line-of-sight velocity of -96$\\pm$4 km s$^{-1}$. This was measured within an area of $\\sim$250 arcsec$^2$ selected on a bright knot along the long filament of $\\sim$1.5$^{\\circ}$, together with a [OIII]5007 surface brightness of 4.2$\\pm$2.1 10$^{-17}$ erg s$^{-1}$ cm$^{-2}$ arcsec$^{-2}$. This agrees moderately well with the previous measurement. We also estimated the H$α$/[NII] line ratio as $\\sim$1.1. The radial velocities at which the H$α$ and [OIII] lines were detected seem to show that these hydrogen and oxygen atoms belong to the same layer, but we cannot exclude that another weaker [OIII] line, belonging to another structure, that is, at another velocity, is below our detection threshold. Different scenarios have been considered to explain this filamentary structure...",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09425v1"
    ],
    "publication_venue": "8 pages, 5 figures, A&A letters, Accepted",
    "doi": "10.1051/0004-6361/202346311"
}