{
    "arxiv_id": "2303.15236",
    "paper_title": "Grain Boundary Softening from Stress Assisted Helium Cavity Coalescence in Ultrafine-Grained Tungsten",
    "authors": [
        "W. S. Cunningham",
        "Y. Zhang",
        "S. L. Thomas",
        "O. El-Atwani",
        "Y. Wang",
        "J. R. Trelewicz"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "The formation of helium cavities in coarse-grained materials produces hardening proportional to the number density and size of the cavities and due to the interaction of dislocations with intragranular helium defects. In nanostructured metals containing a high density of interfacial sinks, preferential cavity formation on the grain boundaries instead produces softening and often attributed to enhanced interfacial plasticity. Employing two grades of ultrafine-grained tungsten, we explore this effect using targeted implantation studies to map cavity evolution as a function of the irradiation conditions and quantify its impact on the mechanical response through nanoindentation. Softening is reported at implantation temperatures above the threshold for preferential grain boundary cavity formation but at a sufficiently low fluence prior to the growth of intragranular cavities. Collective changes in the mean cavity size, density, and morphology beneath a residual impression on an implanted surface indicate that cavity coalescence accompanied the reduction in hardness. Complementary atomistic simulations demonstrate that, in tungsten grain structures exhibiting softening, grain boundary bubble coalescence is driven by stress concentrations that further act to localize strain in the grain boundaries through cooperative deformation processes involving local atomic shuffling and sliding, dislocation emission, and even the nucleation of unstable twinning events.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15236v1"
    ],
    "publication_venue": null
}