{
    "arxiv_id": "2303.08519",
    "paper_title": "Stellar Cycles in Fully Convective Stars and a New Interpretation of Dynamo Evolution",
    "authors": [
        "Zackery A. Irving",
        "Steven H. Saar",
        "Bradford J. Wargelin",
        "José-Dias do Nascimento"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-06-14"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "An $αΩ$ dynamo, combining shear and cyclonic convection in the tachocline, is believed to generate the solar cycle. However, this model cannot explain cycles in fast rotators (with minimal shear) or in fully convective stars (no tachocline); analysis of such stars could therefore provide key insights into how these cycles work. We reexamine ASAS data for 15 M dwarfs, 11 of which are presumed fully convective; the addition of newer ASAS-SN data confirms cycles in roughly a dozen of them, while presenting new or revised rotation periods for five. The amplitudes and periods of these cycles follow $A_{\\rm cyc} \\propto P_{\\rm cyc}^{0.94 \\pm 0.11}$, with $P_{\\rm cyc}/P_{\\rm rot} \\propto {\\rm Ro}^{-1.02 \\pm 0.06}$ (where Ro is the Rossby number), very similar to $P_{\\rm cyc}/P_{\\rm rot} \\propto {\\rm Ro}^{-0.81 \\pm 0.17}$ that we find for 40 previously studied FGK stars, although $P_{\\rm cyc}/P_{\\rm rot}$ and $α$ are a factor of $\\sim$20 smaller in the M stars. The very different $P_{\\rm cyc}/P_{\\rm rot}$-Ro relationship seen here compared to previous work suggests that two types of dynamo, with opposite Ro dependences, operate in cool stars. Initially, a (likely $α^2$ or $α^2Ω$) dynamo operates throughout the convective zone in mid-late M and fast rotating FGK stars, but once magnetic breaking decouples the core and convective envelope, a tachocline $αΩ$ dynamo begins and eventually dominates in older FGK stars. A change in $α$ in the tachocline dynamo generates the fundamentally different $P_{\\rm cyc}/P_{\\rm rot}$-Ro relationship.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08519v1"
    ],
    "publication_venue": "26 pages, 18 figures, submitted to ApJ. Figure sets will be available in the final print",
    "doi": "10.3847/1538-4357/acc468"
}