{
    "arxiv_id": "2303.12344",
    "paper_title": "Processing of hydroxylamine, NH2OH, an important prebiotic precursor, on interstellar ices",
    "authors": [
        "Gerán Molpeceres",
        "Víctor. M. Rivilla",
        "Kenji Furuya",
        "Johannes Kästner",
        "Belén Maté",
        "Yuri Aikawa"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Hydroxylamine, NH2OH, is one of the already detected interstellar molecules with the highest prebiotic potential. Yet, the abundance of this molecule found by astronomical observations is rather low for a relatively simple molecule, $\\sim$ 10$^{-10}$ relative to H2. This seemingly low abundance can be rationalized by destruction routes operating on interstellar dust grains. In this work, we tested the viability of this hypothesis under several prisms, finding that the origin of a lower abundance of \\ce{NH2OH} can be explained by two chemical processes, one operating at low temperature (10 K) and the other at intermediate temperature (20 K). At low temperatures, enabling the hydrogen abstraction reaction HNO + H -> NO + H2, even in small amounts, partially inhibits the formation of NH2OH through successive hydrogenation of NO, and reduces its abundance on the grains. We found that enabling a 15--30 % of binding sites for this reaction results in reductions of \\ce{NH2OH} abundance of $\\sim$ 1-2 orders of magnitude. At warmer temperatures (20 K, in our study), the reaction NH2OH + H -> HNOH + H2, which was found to be fast (k$\\sim$10$^{6}$ s$^{-1}$) in this work, followed by further abstractions by adsorbates that are immobile at 10 K (O, N) are the main route of \\ce{NH2OH} destruction. Our results shed light on the abundance of hydroxylamine in space and pave the way to constraining the subsequent chemistry experienced by this molecule and its derivatives in the interstellar prebiotic chemistry canvas.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12344v1"
    ],
    "publication_venue": "Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad892"
}