{
    "arxiv_id": "2303.17128",
    "paper_title": "Stirred but not shaken: a multi-wavelength view of HD 16743's debris disc",
    "authors": [
        "Jonathan P. Marshall",
        "Julien Milli",
        "Elodie Choquet",
        "Carlos del Burgo",
        "Grant M. Kennedy",
        "Francisca Kemper",
        "Mark C. Wyatt",
        "Quentin Kral",
        "Remi Soummer"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Planetesimals -- asteroids and comets -- are the building blocks of planets in protoplanetary discs and the source of dust, ice and gas in debris discs. Along with planets they comprise the left-over material after star formation that constitutes a planetary system. Planets influence the dynamics of planetesimals, sculpting the orbits of debris belts to produce asymmetries or gaps. We can constrain the architecture of planetary systems, and infer the presence of unseen planetary companions, by high spatial resolution imaging of debris discs. HD~16743 is a relatively young F-type star that hosts a bright edge-on debris disc. Based on far-infrared \\textit{Herschel} observations its disc was thought to be stirred by a planetary companion. Here we present the first spatially resolved observations at near-infrared and millimetre wavelengths with \\textit{HST} and ALMA, revealing the disc to be highly inclined at $87\\fdg3~^{+1\\fdg9}_{-2\\fdg5}$ with a radial extent of 157.7$^{+2.6}_{-1.5}$~au and a FWHM of 79.4$^{+8.1}_{-7.8}$~au ($ΔR/R = 0.5$). The vertical scale height of the disc is $0.13~\\pm~0.02$, significantly greater than typically assumed unstirred value of 0.05, and could be indicative of stirring of the dust-producing planetesimals within the disc by bodies at least a few times the mass of Pluto up to 18.3~$M_{\\oplus}$ in the single object limit.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17128v1"
    ],
    "publication_venue": "12 pages, 7 figures, 4 tables, accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad913"
}