{
    "arxiv_id": "2303.11035",
    "paper_title": "Total Electron Temperature Derived from Quasi-Thermal Noise Spectroscopy In the Pristine Solar Wind: Parker Solar Probe Observations",
    "authors": [
        "M. Liu",
        "K. Issautier",
        "M. Moncuquet",
        "N. Meyer-Vernet",
        "M. Maksimovic",
        "J. Huang",
        "M. Martinovic",
        "L. Griton",
        "N. Chrysaphi",
        "V. K. Jagarlamudi",
        "S. Bale",
        "M. Pulupa",
        "J. C. Kasper",
        "M. L. Stevens"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-05-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "physics.space-ph"
    ],
    "abstract": "The Quasi-thermal noise (QTN) technique is a reliable tool to yield accurate measurements of the electron parameters in the solar wind. We apply this method on Parker Solar Probe (PSP) observations to derive the total electron temperature ($T_e$) from the linear fit of the high-frequency part of the QTN spectra acquired by the RFS/FIELDS instrument, and present a combination of 12-day period of observations around each perihelion from Encounter One (E01) to Ten (E10) (with E08 not included) with the heliocentric distance varying from about 13 to 60 solar radii ($R_\\odot{}$). We find that the total electron temperature decreases with the distance as $\\sim$$R^{-0.66}$, which is much slower than adiabatic. The extrapolated $T_e$ based on PSP observations is consistent with the exospheric solar wind model prediction at $\\sim$10 $R_\\odot{}$, Helios observations at $\\sim$0.3 AU and Wind observations at 1 AU. Also, $T_e$, extrapolated back to 10 $R_\\odot{}$, is almost the same as the strahl electron temperature $T_s$ (measured by SPAN-E) which is considered to be closely related to or even almost equal to the coronal electron temperature. Furthermore, the radial $T_e$ profiles in the slower solar wind (or flux tube with larger mass flux) are steeper than those in the faster solar wind (or flux tube with smaller mass flux). More pronounced anticorrelated $V_p$-$T_e$ is observed when the solar wind is slower and closer to the Sun.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11035v1"
    ],
    "publication_venue": "10 pages, 7 figures, and Astronomy & Astrophysics Accepted",
    "doi": "10.1051/0004-6361/202245450"
}