{
    "arxiv_id": "2303.15348",
    "paper_title": "Numerical simulations of prominence oscillations triggered by external perturbations",
    "authors": [
        "Valeriia Liakh",
        "Manuel Luna",
        "Elena Khomenko"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "physics.plasm-ph"
    ],
    "abstract": "Several energetic disturbances have been identified as triggers of the large-amplitude oscillations (LAOs) in prominences. However, the mechanisms for LAOs excitation are not well understood. We aim to study these mechanisms, performing time-dependent numerical simulations in 2.5D and 2D setups using magnetohydrodynamic (MHD) code MANCHA3D. Two types of disturbances are applied to excite prominence oscillations, such as a perturbation associated with an eruption and the waves caused by an artificial energy release. In the simulation with the eruption, we obtain that it does not produce LAOs in the prominence located in its vicinity. While the erupting flux rope rises, an elongated current sheet forms behind it, which becomes unstable and breaks into plasmoids. The downward-moving plasmoids cause perturbations in the velocity field by merging with the post-reconnection loops. This velocity perturbation propagates in the surroundings and perturbs the nearby prominence. The analysis of the oscillatory motions of the prominence plasma reveals the excitation of small-amplitude oscillations (SAOs), which are a mixture of longitudinal and vertical oscillations. In the simulation with a distant artificial perturbation, a fast-mode shock wave is produced, and it gradually reaches two flux rope prominences at different distances. This shock wave excites vertical LAOs and longitudinal SAOs with similar amplitudes, periods, and damping times in both prominences. Finally, in the experiment with the external triggering of LAOs in a dipped arcade prominence model, we find that, although the vector normal to the front of a fast-mode shock wave is parallel to the spine of the dipped arcade well before the contact, this wave does not excite longitudinal LAOs. When the wave front approaches the prominence, it pushes the dense plasma down, establishing vertical LAOs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15348v1"
    ],
    "publication_venue": "18 pages, 18 figures, accepted for publication in Astronomy and Astrophysics",
    "doi": "10.1051/0004-6361/202245765"
}