{
    "arxiv_id": "2303.16658",
    "paper_title": "SPARC HSBs, and LSBs, the surface density of dark matter haloes, and MOND",
    "authors": [
        "Antonino Del Popolo"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
    ],
    "abstract": "In this paper, we use SPARC's HSBs, and LSBs galaxies to verify two issues. The first one is related to one claim of \\citep{Donato} D09, namely: is the DM surface density (DMsd) a constant universal quantity, equal to $\\log{(\\rm Σ/M_\\odot pc^{-2})}=2.15 \\pm 0.2$, or does it depend on the baryon surface density of the system? The second one, is based on a MOND prediction that for HSBs the DMsd is constant, and equal to $\\log{(\\rm Σ/M_\\odot pc^{-2})}=2.14$, while for LSBs the surface density is not constant and takes values that are smaller than for HSBs and D09 prediction \\citep{Milgrom2009}. We find that HSBs shows a constant DMsd vs magnitude as in D09, and a constant DMsd vs $Σ_{\\rm eff}$ as in MOND prediction, for HSBs with $Σ_{\\rm eff}>200 L_\\odot/pc^2$, and $Σ_{\\rm eff}>300 L_\\odot/pc^2$. However, the value of the DMsd is larger, $Σ\\simeq 2.61$ (in the case of the DMsd-magnitude with $Σ_{\\rm eff}>300 L_\\odot/pc^2$), and $Σ\\simeq 2.54$ (in the case of the surface DMsd-surface brightness with $Σ_{\\rm eff}>200 L_\\odot/pc^2$). This value slightly depends on the threshold to determine wheter a galaxy is HSB. In the case of LSBs, for $Σ_{\\rm eff}<100 L_\\odot/pc^2$, and $Σ_{\\rm eff}<25 L_\\odot/pc^2$, the surface density vs magnitude, for lower magnitudes, is approximately equal to that predicted by D09, but several galaxies, for magnitude $M>-17$, have smaller values than those predicted by D09. The DMsd vs $Σ_{\\rm eff}$ shows a similar behavior in qualitative, but not quantitative, agreement with MOND predictions. In summary, in the case of HSBs both D09 and MOND are in qualitative, but not quantitative, agreement with the data. In the case of LSBs D09 is mainly in disagreement with the data, and MOND only in qualitative agreement with them.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16658v1"
    ],
    "publication_venue": "31 pages, 4 figures"
}