{
    "arxiv_id": "2303.17512",
    "paper_title": "Power-Optimal HARQ Protocol for Reliable Free Space Optical Communication",
    "authors": [
        "Georgios D. Chondrogiannis",
        "Nikos A. Mitsiou",
        "Nestor D. Chatzidiamantis",
        "Alexandros-Apostolos A. Boulogeorgos",
        "George K. Karagiannidis"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cs.IT",
        "eess.SP"
    ],
    "abstract": "This paper investigates the usage of hybrid automatic repeat request (HARQ) protocols for power-efficient and reliable communications over free space optical (FSO) links. By exploiting the large coherence time of the FSO channel, the proposed transmission schemes combat turbulence-induced fading by retransmitting the failed packets in the same coherence interval. To assess the performance of the presented HARQ technique, we extract a theoretical framework for the outage performance. In more detail, a closed-form expression for the outage probability (OP) is reported and an approximation for the high signal-to-noise ratio (SNR) region is extracted. Building upon the theoretical framework, we formulate a transmission power allocation problem throughout the retransmission rounds. This optimization problem is solved numerically through the use of an iterative algorithm. In addition, the average throughput of the HARQ schemes under consideration is examined. Simulation results validate the theoretical analysis under different turbulence conditions and demonstrate the performance improvement, in terms of both OP and throughput, of the proposed HARQ schemes compared to fixed transmit power HARQ benchmarks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17512v1"
    ],
    "publication_venue": "6 pages, 4 figures, IEEE International Conference on Communications (ICC) 2023 WS-19: 5th Workshop on ULMC6GN - Ultra-high speed, Low latency and Massive Communication for futuristic 6G Networks"
}