{
    "arxiv_id": "2303.16820",
    "paper_title": "General-relativistic simulations of the formation of a magnetized hybrid star",
    "authors": [
        "Anson Ka Long Yip",
        "Patrick Chi-Kit Cheong",
        "Tjonnie Guang Feng Li"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Strongly magnetized neutron stars are popular candidates for producing detectable electromagnetic and gravitational-wave signals. A rapid density increase in a neutron star core could also trigger the phase transition from hadrons to deconfined quarks and form a hybrid star. This formation process could release a considerable amount of energy in the form of gravitational waves and neutrinos. Hence, the formation of a magnetized hybrid star is an interesting scenario for detecting all these signals. These detections may provide essential probes for the magnetic field and composition of such stars. Thus far, a dynamical study of the formation of a magnetized hybrid star has yet to be realized. Here, we investigate the formation dynamics and the properties of a magnetized hybrid star through dynamical simulations. We find that the maximum values of rest-mass density and magnetic field strength increase slightly and these two quantities are coupled in phase during the formation. We then demonstrate that all microscopic and macroscopic quantities of the resulting hybrid star vary dramatically when the maximum magnetic field strength goes beyond a threshold of $\\sim 5 \\times 10^{17}$ G but they are insensitive to the magnetic field below this threshold. Specifically, the magnetic deformation makes the rest-mass density drop significantly, suppressing the matter fraction in the mixed phase. Therefore, this work provides a solid support for the magnetic effects on a hybrid star, so it is possible to link observational signals from the star to its magnetic field configuration.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16820v1"
    ],
    "publication_venue": "8 pages, 3 figures"
}