{
    "arxiv_id": "2303.08076",
    "paper_title": "Control-aware Communication for Cooperative Adaptive Cruise Control",
    "authors": [
        "Mahdi Razzaghpour",
        "Rodolfo Valiente",
        "Mahdi Zaman",
        "Yaser P. Fallah"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "cs.MA"
    ],
    "abstract": "Utilizing vehicle-to-everything (V2X) communication technologies, vehicle platooning systems are expected to realize a new paradigm of cooperative driving with higher levels of traffic safety and efficiency. Connected and Autonomous Vehicles (CAVs) need to have proper awareness of the traffic context. However, as the quantity of interconnected entities grows, the expense of communication will become a significant factor. As a result, the cooperative platoon's performance will be influenced by the communication strategy. While maintaining desired levels of performance, periodic communication can be relaxed to more flexible aperiodic or event-triggered implementations. In this paper, we propose a control-aware communication solution for vehicle platoons. The method uses a fully distributed control-aware communication strategy, attempting to decrease the usage of communication resources while still preserving the desired closed-loop performance characteristics. We then leverage Model-Based Communication (MBC) to improve cooperative vehicle perception in non-ideal communication and propose a solution that combines control-aware communication with MBC for cooperative control of vehicle platoons. Our approach achieves a significant reduction in the average communication rate ($47\\%$) while only slightly reducing control performance (e.g., less than $1\\%$ speed deviation). Through extensive simulations, we demonstrate the benefits of combined control-aware communication with MBC for cooperative control of vehicle platoons.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08076v1"
    ],
    "publication_venue": "arXiv admin note: text overlap with arXiv:2203.15772"
}