{
    "arxiv_id": "2303.16818",
    "paper_title": "BEVSimDet: Simulated Multi-modal Distillation in Bird's-Eye View for Multi-view 3D Object Detection",
    "authors": [
        "Haimei Zhao",
        "Qiming Zhang",
        "Shanshan Zhao",
        "Jing Zhang",
        "Dacheng Tao"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-04-18"
    ],
    "latest_version": 3,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Multi-view camera-based 3D object detection has gained popularity due to its low cost. But accurately inferring 3D geometry solely from camera data remains challenging, which impacts model performance. One promising approach to address this issue is to distill precise 3D geometry knowledge from LiDAR data. However, transferring knowledge between different sensor modalities is hindered by the significant modality gap. In this paper, we approach this challenge from the perspective of both architecture design and knowledge distillation and present a new simulated multi-modal 3D object detection method named BEVSimDet. We first introduce a novel framework that includes a LiDAR and camera fusion-based teacher and a simulated multi-modal student, where the student simulates multi-modal features with image-only input. To facilitate effective distillation, we propose a simulated multi-modal distillation scheme that supports intra-modal, cross-modal, and multi-modal distillation simultaneously, in Bird's-eye-view (BEV) space. By combining them together, BEVSimDet can learn better feature representations for 3D object detection while enjoying cost-effective camera-only deployment. Experimental results on the challenging nuScenes benchmark demonstrate the effectiveness and superiority of BEVSimDet over recent representative methods. The source code will be released at \\href{https://github.com/ViTAE-Transformer/BEVSimDet}{BEVSimDet}.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16818v1",
        "http://arxiv.org/pdf/2303.16818v2",
        "http://arxiv.org/pdf/2303.16818v3"
    ],
    "publication_venue": "15 pages; add link"
}