{
    "arxiv_id": "2303.10003",
    "paper_title": "Accreting neutron stars: composition of the upper layers of the inner crust",
    "authors": [
        "Nikolay N. Shchechilin",
        "Mikhail E. Gusakov",
        "Andrey I. Chugunov"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "We model the nuclear evolution of an accreted matter as it sinks toward the stellar center, in order to find its composition and equation of state. To this aim, we developed a simplified reaction network that allows for redistribution of free neutrons in the inner crust to satisfy the recently suggested neutron hydrostatic and diffusion equilibrium condition. We analyse the main reaction pathways for the three representative thermonuclear ash compositions: Superburst, Kepler, and Extreme rp. In contrast to the previous results, which neglect redistribution of free (unbound) neutrons in the inner crust, the most significant reactions in our calculations are neutron captures and electron emissions. The pycnonuclear fusion plays some role only for Kepler ashes. For the direct application of our results in astrophysical codes we present profiles of the average charge, $\\langle Z\\rangle$, impurity parameter, $Q_\\mathrm{imp}$ and equation of state for a set of models, parametrized by the pressure at the outer-inner crust interface. Typically, for Superburst ashes $Q_\\mathrm{imp}\\approx 1-4$, while for Kepler ashes $Q_\\mathrm{imp}$ decreases from $\\approx23$ at the outer-inner crust interface to $\\approx5$ at the end of our simulation (the corresponding density equals $ρ_\\mathrm{dc}\\approx2\\times 10^{12}$ g cm$^{-3}$). At the same time, for Extreme rp ashes $Q_\\mathrm{imp}$ remains large $\\approx 30-35$ in the considered inner crust region. Our results are important for modeling the thermal relaxation of transiently accreting neutron stars after the end of the outburst.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10003v1"
    ],
    "publication_venue": "11 pages, 4 figures. Submitted to MNRAS",
    "doi": "10.1093/mnras/stad1731"
}