{
    "arxiv_id": "2303.15008",
    "paper_title": "Fundamental effective temperature measurements for eclipsing binary stars -- IV. Selection of new benchmark stars and first results for HD 22064",
    "authors": [
        "P. F. L. Maxted"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "I describe the selection and initial characterisation of 20 eclipsing binary stars that are suitable for calibration and testing of stellar models and data analysis algorithms used by the PLATO mission and spectroscopic surveys. The binary stars selected are F-/G-type dwarf stars with M-type dwarf companions that contribute less than 2% of the flux at optical wavelengths. The light curves typically show well-defined total eclipses with very little variability between the eclipses. I have used near-infrared spectra obtained by the APOGEE survey to measure the spectroscopic orbit for both stars in HD22064. Combined with an analysis of the TESS light curve, I derive the following masses and radii: $M_1 = 1.35 \\pm 0.03 M_{\\odot}$, $M_2 = 0.58 \\pm 0.01 M_{\\odot}$, $R_1 = 1.554 \\pm 0.014 R_{\\odot}$, $R_2 = 0.595 \\pm 0.008 R_{\\odot}$. Using $R_1$ and the parallax from Gaia EDR3, I find that the primary star's angular diameter is $θ= 0.1035 \\pm 0.0009 $ mas. The apparent bolometric flux of the primary star is ${\\mathcal F}_{\\oplus,0} = (7.51\\pm 0.09)\\times10^{-9}$ erg cm$^{-2}$ s$^{-1}$. Hence, this F2V star has an effective temperature $T_{\\rm eff,1} = 6763{\\rm\\,K} \\pm 39{\\rm \\,K}$. HD22064 is an ideal benchmark star that can be used for ``end-to-end'' tests of the stellar parameters measured by large-scale spectroscopic surveys, or stellar parameters derived from asteroseismology with PLATO. The techniques described here for HD22064 can be applied to the other eclipsing binaries in the sample in order to create an all-sky network of such benchmark stars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15008v1"
    ],
    "publication_venue": "12 pages, 9 figures. Submitted to MNRAS. arXiv admin note: text overlap with arXiv:2205.01466"
}