{
    "arxiv_id": "2303.12092",
    "paper_title": "A Visual Modeling Method for Spatiotemporal and Multidimensional Features in Epidemiological Analysis: Applied COVID-19 Aggregated Datasets",
    "authors": [
        "Yu Dong",
        "Christy Jie Liang",
        "Yi Chen",
        "Jie Hua"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 2,
    "categories": [
        "stat.AP",
        "cs.GR"
    ],
    "abstract": "The visual modeling method enables flexible interactions with rich graphical depictions of data and supports the exploration of the complexities of epidemiological analysis. However, most epidemiology visualizations do not support the combined analysis of objective factors that might influence the transmission situation, resulting in a lack of quantitative and qualitative evidence. To address this issue, we have developed a portrait-based visual modeling method called +msRNAer. This method considers the spatiotemporal features of virus transmission patterns and the multidimensional features of objective risk factors in communities, enabling portrait-based exploration and comparison in epidemiological analysis. We applied +msRNAer to aggregate COVID-19-related datasets in New South Wales, Australia, which combined COVID-19 case number trends, geo-information, intervention events, and expert-supervised risk factors extracted from LGA-based censuses. We perfected the +msRNAer workflow with collaborative views and evaluated its feasibility, effectiveness, and usefulness through one user study and three subject-driven case studies. Positive feedback from experts indicates that +msRNAer provides a general understanding of analyzing comprehension that not only compares relationships between cases in time-varying and risk factors through portraits but also supports navigation in fundamental geographical, timeline, and other factor comparisons. By adopting interactions, experts discovered functional and practical implications for potential patterns of long-standing community factors against the vulnerability faced by the pandemic. Experts confirmed that +msRNAer is expected to deliver visual modeling benefits with spatiotemporal and multidimensional features in other epidemiological analysis scenarios.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12092v1",
        "http://arxiv.org/pdf/2303.12092v2"
    ],
    "publication_venue": null
}