{
    "arxiv_id": "2303.12436",
    "paper_title": "The carbon star DY Persei may be a cool R Coronae Borealis variable",
    "authors": [
        "D. A. Garcia-Hernandez",
        "N. Kameswara Rao",
        "D. L. Lambert",
        "K. Eriksson",
        "A. B. S. Reddy",
        "T. Masseron"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Optical and near-IR photometry suggests that the carbon star DY Persei exhibits fadings similar to those of R Coronae Borealis (RCB) variables. Photometric surveys of the Galaxy and Magellanic Clouds uncovered new DY Per variables with infrared photometry identifying them with cool carbon stars, perhaps, with an unusual tendency to shed mass. In an attempt to resolve DY Per's identity crisis -- a cool carbon giant or a cool RCB variable? -- we analyze a high-resolution H&K band spectrum of DY Per. The CO first-overtone bands in the K-band of DY Per show a high abundance of 18O such that 16O/18O = 4 +- 1, a ratio sharply at odds with published results for `regular' cool carbon giants with 16O/18O ~ 1000 but this exceptionally low ratio is characteristic of RCB-variables and HdC stars. This similarity suggests that DY Per indeed may be a cool RCB variable. Current opinion considers RCB-variables to result from merger of a He onto a CO white dwarf; observed abundances of these H-deficient stars including the exceptionally low 16O/18O ratios are in fair accord with predicted compositions for white dwarf merger products. A H-deficiency for DY Per is not directly observable but is suggested from the strength of a HF line and an assumption that F may be overabundant, as observed and predicted for RCB stars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12436v1"
    ],
    "publication_venue": "Accepted for publication in ApJ (16 pages and 4 figures)",
    "doi": "10.3847/1538-4357/acc574"
}