{
    "arxiv_id": "2303.15712",
    "paper_title": "Habitat fragmentation affects climate adaptation in a forest herb",
    "authors": [
        "Frederik Van Daele",
        "Olivier Honnay",
        "Steven Janssens",
        "Hanne De Kort"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-04-25"
    ],
    "latest_version": 2,
    "categories": [
        "q-bio.PE"
    ],
    "abstract": "Climate change and increased drought frequencies are expected to have a major impact on forest herb persistence. The adaptive capacity of forest herbs towards climate change depends on their long-standing imprints of local adaptation and phenotypic plasticity which in turn may be affected by forest fragmentation. To evaluate how local adaptation towards habitat fragmentation affects climate adaptation in Primula elatior, we quantified a wide range of traits in a common garden experiment. Specifically, we disentangled the relative contribution of climate, habitat fragmentation, drought stress and their interactions on variation in a range of vegetative, regulatory and reproductive traits. To further evaluate the effect of shifts in the mating system, we quantified flower colour adaptations, herkogamy, and self-incompatibility. Southern populations displayed an increased sensitivity towards climate change, while northern populations showed a reduced establishment and competitive potential. Habitat fragmentation resulted in the evolutionary breakdown of reciprocal herkogamy, as well as in an increase in self-compatibility of S morphs. Furthermore, in fragmented habitats we observed both a significant differentiation in flower colour attraction patterns and strongly reduced flowering investment in populations present in the southern part of P. elatior's distribution range. Habitat fragmentation additionally disrupted biomass allocation strategies, abaxial stomatal plasticity, and adaxial trichome density. The interaction between local adaptation to climate drivers and habitat fragmentation could have far-reaching effects on (meta-)population dynamics under climate change and could limit the successful application of assisted migration strategies. A focus on restoring habitat integrity and ecological connectivity are likely to yield benefits for forest herb persistence under climate change.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15712v1",
        "http://arxiv.org/pdf/2303.15712v2"
    ],
    "publication_venue": null
}