{
    "arxiv_id": "2303.08957",
    "paper_title": "Impacts of dielectric screening on the luminescence of monolayer WSe$_2$",
    "authors": [
        "Fabio J. R. Costa",
        "Thiago G-L. Brito",
        "Ingrid D. Barcelos",
        "Luiz Fernando Zagonel"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-07-12"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "cond-mat.mes-hall",
        "physics.optics"
    ],
    "abstract": "Single layers of transition metal dichalcogenides, such as WSe$_2$ have gathered increasing attention due to their intense electron-hole interactions, being considered promising candidates for developing novel optical applications. Within the few-layer regime, these systems become highly sensitive to the surrounding environment, enabling the possibility of using a proper substrate to tune desired aspects of these atomically-thin semiconductors. In this scenario, the dielectric environment provided by the substrates exerts significant influence on electronic and optical properties of these layered materials, affecting the electronic band-gap and the exciton binding energy. However, the corresponding effect on the luminescence of transition metal dichalcogenides is still under discussion. To elucidate these impacts, we used a broad set of materials as substrates for single-layers of WSe$_2$, enabling the observation of these effects over a wide range of electrical permittivities. Our results demonstrate that an increasing permittivity induces a systematic red-shift of the optical band-gap of WSe$_2$, intrinsically related to a considerable reduction of the luminescence intensity. Moreover, we annealed the samples to ensure a tight coupling between WSe$_2$and its substrates, reducing the effect of undesired adsorbates trapped in the interface. Ultimately, our findings reveal how critical the annealing temperature can be, indicating that above a certain threshold, the heating treatment can induce adverse impacts on the luminescence. Furthermore, our conclusions highlight the influence the dielectric properties of the substrate have on the luminescence of WSe$_2$, showing that a low electrical permittivity favours preserving the native properties of the adjacent monolayer",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08957v1"
    ],
    "publication_venue": "16 pages, 8 figures",
    "doi": "10.1088/1361-6528/acda3b"
}