{
    "arxiv_id": "2303.12587",
    "paper_title": "Unveiling properties of the non-thermal X-ray production in the gamma-ray binary LS 5039 using the long-term pattern of its fast X-ray variability",
    "authors": [
        "Hiroki Yoneda",
        "Valenti Bosch-Ramon",
        "Teruaki Enoto",
        "Dmitry Khangulyan",
        "Paul S. Ray",
        "Tod Strohmayer",
        "Toru Tamagawa",
        "Zorawar Wadiasingh"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-05-15"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Gamma-ray binary systems, a subclass of high-mass X-ray binaries, show non-thermal emissions from radio to TeV. While efficient electron acceleration is considered to take place in them, the nature of the acceleration mechanism and the physical environments in these systems have been a long-standing question. In this work, we report on long-term recurrent patterns in the short-term variability of the soft X-ray emission of LS 5039, one of the brightest gamma-ray binary systems. The Neutron star Interior Composition Explorer (NICER) observed LS 5039 four times from 2018 to 2021. By comparing them with the previous Suzaku and NuSTAR long-exposure observations, we studied the long-term evolution of the orbital light curve in the soft X-ray band. Although the observations by NICER and Suzaku are separated by $\\sim$14 years, i.e., more than 10^3 orbits, the orbital light curves show remarkable consistency after calculating their running averages with a window width 70 ks. Furthermore, all of the light curves show short-term variability with a time scale of $\\sim$10 ks. Since the column density did not vary when the flux changed abruptly, such a short-term variability seems to be an intrinsic feature of the X-ray emission. We propose that the short-term variability is caused by clumps (or inhomogeneities) of the companion star wind impacting the X-ray production site. The observed time scale matches well with the lifetime of the clumps interacting with the pulsar wind and the dynamical time scale of the relativistic intrabinary shock in the pulsar wind scenario.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12587v1"
    ],
    "publication_venue": "17 pages, 13 figures, accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc175"
}