{
    "arxiv_id": "2303.17403",
    "paper_title": "Large deviations in stochastic dynamics over graphs through Matrix Product Belief Propagation",
    "authors": [
        "Stefano Crotti",
        "Alfredo Braunstein"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.stat-mech",
        "cs.SI",
        "q-bio.PE"
    ],
    "abstract": "Stochastic processes on graphs can describe a great variety of phenomena ranging from vehicular traffic to neural activity and epidemic spreading. While many existing methods can accurately describe typical realizations of such processes, computing properties of extremely rare events is generally a hard task. In particular, good approximations are lacking for models with recurrent dynamics, in which variables can return to a previously visited state. Recently, a scheme based on the cavity method with messages parametrized by matrix product states [T. Barthel, C. De Bacco, and S. Franz, Physical Review E 97, 010104 (2018)] has been shown to work well for typical trajectories. In this work, we build on this approach in two directions: first, we show how, using a general formulation of the belief propagation equations instead of the dynamical cavity method, it can be applied to Markov processes biased by arbitrary reweighting factors that concentrate most of the probability mass on rare events. Second, we introduce an efficient scheme to reduce the computational cost of a single node update from exponential to polynomial in the node degree, allowing to apply the method to graphs of large connectivity. Two applications are considered. First, we compute individual infection probabilities from sparse observations within the SIRS epidemic model (the risk assessment problem). Second, we compute typical observables and large deviations of Glauber dynamics on several Ising models, including a random field ferromagnet and a spin glass.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17403v1"
    ],
    "publication_venue": "18 pages, 5 figures, 1 table, appendix"
}