{
    "arxiv_id": "2303.12411",
    "paper_title": "Infrared galaxies detected by the Atacama Cosmology Telescope",
    "authors": [
        "Ece Kilerci",
        "Tetsuya Hashimoto",
        "Tomotsugu Goto",
        "Ersin Göğüş",
        "Seong Jin Kim",
        "Simon C. -C. Ho",
        "Yi Hang Valerie Wong"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We report on 167 infrared (IR) galaxies selected by AKARI and IRAS and detected in the Atacama Cosmology Telescope (ACT) Data Release 5 (DR5) sky maps at the 98, 150 and 220 GHz frequency bands. Of these detections, 134 (80%) of the millimeter counterparts are first-time identifications with ACT. We expand the previous ACT extragalactic source catalogs, by including new 98 GHz detections and measurements from ACT DR5. We also report flux density measurements at the 98, 150, and 220 GHz frequency bands. We compute $α_{98-150}$, $α_{98-220}$, and $α_{150-220}$ millimeter-wave spectral indices and far-IR to millimeter-wave spectral indices between 90 micron and 98, 150, and 220 GHz. We specify the galaxy type, based on $α_{150-220}$. We combine publicly available multiwavelength data-including ultraviolet, optical, near-IR, mid-IR, far-IR, and the millimeter measurements obtained in this work-and perform spectral energy distribution (SED) fitting with CIGALE. With the radio emission decomposition advantage of CIGALE V2022.0, we identify the origins of the millimeter emissions for 69 galaxies in our sample. Our analysis also shows that millimeter data alone indicates the need for a radio synchrotron component in the SEDs that are produced by active galactic nuclei (AGNs) and/or star formation. We present SEDs and measured physical properties of these galaxies, such as the dust luminosity, AGN luminosity, the total IR luminosity, and the ratio of the IR and radio luminosity. We quantify the relationships between the total IR luminosity and the millimeter-band luminosities, which can be used in the absence of SED analysis.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12411v1"
    ],
    "publication_venue": "29 pages, 6 tables, 11 figures, 1 appendix with 1 further figure. Accepted for publication in ApJS",
    "doi": "10.3847/1538-4365/acb8ba"
}