{
    "arxiv_id": "2303.16844",
    "paper_title": "The ratio of horizontal to vertical displacement in solar oscillations estimated from combined SO/PHI and SDO/HMI observations",
    "authors": [
        "J. Schou",
        "J. Hirzberger",
        "D. Orozco Suárez",
        "K. Albert",
        "N. Albelo Jorge",
        "T. Appourchaux",
        "A. Alvarez-Herrero",
        "J. Blanco Rodríguez",
        "A. Gandorfer",
        "D. Germerott",
        "L. Guerrero",
        "P. Gutierrez-Marques",
        "F. Kahil",
        "M. Kolleck",
        "S. K. Solanki",
        "J. C. del Toro Iniesta",
        "R. Volkmer",
        "J. Woch",
        "B. Fiethe",
        "I. Pérez-Grande",
        "E. Sanchis Kilders",
        "M. Balaguer Jiménez",
        "L. R. Bellot Rubio",
        "D. Calchetti",
        "M. Carmona",
        "W. Deutsch",
        "A. Feller",
        "G. Fernandez-Rico",
        "A. Fernández-Medina",
        "P. García Parejo",
        "J. L. Gasent Blesa",
        "L. Gizon",
        "B. Grauf",
        "K. Heerlein",
        "A. Korpi-Lagg",
        "A. López Jiménez",
        "T. Maue",
        "R. Meller",
        "A. Moreno Vacas",
        "R. Müller",
        "E. Nakai",
        "W. Schmidt",
        "J. Sinjan",
        "J. Staub",
        "H. Strecker",
        "I. Torralbo",
        "G. Valori"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "In order to make accurate inferences about the solar interior using helioseismology, it is essential to understand all the relevant physical effects on the observations. One effect to understand is the (complex-valued) ratio of the horizontal to vertical displacement of the p- and f-modes at the height at which they are observed. Unfortunately, it is impossible to measure this ratio directly from a single vantage point, and it has been difficult to disentangle observationally from other effects. In this paper we attempt to measure the ratio directly using 7.5 hours of simultaneous observations from the Polarimetric and Helioseismic Imager on board Solar Orbiter and the Helioseismic and Magnetic Imager on board the Solar Dynamics Observatory. While image geometry problems make it difficult to determine the exact ratio, it appears to agree well with that expected from adiabatic oscillations in a standard solar model. On the other hand it does not agree with a commonly used approximation, indicating that this approximation should not be used in helioseismic analyses. In addition, the ratio appears to be real-valued.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16844v1"
    ],
    "publication_venue": "Accepted for publication in Astronomy & Astrophysics. 8 pages, 8 figures",
    "doi": "10.1051/0004-6361/202345946"
}