{
    "arxiv_id": "2303.10484",
    "paper_title": "Encounter-based reaction-subdiffusion model II: partially absorbing traps and the occupation time propagator",
    "authors": [
        "Paul C Bressloff"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.stat-mech"
    ],
    "abstract": "In this paper we develop an encounter-based model of reaction-subdiffusion in a domain $Ω$ with a partially absorbing interior trap $\\calU\\subset Ω$. We assume that the particle can freely enter and exit $\\calU$, but is only absorbed within $\\calU$. We take the probability of absorption to depend on the amount of time a particle spends within the trap, which is specified by a Brownian functional known as the occupation time $A(t)$. The first passage time (FPT) for absorption is identified with the point at which the occupation time crosses a random threshold $\\widehat{A}$ with probability density $ψ(a)$. Non-Markovian models of absorption can then be incorporated by taking $ψ(a)$ to be non-exponential. The marginal probability density for particle position $\\X(t)$ prior to absorption depends on $ψ$ and the joint probability density for the pair $(\\X(t),A(t))$, also known as the occupation time propagator. In the case of normal diffusion one can use a Feynman-Kac formula to derive an evolution equation for the propagator. However, care must be taken when combining fractional diffusion with chemical reactions in the same medium. Therefore, we derive the occupation time propagator equation from first principles by taking the continuum limit of a heavy-tailed CTRW. We then use the solution of the propagator equation to investigate conditions under which the mean FPT (MFPT) for absorption within a trap is finite. We show that this depends on the choice of threshold density $ψ(a)$ and the subdiffusivity. Hence, as previously found for evanescent reaction-subdiffusion models, the processes of subdiffusion and absorption are intermingled.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10484v1"
    ],
    "publication_venue": "20 pages, 4 figures"
}