{
    "arxiv_id": "2303.09399",
    "paper_title": "Main Concepts and Principles of Political Economy -- Production and Values, Distribution and Prices, Reproduction and Profits",
    "authors": [
        "Christian Flamant"
    ],
    "submission_date": "2023-03-13",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "econ.GN"
    ],
    "abstract": "This book starts from the basic questions that had been raised by the founders of Economic theory, Smith, Ricardo, and Marx: what makes the value of commodities, what are production, exchange, money and incomes like profits, wages and rents. The answers that these economists had provided were mostly wrong, above all by defining the equivalence of commodities at the level of exchange, but also because of a confusion made between values and prices, and wrong views of what production really is and the role of fixed capital. Using the mathematical theory of measurement and the physical theory of dimensional analysis, this book provides a coherent theory of value based on an equivalence relation not at the level of exchange, but of production. Indeed exchange is considered here as an equivalence relation between money and a monetary price, and not between commodities, modern monetary theory having demonstrated that money is not a commodity. The book rejects the conception of production as a surplus, which owes much to Sraffa's theory of production prices, and is shown to be severely flawed. It founds the equivalence of commodities at the level of a production process considered as a transformation process. It rehabilitates the labor theory of value, based on the connection between money and labor due the monetary payment of wages, which allows the homogenization of various kinds of concrete labor into abstract labor. It shows that value is then a dimension of commodities and that this dimension is time, i.e. the time of physics. On this background, the book shows that the calculation of values for all commodities is always possible, even in the case of joint production, and that there cannot be any commodity residue left by this calculation. As a further step, this book provides a coherent theory of the realization of the product, which occurs in the circulation process. Using an idea - the widow's cruse - introduced by Keynes in his Treatise on Money, it brings to light the mechanism behind the transformation of money values into money prices and of surplus-value into profits and other transfer incomes, ensuring the formation of monetary profits. The book sheds some light on the rate of profit, its determinants and its evolution, showing in particular the paramount importance of capitalist consumption as one of its main determinants. In passing it explains the reasons why in the real world there is a multiplicity of profit rates. Finally, it allows to solve in a precise and illustrated way the problems raised by the Marxist law of the tendency of the rate of profit to fall. Most of the results obtained translate into principles, the first ones being truly basic, the following ones less basic, but all of them being fundamental. All in all, this book might provide the first building blocks to develop a full-fledged and scientific economic theory to many fellow economists, critical of neo-classical theory, but who have not yet dicovered the bases of a complete and coherent alternative.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09399v1"
    ],
    "publication_venue": null
}