{
    "arxiv_id": "2303.08388",
    "paper_title": "A Chandra X-ray Survey of Optically Selected Close Galaxy Pairs: Unexpectedly Low Occupation of Active Galactic Nuclei",
    "authors": [
        "Lin He",
        "Meicun Hou",
        "Zhiyuan Li",
        "Shuai Feng",
        "Xin Liu"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "High-resolution X-ray observations offer a unique tool for probing the still elusive connection between galaxy mergers and active galactic nuclei (AGNs). We present an analysis of nuclear X-ray emission in an optically selected sample of 92 close galaxy pairs (with projected separations $\\lesssim 20$ kpc and line-of-sight velocity offsets $<$ 500 km s$^{-1}$) at low redshift ($\\bar{z} \\sim 0.07$), based on archival Chandra observations. The parent sample of galaxy pairs is constructed without imposing an optical classification of nuclear activity, thus is largely free of selection effect for or against the presence of an AGN. Nor is this sample biased for or against gas-rich mergers. An X-ray source is detected in 70 of the 184 nuclei, giving a detection rate of $38\\%^{+5\\%}_{-5\\%}$, down to a 0.5-8 keV limiting luminosity of $\\lesssim 10^{40}\\rm~erg~s^{-1}$. The detected and undetected nuclei show no systematic difference in their host galaxy properties such as galaxy morphology, stellar mass and stellar velocity dispersion. When potential contamination from star formation is avoided (i.e., $L_{\\rm 2-10~keV} > 10^{41}\\rm~erg~s^{-1}$), the detection rate becomes $18\\%^{+3\\%}_{-3\\%}$ (32/184), which shows no excess compared to the X-ray detection rate of a comparison sample of optically classified single AGNs. The fraction of pairs containing dual AGN is only $2\\%^{+2\\%}_{-2\\%}$. Moreover, most nuclei at the smallest projected separations probed by our sample (a few kpc) have an unexpectedly low apparent X-ray luminosity and Eddington ratio, which cannot be solely explained by circumnuclear obscuration. These findings suggest that close galaxy interaction is not a sufficient condition for triggering a high level of AGN activity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08388v1"
    ],
    "publication_venue": "28 pages, 9 figures. Accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc5e1"
}