{
    "arxiv_id": "2303.10478",
    "paper_title": "Long-rising Type II supernovae resembling supernova 1987A -- I. A comparative study through scaling relations",
    "authors": [
        "M. L. Pumo",
        "S. P. Cosentino",
        "A. Pastorello",
        "S. Benetti",
        "S. Cherubini",
        "G. Manicò",
        "L. Zampieri"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "With the aim of improving our knowledge about their nature, we conduct a comparative study on a sample of long-rising Type II supernovae (SNe) resembling SN 1987A. To do so, we deduce various scaling relations from different analytic models of H-rich SNe, discussing their robustness and feasibility. Then we use the best relations in terms of accuracy to infer the SN progenitor's physical properties at the explosion for the selected sample of SN 1987A-like objects, deriving energies of $\\sim 0.5$-$15$ foe, radii of $\\sim 0.2$-$100 \\times 10^{12}$ cm, and ejected masses of $\\sim 15$-$55$\\msun. Although the sample may be too small to draw any final conclusion, these results suggest that (a) SN 1987A-like objects have parameters at explosion covering a wide range of values; (b) the main parameter determining their distribution is the explosion energy; (c) a high-mass ($\\gtrsim 30$\\,\\Msun), high-energy ($\\gtrsim 10$\\,foe) tail of events, linked to extended progenitors with radii at explosion $\\sim 10^{13}$-$10^{14}$\\,cm, challenge standard theories of neutrino-driven core-collapse and stellar evolution. We also find a correlation between the amount of $^{56}$Ni in the ejecta of the SN 1987A-like objects and the spectrophotometric features of the SN at maximum, that may represent a tool for estimating the amount of $^{56}$Ni in the SN ejecta whitout having information on the tail luminosity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10478v1"
    ],
    "publication_venue": "19 pages, 15 figures, and 2 appendices, accepted for publication on MNRAS",
    "doi": "10.1093/mnras/stad861"
}