{
    "arxiv_id": "2303.12154",
    "paper_title": "The quantum detection of projectors in finite-dimensional algebras and holography",
    "authors": [
        "Joseph Ben Geloun",
        "Sanjaye Ramgoolam"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-11-14"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "hep-th",
        "math.CO",
        "math.RT"
    ],
    "abstract": "We define the computational task of detecting projectors in finite dimensional associative algebras with a combinatorial basis, labelled by representation theory data, using combinatorial central elements in the algebra. In the first example, the projectors belong to the centre of a symmetric group algebra and are labelled by Young diagrams with a fixed number of boxes $n$. We describe a quantum algorithm for the task based on quantum phase estimation (QPE) and obtain estimates of the complexity as a function of $n$. We compare to a classical algorithm related to the projector identification problem by the AdS/CFT correspondence. This gives a concrete proof of concept for classical/quantum comparisons of the complexity of a detection task, based in holographic correspondences. A second example involves projectors labelled by triples of Young diagrams, all having $n$ boxes, with non-vanishing Kronecker coefficient. The task takes as input the projector, and consists of identifying the triple of Young diagrams. In both of the above cases the standard QPE complexities are polynomial in $n$. A third example of quantum projector detection involves projectors labelled by a triple of Young diagrams, with $m,n$ and $m+n$ boxes respectively, such that the associated Littlewood-Richardson coefficient is non-zero. The projector detection task is to identify the triple of Young diagrams associated with the projector which is given as input. This is motivated by a two-matrix model, related via the AdS/CFT correspondence, to systems of strings attached to giant gravitons. The QPE complexity in this case is polynomial in $m$ and $n$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12154v1"
    ],
    "publication_venue": "38 pages (including Appendices) ; 2 figures",
    "doi": "10.1007/JHEP05(2023)191"
}