{
    "arxiv_id": "2303.08892",
    "paper_title": "The dusty circumstellar environment of Betelgeuse during the Great Dimming as seen by VLTI/MATISSE",
    "authors": [
        "E. Cannon",
        "M. Montargès",
        "A. de Koter",
        "A. Matter",
        "J. Sanchez-Bermudez",
        "R. Norris",
        "C. Paladini",
        "L. Decin",
        "H. Sana",
        "J. O. Sundqvist",
        "E. Lagadec",
        "P. Kervella",
        "A. Chiavassa",
        "A. K. Dupree",
        "G. Perrin",
        "P. Scicluna",
        "P. Stee",
        "S. Kraus",
        "W. Danchi",
        "B. Lopez",
        "F. Millour",
        "J. Drevon",
        "P. Cruzalèbes",
        "P. Berio",
        "S. Robbe-Dubois",
        "A. Rosales-Guzman"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-07-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "The 'Great Dimming' of the prototypical red supergiant Betelgeuse, which occurred between December 2019 and April 2020, gives us unprecedented insight into the processes occurring on the stellar surface and in the inner wind of this type of star. In particular it may bring further understanding of their dust nucleation and mass loss processes. Here, we present and analyse VLTI/MATISSE observations in the N-band (8 - 13 $μ$m) taken near the brightness minimum in order to assess the status of the dusty circumstellar environment. We explore the compatibility of a dust clump obscuring the star with our mid-infrared interferometric observations using continuum 3D radiative transfer modelling, and probe the effect of adding multiple clumps close to the star on the observables. We also test the viability of a large cool spot on the stellar surface without dust present in the ambient medium. Using the visibility data, we derive a uniform disk diameter of 59.02 $\\pm$ 0.64 mas in the spectral range 8 to 8.75 $μ$m. We find that both the dust clump and the cool spot models are compatible with the data. Further to this, we note that the extinction and emission of our localised dust clump in the line of sight of the star, directly compensate each other making the clump undetectable in the spectral energy distribution and visibilities. The lack of infrared brightening during the 'Great Dimming' therefore does not exclude extinction due to a dust clump as one of the possible mechanisms. The visibilities can be reproduced by a spherical wind with dust condensing at 13 stellar radii and a dust mass-loss rate of (2.1 - 4.9) $\\times$ 10$^{-10}$ $\\mathit{M}_{\\odot} {\\rm yr}^{-1}$, however, in order to reproduce the complexity of the observed closure phases, additional surface features or dust clumps would be needed.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08892v1"
    ],
    "publication_venue": "13 Pages, accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202243611"
}