{
    "arxiv_id": "2303.10097",
    "paper_title": "XMM2ATHENA, the H2020 project to improve XMM-Newton analysis software and prepare for Athena",
    "authors": [
        "Natalie A. Webb",
        "Francisco J. Carrera",
        "Axel Schwope",
        "Christian Motch",
        "Jean Ballet",
        "Mike Watson",
        "Mat Page",
        "Michael Freyberg",
        "Ioannis Georgantopoulos",
        "Mickael Coriat",
        "Didier Barret",
        "Zoe Massida",
        "Maitrayee Gupta",
        "Hugo Tranin",
        "Erwan Quintin",
        "M. Teresa Ceballos",
        "Silvia Mateos",
        "Amalia Corral",
        "Rosa Dominguez",
        "Holger Stiele",
        "Iris Traulsen",
        "Adriana Pires",
        "Ada Nebot",
        "Laurent Michel",
        "François Xavier Pineau",
        "Jere Kuutila",
        "Pierre Maggi",
        "Sudip Chakroborty",
        "Keir Birchall",
        "Paul Kuin",
        "Athanassios Akylas",
        "Angel Ruiz",
        "Ektoras Pouliasis",
        "Antonis Georgakakis"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
    ],
    "abstract": "XMM-Newton, a European Space Agency observatory, has been observing the X-ray, ultra-violet and optical sky for 23 years. During this time, astronomy has evolved from mainly studying single sources to populations and from a single wavelength, to multi-wavelength or messenger data. We are also moving into an era of time domain astronomy. New software and methods are required to accompany evolving astronomy and prepare for the next generation X-ray observatory, Athena. Here we present XMM2ATHENA, a programme funded by the European Union's Horizon 2020 research and innovation programme. XMM2ATHENA builds on foundations laid by the XMM-Newton Survey Science Centre (XMM-SSC), including key members of this consortium and the Athena Science ground segment, along with members of the X-ray community. The project is developing and testing new methods and software to allow the community to follow the X-ray transient sky in quasi-real time, identify multi-wavelength or messenger counterparts of XMM-Newton sources and determine their nature using machine learning. We detail here the first milestone delivery of the project, a new online, sensitivity estimator. We also outline other products, including the forthcoming innovative stacking procedure and detection algorithms to detect the faintest sources. These tools will then be adapted for Athena and the newly detected or identified sources will enhance preparation for observing the Athena X-ray sky.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10097v1"
    ],
    "publication_venue": "7 pages, 1 figure, accepted for publication in Astronomische Nachrichten"
}