{
    "arxiv_id": "2303.11299",
    "paper_title": "Prevailing Triaxial Shapes in Atomic Nuclei and a Quantum Theory of Rotation of Composite Objects",
    "authors": [
        "T. Otsuka",
        "Y. Tsunoda",
        "N. Shimizu",
        "Y. Utsuno",
        "T. Abe",
        "H. Ueno"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2024-12-24"
    ],
    "latest_version": 7,
    "categories": [
        "nucl-th",
        "nucl-ex"
    ],
    "abstract": "In the traditional view, heavy deformed nuclei are like axially-symmetric prolate ellipsoids, rotating about one of the short axes. In the present picture, their shapes may be triaxial. The triaxial shape yields complex rotations, which actually well reproduce experimental data, as confirmed by state-of-the-art Configuration Interaction calculations. Two origins are suggested for the triaxiality: (i) binding-energy gain by the symmetry restoration for triaxial shapes, and (ii) another gain by specific components of the nuclear force, like tensor force and high-multipole (e.g. hexadecupole) central force. While the origin (i) produces basic modest triaxiality for virtually all deformed nuclei, the origin (ii) produces more prominent triaxiality for a certain class of nuclei. An example of the former is 154Sm, a typical showcase of axial symmetry but is now suggested to depict a modest yet finite triaxiality. The latter, prominent triaxiality, is discussed from various viewpoints for some exemplified nuclei including 166Er, and experimental findings. Many-body structures of the gamma band and the double-gamma band are clarified. Regarding the general features of rotational states of deformed many-body systems including triaxial ones, the well-known J(J+1) rule of rotational excitation energies is derived, within the quantum mechanical many-body theory, without resorting to the quantization of a rotating classical rigid body. This derivation is extended to finite K. The present picture of the rotation is robust and can be applied to various shapes or configurations, including clusters and molecules. Thus, two long-standing open problems, (i) occurrence and origins of triaxiality and (ii) quantum many-body derivation of rotational energy, are resolved. Their possible relations to Davydov's rigid-triaxial-rotor model are mentioned.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11299v1",
        "http://arxiv.org/pdf/2303.11299v2",
        "http://arxiv.org/pdf/2303.11299v3",
        "http://arxiv.org/pdf/2303.11299v4",
        "http://arxiv.org/pdf/2303.11299v5",
        "http://arxiv.org/pdf/2303.11299v6",
        "http://arxiv.org/pdf/2303.11299v7"
    ],
    "publication_venue": "49 pages, 31 figures,revision from the v6 version (4 more pages, 1 more figure)"
}