{
    "arxiv_id": "2303.10297",
    "paper_title": "Quasiperiodicity in the $α-$Fermi-Pasta-Ulam-Tsingou system revisited: an approach using ideas from wave turbulence",
    "authors": [
        "Santhosh Ganapa"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.stat-mech",
        "math-ph",
        "nlin.CD"
    ],
    "abstract": "The Fermi-Pasta-Ulam-Tsingou (FPUT) problem addresses fundamental questions in statistical physics, and attempts to understand the origin of recurrences in the system have led to many great advances in nonlinear dynamics and mathematical physics. In this work we revisit the problem and study the cause of quasiperiodic recurrences in the weakly nonlinear $α-$FPUT system. Our aim is to understand if the FPUT recurrences that are observed in the original paper can be captured by the wave turbulence formalism, which is expected only if we are in the weakly nonlinear regime. In our work we show that this is not always the case and in particular, the recurrences observed in the original paper are not captured by the wave turbulence formalism. We attribute this disagreement to the presence of small denominators in the canonical transformation used to remove the three wave interactions before arriving at the starting point of wave turbulence. We also show that these small denominators are present even in the weakly nonlinear regime, and they become more significant as the system size is increased. We provide numerical evidence to support our claim. We also discuss our results in the context of the problem of equilibration in the $α-$FPUT system, and argue that the wave turbulence formalism needs to be modified for the $α-$FPUT chain in order to explain quasiperiodicity and thermalization in the system for a wider range of nonlinearities, and for larger system sizes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10297v1"
    ],
    "publication_venue": "17 pages, 6 figures"
}