{
    "arxiv_id": "2303.14864",
    "paper_title": "Bounds to electron spin qubit variability for scalable CMOS architectures",
    "authors": [
        "Jesús D. Cifuentes",
        "Tuomo Tanttu",
        "Will Gilbert",
        "Jonathan Y. Huang",
        "Ensar Vahapoglu",
        "Ross C. C. Leon",
        "Santiago Serrano",
        "Dennis Otter",
        "Daniel Dunmore",
        "Philip Y. Mai",
        "Frédéric Schlattner",
        "MengKe Feng",
        "Kohei Itoh",
        "Nikolay Abrosimov",
        "Hans-Joachim Pohl",
        "Michael Thewalt",
        "Arne Laucht",
        "Chih Hwan Yang",
        "Christopher C. Escott",
        "Wee Han Lim",
        "Fay E. Hudson",
        "Rajib Rahman",
        "Andrew S. Dzurak",
        "Andre Saraiva"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-08-03"
    ],
    "latest_version": 2,
    "categories": [
        "quant-ph",
        "cond-mat.mes-hall",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Spins of electrons in CMOS quantum dots combine exquisite quantum properties and scalable fabrication. In the age of quantum technology, however, the metrics that crowned Si/SiO2 as the microelectronics standard need to be reassessed with respect to their impact upon qubit performance. We chart the spin qubit variability due to the unavoidable atomic-scale roughness of the Si/SiO$_2$ interface, compiling experiments in 12 devices, and developing theoretical tools to analyse these results. Atomistic tight binding and path integral Monte Carlo methods are adapted for describing fluctuations in devices with millions of atoms by directly analysing their wavefunctions and electron paths instead of their energy spectra. We correlate the effect of roughness with the variability in qubit position, deformation, valley splitting, valley phase, spin-orbit coupling and exchange coupling. These variabilities are found to be bounded and lie within the tolerances for scalable architectures for quantum computing as long as robust control methods are incorporated.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14864v1",
        "http://arxiv.org/pdf/2303.14864v2"
    ],
    "publication_venue": "20 pages, 8 figures"
}