{
    "arxiv_id": "2303.14194",
    "paper_title": "DeepEpiSolver: Unravelling Inverse problems in Covid, HIV, Ebola and Disease Transmission",
    "authors": [
        "Ritam Majumdar",
        "Shirish Karande",
        "Lovekesh Vig"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cs.AI",
        "q-bio.QM"
    ],
    "abstract": "The spread of many infectious diseases is modeled using variants of the SIR compartmental model, which is a coupled differential equation. The coefficients of the SIR model determine the spread trajectories of disease, on whose basis proactive measures can be taken. Hence, the coefficient estimates must be both fast and accurate. Shaier et al. in the paper \"Disease Informed Neural Networks\" used Physics Informed Neural Networks (PINNs) to estimate the parameters of the SIR model. There are two drawbacks to this approach. First, the training time for PINNs is high, with certain diseases taking close to 90 hrs to train. Second, PINNs don't generalize for a new SIDR trajectory, and learning its corresponding SIR parameters requires retraining the PINN from scratch. In this work, we aim to eliminate both of these drawbacks. We generate a dataset between the parameters of ODE and the spread trajectories by solving the forward problem for a large distribution of parameters using the LSODA algorithm. We then use a neural network to learn the mapping between spread trajectories and coefficients of SIDR in an offline manner. This allows us to learn the parameters of a new spread trajectory without having to retrain, enabling generalization at test time. We observe a speed-up of 3-4 orders of magnitude with accuracy comparable to that of PINNs for 11 highly infectious diseases. Further finetuning of neural network inferred ODE coefficients using PINN further leads to 2-3 orders improvement of estimated coefficients.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14194v1"
    ],
    "publication_venue": "Publication accepted at International Conference for Learning Representations 2023: First Workshop in Machine Learning and Global Health"
}