{
    "arxiv_id": "2303.10586",
    "paper_title": "Graded Differential Categories and Graded Differential Linear Logic",
    "authors": [
        "Jean-Simon Pacaud Lemay",
        "Jean-Baptiste Vienney"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2024-01-29"
    ],
    "latest_version": 6,
    "categories": [
        "cs.LO",
        "math.CT"
    ],
    "abstract": "In Linear Logic ($\\mathsf{LL}$), the exponential modality $!$ brings forth a distinction between non-linear proofs and linear proofs, where linear means using an argument exactly once. Differential Linear Logic ($\\mathsf{DiLL}$) is an extension of Linear Logic which includes additional rules for $!$ which encode differentiation and the ability of linearizing proofs. On the other hand, Graded Linear Logic ($\\mathsf{GLL}$) is a variation of Linear Logic in such a way that $!$ is now indexed over a semiring $R$. This $R$-grading allows for non-linear proofs of degree $r \\in R$, such that the linear proofs are of degree $1 \\in R$. There has been recent interest in combining these two variations of $\\mathsf{LL}$ together and developing Graded Differential Linear Logic ($\\mathsf{GDiLL}$). In this paper we present a sequent calculus for $\\mathsf{GDiLL}$, as well as introduce its categorical semantics, which we call graded differential categories, using both coderelictions and deriving transformations. We prove that symmetric powers always give graded differential categories, and provide other examples of graded differential categories. We also discuss graded versions of (monoidal) coalgebra modalities, additive bialgebra modalities, and the Seely isomorphisms, as well as their implementations in the sequent calculus of $\\mathsf{GDiLL}$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10586v1",
        "http://arxiv.org/pdf/2303.10586v2",
        "http://arxiv.org/pdf/2303.10586v3",
        "http://arxiv.org/pdf/2303.10586v4",
        "http://arxiv.org/pdf/2303.10586v5",
        "http://arxiv.org/pdf/2303.10586v6"
    ],
    "publication_venue": "In the proceedings of MFPS2023. Removed appendix from previous version to respect page limit. Minor corrections: the previous statement of one of our examples was incorrect, we thank Flavien Breuvart for explaining this to us. This has now been fixed. The rest of the paper remains unchanged"
}