{
    "arxiv_id": "2303.11236",
    "paper_title": "Plasmonic photothermal response of a phantom embedded with gold nanorod aggregates on broadband near-infrared irradiation",
    "authors": [
        "Dheeraj Pratap",
        "Rizul Gautam",
        "Amit Kumar Shaw",
        "Vikas",
        "Sanjeev Soni"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics",
        "physics.app-ph"
    ],
    "abstract": "Longer near-infrared wavelengths provide better penetration depth in biological tissues, so these are useful for plasmonic photothermal cancer therapeutics. In the context of nanoparticles for such applications, the absorption can be tuned for longer NIR wavelengths. However, on increasing the size of the nanoparticle, the scattering is enhanced and thus is not suitable for plasmonic therapeutics. Therefore, to overcome this issue, different types of small gold nanorods were synthesized and converted into stable aggregates to red-shift the plasmonic resonance wavelength to longer near-infrared wavelengths. The gold nanorod aggregates were embedded into the agarose gel phantoms mimicking the tumor-tissue-like structure. The photothermal response was measured through the prepared phantoms using a broadband near-infrared light source. It was shown that even in an extremely dilute concentration of gold nanorods, the photothermal heat generation could increase after the aggregation and also give gives deeper penetration of thermal energy. The observed photothermal response was also verified through numerical simulation. The current study shows better performance by increasing the plasmonic coupling, reducing the mismatch issue of plasmonic resonance shift in the second biological therapeutic window for the aggregates without increasing the size of individual nanoparticles. The aggregates provide better light penetration at deeper tissue by red-shifting the absorbance resonance wavelength which is useful for plasmonic photothermal cancer therapy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11236v1"
    ],
    "publication_venue": null
}