{
    "arxiv_id": "2303.15961",
    "paper_title": "MoS2/MoO3 Heterojunction: Dual Role of the Type II set-up and Band Gap Modulation of MoS2 upon Lithium-Ion Intercalation",
    "authors": [
        "Raheel Hammad",
        "Amar Kumar",
        "Tharangattu N. Narayanan",
        "Soumya Ghosh"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "In recent times photorechargeable metal ion batteries have garnered significant attention but the atomistic details of the mechanism of the charging process is still unknown. MoS2/MoOy, a type II semiconductor heterostructure, has been shown to function as photocathode where during discharge the lithium ion (Li-ion) intercalation happens mostly in MoS2 layers. Photoexposure leads to exciton formation and the type II set-up is supposed to generate spatially separated and longer-lived charge carriers. The Li intercalated MoS2 is known to undergo a phase transition from the semiconducting (2H) to a metallic (1T') phase. Hence, the proposal of exciton formation and its separation in LixMoS2 during photocharging needs closer inspection. In this study, with the help of density functional theory (DFT) based studies that is aptly supported by experimental data, it is shown that LixMoS2/MoO3 forms a type II heterostructure where the underlying band gap of LixMoS2 is exposed due to dispersion of electron density onto MoO3 upto a certain value of x. Further studies show that the type II arrangement is lost prior to the phase transition. In order to investigate the electronic structure and the phase transition upon lithiation in the explicit heterostructure, we introduced two unconventional computational schemes. The presence of the band gap and the ensuing type II arrangement in LixMoS2/MoO3 upto a certain concentration of the intercalated Li-ion justifies the possibility of the photocharging process. We believe that the general concepts explored in this study will be important in the rational design of type II heterostructures that can behave as photo-cathode materials in Li-ion batteries.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15961v1"
    ],
    "publication_venue": null
}