{
    "arxiv_id": "2303.10785",
    "paper_title": "On the Application of Gradient Based Reconstruction for Flow Simulations on Generalized Curvilinear and Dynamic Mesh Domains",
    "authors": [
        "Hemanth Chandravamsi",
        "Amareshwara Sainadh Chamarthi",
        "Natan Hoffmann",
        "Steven H. Frankel"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "Accurate high-speed flow simulations of practical interest require numerical methods with high-resolution properties. In this paper, we present an extension and demonstration of the high-accuracy Gradient-based reconstruction and $α$-damping schemes introduced by Chamarthi (2022) [1] for simulating high-speed flows in generalized curvilinear and dynamic mesh domains with the freestream preservation property. In the first part of this paper, the algorithms are detailed within the generalized curvilinear coordinate framework, with a focus on demonstration through stationary and dynamic mesh test cases. It has been shown both theoretically and through the use of test cases that the conservative metrics, including their interpolation to cell interfaces, must be numerically computed using a central scheme that is consistent with the inviscid flux algorithm to achieve the freestream preservation property. The second part of the paper illustrates the efficacy of the algorithm in simulating supersonic jet screech by displaying its capability to capture the screech tones and accurately characterize the unsteady lateral flapping mode of a Mach 1.35 under-expanded supersonic jet, in contrast to the WENO-Z scheme which fails to do so at the same grid resolution. In the final part of the paper, the parallelizability of the schemes on GPU architectures is demonstrated and performance metrics are evaluated. A significant speedup of over $200 \\times$ (compared to a single core CPU) and a reduction in simulation completion time to 34.5 hours per simulation were achieved for the supersonic jet noise case at a grid resolution of 13 million cells.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10785v1"
    ],
    "publication_venue": null
}