{
    "arxiv_id": "2303.12290",
    "paper_title": "Separability of four-dimensional Dirac equation in rotating pairwise-equal STU black hole space-time",
    "authors": [
        "M. Cvetic",
        "M. M. Stetsko"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "hep-th"
    ],
    "abstract": "Four dimensional Dirac equation on rotating pair-wise equal black hole space-time obtained in the paper of Cvetič and Youm \\cite{Cvetic_PRD96} in the framework of ungauged Supergravity is considered. The problem generalizes earlier examined Dirac equation for Kerr-Sen solution with equal electric charges \\cite{Houri_JHEP10}. Similarly as for the Kerr-Sen space-time the standard Dirac equation is not separable, to cure this problem a specific torsion term is introduced. It is shown the torsion term can be chosen non-uniquely giving rise to actually different modified Dirac equations. To derive torsion tensor two approaches are used, namely the first of them which is based on the notion of the generalized Killing-Yano tensors is utilized to obtain the torsion form in the Einstein frame, whereas the other one appeals to earlier observations that the torsion form might be identified with the $3$-form $H$-field is considered in the String frame. Both approaches give rise to modified Dirac equations which even in massive case are separable in corresponding frames. We have also shown that the generalized massless Dirac action which gives rise to our torsion-modified Dirac equation is invariant under conformal rescaling if the spinors are properly rescaled, similarly as it is for the standard Dirac action. It is shown that corresponding massless equations are also separable after conformal rescaling, this rescaling is nothing else but transformation from the Einstein frame to the String one or the converse transformation. Equations for the radial and angular wave-functions in the massless case are also examined, namely their general solutions are described. We also give very brief analysis of a technically sophisticated equation for the radial wave-function in the massive case.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12290v1"
    ],
    "publication_venue": "33 pages"
}