{
    "arxiv_id": "2303.11037",
    "paper_title": "Delayed closed-loop neurostimulation for the treatment of pathological brain rhythms in mental disorders",
    "authors": [
        "Thomas Wahl",
        "Joséphine Riedinger",
        "Michel Duprez",
        "Axel Hutt"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.NC",
        "math-ph"
    ],
    "abstract": "Mental disorders (MD) are among the top most demanding challenges in world-wide health. According to the World Health Organization, the burden of MDs continues to grow with significant impact on health and major social and human rights. A large number of MDs exhibit pathological rhythms, which serve as the disorders characteristic biomarkers. These rhythms are the targets for neurostimulation techniques. Open-loop neurostimulation employs stimulation protocols, which are rather independent of the patients health and brain state in the moment of treatment. Most alternative closed-loop stimulation protocols consider real-time brain activity observations but appear as adaptive open-loop protocols, where e.g. pre-defined stimulation sets in if observations fulfil pre-defined criteria. The present theoretical work proposes a fully-adaptive closed-loop neurostimulation setup, that tunes the brain activities power spectral density (PSD) according to a user-defined PSD. The utilized brain model is non-parametric and estimated from the observations via magnitude fitting in a pre-stimulus setup phase. Moreover, the algorithm takes into account possible conduction delays in the feedback connection between observation and stimulation electrode. All involved features are illustrated on pathological alpha- and gamma-rhythms known from psychosis. To this end, we simulate numerically a linear neural population brain model and a non-linear cortico-thalamic feedback loop model recently derived to explain brain activity in psychosis.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11037v1"
    ],
    "publication_venue": null
}