{
    "arxiv_id": "2303.14982",
    "paper_title": "Contactium: A strongly correlated model system",
    "authors": [
        "Jerzy Cioslowski",
        "Berthold-Georg Englert",
        "Martin-Isbjörn Trappe",
        "Jun Hao Hue"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph",
        "cond-mat.quant-gas",
        "quant-ph"
    ],
    "abstract": "At the limit of an infinite confinement strength $ω$, the ground state of a system that comprises two fermions or bosons in a harmonic confinement interacting through the Fermi--Huang pseudopotential remains strongly correlated. A detailed analysis of the one-particle description of this ``contactium'' reveals several peculiarities that are not encountered in conventional model systems (such as the two-electron harmonium atom, ballium, and spherium) involving Coulombic interparticle interactions. First of all, none of the natural orbitals (NOs) $\\{ ψ_\\mathfrak{n}(ω;\\vec r) \\}$ of the contactium is unoccupied, which implies nonzero collective occupancies for all the angular momenta. Second, the NOs and their nonascendingly ordered occupation numbers $\\{ ν_\\mathfrak{n} \\}$ turn out to be related to the eigenfunctions and eigenvalues of a zero-energy Schrödinger equation with an attractive Gaussian potential. This observation enables the derivation of their properties such as the $\\mathfrak{n}^{-4/3}$ asymptotic decay of $ν_\\mathfrak{n}$ at the $\\mathfrak{n} \\to \\infty$ limit (which differs from that of $\\mathfrak{n}^{-8/3}$ in the Coulombic systems), the independence of the confinement energy ${v_\\mathfrak{n} = \\langle ψ_\\mathfrak{n}(ω;\\vec r) | \\frac{1}{2} %\nω^2r^2 | ψ_\\mathfrak{n}(ω;\\vec r) \\rangle}$  of $\\mathfrak{n}$, and the $\\mathfrak{n}^{-2/3}$ asymptotic decay of the respective contribution $ν_\\mathfrak{n}t_\\mathfrak{n}$ to the kinetic energy. Upon suitable scaling, the weakly occupied NOs of the contactium turn out to be virtually identical with those of the two-electron harmonium atom at the ${ω\\to \\infty}$ limit, despite the entirely different interparticle interactions in these systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14982v1"
    ],
    "publication_venue": "9 pages, 5 figures, 1 table",
    "doi": "10.1063/5.0150523"
}