{
    "arxiv_id": "2303.11601",
    "paper_title": "Significant enhancement of critical current density in H+-intercalated FeSe single crystal",
    "authors": [
        "Yan Meng",
        "Wei Wei",
        "Xiangzhuo Xing",
        "Xiaolei Yi",
        "Nan Zhou",
        "Yufeng Zhang",
        "Wenhui Liu",
        "Yue Sun",
        "Zhixiang Shi"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con"
    ],
    "abstract": "Superconducting transition temperature (Tc) and critical current density (Jc) are two key factors that are not only crucial for probing high-temperature superconducting mechanisms, but also for practical applications. The simple crystal structure of FeSe is very favorable for the fabrication of thin films and wires, but its application is limited by the relatively low Tc and small Jc. A previous study has found that the Tc of FeSe can be significantly enhanced over 40 K by using the protonation method. Here, we present a systematic study of Jc and vortex properties of H+-intercalated FeSe (Hx-FeSe) single crystals. The value of Jc for Hx-FeSe single crystal is significantly enhanced, exceeding 1.3*10^6 A/cm2 at 4 K, which is more than two orders of magnitude larger than 1.1*10^4 A/cm2 of pristine FeSe. The vortex pinning mechanism of Hx-FeSe is found to be surface pinning, which is different from the dominant strong point-like pinning in pristine FeSe. Moreover, the systematic study of the vortex phase transition and the underlying mechanism provides a wealth of information for the vortex phase diagram of Hx-FeSe single crystal. Our results confirm that the introduction of H+ intercalations into FeSe not only enhances the Tc, but also significantly increases the value of Jc, which is favorable for practical applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11601v1"
    ],
    "publication_venue": "13 pages, 5 figures",
    "doi": "10.1088/1361-6668/ac72cd"
}