{
    "arxiv_id": "2303.09928",
    "paper_title": "Angular correlation of the two gamma rays produced in the thermal neutron capture on gadolinium-155 and gadolinium-157",
    "authors": [
        "Pierre Goux",
        "Franz Glessgen",
        "Enrico Gazzola",
        "Mandeep Singh Reen",
        "William Focillon",
        "Michel Gonin",
        "Tomoyuki Tanaka",
        "Kaito Hagiwara",
        "Ajmi Ali",
        "Takashi Sudo",
        "Yusuke Koshio",
        "Makoto Sakuda",
        "Gianmaria Collazuol",
        "Atsushi Kimura",
        "Shoji Nakamura",
        "Nobuyuki Iwamoto",
        "Hideo Harada",
        "Michael Wurm"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "nucl-ex",
        "physics.ins-det"
    ],
    "abstract": "The ANNRI-Gd collaboration studied in detail the single $γ$-ray spectrum produced from the thermal neutron capture on $^{155}$Gd and $^{157}$Gd in the previous publications~\\cite{Hagiwara, Tanaka}. Gadolinium targets were exposed to a neutron beam provided by the Japan Spallation Neutron Source (JSNS) in J-PARC, Japan. In the present analysis, one new additional coaxial germanium crystal was used in the analysis in combination with the fourteen germanium crystals in the cluster detectors to study the angular correlation of the two $γ$ rays emitted in the same neutron capture. We present for the first time angular correlation functions for two $γ$ rays produced during the electromagnetic cascade transitions in the (n, $γ$) reactions on $^{\\rm 155}$Gd and $^{\\rm 157}$Gd. As expected, we observe the mild angular correlations for the strong, but rare transitions from the resonance state to the two energy levels of known spin-parities. Contrariwise, we observe negligibly small angular correlations for arbitrary pairs of two $γ$ rays produced in the majority of cascade transitions from the resonance state to the dense continuum states.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09928v1"
    ],
    "publication_venue": "21 pages, 13 figures"
}