{
    "arxiv_id": "2303.15625",
    "paper_title": "Phase-field Simulations of Polarization Variations in Polycrystalline Hf0.5Zr0.5O2 based MFIM: Voltage-Dependence and Dynamics",
    "authors": [
        "Revanth Koduru",
        "Imtiaz Ahmed",
        "Atanu K Saha",
        "Xiao Lyu",
        "Peide Ye",
        "Sumeet K. Gupta"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "physics.comp-ph"
    ],
    "abstract": "In this work, we investigate the device-to-device variations in remanent polarization of Hafnium-Zirconium-Oxide based Metal-Ferroelectric-Insulator-Metal (MFIM) stacks. We consider the effects of polycrystallinity in conjunction with multi-domain effects in HZO to understand the dependencies of variations on static and dynamic voltage stimuli using our 3D dynamic multi-grain phase-field simulation framework. We examine the trends in variations due to various design factors - set voltage, pulse amplitude and pulse width and correlate them to the dynamics of polarization switching and the underlying mechanisms. According to our analysis, variations exhibit a non-monotonic dependence on set voltage due to the interplay between voltage-dependent switching mechanisms and the polycrystalline structure. We further report that towards the higher end of the set voltages, collapsing of oppositely polarized domains can lead to increase in variations. We also show that ferroelectric thickness scaling lowers the device-to-device variations. In addition, considering the dynamics of polarization switching, we signify the key role of voltage and temporal dependence of domain nucleation in dictating the trends in variations. Finally, we show that to reach a target mean polarization, using a pulse with lower amplitude for longer duration results in lower variations compared to higher amplitude pulse for a shorter duration.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15625v1"
    ],
    "publication_venue": null
}