{
    "arxiv_id": "2303.17148",
    "paper_title": "The multifunctionality of lanthanum-strontium cobaltite nanopowder: high-pressure magnetic and excellent electrocatalytic properties for OER",
    "authors": [
        "Hanlin Yu",
        "N. A. Liedienov",
        "I. V. Zatovsky",
        "D. S. Butenko",
        "I. V. Fesych",
        "Wei Xu",
        "Songchun Rui",
        "Quanjun Li",
        "Bingbing Liu",
        "A. V. Pashchenko",
        "G. G. Levchenko"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "cond-mat.str-el",
        "physics.chem-ph"
    ],
    "abstract": "Simultaneous study of magnetic and electrocatalytic properties of cobaltites under extreme conditions expands understanding of physical and chemical processes proceeding in them with the possibility of their further practical application. Therefore, La0.6Sr0.4CoO3 (LSCO) nanopowders have been synthesized at different annealing temperatures tann = 850, 875, 900 C, and their multifunctional properties have been studied comprehensively. As tann increases, the rhombohedral perovskite structure of the LSCO becomes more single-phase, whereas average particle size and dispersion grow. Co ions are in mixed valence states, including major Co3+ and Co4+ components. It has been found that the LSCO-900 shows two main Curie temperatures, TC1 and TC2, associated with a particle size distribution. As an external hydrostatic pressure P increases, average <TC1> and <TC2> increase from 253 and 175 K under ambient pressure to 268 and 180 K under P = 0.8 GPa, respectively. At the same time, the antiferromagnetic temperature TAFM and blocking temperature TB also increase from 145 and 169 K to 158 and 170 K, respectively. The increment of <dTC/dP> for the smaller and bigger particles is sufficiently high and equals 10 and 13 K/GPa, respectively. The magnetocaloric effect in the LSCO-900 nanopowder is relatively weak but with an extremely wide peak > 50 K that makes this composition interesting to be used as one of the components of the composite expanding its working temperature window. Moreover, all LSCO samples showed excellent electrocatalytic performance for the overall water splitting (OER) process (overpotentials only 265-285 mV at a current density of 10 mA/cm2) with minimal values for LSCO-900. Based on the XPS data, it was found that the formation of a dense amorphous layer on the surface of the particles ensures high stability as a catalyst (at least 24 h) during electrolysis in 1 M KOH electrolyte.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17148v1"
    ],
    "publication_venue": "40 pages, 19 figures, 9 tables, 90 references, article"
}