{
    "arxiv_id": "2303.12020",
    "paper_title": "A search for Kuiper Belt occultations using the Weizmann Fast Astronomical Survey Telescope",
    "authors": [
        "Guy Nir",
        "Eran O. Ofek",
        "David Polishook",
        "Barak Zackay",
        "Sagi Ben-Ami"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Measuring the size distribution of small (km-scale) KBOs can help constrain models of Solar System formation and planetary migration. Such small, distant bodies are hard to detect with current or planned telescopes, but can be identified as sub-second occultations of background stars. We present the analysis of data from the Weizmann Fast Astronomical Survey Telescope (W-FAST), consisting of fast photometry of ~10^6 star hours at a frame rate of 10-25 Hz. Our pipeline utilizes a matched-filter approach with a large template bank, including red-noise treatment, and injection of simulated events for estimating the detection efficiency. The KBO radius at which our survey is 10% (50%) efficient is 1.1 (2.0) km. The data from 2020-2021 observing seasons were analyzed and no occultations were identified. We discuss a sample of sub-second false-positive events, both occultation-like and flare-like, which are still not fully understood but could be instructive for future surveys looking for short-duration events. We use our null-detection result to set limits on the km-scale KBO number density. Our individual radius bin limits are consistent with most previous works, with N(r>1km) <=10^6 deg^-2 (95% confidence limit). Our integrated (all size) limits, assuming a power law normalized to large (~45 km) KBOs gives a power law index q<3.93 (95% confidence limit). Finally, our results are in tension with a recently reported KBO detection from the ground, at the p=4x10^-4 level.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12020v1"
    ],
    "publication_venue": null
}