{
    "arxiv_id": "2303.17244",
    "paper_title": "GEM Detectors for the CMS Endcap Muon System: status of three new detector stations",
    "authors": [
        "Piet Verwilligen"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ins-det",
        "hep-ex"
    ],
    "abstract": "The High-Luminosity LHC (HL-LHC, or Phase 2 LHC) will deliver proton-proton collisions at 5-7.5 times the nominal LHC luminosity, with an expected number of 140-200 pp-interactions per bunch crossing (Pile-up or PU). To maintain the performance of muon triggering and reconstruction under high background radiation, the forward part of the Muon spectrometer of the CMS experiment will be upgraded with Gas Electron Multipliers (GEM) and improved Resistive Plate Chambers (iRPC) detectors. A first GEM station (GE1/1) was installed during long-shutdown 2 (LS2, 2019-2021), a 2$^{\\text{nd}}$ station (GE2/1) of Triple-GEM detectors will be installed in winter 2023-24 and 2024-25, while a new 6-layer station (ME0) will be installed in the third long shutdown (LS3, 2026-2028). GE11 is considered an early Phase 2 upgrade as it will reduce the $p_{T}$ threshold by combining GEM and Cathode Strip Chamber (CSC) hits in the forward muon system at twice the LHC design luminosity ($\\mathcal{L} = 2 \\cdot 10^{34}$ cm$^{-2}$s$^{-1}$, 50 PU). After a successful start of Run 3 in 2022, with almost 40 fb$^{-1}$ collected, the commissioning of the GE1/1 detector is nearly complete. Most chambers are operated stabily with an efficiency in excess of 95%, next being the demonstration of the combined CSC-GEM trigger in 2023. The lessons learnt with the first large-area GEM station have lead to improvements in detector and electronics design for the Phase 2 detectors GE2/1 and ME0. This proceeding will discuss the progress made since last MPGD Conference (MPGD 2019), discussing the commissioning and early performance of GE1/1; the design improvements and start of construction of GE2/1; and the R&D currently ongoing for ME0.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17244v1"
    ],
    "publication_venue": "The 7th International Conference on Micro Pattern Gaseous Detectors, MPGD2022"
}