{
    "arxiv_id": "2303.10477",
    "paper_title": "Rate dependence of damage formation in metallic-intermetallic Mg-Al-Ca composites",
    "authors": [
        "Setareh Medghalchi",
        "Muhammad Zubair",
        "Ehsan Karimi",
        "Stefanie Sandlöbes-Haut",
        "Ulrich Kerzel",
        "Sandra Korte-Kerzel"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "We study a cast Mg-4.65Al-2.82Ca alloy with a microstructure containing $α$-Mg matrix reinforced with a C36 Laves phase skeleton. Such ternary alloys are targeted for elevated temperature applications in automotive engines since they possess excellent creep properties. However, in application, the alloy may be subjected to a wide range of strain rates and in material development, accelerated testing is often of essence. It is therefore crucial to understand the effect of such rate variations. Here, we focus on their impact on damage formation. Due to the locally highly variable skeleton forming the reinforcement in this alloy, we employ an analysis based on high resolution panoramic imaging by scanning electron microscopy coupled with automated damage analysis by deep learning-based object detection and classification convolutional neural network algorithm (YOLOV5). We find that with decreasing strain rate the dominant damage mechanism for a given strain level changes: at a strain rate of $5\\cdot10^{-4}/s$ the evolution of microcracks in the C36 Laves phase governs damage formation. However , when the strain rate is decreased to $5\\cdot10^{-6}/s$, interface decohesion at the $α$-Mg/Laves phase interfaces becomes equally important. We also observe a change in crack orientation indicating an increasing influence of plastic co-deformation of the α-Mg matrix and Laves phase. We attribute this transition in leading damage mechanism to thermally activated processes at the interface.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10477v1"
    ],
    "publication_venue": null
}