{
    "arxiv_id": "2303.15267",
    "paper_title": "Revisiting progenitor-age dependence of type Ia supernova luminosity standardization process",
    "authors": [
        "Junchao Wang",
        "Zhiqi Huang",
        "Lu Huang"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-09-25"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "Much of the research in supernova cosmology is based on an assumption that the peak luminosity of type Ia supernovae (SNe Ia), after a standardization process, is independent of the galactic environment. A series of recent studies suggested that there is a significant correlation between the standardized luminosity and the progenitor age of SNe Ia. The correlation found in the most recent work by Lee et al. is strong enough to explain the extra dimming of distant SNe Ia and therefore casts doubts on the direct evidence of cosmic acceleration. The present work incorporates the uncertainties of progenitor ages, which were ignored in Lee et al., into a fully Bayesian inference framework. We find a weaker dependence of supernova standardized luminosity on the progenitor age, but the detection of correlation remains significant (3.5$σ$). Assuming that such correlation can be extended to high redshift and applying it to the Pantheon SN Ia data set, we confirm that when the Hubble residual does not include intrinsic scatter, the age-bias could be the primary cause of the observed extra dimming of distant SNe Ia. Furthermore, we use the PAge formalism, which is a good approximation to many dark energy and modified gravity models, to do a model comparison. We find that if intrinsic scatter is included in the Hubble residual, the Lambda cold dark matter model remains a good fit. However, in a scenario without intrinsic scatter, the Lambda cold dark matter model faces a challenge.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15267v1",
        "http://arxiv.org/pdf/2303.15267v2"
    ],
    "publication_venue": "8 pages, 6 figures, 2 tables. Accepted for publication in SCPMA"
}