{
    "arxiv_id": "2303.12018",
    "paper_title": "The CMS di-photon excess at 95 GeV in view of the LHC Run 2 results",
    "authors": [
        "T. Biekötter",
        "S. Heinemeyer",
        "G. Weiglein"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-04-18"
    ],
    "latest_version": 2,
    "categories": [
        "hep-ph"
    ],
    "abstract": "The CMS collaboration has recently reported the results of a low-mass Higgs-boson search in the di-photon final state based on the full Run 2 data set with refined analysis techniques. The new results show an excess of events at a mass of about 95 GeV with a local significance of $2.9\\,σ$, confirming a previously reported excess at about the same mass and similar significance based on the first-year Run 2 plus Run 1 data. The observed excess is compatible with the limits obtained in the corresponding ATLAS searches. In this work, we discuss the di-photon excess and show that it can be interpreted as the lightest Higgs boson in the Two-Higgs doublet model that is extended by a complex singlet (S2HDM) of Yukawa types II and IV. We show that the second-lightest Higgs boson is in good agreement with the current LHC Higgs-boson measurements of the state at 125 GeV, and that the full scalar sector is compatible with all theoretical and experimental constraints. Furthermore, we discuss the di-photon excess in conjunction with an excess in the $b \\bar b$ final state observed at LEP and an excess observed by CMS in the di-tau final state, which were found at comparable masses with local significances of about $2σ$ and $3σ$, respectively. We find that the $b \\bar b$ excess can be well described together with the di-photon excess in both types of the S2HDM. However, the di-tau excess can only be accommodated at the level of $1σ$ in type IV. We also comment on the compatibility with supersymmetric scenarios and other extended Higgs sectors, and we discuss how the potential signal can be further analyzed at the LHC and at future $e^+e^-$ colliders.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12018v1",
        "http://arxiv.org/pdf/2303.12018v2"
    ],
    "publication_venue": "14 pages, 4 figures, v2: Updated with CMS signal strength value and added references"
}