{
    "arxiv_id": "2303.09202",
    "paper_title": "Quantum coherent control of non-linear thermoelectric transport in a triple-dot Aharonov-Bohm heat engine",
    "authors": [
        "Jayasmita Behera",
        "Salil Bedkihal",
        "Bijay Kumar Agarwalla",
        "Malay Bandyopadhyay"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-11-03"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "We investigate the role of quantum coherence and higher harmonics resulting from multiple-path interference in nonlinear thermoelectricity in a two-terminal triangular triple-dot Aharonov-Bohm (AB) interferometer. We quantify the trade-off between efficiency and power in the nonlinear regime of our simple setup comprising three non-interacting quantum dots (two connected to two biased metallic reservoirs) placed at the vertex of an equilateral triangle, and a magnetic flux $Φ$ pierces it perpendicularly. For a spatially symmetric setup, we achieve optimal efficiency and power output when the inter-dot tunneling strength is comparable to the dot-lead coupling, AB phase $φ=π/2$. Our analysis reveals that the presence of higher harmonics is necessary but not sufficient to achieve optimal power output. The maximal constructive interference represented by three close-packed resonance peaks of the unit transmission can enhance the power output ($P_{max}\\sim 2.35\\,\\mathrm{fW}$) almost 3.5 times as compared to the case where only a single channel participates in the transport, and the corresponding efficiency is about $0.80η_{c}$ where $η_{c}$ is the Carnot efficiency. Geometric asymmetries and their effects on efficiency and power output are also investigated. An asymmetric setup characterized by the ratio of the coupling to the source and the drain terminals ($x$) can further enhance the maximum power output $P_{max}\\sim 3.85\\,\\mathrm{fW}$ for $x=1.5$ with the same efficiency as that of the symmetric case. Our investigation reveals that the output power and efficiency are optimal in the wide-band limit. The power output is significantly reduced for the narrow-band case. On the other hand, disorder effects radically reduce the performance of the heat engine.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09202v1",
        "http://arxiv.org/pdf/2303.09202v2"
    ],
    "publication_venue": null
}