{
    "arxiv_id": "2303.17641",
    "paper_title": "Polarization Formalism for ALP-induced X-ray Emission from Magnetars",
    "authors": [
        "Jean-François Fortin",
        "Kuver Sinha"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "hep-ph"
    ],
    "abstract": "Missions like NASA's Imaging X-ray Polarimetry Explorer (IXPE) are poised to provide an unprecedented view of the Universe in polarized X-rays. Polarization probes physical anisotropies, a fact exploited by particle physicists to look for the anisotropic $a\\boldsymbol{E}\\cdot\\boldsymbol{B}$ operator in the axion-like-particle (ALP) Lagrangian. Such studies have typically focused on polarization in the radio and microwaves, through local or cosmic birefringence effects. To such polarization studies we add X-rays emanating from magnetars -- a class of neutron stars with near-critical strength magnetic fields -- that are important targets for IXPE. ALPs produced in the neutron star core convert to X-rays in the magnetosphere; such X-rays are polarized along the direction parallel to the dipolar magnetic field at the point of conversion. We develop the full theoretical formalism for ALP-induced polarization in the presence of dipolar magnetic fields. For uncorrelated photon and ALP production mechanisms, we completely disentangle the ALP contributions to the Stokes parameters in terms of the ALP intensity, the ALP-to-photon conversion probability, and the ALP-induced birefringence. In the proper limit, our results demonstrate that the inclusion of ALPs suppresses the observed degree of circular polarization compared to its pure astrophysical value. Our results can also be used to impose limits on ALP couplings with IXPE polarization data from magnetars 4U 0142+61 and 1RXS J170849.0-400910, the subject of upcoming work.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17641v1"
    ],
    "publication_venue": "1+22 pages, 2 figures"
}