{
    "arxiv_id": "2303.08148",
    "paper_title": "Rotational Symmetry Protected Edge and Corner States in Abelian topological phases",
    "authors": [
        "Naren Manjunath",
        "Abhinav Prem",
        "Yuan-Ming Lu"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.str-el",
        "cond-mat.mes-hall"
    ],
    "abstract": "Spatial symmetries can enrich the topological classification of interacting quantum matter and endow systems with non-trivial strong topological invariants (protected by internal symmetries) with additional \"weak\" topological indices. In this paper, we study the edge physics of systems with a non-trivial shift invariant, which is protected by either a continuous $\\text{U}(1)_r$ or discrete $\\text{C}_n$ rotation symmetry, along with internal $\\text{U}(1)_c$ charge conservation. Specifically, we construct an interface between two systems which have the same Chern number but are distinguished by their Wen-Zee shift and, through analytic arguments supported by numerics, show that the interface hosts counter-propagating gapless edge modes which cannot be gapped by arbitrary local symmetry-preserving perturbations. Using the Chern-Simons field theory description of two-dimensional Abelian topological orders, we then prove sufficient conditions for continuous rotation symmetry protected gapless edge states using two complementary approaches. One relies on the algebraic Lagrangian sub-algebra framework for gapped boundaries while the other uses a more physical flux insertion argument. For the case of discrete rotation symmetries, we extend the field theory approach to show the presence of fractional corner charges for Abelian topological orders with gappable edges, and compute them in the case where the Abelian topological order is placed on the two-dimensional surface of a Platonic solid. Our work paves the way for studying the edge physics associated with spatial symmetries in symmetry enriched topological phases.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08148v1",
        "http://arxiv.org/pdf/2303.08148v2"
    ],
    "publication_venue": "9 + 2 pages, 2 figures. Added references and improved discussion in Sec II"
}