{
    "arxiv_id": "2303.16262",
    "paper_title": "Programming hydrogel adhesion with engineered polymer network topology",
    "authors": [
        "Zhen Yang",
        "Guangyu Bao",
        "Shuaibing Jiang",
        "Xingwei Yang",
        "Ran Huo",
        "Xiang Ni",
        "Luc Mongeau",
        "Rong Long",
        "Jianyu Li"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft"
    ],
    "abstract": "Hydrogel adhesion that can be easily modulated in magnitude, space, and time is desirable in many emerging applications ranging from tissue engineering, and soft robotics, to wearable devices. In synthetic materials, these complex adhesion behaviors are often achieved individually with mechanisms and apparatus that are difficult to integrate. Here, we report a universal strategy to embody multifaceted adhesion programmability in synthetic hydrogels. By designing the surface network topology of a hydrogel, supramolecular linkages that result in contrasting adhesion behaviors are formed on the hydrogel interface. The incorporation of different topological linkages leads to dynamically tunable adhesion with high-resolution spatial programmability without alteration of bulk mechanics and chemistry. Further, the association of linkages enables stable and tunable adhesion kinetics that can be tailored to suit different applications. We rationalize the physics of chain slippage, rupture, and diffusion that underpins emergent programmable behaviors. We then incorporate the strategy into the designs of various devices such as smart wound patches, fluidic channels, drug-eluting devices, and reconfigurable soft robotics. Our study presents a simple and robust platform in which adhesion controllability in multiple aspects can be easily integrated into a single design of a hydrogel network.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16262v1"
    ],
    "publication_venue": null
}