{
    "arxiv_id": "2303.12221",
    "paper_title": "Detection of Interstellar $E$-1-cyano-1,3-butadiene in GOTHAM Observations of TMC-1",
    "authors": [
        "Ilsa R. Cooke",
        "Ci Xue",
        "P. Bryan Changala",
        "Hannah Toru Shay",
        "Alex N. Byrne",
        "Qi Yu Tang",
        "Zachary T. P. Fried",
        "Kin Long Kelvin Lee",
        "Ryan A. Loomis",
        "Thanja Lamberts",
        "Anthony Remijan",
        "Andrew M. Burkhardt",
        "Eric Herbst",
        "Michael C. McCarthy",
        "Brett A. McGuire"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We report the detection of the lowest energy conformer of $E$-1-cyano-1,3-butadiene ($E$-1-C$_4$H$_5$CN), a linear isomer of pyridine, using the fourth data reduction of the GOTHAM deep spectral survey toward TMC-1 with the 100 m Green Bank Telescope. We performed velocity stacking and matched filter analyses using Markov chain Monte Carlo simulations and find evidence for the presence of this molecule at the 5.1$σ$ level. We derive a total column density of $3.8^{+1.0}_{-0.9}\\times 10^{10}$ cm$^{-2}$, which is predominantly found toward two of the four velocity components we observe toward TMC-1. We use this molecule as a proxy for constraining the gas-phase abundance of the apolar hydrocarbon 1,3-butadiene. Based on the three-phase astrochemical modeling code NAUTILUS and an expanded chemical network, our model underestimates the abundance of cyano-1,3-butadiene by a factor of 19, with a peak column density of $2.34 \\times 10^{10}\\ \\mathrm{cm}^{-2}$ for 1,3-butadiene. Compared to the modeling results obtained in previous GOTHAM analyses, the abundance of 1,3-butadiene is increased by about two orders of magnitude. Despite this increase, the modeled abundances of aromatic species do not appear to change and remain underestimated by 1--4 orders of magnitude. Meanwhile, the abundances of the five-membered ring molecules increase proportionally with 1,3-butadiene by two orders of magnitudes. We discuss implications for bottom-up formation routes to aromatic and polycyclic aromatic molecules.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12221v1"
    ],
    "publication_venue": null,
    "doi": "10.3847/1538-4357/acc584"
}