{
    "arxiv_id": "2303.08716",
    "paper_title": "Thermal evolution of neutron stars in soft X-ray transients with thermodynamically consistent models of the accreted crust",
    "authors": [
        "A. Y. Potekhin",
        "M. E. Gusakov",
        "A. I. Chugunov"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-05-01"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Thermal emission of neutron stars in soft X-ray transients (SXTs) in a quiescent state is believed to be powered by the heat deposited in the stellar crust due to nuclear reactions during accretion (deep crustal heating paradigm). Confronting observations of SXTs with simulations helps to verify theoretical models of the dense matter in the neutron stars. Usually, such simulations were carried out assuming that the free neutrons and nuclei in the inner crust move together. A recently proposed thermodynamically consistent approach allows for independent motion of the free neutrons. We simulate the thermal evolution of the SXTs within the thermodynamically consistent approach and compare the results with the traditional approach and with observations. For the latter, we consider a collection of quasi-equilibrium thermal luminosities of the SXTs in quiescence and the observed neutron star crust cooling in SXT MXB 1659$-$29. We test different models of the equation of state and baryon superfluidity and take into account additional heat sources in the shallow layers of neutron-star crust (the shallow heating). We find that the observed quasi-stationary thermal luminosities of the SXTs can be equally well fitted using the traditional and thermodynamically consistent models, provided that the shallow heat diffusion into the core is taken into account. The observed crust cooling in MXB 1659$-$29 can also be fitted in the frames of both models, but the choice of the model affects the derived parameters responsible for the thermal conductivity in the crust and for the shallow heating.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08716v1",
        "http://arxiv.org/pdf/2303.08716v2"
    ],
    "publication_venue": "11 pages, 13 figures, 2 tables, accepted by MNRAS. In v2, beside minor text improvements, caption and headers of the tables are corrected and a few observational points in figures are updated"
}