{
    "arxiv_id": "2303.08279",
    "paper_title": "Terrestrial and Neptune mass free-floating planet candidates from the MOA-II 9-year Galactic Bulge survey",
    "authors": [
        "Naoki Koshimoto",
        "Takahiro Sumi",
        "David P. Bennett",
        "Valerio Bozza",
        "Przemek Mróz",
        "Andrzej Udalski",
        "Nicholas J. Rattenbury",
        "Fumio Abe",
        "Richard Barry",
        "Aparna Bhattacharya",
        "Ian A. Bond",
        "Hirosane Fujii",
        "Akihiko Fukui",
        "Ryusei Hamada",
        "Yuki Hirao",
        "Stela Ishitani Silva",
        "Yoshitaka Itow",
        "Rintaro Kirikawa",
        "Iona Kondo",
        "Yutaka Matsubara",
        "Shota Miyazaki",
        "Yasushi Muraki",
        "Greg Olmschenk",
        "Clément Ranc",
        "Yuki Satoh",
        "Daisuke Suzuki",
        "Mio Tomoyoshi",
        "Paul J. Tristram",
        "Aikaterini Vandorou",
        "Hibiki Yama",
        "Kansuke Yamashita"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
    ],
    "abstract": "We report the discoveries of low-mass free-floating planet (FFP) candidates from the analysis of 2006-2014 MOA-II Galactic bulge survey data. In this dataset, we found 6,111 microlensing candidates and identified a statistical sample consisting of 3,535 high quality single lens events with Einstein radius crossing times in the range $0.057 < t_{\\rm E}/{\\rm days} < 757$, including 13 events that show clear finite source effects with angular Einstein radii of $0.90<θ_{\\rm E}/{\\rm μas} <332.54$. Two of the 12 events with $t_{\\rm E} < 1$ day have significant finite source effects, and one event, MOA-9y-5919, with $t_{\\rm E}=0.057\\pm 0.016$ days and $θ_{\\rm E}= 0.90 \\pm 0.14$ $μ$as, is the second terrestrial mass FFP candidate to date. A Bayesian analysis indicates a lens mass of $0.75^{+1.23}_{-0.46}$ $M_\\oplus$ for this event. The low detection efficiency for short duration events implies a large population of low-mass FFPs. The microlensing detection efficiency for low-mass planet events depends on both the Einstein radius crossing times and the angular Einstein radii, so we have used image-level simulations to determine the detection efficiency dependence on both $t_{\\rm E}$ and $θ_{\\rm E}$. This allows us to use a Galactic model to simulate the $t_{\\rm E}$ and $θ_{\\rm E}$ distribution of events produced by the known stellar populations and models of the FFP distribution that are fit to the data. Methods like this will be needed for the more precise FFP demographics determinations from Nancy Grace Roman Space Telescope data.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08279v1"
    ],
    "publication_venue": "29 pages, 10 figures, 8 tables, submitted to an AAS journal"
}