{
    "arxiv_id": "2303.17527",
    "paper_title": "Diatomic molecules of alkali-metal and alkaline-earth-metal atoms: interaction potentials, dipole moments, and polarizabilities",
    "authors": [
        "Hela Ladjimi",
        "Michał Tomza"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "physics.atom-ph",
        "cond-mat.quant-gas",
        "physics.chem-ph"
    ],
    "abstract": "Ultracold diatomic molecules find application in quantum studies ranging from controlled chemistry and precision measurement physics to quantum many-body simulation and potentially quantum computing. Accurate knowledge of molecular properties is required to guide and explain ongoing experiments. Here, in an extensive and comparative study, we theoretically investigate the electronic properties of the ground-state diatomic molecules composed of alkali-metal (Li, Na, K, Rb, Cs, Fr) and alkaline-earth-metal (Be, Mg, Ca, Sr, Ba, Ra) atoms. We study 78 hetero- and homonuclear diatomic combinations, including 21 alkali-metal molecules in the $X^1Σ^+$ and $a^3Σ^+$ electronic states, 36 alkali-metal--alkaline-earth-metal molecules in the $X^2Σ^+$ electronic state, and 21 alkaline-earth-metal molecules in the $X^1Σ^+$ electronic state. We calculate potential energy curves, permanent electric dipole moments, and polarizabilities using the hierarchy of coupled cluster methods upto CCSDTQ with large Gaussian basis sets and small-core relativistic energy-consistent pseudopotentials. We collect and analyze corresponding spectroscopic constants. We estimate computational uncertainties and compare the present values with previous experimental and theoretical data to establish a new theoretical benchmark. The presented results should be useful for further application of the studied molecules in modern ultracold physics and chemistry experiments.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17527v1"
    ],
    "publication_venue": "29 pages, 10 figures, 7 tables"
}