{
    "arxiv_id": "2303.17286",
    "paper_title": "Charge fluctuations, phonons and superconductivity in multilayer graphene",
    "authors": [
        "Ziyan Li",
        "Xueheng Kuang",
        "Alejandro Jimeno-Pozo",
        "Héctor Sainz-Cruz",
        "Zhen Zhan",
        "Shengjun Yuan",
        "Francisco Guinea"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-07-19"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "cond-mat.supr-con"
    ],
    "abstract": "Motivated by the recent experimental detection of superconductivity in Bernal bilayer (AB) and rhombohedral trilayer (ABC) graphene, we study the emergence of superconductivity in multilayer graphene based on a Kohn-Luttinger (KL)-like mechanism in which the pairing glue is the screened Coulomb interaction. We find that electronic interactions alone can drive superconductivity in AB bilayer graphene and ABC trilayer graphene with the critical temperatures in good agreement with the experimentally observed ones, allowing us to further predict superconductivity from electronic interactions in Bernal ABA trilayer and ABAB tetralayer and rhombohedral ABCA tetralayer graphene. By comparing the critical temperatures ($T_c$) of these five non-twisted graphene stacks, we find that the ABC trilayer graphene possesses the highest $T_c\\sim100$ mK. After considering the enhancement of superconductivity due to Ising spin-orbit coupling, we observe that the AB bilayer graphene has the largest enhancement in the critical temperature, increasing from 23 mK to 143 mK. The superconducting behaviors in these non-twisted graphene stacks could be explained by the order parameters (OPs). The OPs of Bernal stacks preserve intravalley $C_3$ symmetry, whereas rhombohedral stacks break it. In all stacks, the OPs have zeroes and change signs between valleys, which means that these multilayers of graphene are nodal spin-triplet superconductors. Moreover, dressing the purely electronic interaction with acoustic phonons, we observe minor changes of the critical temperatures in these five stacks. We adopt the KL-like mechanism to investigate the tendency of superconductivity in multilayer graphene without fitting parameters, which could provide guidance to future experiments exploring superconductivity in non-twisted graphene.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17286v1"
    ],
    "publication_venue": "11 pages, 7 figures, 2 tables",
    "doi": "10.1103/PhysRevB.108.045404"
}