{
    "arxiv_id": "2303.12428",
    "paper_title": "Quantitative non-classicality of mediated interactions",
    "authors": [
        "Ray Ganardi",
        "Ekta Panwar",
        "Mahasweta Pandit",
        "Bianka Wołoncewicz",
        "Tomasz Paterek"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "In plethora of physical situations one can distinguish a mediator -- a system that couples other, non-interacting systems. Often the mediator itself is not directly accessible to experimentation, yet it is interesting and sometimes crucial to understand if it admits non-classical properties. An example of this sort that recently enjoys considerable attention are two quantum masses coupled via gravitational field. It has been argued that the gain of quantum entanglement between the masses indicates non-classical states of the whole tripartite system. Here, we focus on non-classical properties of the involved interactions rather than the involved states. We derive inequalities whose violation indicates non-commutativity and non-decomposability (open system generalisation of non-commuting unitaries) of interactions through the mediators. The derivations are based on properties of general quantum formalism and make minimalistic assumptions about the studied systems, in particular the interactions can remain uncharacterised throughout the assessment. Furthermore, we also present conditions that solely use correlations between the coupled systems, excluding the need to measure the mediator. Next, we show that the amount of violation places a lower bound on suitably defined degree of non-decomposability. This makes the methods quantitative and at the same time experiment ready. We give applications of these techniques in two different fields: for detecting non-classicality of gravitational interaction and in bounding the Trotter error in quantum simulations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12428v1"
    ],
    "publication_venue": "12 pages, 1 figure"
}