{
    "arxiv_id": "2303.15051",
    "paper_title": "A Time-invariant Network Flow Model for Two-person Ride-pooling Mobility-on-Demand",
    "authors": [
        "Fabio Paparella",
        "Leonardo Pedroso",
        "Theo Hofman",
        "Mauro Salazar"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2024-01-25"
    ],
    "latest_version": 1,
    "categories": [
        "math.OC"
    ],
    "abstract": "This paper presents a time-invariant network flow model capturing two-person ride-pooling that can be integrated within design and planning frameworks for Mobility-on-Demand systems. In these type of models, the arrival process of travel requests is described by a Poisson process, meaning that there is only statistical insight into request times, including the probability that two requests may be pooled together. Taking advantage of this feature, we devise a method to capture ride-pooling from a stochastic mesoscopic perspective. This way, we are able to transform the original set of requests into an equivalent set including pooled ones which can be integrated within standard network flow problems, which in turn can be efficiently solved with off-the-shelf LP solvers for a given ride-pooling request assignment. Thereby, to compute such an assignment, we devise a polynomial-time algorithm that is optimal w.r.t. an approximated version of the problem. Finally, we perform a case study of Sioux Falls, South Dakota, USA, where we quantify the effects that waiting time and experienced delay have on the vehicle-hours traveled. Our results suggest that the higher the demands per unit time, the lower the waiting time and delay experienced by users. In addition, for a sufficiently large number of demands per unit time, with a maximum waiting time and experienced delay of 5 minutes, more than 90% of the requests can be pooled.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15051v1"
    ],
    "publication_venue": null,
    "doi": "10.1109/CDC49753.2023.10384279"
}