{
    "arxiv_id": "2303.09149",
    "paper_title": "Contact Angle Hysteresis on Rough Surfaces Part II: Energy Dissipation via Microscale Interface Dynamics",
    "authors": [
        "Pawan Kumar",
        "Dalton J. E. Harvie"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn",
        "cond-mat.soft"
    ],
    "abstract": "The wetting behaviour of surfaces is important for various applications like super-hydrophobic surfaces, enhanced oil recovery, mining of metal ores and anti-icing surfaces etc. For rough surfaces, which are the rule rather than the exception, designing textured surfaces that have wetting properties tailored to suit these applications generally involves either bio-mimicry or trial and error. Existing wetting theories such as the well-known Wenzel (1936) and Cassie & Baxter (1944) models do not predict wetting regimes and importantly, only give a single equilibrium angle rather than a range of stable contact angles (hysteresis) as observed in reality. In this paper, we use a roughness-scale mechanical energy balance (derived in part I) combined with simulations of micro-scale interface dynamics based on open-source software (Surface Evolver (Brakke 1992)) to calculate the energy dissipation during the motion of an interface over a chemically homogeneous rough surface. This dissipation is used to predict contact angle hysteresis (CAH) from knowledge of just the surface roughness topography and equilibrium contact angle. We simulate interface dynamics over a surface decorated with a periodic array of round-edge square pillars and show that the energy dissipated varies approximately as $φlnφ$ with the area fraction ($φ$), and becomes zero as $φ \\to 0$. The CAH predicted by our method is in good agreement with the experimental results of Forsberg et al. (2010), especially at low area fractions. We also compute CAH for an interface moving at 45$°$ to the surface periodicity direction, showing that the experimental measurements are bracketed by the 0$°$ and 45$°$ advance direction results.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09149v1"
    ],
    "publication_venue": "To be published in Journal of Fluid Mechanics, 55 pages, 39 figures"
}