{
    "arxiv_id": "2303.13371",
    "paper_title": "Plug-and-Play Regulators for Image-Text Matching",
    "authors": [
        "Haiwen Diao",
        "Ying Zhang",
        "Wei Liu",
        "Xiang Ruan",
        "Huchuan Lu"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV",
        "cs.MM"
    ],
    "abstract": "Exploiting fine-grained correspondence and visual-semantic alignments has shown great potential in image-text matching. Generally, recent approaches first employ a cross-modal attention unit to capture latent region-word interactions, and then integrate all the alignments to obtain the final similarity. However, most of them adopt one-time forward association or aggregation strategies with complex architectures or additional information, while ignoring the regulation ability of network feedback. In this paper, we develop two simple but quite effective regulators which efficiently encode the message output to automatically contextualize and aggregate cross-modal representations. Specifically, we propose (i) a Recurrent Correspondence Regulator (RCR) which facilitates the cross-modal attention unit progressively with adaptive attention factors to capture more flexible correspondence, and (ii) a Recurrent Aggregation Regulator (RAR) which adjusts the aggregation weights repeatedly to increasingly emphasize important alignments and dilute unimportant ones. Besides, it is interesting that RCR and RAR are plug-and-play: both of them can be incorporated into many frameworks based on cross-modal interaction to obtain significant benefits, and their cooperation achieves further improvements. Extensive experiments on MSCOCO and Flickr30K datasets validate that they can bring an impressive and consistent R@1 gain on multiple models, confirming the general effectiveness and generalization ability of the proposed methods. Code and pre-trained models are available at: https://github.com/Paranioar/RCAR.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13371v1"
    ],
    "publication_venue": "13 pages, 9 figures, Accepted by TIP2023",
    "doi": "10.1109/TIP.2023.3266887"
}