{
    "arxiv_id": "2303.12226",
    "paper_title": "Production of neptunium and plutonium nuclides from uranium carbide using 1.4-GeV protons",
    "authors": [
        "M. Au",
        "M. Athanasakis-Kaklamanakis",
        "L. Nies",
        "R. Heinke",
        "K. Chrysalidis",
        "U. Köster",
        "P. Kunz",
        "B. Marsh",
        "M. Mougeot",
        "L. Schweikhard",
        "S. Stegemann",
        "Y. Vila Gracia",
        "Ch. E. Düllmann",
        "S. Rothe"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 1,
    "categories": [
        "nucl-ex"
    ],
    "abstract": "Accelerator-based techniques are one of the leading ways to produce radioactive nuclei. In this work, the Isotope Separation On-Line method was employed at the CERN-ISOLDE facility to produce neptunium and plutonium from a uranium carbide target material using 1.4-GeV protons. Neptunium and plutonium were laser-ionized and extracted as 30-keV ion beams. A Multi-Reflection Time-of-Flight mass spectrometer was used for ion identification by means of time-of-flight measurements as well as for isobaric separation. Isotope shifts were investigated for the 395.6-nm ground state transition in $^{236,237,239}$Np and the 413.4-nm ground state transition in $^{236,239,240}$Pu. Rates of $^{235-241}$Np and $^{234-241}$Pu ions were measured and compared with predictions of in-target production mechanisms simulated with GEANT4 and FLUKA to elucidate the processes by which these nuclei, which contain more protons than the target nucleus, are formed. $^{241}$Pu is the heaviest nuclide produced and identified at a proton-accelerator-driven facility to date. We report the availability of neptunium and plutonium as two additional elements at CERN-ISOLDE and discuss the limit of accelerator-based isotope production at high-energy proton accelerator facilities for nuclides in the actinide region.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12226v1"
    ],
    "publication_venue": "12 pages, 12 figures",
    "doi": "10.1103/PhysRevC.107.064604"
}