{
    "arxiv_id": "2303.16978",
    "paper_title": "Hydrogen bonds in lead halide perovskites: insights from ab initio molecular dynamics",
    "authors": [
        "Alejandro Garrote-Márquez",
        "Lucas Lodeiro",
        "Rahul Suresh",
        "Norge Cruz Hernández",
        "Ricardo Grau-Crespo",
        "Eduardo Menéndez-Proupin"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-08-09"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.chem-ph"
    ],
    "abstract": "Hydrogen bonds (HBs) play an important role in the rotational dynamics of organic cations in hybrid organic/inorganic halide perovskites, affecting the structural and electronic properties of the perovskites. However, the properties and even the existence of HBs in these perovskites are not well established. We investigate HBs in perovskites MAPbBr$_3$ (MA$^+$=CH$_3$NH$_3^+$), FAPbI$_3$ (FA$^+$= CH(NH$_2$)$_2^+$), and their solid solution (FAPbI$_3$)$_{7/8}$(MAPbBr$_3$)$_{1/8}$, using ab initio molecular dynamics and electronic structure calculations. We consider HBs donated by X-H fragments (X=N, C) of the organic cations and accepted by the halides (Y=Br, I), and characterize their properties based on pair distribution functions and on a combined distribution function of hydrogen-acceptor distance with donor-hydrogen-acceptor angle. By analyzing these functions, we establish geometric criteria for HB existence based on hydrogen-acceptor distance $d(H-Y)$ and donor-hydrogen-acceptor angle $\\measuredangle(X-H-Y)$. The distance condition is defined as $d(H-Y)<0.3$ nm, for N-H-donated HBs, and $d(H-Y)<0.4$ nm for C-H-donated HBs. The angular condition is $135{^\\circ}\\le\\measuredangle(X-H-Y)\\le 180{^\\circ}$ for both types of HBs. At the simulated temperature (350 K), the HBs dynamically break and form. We compute time correlation functions of HB existence and HB lifetimes, which range between 0.1 and 0.3 picoseconds at that temperature. The analysis of HB lifetimes indicates that N-H--Br bonds are relatively stronger than N-H--I bonds, while C-H--Y bonds are weaker. To evaluate the impact of HBs on vibrational spectra, we present the power spectra, showing that peaks associated with N-H stretching modes in perovskites are redshifted and asymmetrically deformed compared with the peaks of isolated cations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16978v1"
    ],
    "publication_venue": "19 pages, 9 figures",
    "doi": "10.1021/acs.jpcc.3c02376"
}