{
    "arxiv_id": "2303.15431",
    "paper_title": "Confirmation and refutation of very luminous galaxies in the early universe",
    "authors": [
        "Pablo Arrabal Haro",
        "Mark Dickinson",
        "Steven L. Finkelstein",
        "Jeyhan S. Kartaltepe",
        "Callum T. Donnan",
        "Denis Burgarella",
        "Adam Carnall",
        "Fergus Cullen",
        "James S. Dunlop",
        "Vital Fernández",
        "Seiji Fujimoto",
        "Intae Jung",
        "Melanie Krips",
        "Rebecca L. Larson",
        "Casey Papovich",
        "Pablo G. Pérez-González",
        "Ricardo O. Amorín",
        "Micaela B. Bagley",
        "Véronique Buat",
        "Caitlin M. Casey",
        "Katherine Chworowsky",
        "Seth H. Cohen",
        "Henry C. Ferguson",
        "Mauro Giavalisco",
        "Marc Huertas-Company",
        "Taylor A. Hutchison",
        "Dale D. Kocevski",
        "Anton M. Koekemoer",
        "Ray A. Lucas",
        "Derek J. McLeod",
        "Ross J. McLure",
        "Norbert Pirzkal",
        "Lise-Marie Seillé",
        "Jonathan R. Trump",
        "Benjamin J. Weiner",
        "Stephen M. Wilkins",
        "Jorge A. Zavala"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-08-16"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "During the first 500 million years of cosmic history, the first stars and galaxies formed, seeding the Universe with heavy elements and eventually reionizing the intergalactic medium. Observations with JWST have uncovered a surprisingly high abundance of candidates for early star-forming galaxies, with distances (redshifts, $z$), estimated from multi-band photometry, as large as $z\\approx 16$, far beyond pre-JWST limits. While generally robust, such photometric redshifts can suffer from degeneracies and occasionally catastrophic errors. Spectroscopic measurement is required to validate these sources and to reliably quantify physical properties that can constrain galaxy formation models and cosmology. Here we present JWST spectroscopy that confirms redshifts for two very luminous galaxies with $z > 11$, but also demonstrates that another candidate with suggested $z\\approx 16$ instead has $z = 4.9$, with an unusual combination of nebular line emission and dust reddening that mimics the colors expected for much more distant objects. These results reinforce evidence for the early, rapid formation of remarkably luminous galaxies, while also highlighting the necessity of spectroscopic verification. The large abundance of bright, early galaxies may indicate shortcomings in current galaxy formation models, or deviation from physical properties (such as the stellar initial mass function) that are generally believed to hold at later times.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15431v1",
        "http://arxiv.org/pdf/2303.15431v2"
    ],
    "publication_venue": "Accelerated Article Preview (AAP) version published in Nature",
    "doi": "10.1038/s41586-023-06521-7"
}