{
    "arxiv_id": "2303.14277",
    "paper_title": "Impact of jets on kilonova photometric and polarimetric emission from binary neutron star mergers",
    "authors": [
        "Manisha Shrestha",
        "Mattia Bulla",
        "Lorenzo Nativi",
        "Ivan Markin",
        "Stephan Rosswog",
        "Tim Dietrich"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "A merger of binary neutron stars creates heavy unstable elements whose radioactive decay produces a thermal emission known as a kilonova. In this paper, we predict the photometric and polarimetric behaviour of this emission by performing 3-D Monte Carlo radiative transfer simulations. In particular, we choose three hydrodynamical models for merger ejecta, two including jets with different luminosities and one without a jet structure, to help decipher the impact of jets on the light curve and polarimetric behaviour. In terms of photometry, we find distinct color evolutions across the three models. Models without a jet show the highest variation in light curves for different viewing angles. In contrast, to previous studies, we find models with a jet to produce fainter kilonovae when viewed from orientations close to the jet axis, compared to a model without a jet. In terms of polarimetry, we predict relatively low levels (<~0.3-0.4%) at all orientations that, however, remain non-negligible until a few days after the merger and longer than previously found. Despite the low levels, we find that the presence of a jet enhances the degree of polarization at wavelengths ranging from 0.25 to 2.5\\micron, an effect that is found to increase with the jet luminosity. Thus, future photometric and polarimetric campaigns should observe kilonovae in blue and red filters for a few days after the merger to help constrain the properties of the ejecta (e.g. composition) and jet.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14277v1"
    ],
    "publication_venue": "11 pages, 7 figures, submitted to MNRAS, comments welcome"
}