{
    "arxiv_id": "2303.12474",
    "paper_title": "Swinging in the States: Does disinformation on Twitter mirror the US presidential election system?",
    "authors": [
        "Manuel Pratelli",
        "Marinella Petrocchi",
        "Fabio Saracco",
        "Rocco De Nicola"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cs.SI"
    ],
    "abstract": "For more than a decade scholars have been investigating the disinformation flow on social media contextually to societal events, like, e.g., elections. In this paper, we analyze the Twitter traffic related to the US 2020 pre-election debate and ask whether it mirrors the electoral system. The U.S. electoral system provides that, regardless of the actual vote gap, the premier candidate who received more votes in one state `takes' that state. Criticisms of this system have pointed out that election campaigns can be more intense in particular key states to achieve victory, so-called {\\it swing states}. Our intuition is that election debate may cause more traffic on Twitter-and probably be more plagued by misinformation-when associated with swing states. The results mostly confirm the intuition. About 88\\% of the entire traffic can be associated with swing states, and links to non-trustworthy news are shared far more in swing-related traffic than the same type of news in safe-related traffic. Considering traffic origin instead, non-trustworthy tweets generated by automated accounts, so-called social bots, are mostly associated with swing states. Our work sheds light on the role an electoral system plays in the evolution of online debates, with, in the spotlight, disinformation and social bots.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12474v1"
    ],
    "publication_venue": "9 pages, 2 figures; Accepted @CySoc 2023, International Workshop on Cyber Social Threats, co-located with the ACM Web conference 2023, April 30, 2023. The present version is a preprint"
}