{
    "arxiv_id": "2303.12689",
    "paper_title": "Technical barriers for deep closed-loop geothermal",
    "authors": [
        "Mark McClure"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "physics.geo-ph"
    ],
    "abstract": "This is the most exciting time in my lifetime for geothermal. There are many, many innovative things happening. To name a few, promising new approaches to Enhanced Geothermal Systems, geothermal projects in sedimentary and lower enthalpy formations, new approaches for geothermal exploration, lithium extraction from produced brines, geothermal energy storage, integrations with CO2 storage and capture, and new technologies for producing energy from hot water that is coproduced with oil and gas. However, this post is about a concept about which I remain skeptical, deep closed-loop heat exchangers. These designs are sometimes called Advanced Geothermal Systems, AGS. To clarify, this blog post discusses the use of closed-loop heat exchangers in deep geothermal wells, 1000s of ft deep. This is a different application than the use of closed-loop heat exchangers in very shallow wells, 10s of ft deep, for ground source heat pumps. The fundamental challenge is that closed-loop heat exchanger designs rely on conduction, and sometimes free convection, to bring energy into the well. These processes are inherently much slower than forced convection, which is what drives energy transport into a conventional geothermal well. Slower energy transport means less revenue, and therefore, worse economics. In the past few years, there have been many creative new ideas for using closed-loop heat exchangers for geothermal energy production. Usually, these proposals recognize the challenge facing closed-loop, but introduce a wrinkle intended to overcome the problem. Despite these efforts, there are still daunting technical hurdles to widespread deployment of deep closed-loop geothermal. In this post, I go through some of the proposed designs and discuss key issues.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12689v1"
    ],
    "publication_venue": "This article was originally posted as a ResFrac Blog post"
}