{
    "arxiv_id": "2303.10621",
    "paper_title": "Mode-coupling theory of lattice dynamics for classical and quantum crystals",
    "authors": [
        "Aloïs Castellano",
        "J. P. Alvarinhas Batista",
        "Matthieu J. Verstraete"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-08-22"
    ],
    "latest_version": 3,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "The dynamical properties of nuclei, carried by the concept of phonon quasiparticles (QP), are central to the field of condensed matter. While the harmonic approximation can reproduce a number of properties observed in real crystals, the inclusion of anharmonicity in lattice dynamics is essential to accurately predict properties such as heat transport or thermal expansion. For highly anharmonic systems, non perturbative approaches are needed, which result in renormalized theories of lattice dynamics. In this article, we apply the Mori-Zwanzig projector formalism to derive an exact generalized Langevin equation describing the quantum dynamics of nuclei in a crystal. By projecting this equation on quasiparticles in reciprocal space, and with results from linear response theory, we obtain a formulation of vibrational spectra that fully accounts for the anharmonicity. Using a mode-coupling approach, we construct a systematic perturbative expansion in which each new order is built to minimize the following ones. With a truncation to the lowest order, we show how to obtain a set of self-consistent equations that can describe the lineshapes of quasiparticles. The only inputs needed for the resulting set of equations are the static Kubo correlation functions, which can be computed using (fully quantum) path-integral molecular dynamics or approximated with (classical or ab initio) molecular dynamics. We illustrate the theory with an application on fcc 4He, an archetypal quantum crystal with very strong anharmonicity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10621v1",
        "http://arxiv.org/pdf/2303.10621v2",
        "http://arxiv.org/pdf/2303.10621v3"
    ],
    "publication_venue": null
}