{
    "arxiv_id": "2303.09160",
    "paper_title": "Hear the quantum noise of photocurrent",
    "authors": [
        "Longjun Xiang",
        "Hao Jin",
        "Jian Wang"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Using light to detect the response of quantum materials is one of the most versatile tools in modern condensed matter physics. For instance, the injection current under light illumination can be exploited to probe the topological properties of materials without inversion ($\\mathcal{P}$) symmetry. Rather than detecting the averaged DC photocurrent response, we propose that the quantum fluctuation of photocurrent, in the form of DC shot noise (SN), can also be heard even when the DC photocurrent is forbidden by symmetry. Particularly, we develop the quantum theory for DC SN for gapped systems and identify four types of resonant DC SNs at the second order of electric field, dubbed shift SN, injection SN, jerk SN and snap SN in terms of their dependence on illumination time. Importantly, the expressions for all SN susceptibility tensors are also characterized by the gauge-invariant band topological quantities, such as the local quantum metric, the local Berry curvature, as well as the shift vector, and amenable to first-principles calculations. Furthermore, we discuss the symmetry constraints for all SNs and find that they are hardly forbidden by symmtry like the photocurrent. To illustrate our theory, we investigate the SNs in time-reversal-invariant two-dimensional materials GeS and MoS$_2$ with different symmetries. We confirm that the SNs can be heard even when the photocurrent responses are forbidden by $\\mathcal{P}$-symmetry and also reveal the relevance of band geometric quantities on SNs. Our work show that the quantum fluctuation of photocurrent can be informative and offer a complementary tool to characterize the symmetry and topology of quantum materials.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09160v1"
    ],
    "publication_venue": "two figures"
}