{
    "arxiv_id": "2303.13611",
    "paper_title": "Active and inactive microaneurysms identified and characterized by structural and angiographic optical coherence tomography",
    "authors": [
        "Min Gao",
        "Tristan T. Hormel",
        "Yukun Guo",
        "Kotaro Tsuboi",
        "Christina J. Flaxel",
        "David Huang",
        "Thomas S. Hwang",
        "Yali Jia"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.QM",
        "q-bio.TO"
    ],
    "abstract": "Purpose: To characterize flow status within microaneurysms (MAs) and quantitatively investigate their relations with regional macular edema in diabetic retinopathy (DR). Design: Retrospective, cross-sectional study. Participants: A total of 99 participants, including 23 with mild nonproliferative DR (NPDR), 25 with moderate NPDR, 34 with severe NPDR, 17 with proliferative DR. Methods: In this study, 3x3-mm optical coherence tomography (OCT) and OCT angiography (OCTA) scans with a 400x400 sampling density from one eye of each participant were obtained using a commercial OCT system. Trained graders manually identified MAs and their location relative to the anatomic layers from cross-sectional OCT. Microaneurysms were first classified as active if the flow signal was present in the OCTA channel. Then active MAs were further classified into fully active and partially active MAs based on the flow perfusion status of MA on en face OCTA. The presence of retinal fluid near MAs was compared between active and inactive types. We also compared OCT-based MA detection to fundus photography (FP) and fluorescein angiography (FA)-based detection. Results: We identified 308 MAs (166 fully active, 88 partially active, 54 inactive) in 42 eyes using OCT and OCTA. Nearly half of the MAs identified straddle the inner nuclear layer and outer plexiform layer. Compared to partially active and inactive MAs, fully active MAs were more likely to be associated with local retinal fluid. The associated fluid volumes were larger with fully active MAs than with partially active and inactive MAs. OCT/OCTA detected all MAs found on FP. While not all MAs seen with FA were identified with OCT, some MAs seen with OCT were not visible with FA or FP. Conclusions: Co-registered OCT and OCTA can characterize MA activities, which could be a new means to study diabetic macular edema pathophysiology.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13611v1"
    ],
    "publication_venue": null
}