{
    "arxiv_id": "2303.10544",
    "paper_title": "Quantum Causal Inference with Extremely Light Touch",
    "authors": [
        "Xiangjing Liu",
        "Yixian Qiu",
        "Oscar Dahlsten",
        "Vlatko Vedral"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2024-03-29"
    ],
    "latest_version": 3,
    "categories": [
        "quant-ph"
    ],
    "abstract": "We consider the quantum version of inferring the causal relation between events. There has been recent progress towards identifying minimal interventions and observations needed. We here give an explicit quantum causal inference scheme using quantum observations alone for the case of a bipartite quantum system with measurements at two times. In this scenario there may be combinations of temporal and spatial correlations. We derive a closed-form expression for the space-time pseudo-density matrix associated with many times and qubits. This matrix can be determined by coarse-grained quantum observations alone and the protocol is in that sense extremely light touch. We prove that if there is no signalling between two subsystems, the associated reduced state of the pseudo-density matrix cannot have negativity, regardless of the possible presence of initial spatial correlations. We further exploit the time asymmetry of the pseudo-density matrix to determine the temporal order of events. The negativity and time asymmetry are used to determine compatibility with 5 causal structures distinguished by the direction of causal influence and whether there are initial correlations or not. The protocol succeeds for a state with coherence undergoing a fully decohering channel, showing that coherence in the channel is not necessary for the quantum advantage of causal inference from observations alone.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10544v1",
        "http://arxiv.org/pdf/2303.10544v2",
        "http://arxiv.org/pdf/2303.10544v3"
    ],
    "publication_venue": "The causal inference protocol is enhanced plus presentational improvement, Comments are welcome"
}