{
    "arxiv_id": "2303.17281",
    "paper_title": "Scaling properties of RNA as a randomly branching polymer",
    "authors": [
        "Domen Vaupotič",
        "Angelo Rosa",
        "Luca Tubiana",
        "Anže Božič"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "physics.bio-ph",
        "cond-mat.soft",
        "q-bio.BM"
    ],
    "abstract": "Formation of base pairs between the nucleotides of an RNA sequence gives rise to a complex and often highly branched secondary and tertiary RNA structure. While numerous studies have demonstrated the functional importance of the high degree of RNA branching -- for instance, for its spatial compactness or interaction with other biological macromolecules -- the nature of RNA branching topology remains largely unexplored. Here, we use the theory of randomly branching polymers to explore the scaling properties of RNA sequences by mapping their secondary structures onto planar tree graphs. Focusing on random RNA sequences of varying lengths, we determine their scaling exponents $ρ$ and $\\varepsilon$, related to the topology of branching. Our results indicate that the ensembles of RNA secondary structures are characterized by annealed random branching and scale similarly to branched self-avoiding walks in three dimensions. We further examine how nucleotide composition, tree topology, and folding energy parameters influence the obtained scaling exponents and we show that both exponents are robust upon reasonable changes in these quantities. Finally, in order to apply the theory of branching polymers to biological RNAs, whose length cannot be arbitrarily varied, we demonstrate how both scaling exponents can be obtained from the distributions of the related topological quantities of individual RNA molecules with fixed length. In this way, we establish a framework to study the branching properties of RNA and compare them to other known classes of branched polymers, while also identifying the conditions under which this description becomes insufficient. By understanding the scaling properties of RNA related to its branching structure we aim to improve our understanding of the underlying principles and open up the possibility to design RNA sequences with desired topological properties.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17281v1"
    ],
    "publication_venue": "13 pages, 4 figures; 9 pages and 7 figures of supplementary material"
}