{
    "arxiv_id": "2303.16122",
    "paper_title": "Increasing error tolerance in quantum computers with dynamic bias arrangement",
    "authors": [
        "Hector Bombín",
        "Chris Dawson",
        "Naomi Nickerson",
        "Mihir Pant",
        "Jordan Sullivan"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Many quantum operations are expected to exhibit bias in the structure of their errors. Recent works have shown that a fixed bias can be exploited to improve error tolerance by statically arranging the errors in beneficial configurations. In some cases an error bias can be dynamically reconfigurable, an example being linear optical fusion where the basis of a fusion failure can be chosen before the measurement is made. Here we introduce methods for increasing error tolerance in this setting by using classical decision-making to adaptively choose the bias in measurements as a fault tolerance protocol proceeds. We study this technique in the setting of linear optical fusion based quantum computing (FBQC). We provide examples demonstrating that by dynamically arranging erasures, the loss tolerance can be tripled when compared to a static arrangement of biased errors while using the same quantum resources: we show that for the best FBQC architecture of Bartolucci et al. (2023) the threshold increases from $2.7\\%$ to $7.5\\%$ per photon with the same resource state by using dynamic biasing. Our method does not require any specific code structure beyond having a syndrome graph representation. We have chosen to illustrate these techniques using an architecture which is otherwise identical to that in Bartolucci et al. (2023), but deployed together with other techniques, such as different fusion networks, higher loss thresholds are possible.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16122v1"
    ],
    "publication_venue": null
}