{
    "arxiv_id": "2303.10201",
    "paper_title": "Particle-hole symmetry protects spin-valley blockade in graphene quantum dots",
    "authors": [
        "Luca Banszerus",
        "Samuel Möller",
        "Katrin Hecker",
        "Eike Icking",
        "Kenji Watanabe",
        "Takashi Taniguchi",
        "Fabian Hassler",
        "Christian Volk",
        "Christoph Stampfer"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-06-19"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "quant-ph"
    ],
    "abstract": "Particle-hole symmetry plays an important role for the characterization of topological phases in solid-state systems. It is found, for example, in free-fermion systems at half filling, and it is closely related to the notion of antiparticles in relativistic field theories. In the low energy limit, graphene is a prime example of a gapless particle-hole symmetric system described by an effective Dirac equation, where topological phases can be understood by studying ways to open a gap by preserving (or breaking) symmetries. An important example is the intrinsic Kane-Mele spin-orbit gap of graphene, which leads to a lifting of the spin-valley degeneracy and renders graphene a topological insulator in a quantum spin Hall phase, while preserving particle-hole symmetry. Here, we show that bilayer graphene allows realizing electron-hole double quantum-dots that exhibit nearly perfect particle-hole symmetry, where transport occurs via the creation and annihilation of single electron-hole pairs with opposite quantum numbers. Moreover, we show that this particle-hole symmetry results in a protected single-particle spin-valley blockade. The latter will allow robust spin-to-charge conversion and valley-to-charge conversion, which is essential for the operation of spin and valley qubits.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10201v1"
    ],
    "publication_venue": null,
    "doi": "10.1038/s41586-023-05953-5"
}