{
    "arxiv_id": "2303.08534",
    "paper_title": "On the Running of Gauge Couplings in String Theory",
    "authors": [
        "Steven Abel",
        "Keith R. Dienes",
        "Luca A. Nutricati"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-07-05"
    ],
    "latest_version": 1,
    "categories": [
        "hep-th",
        "hep-ph"
    ],
    "abstract": "In this paper we conduct a general, model-independent analysis of the running of gauge couplings within closed string theories. Unlike previous discussions in the literature, our calculations fully respect the underlying modular invariance of the string and include the contributions from the infinite towers of string states which are ultimately responsible for many of the properties for which string theory is famous, including an enhanced degree of finiteness and UV/IR mixing. In order to perform our calculations, we adopt a formalism that was recently developed for calculations of the Higgs mass within such theories, and demonstrate that this formalism can also be applied to calculations of gauge couplings. In general, this formalism gives rise to an ``on-shell'' effective field theory (EFT) description in which the final results are expressed in terms of supertraces over the physical string states, and in which these quantities exhibit an EFT-like ``running'' as a function of an effective spacetime mass scale. We find, however, that the calculation of the gauge couplings differs in one deep way from that of the Higgs mass: while the latter results depend on purely on-shell supertraces, the former results have a different modular structure which causes them to depend on off-shell supertraces as well. In some regions of parameter space, our results demonstrate how certain expected field-theoretic behaviors can emerge from the highly UV/IR-mixed environment. In other situations, by contrast, our results give rise to a number of intrinsically stringy behaviors that transcend what might be expected within an effective field theory approach.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08534v1"
    ],
    "publication_venue": "37 pages, LaTeX, 5 figures",
    "doi": "10.1103/PhysRevD.107.126019"
}