{
    "arxiv_id": "2303.08087",
    "paper_title": "Search strategies for supermassive stars in young clusters and application to nearby galaxies",
    "authors": [
        "A. Kuruvanthodi",
        "D. Schaerer",
        "M. Messa",
        "A. Adamo",
        "C. Usher",
        "C. Charbonnel",
        "R. Marques-Chaves"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Supermassive stars (SMS) with masses $M \\gtrsim 10^3-10^4 M_{\\odot}$, formed by runaway collisions in young, massive, and dense star clusters have been invoked as a possible solution to the puzzles raised by the presence of multiple stellar populations and peculiar abundance patterns observed in globular clusters. However, such objects have not been observed so far. We developed observational strategies to search for SMS hosted within young massive clusters (thought to be the precursors of globular clusters, GCs), which could be applicable in a relatively general fashion, using both photometric and spectroscopic observations. We used theoretical predictions of spectra of SMS and SMS-hosting clusters, together with predictions from standard simple stellar populations to examine their impact on color-color diagrams and on individual optical spectral lines (primarily Hydrogen emission and absorption lines). As a first step, we apply our search strategies to a sample of $\\sim 3000$ young star clusters (YSC) from two nearby galaxies with multi-band observations from the HST and optical integral-field spectroscopy obtained with MUSE on the Very Large Telescope. We focus on models for SMS with large radii (corresponding to $ Teff \\lesssim 7000$ K), which predict strong Balmer breaks, and construct proper color-color diagrams to select the corresponding SMS-hosting cluster candidates. We show that their spectrophotometric properties are similar to that of normal clusters with ages of a few hundred Myr, which would, however, show signs of composite stellar populations, in particular the presence of nebular lines (H$α$ and others). Examining the photometry, overall SEDs, and the spectra of $\\sim 100$ clusters with strong Balmer breaks, we have found several objects with peculiar SEDs, the presence of emission lines, or other peculiar signatures. [abridged]",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08087v1"
    ],
    "publication_venue": "Accepted for publication in A&A, 15 pages, 12 figures, 2 tables, (Abstract abridged)",
    "doi": "10.1051/0004-6361/202245695"
}