{
    "arxiv_id": "2303.08091",
    "paper_title": "Absorption and birefringence study for reduced optical losses in diamond with high NV concentration",
    "authors": [
        "T. Luo",
        "F. A. Hahl",
        "J. Langer",
        "V. Cimalla",
        "L. Lindner",
        "X. Vidal",
        "M. Haertelt",
        "R. Blinder",
        "S. Onoda",
        "T. Ohshima",
        "J. Jeske"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph",
        "cond-mat.mtrl-sci",
        "physics.optics"
    ],
    "abstract": "The use of diamond color centers such as the nitrogen-vacancy (NV) center is increasingly enabling quantum sensing and computing applications. Novel concepts like cavity coupling and readout, laser threshold magnetometry and multi-pass geometries allow significantly improved sensitivity and performance via increased signals and strong light fields. Enabling material properties for these techniques and their further improvements are low optical material losses via optical absorption of signal light and low birefringence. Here we study systematically the behavior of absorption around 700 nm and birefringence with increasing nitrogen- and NV-doping, as well as their behavior during NV creation via diamond growth, electron beam irradiation and annealing treatments. Absorption correlates with increased nitrogen-doping yet substitutional nitrogen does not seem to be the direct absorber. Birefringence reduces with increasing nitrogen doping. We identify multiple crystal defect concentrations via absorption spectroscopy and their changes during the material processing steps and thus identify potential causes of absorption and birefringence as well as strategies to fabricate CVD diamonds with high NV density yet low absorption and low birefringence.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08091v1"
    ],
    "publication_venue": "Accepted by Philosophical Transactions A (DOI: 10.1098/rsta.2022.0314)",
    "doi": "10.1098/rsta.2022.0314"
}