{
    "arxiv_id": "2303.12853",
    "paper_title": "Three iterations of $(d-1)$-WL test distinguish non isometric clouds of $d$-dimensional points",
    "authors": [
        "Valentino Delle Rose",
        "Alexander Kozachinskiy",
        "Cristóbal Rojas",
        "Mircea Petrache",
        "Pablo Barceló"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2025-04-22"
    ],
    "latest_version": 3,
    "categories": [
        "cs.LG",
        "cs.DM"
    ],
    "abstract": "The Weisfeiler--Lehman (WL) test is a fundamental iterative algorithm for checking isomorphism of graphs. It has also been observed that it underlies the design of several graph neural network architectures, whose capabilities and performance can be understood in terms of the expressive power of this test. Motivated by recent developments in machine learning applications to datasets involving three-dimensional objects, we study when the WL test is {\\em complete} for clouds of euclidean points represented by complete distance graphs, i.e., when it can distinguish, up to isometry, any arbitrary such cloud. %arbitrary clouds of euclidean points represented by complete distance graphs. % How many dimensions of the Weisfeiler--Lehman test is enough to distinguish any two non-isometric point clouds in $d$-dimensional Euclidean space, assuming that these point clouds are given as complete graphs labeled by distances between the points? This question is important for understanding, which architectures of graph neural networks are capable of fully exploiting the spacial structure of a point cloud.\n  Our main result states that the $(d-1)$-dimensional WL test is complete for point clouds in $d$-dimensional Euclidean space, for any $d\\ge 2$, and that only three iterations of the test suffice. We also observe that the $d$-dimensional WL test only requires one iteration to achieve completeness.\n  Our paper thus provides complete understanding of the 3-dimensional case: it was shown in previous works that 1-WL is not complete in $\\mathbb{R}^3$, and we show that 2-WL is complete there. We also strengthen the lower bound for 1-WL by showing that it is unable to recognize planar point clouds in $\\mathbb{R}^3$. Finally, we show that 2-WL is not complete in $\\mathbb{R}^6$, leaving as an open question, whether it is complete in $\\mathbb{R}^{d}$ for $d = 4,5$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12853v1",
        "http://arxiv.org/pdf/2303.12853v2",
        "http://arxiv.org/pdf/2303.12853v3"
    ],
    "publication_venue": "Changes to previous version: new results, inability of 1-WL to recognize planar point clouds in R^3, and incompleteness of 2-WL in R^6"
}