{
    "arxiv_id": "2303.09079",
    "paper_title": "SSL-Cleanse: Trojan Detection and Mitigation in Self-Supervised Learning",
    "authors": [
        "Mengxin Zheng",
        "Jiaqi Xue",
        "Zihao Wang",
        "Xun Chen",
        "Qian Lou",
        "Lei Jiang",
        "Xiaofeng Wang"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-10-10"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CR",
        "cs.CV",
        "cs.LG"
    ],
    "abstract": "Self-supervised learning (SSL) is a prevalent approach for encoding data representations. Using a pre-trained SSL image encoder and subsequently training a downstream classifier, impressive performance can be achieved on various tasks with very little labeled data. The growing adoption of SSL has led to an increase in security research on SSL encoders and associated Trojan attacks. Trojan attacks embedded in SSL encoders can operate covertly, spreading across multiple users and devices. The presence of backdoor behavior in Trojaned encoders can inadvertently be inherited by downstream classifiers, making it even more difficult to detect and mitigate the threat. Although current Trojan detection methods in supervised learning can potentially safeguard SSL downstream classifiers, identifying and addressing triggers in the SSL encoder before its widespread dissemination is a challenging task. This challenge arises because downstream tasks might be unknown, dataset labels may be unavailable, and the original unlbeled training dataset might be inaccessible during Trojan detection in SSL encoders. We introduce SSL-Cleanse as a solution to identify and mitigate backdoor threats in SSL encoders. We evaluated SSL-Cleanse on various datasets using 1200 encoders, achieving an average detection success rate of 82.2% on ImageNet-100. After mitigating backdoors, on average, backdoored encoders achieve 0.3% attack success rate without great accuracy loss, proving the effectiveness of SSL-Cleanse.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09079v1",
        "http://arxiv.org/pdf/2303.09079v2"
    ],
    "publication_venue": "9 pages, 6 figures, 4 tables"
}