{
    "arxiv_id": "2303.14789",
    "paper_title": "5 wave interactions in internal gravity waves",
    "authors": [
        "Saranraj Gururaj",
        "Anirban Guha"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "We use multiple-scale analysis to study a 5-wave system (5WS) composed of two different internal gravity wave triads. Each of these triads consists of a parent wave and two daughter waves, with one daughter wave common between the two triads. The parent waves are assumed to have the same frequency and wavevector norm co-existing in a region of constant background stratification. Such 5-wave systems may emerge in oceans, for example, via tide-topography interactions, generating multiple parent internal waves that overlap. Two 2D cases are considered: Case 1(2) has parent waves with the same horizontal (vertical) wavenumber but with different vertical (horizontal) wavenumber. For both cases, the 5WS is more unstable than triads for $f/ω_1\\gtrapprox0.3$, where $ω_1$ and $f$ are the parent wave and the local Coriolis frequency, respectively. For $f/ω_1\\gtrapprox0.3$, the common daughter wave's frequency is $\\approx ω_1-f $ and $f$ respectively for Cases 1 and 2. For 3D cases, 5WSs become more unstable as the angle ($θ$) between the horizontal wavevectors of the parent waves is decreased. Moreover, for any $θ$, 5WSs have higher growth rates than triads for $f/ω_1\\gtrapprox0.3$. Numerical simulations match the theoretical growth rates of 5WSs for a wide range of latitudes, except when $f/ω_1\\approx0.5$ (critical latitude). More than three daughter waves are forced by the two parent waves when $f/ω_1\\approx0.5$. We formulate a reduced order model which shows that for any $θ$, the maximum growth rate near the critical latitude is approximately twice the maximum growth rate of all triads.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14789v1"
    ],
    "publication_venue": null
}