{
    "arxiv_id": "2303.09726",
    "paper_title": "The Emergence of Brightest Cluster Galaxy in the Most Massive Protocluster Core",
    "authors": [
        "Dongdong Shi",
        "Xin Wang",
        "XianZhong Zheng",
        "Zheng Cai",
        "Xiaohui Fan",
        "Fuyan Bian",
        "Harry I. Teplitz"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Distant protoclusters of galaxies, as the progenitors of massive galaxy clusters in the present day, are expected to host brightest cluster galaxies (BCGs) at their early formation stage. It remains unclear whether the assembly of (some) BCGs is essential to the formation of a mature cluster core or vice versa. Here we report the detection of a pair of massive quiescent galaxies likely in the process of merging at the centre of the spectroscopically confirmed, extremely massive protocluster BOSS1244 at a look-back time of 10.58 billion years. These galaxies, BOSS1244-QG1 ($5.25\\times 10^{11}$ M$_{\\odot}$) and BOSS1244-QG2 ($1.32\\times 10^{11}$ M$_{\\odot}$), were detected with Hubble Space Telescope (HST) grism slitless spectroscopic observations. These two quiescent galaxies are among the brightest member galaxies in BOSS1244 and reside at redshifts $z=2.244$ and $z=2.242$, with a half-light radius of $6.76\\pm0.50$ and $2.72\\pm0.16$ kiloparsec, respectively. BOSS1244-QG1 and BOSS1244-QG2 are separated by a projected distance of about 70 physical kiloparsecs, implying that we are likely to be witnessing them during the formation of a massive BCG, through a dry merger with size and mass similiar to the most massive BCGs in the local Universe. We thus infer that BCG formation have taken place before the virialization of the cluster core, which shatter and broaden our previous understanding the BCGs in the mature galaxy clusters. Moreover, we find for the first time in BOSS1244 a strong density-star formation relation over a scale of 20 co-moving Mpc, implying that the quenching of star formation in BCGs and their progenitors is likely governed by environment-related processes before the virialization.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09726v1",
        "http://arxiv.org/pdf/2303.09726v2"
    ],
    "publication_venue": "26 (10+16) pages, 8 (3+5) figures, 1 table, submitted. Comments welcome !"
}