{
    "arxiv_id": "2303.09221",
    "paper_title": "Physics-based model of solar wind stream interaction regions: Interfacing between Multi-VP and 1D MHD for operational forecasting at L1",
    "authors": [
        "R. Kieokaew",
        "R. F. Pinto",
        "E. Samara",
        "C. Tao",
        "M. Indurain",
        "B. Lavraud",
        "A. Brunet",
        "V. Génot",
        "A. Rouillard",
        "N. André",
        "S. Bourdarie",
        "C. Katsavrias",
        "F. Darrouzet",
        "B. Grison",
        "I. Daglis"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "physics.space-ph"
    ],
    "abstract": "Our current capability of space weather prediction in the Earth's radiation belts is limited to only an hour in advance using the real-time solar wind monitoring at the Lagrangian L1 point. To mitigate the impacts of space weather on telecommunication satellites, several frameworks were proposed to advance the lead time of the prediction. We develop a prototype pipeline called \"Helio1D\" to forecast ambient solar wind conditions (speed, density, temperature, tangential magnetic field) at L1 with a lead time of 4 days. This pipeline predicts Corotating Interaction Regions (CIRs) and high-speed streams that can increase high-energy fluxes in the radiation belts. The Helio1D pipeline connects the Multi-VP model, which provides real-time solar wind emergence at 0.14 AU, and a 1D MHD model of solar wind propagation. We benchmark the Helio1D pipeline for solar wind speed against observations for the intervals in 2004 - 2013 and 2017 - 2018. We developed a framework based on the Fast Dynamic Time Warping technique that allows us to continuously compare time-series outputs containing CIRs to observations to measure the pipeline's performance. In particular, we use this framework to calibrate and improve the pipeline's performance for operational forecasting. To provide timing and magnitude uncertainties, we model several solar wind conditions in parallel, for a total of 21 profiles corresponding to the various virtual targets including the Earth. This pipeline can be used to feed real-time, daily solar wind forecasting that aims to predict the dynamics of the inner magnetosphere and the radiation belts.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09221v1"
    ],
    "publication_venue": "24 pages, 9 figures. The appendix is available upon request"
}