{
    "arxiv_id": "2303.11700",
    "paper_title": "Dynamically Expandable Graph Convolution for Streaming Recommendation",
    "authors": [
        "Bowei He",
        "Xu He",
        "Yingxue Zhang",
        "Ruiming Tang",
        "Chen Ma"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cs.IR"
    ],
    "abstract": "Personalized recommender systems have been widely studied and deployed to reduce information overload and satisfy users' diverse needs. However, conventional recommendation models solely conduct a one-time training-test fashion and can hardly adapt to evolving demands, considering user preference shifts and ever-increasing users and items in the real world. To tackle such challenges, the streaming recommendation is proposed and has attracted great attention recently. Among these, continual graph learning is widely regarded as a promising approach for the streaming recommendation by academia and industry. However, existing methods either rely on the historical data replay which is often not practical under increasingly strict data regulations, or can seldom solve the \\textit{over-stability} issue. To overcome these difficulties, we propose a novel \\textbf{D}ynamically \\textbf{E}xpandable \\textbf{G}raph \\textbf{C}onvolution (DEGC) algorithm from a \\textit{model isolation} perspective for the streaming recommendation which is orthogonal to previous methods. Based on the motivation of disentangling outdated short-term preferences from useful long-term preferences, we design a sequence of operations including graph convolution pruning, refining, and expanding to only preserve beneficial long-term preference-related parameters and extract fresh short-term preferences. Moreover, we model the temporal user preference, which is utilized as user embedding initialization, for better capturing the individual-level preference shifts. Extensive experiments on the three most representative GCN-based recommendation models and four industrial datasets demonstrate the effectiveness and robustness of our method.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11700v1"
    ],
    "publication_venue": "11 pages, 6 figures, published on The Web Conference 2023 (WWW 2023)",
    "doi": "10.1145/3543507.3583237"
}