{
    "arxiv_id": "2303.08993",
    "paper_title": "Folding@home: achievements from over twenty years of citizen science herald the exascale era",
    "authors": [
        "Vincent A. Voelz",
        "Vijay S. Pande",
        "Gregory R. Bowman"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-08-09"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.BM",
        "physics.chem-ph"
    ],
    "abstract": "Simulations of biomolecules have enormous potential to inform our understanding of biology but require extremely demanding calculations. For over twenty years, the Folding@home distributed computing project has pioneered a massively parallel approach to biomolecular simulation, harnessing the resources of citizen scientists across the globe. Here, we summarize the scientific and technical advances this perspective has enabled. As the project's name implies, the early years of Folding@home focused on driving advances in our understanding of protein folding by developing statistical methods for capturing long-timescale processes and facilitating insight into complex dynamical processes. Success laid a foundation for broadening the scope of Folding@home to address other functionally relevant conformational changes, such as receptor signaling, enzyme dynamics, and ligand binding. Continued algorithmic advances, hardware developments such as GPU-based computing, and the growing scale of Folding@home have enabled the project to focus on new areas where massively parallel sampling can be impactful. While previous work sought to expand toward larger proteins with slower conformational changes, new work focuses on large-scale comparative studies of different protein sequences and chemical compounds to better understand biology and inform the development of small molecule drugs. Progress on these fronts enabled the community to pivot quickly in response to the COVID-19 pandemic, expanding to become the world's first exascale computer and deploying this massive resource to provide insight into the inner workings of the SARS-CoV-2 virus and aid the development of new antivirals. This success provides a glimpse of what's to come as exascale supercomputers come online, and Folding@home continues its work.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08993v1"
    ],
    "publication_venue": "24 pages, 6 figures",
    "doi": "10.1016/j.bpj.2023.03.028"
}