{
    "arxiv_id": "2303.08261",
    "paper_title": "Ca-dimers and solvent layering determine electrochemically active species in Ca(BH$_4$)$_2$ in THF",
    "authors": [
        "Ana Sanz-Matìas",
        "Fabrice Roncoroni",
        "Siddharth Sundararaman",
        "David Prendergast"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.chem-ph"
    ],
    "abstract": "Divalent ions, such as Mg, Ca, and Zn, are being considered as competitive, safe, and earth-abundant alternatives to Li-ion electrochemistry. However, the challenge remains to match electrode and electrolyte materials that stably cycle with these new formulations, based primarily on controlling interfacial phenomena. We explore the formation of electroactive species in the electrolyte Ca(BH$_4$)$_2$ in THF through molecular dynamics simulation. Free-energy analysis indicates that this electrolyte has a majority population of neutral Ca dimers and monomers, albeit with diverse molecular conformations as revealed by unsupervised learning techniques, but with an order of magnitude lower concentration of possibly electroactive charged species, such as the monocation, CaBH$_4^+$ , which we show is produced via disproportionation of neutral Ca(BH$_4$)$_2$ complexes. Dense layering of THF molecules within 1 nm of the electrode surface (modeled here using graphite) hinders the approach of reducible species to within 0.6 nm and instead enhances the local concetration of species in a narrow intermediate-density layer from 0.7-0.9 nm. A dramatic increase in the monocation population in this intermediate layer is induced at negative bias, supplied by local dimer disproportionation. We see no evidence to support any functional role of fully-solvated Ca$^{2+}$ in the electrochemical activity of this electrolyte. The consequences for performance and alternative formulations are discussed in light of this molecular-scale insight.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08261v1"
    ],
    "publication_venue": null
}