{
    "arxiv_id": "2303.08752",
    "paper_title": "The halo model for cosmology: a pedagogical review",
    "authors": [
        "Marika Asgari",
        "Alexander J. Mead",
        "Catherine Heymans"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
    ],
    "abstract": "We present a pedagogical review of the halo model, a flexible framework that can describe the distribution of matter and its tracers on non-linear scales for both conventional and exotic cosmological models. We start with the premise that the complex structure of the cosmic web can be described by the sum of its individual components: dark matter, gas, and galaxies, all distributed within spherical haloes with a range of masses. The halo properties are specified through a series of simulation-calibrated ingredients including the halo mass function, non-linear halo bias and a dark matter density profile that can additionally account for the impact of baryon feedback. By incorporating a model of the galaxy halo occupation distribution, the properties of central and satellite galaxies, their non-linear bias and intrinsic alignment can be predicted. Through analytical calculations of spherical collapse in exotic cosmologies, the halo model also provides predictions for non-linear clustering in beyond-$Λ$CDM models. The halo model has been widely used to model observations of a variety of large-scale structure probes, most notably as the primary technique to model the underlying non-linear matter power spectrum. By documenting these varied and often distinct use cases, we seek to further coherent halo model analyses of future multi-tracer observables. This review is accompanied by the release of pyhalomodel: https://github.com/alexander-mead/pyhalomodel , flexible software to conduct a wide range of halo-model calculations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08752v1"
    ],
    "publication_venue": "Comments from the community are gratefully received"
}