{
    "arxiv_id": "2303.11600",
    "paper_title": "Thermal decoupling in high-$T_c$ cuprate superconductors",
    "authors": [
        "Sungwoo Lee",
        "Woojin Choi",
        "Youngje Kim",
        "Young-Kyun Kwon",
        "Dongjoon Song",
        "Miyoung Kim",
        "Gun-Do Lee"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con"
    ],
    "abstract": "Although many years have passed since the discovery of high-critical-temperature (high-$T_c$) superconducting materials, the underlying mechanism is still unknown. The B1g phonon anomaly in high-Tc cuprate superconductors has long been studied; however, the correlation between the B1g phonon anomaly and superconductivity has yet to be clarified. In the present study, we successfully reproduced the B1g phonon anomaly in YBa$_2$Cu$_3$O$_7$ (YBCO) using an ab initio molecular dynamics (AIMD) simulation and temperature-dependent effective potential (TDEP) method. The Ag phonon by Ba atoms shows a more severe anomaly than the B1g phonon at low temperatures. Our analysis of the phonon anomaly and the temperature-dependent phonon dispersion indicated that decoupling between thermal phenomena and electron transport at low temperatures leads to layer-by-layer thermal decoupling in YBCO. Electronically and thermally isolated Ba atoms in YBCO are responsible for the thermal decoupling. The analytic study of the thermal dcoupling revealed that Planckian dissipation expressing linear-T resistivity is another expression of the Fermi liquid of the CuO$_2$ plane. The Uemura plot of the relationship between Tc and the Fermi temperature, as well as the superconducting dome in YBCO, is explained rigorously and quantitatively. Our findings not only present a new paradigm for understanding high-Tc superconductivity but also imply that the spontaneous formation of low-temperature layers in materials can lead to revolutionary changes in the thermal issues of industrial fields.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11600v1"
    ],
    "publication_venue": "21 pages, 5 figures"
}