{
    "arxiv_id": "2303.16374",
    "paper_title": "A scale-based study of the Reynolds number scaling for the near-wall streamwise turbulence intensity in wall turbulence",
    "authors": [
        "Cheng Cheng",
        "Lin Fu"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn",
        "math-ph"
    ],
    "abstract": "Very recently, a defect model which depicts the growth tendency of the near-wall peak of the streamwise turbulence intensity has been developed (Chen $\\&$ Sreenivasan, J. Fluid Mech. (2021), vol.908, R3). Based on the finiteness of the near-wall turbulence production, this model predicts that the magnitude of the peak will approach a finite limit as the Reynolds number increases. In the present study, we revisit the basic hypotheses of the model, such as the balance between the turbulence production and the wall dissipation in the region of peak production, the negligible effects of the logarithmic motions on the wall dissipation, and the typical time-scale that the outer-layer flow imposes on the inner layer. Our analyses show that some of them are not consistent with the characteristics of the wall-bounded turbulence. Moreover, based on the spectral stochastic estimation, we develop a framework to assess the wall dissipation contributed by the energy-containing eddies populating the logarithmic region, and uncover the linkage between its magnitude and the local Reynolds number. Our results demonstrate that these multi-scale eddies make a non-negligible contribution to the formation of the wall dissipation. Based on these observations, we verify that the classical logarithmic model, which suggests a logarithmic growth of the near-wall peak of the streamwise turbulence intensity with regard to the friction Reynolds number, is more physically consistent, and still holds even with the latest high-Reynolds-number database.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16374v1"
    ],
    "publication_venue": "21 pages, 6 figures, accepted by International Journal of Heat and Fluid Flow"
}