{
    "arxiv_id": "2303.16167",
    "paper_title": "Strong ill-posedness in $W^{1, \\infty}$ of the 2d stably stratified Boussinesq equations and application to the 3d axisymmetric Euler Equations",
    "authors": [
        "Roberta Bianchini",
        "Lars Eric Hientzsch",
        "Felice Iandoli"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-05-12"
    ],
    "latest_version": 2,
    "categories": [
        "math.AP",
        "math-ph"
    ],
    "abstract": "We prove the strong ill-posedness in the sense of Hadamard of the two-dimensional Boussinesq equations in $W^{1, \\infty}(\\mathbb{R}^2)$ without boundary, extending to the case of systems the method that Shikh Khalil \\& Elgindi arXiv:2207.04556v1 developed for scalar equations. We provide a large class of initial data with velocity and density of small $W^{1, \\infty}(\\mathbb{R}^2)$ size, for which the horizontal density gradient has a strong $L^{\\infty}(\\mathbb{R}^2)$-norm inflation in infinitesimal time, while the vorticity and the vertical density gradient remain bounded. Furthermore, exploiting the three-dimensional version of Elgindi's decomposition of the Biot-Savart law, we apply the method to the three-dimensional axisymmetric Euler equations with swirl and away from the vertical axis, showing that a large class of initial data with velocity field uniformly bounded in $W^{1, \\infty}(\\mathbb{R}^2)$ provides a solution whose swirl component has a strong $W^{1, \\infty}(\\mathbb{R}^2)$-norm inflation in infinitesimal time, while the potential vorticity remains bounded at least for small times. Finally, the $W^{1,\\infty}$-norm inflation of the swirl (and the $L^{\\infty}$-norm inflation of the vorticity field) is quantified from below by an explicit lower bound which depends on time, the size of the data and it is valid for small times.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16167v1",
        "http://arxiv.org/pdf/2303.16167v2"
    ],
    "publication_venue": null
}