{
    "arxiv_id": "2303.10746",
    "paper_title": "Timescales of Cell Membrane Fusion Mediated by SARS-CoV2 Spike Protein and its Receptor ACE2",
    "authors": [
        "Dominic Hayward",
        "Purushottam S Dubey",
        "Marie-Sousai Appavou",
        "Olaf Holderer",
        "Henrich Frielinghaus",
        "Sylvain Prevost",
        "Bela Farago",
        "Anna Sokolova",
        "Piotr Zolnierczuk",
        "Heiner von Buttlar",
        "Peter Braun",
        "Joachim Jakob Bugert",
        "Rosina Ehmann",
        "Sebastian Jaksch"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.bio-ph",
        "cond-mat.soft",
        "physics.med-ph"
    ],
    "abstract": "In this manuscript we describe the investigation of the SARS-CoV2 membrane fusion timescale by means of small-angle neutron scattering (SANS) using hydrogen/deuterium contrast variation. After the successful production of virus-like vesicles and human-host-cell-like vesicles we were able to follow the fusion of the respective vesicles in real-time. This was done using deuterated and protonated phospholipids in the vesicles in a neutron-contrast matched solvent. The vesicles were identical apart from either the presence or absence of the SARS-CoV2 spike protein. The human-host-cell-like vesicles were carrying an ACE2 receptor protein in all cases. In case of the absence of the spike protein a fusion over several hours was observed in agreement with literature, with a time constant of 4.5 h. In comparison, there was not time-evolution, but immediate fusion of the vesicles when the spike protein was present. Those two figures, fusion over several hours and fusion below 10 s corresponding to the absence or presence of the spike protein allow an upper-limit estimate for the fusion times of virus-like vesicles with the SARS-CoV2 spike protein of 10 s. This very fast fusion, when compared to the case without spike protein it is a factor of 2500, can also help to explain why infection with SARS-CoV2 can be so effective and fast. Studying spike protein variants using our method may explain differences in transmissibility between SARS-CoV2 strains. In addition, the model developed here can potentially be applied to any enveloped virus.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10746v1"
    ],
    "publication_venue": "15 pages, 7 figures, 2 tables"
}