{
    "arxiv_id": "2303.17365",
    "paper_title": "Probing the Superconducting Pairing Potential via Dynamical Coulomb Blockade",
    "authors": [
        "Chaofei Liu",
        "Pedro Portuga",
        "Yi Gao",
        "Jie Yang",
        "Xiuying Zhang",
        "Jing Lu",
        "Christian Flindt",
        "Jian Wang"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con",
        "cond-mat.mes-hall",
        "cond-mat.mtrl-sci",
        "cond-mat.str-el"
    ],
    "abstract": "Coulomb blockade occurs for electrons tunneling into nanoislands because of the quantization of charges. Here, using spectroscopy measurements of nonmagnetic islands grown on a high-Tc superconductor [one-unit-cell (1-UC) FeSe], we employ dynamical Coulomb blockade (DCB) as a tool to probe the nature of Cooper pairing in the superconducting substrate. The tunneling spectra are acquired on single-crystalline Pb nanoislands, and show a clear suppression of the tunneling current around zero bias-voltage, i.e. a gap-like structure. The observed spectral gaps can be attributed to DCB based on our comprehensive investigations, including experiments with finely varying island sizes and calculations of the spectra using the P(E) theory of DCB. Our detailed analysis suggests that the observed DCB can be assigned to the sign-reversing pairing potential for the 1-UC FeSe substrate below the islands. The sign reversal is furthermore reflected in a transition of the superconducting gap of FeSe from a U- to a V-like lineshape as the distance between neighboring doublet islands is decreased, indicating the presence of a nodal-like gap as expected for a sign-reversing superconductor. Our configuration of nonmagnetic nanoislands on a high-Tc superconductor for spectroscopy measurements may serve as a local, spatially sensitive, and tunable probe for detecting the sign-reversing order parameter in unconventional superconductors.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17365v1"
    ],
    "publication_venue": null
}