{
    "arxiv_id": "2303.15536",
    "paper_title": "\"That's important, but...\": How Computer Science Researchers Anticipate Unintended Consequences of Their Research Innovations",
    "authors": [
        "Kimberly Do",
        "Rock Yuren Pang",
        "Jiachen Jiang",
        "Katharina Reinecke"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "cs.HC",
        "cs.CY"
    ],
    "abstract": "Computer science research has led to many breakthrough innovations but has also been scrutinized for enabling technology that has negative, unintended consequences for society. Given the increasing discussions of ethics in the news and among researchers, we interviewed 20 researchers in various CS sub-disciplines to identify whether and how they consider potential unintended consequences of their research innovations. We show that considering unintended consequences is generally seen as important but rarely practiced. Principal barriers are a lack of formal process and strategy as well as the academic practice that prioritizes fast progress and publications. Drawing on these findings, we discuss approaches to support researchers in routinely considering unintended consequences, from bringing diverse perspectives through community participation to increasing incentives to investigate potential consequences. We intend for our work to pave the way for routine explorations of the societal implications of technological innovations before, during, and after the research process.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15536v1"
    ],
    "publication_venue": "Corresponding author: Rock Yuren Pang, email provided below. Kimberly Do and Rock Yuren Pang contributed equally to this research. The author order is listed alphabetically. To appear in CHI Conference on Human Factors in Computing Systems (CHI '23), April 23-April 28, 2023, Hamburg, Germany. ACM, New York, NY, USA, 16 pages",
    "doi": "10.1145/3544548.3581347"
}