{
    "arxiv_id": "2303.10843",
    "paper_title": "Boundary layer transition due to distributed roughness: Effect of roughness spacing",
    "authors": [
        "Rong Ma",
        "Krishnan Mahesh"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "The influence of roughness spacing on boundary layer transition over distributed roughness elements is studied using direct numerical simulation (DNS) and global stability analysis, and compared to isolated roughness elements at the same Reh. Small spanwise spacing ($位_z = 2.5h$) inhibits the formation of counter-rotating vortices (CVP) and as a result, hairpin vortices are not generated and the downstream shear layer is steady. For $位_z = 5h$, the CVP and hairpin vortices are induced by the first row of roughness, perturbing the downstream shear layer and causing transition. The temporal periodicity of the primary hairpin vortices appears to be independent of the streamwise spacing. Distributed roughness leads to a lower critical Reh for instability to occur and a more significant breakdown of the boundary layer compared to isolated roughness. When the streamwise spacing is comparable to the region of flow separation ($位_x = 5h$), the high-momentum fluid barely moves downward into the cavities and the wake flow has little impact on the following roughness elements. The leading unstable varicose mode is associated with the central low-speed streaks along the aligned roughness elements, and its frequency is close to the shedding frequency of hairpin vortices in the isolated case. For larger streamwise spacing ($位_x = 10h$), two distinct modes are obtained from global stability analysis. The first mode shows varicose symmetry, corresponding to the primary hairpin vortex shedding induced by the first-row roughness. The high-speed streaks formed in the longitudinal grooves are also found to be unstable and interacting with the varicose mode. The second mode is a sinuous mode with lower frequency, induced as the wake flow of the first-row roughness runs into the second row. It extracts most energy from the spanwise shear between the high- and low-speed streaks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10843v1"
    ],
    "publication_venue": null
}