{
    "arxiv_id": "2303.16457",
    "paper_title": "Towards Understanding the Endemic Behavior of a Competitive Tri-Virus SIS Networked Model",
    "authors": [
        "Sebin Gracy",
        "Mengbin Ye",
        "Brian D. O. Anderson",
        "Cesar A. Uribe"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2024-10-24"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY"
    ],
    "abstract": "This paper studies the endemic behavior of a multi-competitive networked susceptible-infected-susceptible (SIS) model. Specifically, the paper deals with three competing virus systems (i.e., tri-virus systems). First, we show that a tri-virus system, unlike a bi-virus system, is not a monotone dynamical system. Using the Parametric Transversality Theorem, we show that, generically, a tri-virus system has a finite number of equilibria and that the Jacobian matrices associated with each equilibrium are nonsingular. The endemic equilibria of this system can be classified as follows: a) single-virus endemic equilibria (also referred to as the boundary equilibria), where precisely one of the three viruses is alive; b) 2-coexistence equilibria, where exactly two of the three viruses are alive; and c) 3-coexistence equilibria, where all three viruses survive in the network. We provide a necessary and sufficient condition that guarantees local exponential convergence to a boundary equilibrium. Further, we secure conditions for the nonexistence of 3-coexistence equilibria (resp. for various forms of 2-coexistence equilibria). We also identify sufficient conditions for the existence of a 2-coexistence (resp. 3-coexistence) equilibrium. We identify conditions on the model parameters that give rise to a continuum of coexistence equilibria. More specifically, we establish i) a scenario that admits the existence and local exponential attractivity of a line of coexistence equilibria; and ii) scenarios that admit the existence of, and, in the case of one such scenario, global convergence to, a plane of 3-coexistence equilibria.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16457v1"
    ],
    "publication_venue": "arXiv admin note: substantial text overlap with arXiv:2209.11826",
    "doi": "10.1137/23M1563074"
}