{
    "arxiv_id": "2303.14300",
    "paper_title": "Fast, Accurate, but Sometimes Too-Compelling Support: The Impact of Imperfectly Automated Cues in an Augmented Reality Head-Mounted Display on Visual Search Performance",
    "authors": [
        "Amelia C. Warden",
        "Christopher D. Wickens",
        "Daniel Rehberg",
        "Francisco R. Ortega",
        "Benjamin A. Clegg"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.HC"
    ],
    "abstract": "While visual search for targets within a complex scene might benefit from using augmented-reality (AR) head-mounted display (HMD) technologies helping to efficiently direct human attention, imperfectly reliable automation support could manifest in occasional errors. The current study examined the effectiveness of different HMD cues that might support visual search performance and their respective consequences following automation errors. Fifty-six participants searched a 3D environment containing 48 objects in a room, in order to locate a target object that was viewed prior to each trial. They searched either unaided or assisted by one of three HMD types of cues: an arrow pointing to the target, a plan-view minimap highlighting the target, and a constantly visible icon depicting the appearance of the target object. The cue was incorrect on 17% of the trials for one group of participants and 100% correct for the second group. Through both analysis and modeling of both search speed and accuracy, the results indicated that the arrow and minimap cues depicting location information were more effective than the icon cue depicting visual appearance, both overall, and when the cue was correct. However, there was a tradeoff on the infrequent occasions when the cue erred. The most effective AR-based cue led to a greater automation bias, in which the cue was more often blindly followed without careful examination of the raw images. The results speak to the benefits of augmented reality and the need to examine potential costs when AR-conveyed information may be incorrect because of imperfectly reliable systems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14300v1"
    ],
    "publication_venue": "Under revision in IEEE Transactions on Human-Machine Systems; Number of pages: 12; Number of figures: 5"
}