{
    "arxiv_id": "2303.10465",
    "paper_title": "Affective Workload Allocation for Multi-human Multi-robot Teams",
    "authors": [
        "Wonse Jo",
        "Ruiqi Wang",
        "Baijian Yang",
        "Dan Foti",
        "Mo Rastgaar",
        "Byung-Cheol Min"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cs.HC",
        "cs.RO"
    ],
    "abstract": "The interaction and collaboration between humans and multiple robots represent a novel field of research known as human multi-robot systems. Adequately designed systems within this field allow teams composed of both humans and robots to work together effectively on tasks such as monitoring, exploration, and search and rescue operations. This paper presents a deep reinforcement learning-based affective workload allocation controller specifically for multi-human multi-robot teams. The proposed controller can dynamically reallocate workloads based on the performance of the operators during collaborative missions with multi-robot systems. The operators' performances are evaluated through the scores of a self-reported questionnaire (i.e., subjective measurement) and the results of a deep learning-based cognitive workload prediction algorithm that uses physiological and behavioral data (i.e., objective measurement). To evaluate the effectiveness of the proposed controller, we use a multi-human multi-robot CCTV monitoring task as an example and carry out comprehensive real-world experiments with 32 human subjects for both quantitative measurement and qualitative analysis. Our results demonstrate the performance and effectiveness of the proposed controller and highlight the importance of incorporating both subjective and objective measurements of the operators' cognitive workload as well as seeking consent for workload transitions, to enhance the performance of multi-human multi-robot teams.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10465v1"
    ],
    "publication_venue": "This paper is submitted to IEEE Transactions on Affective Computing"
}