{
    "arxiv_id": "2303.14805",
    "paper_title": "Sensitivity of anomalous quartic gauge couplings via tri-photon production at FCC-hh",
    "authors": [
        "A. Senol",
        "H. Denizli",
        "C. Helveci"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 2,
    "categories": [
        "hep-ph"
    ],
    "abstract": "A direct investigation of the self-couplings of gauge bosons, completely described by the non-Abelian gauge symmetry of the Standard Model, is extremely valuable in understanding the gauge structure of the SM. Any deviation from the SM predictions on gauge boson self-coupling is to give a hint at the existence of a new physics beyond the SM, which is defined with a modification of the self-interactions using an effective field theory approach. In this paper, we present a detailed Monte Carlo study searching for anomalous quartic gauge dimension-8 couplings related to $γγγγ$ and $γγγZ$ vertices at the future hadron-hadron collider (FCC-hh) via tri-photon production at a 100 TeV center of mass energy with an integrated luminosity L$_{int}$=30 ab$^{-1}$. Events that have been parton showered and include detector effects are analyzed with a Toolkit for Multivariate Data Analysis (TMVA) using a boosted decision tree to help distinguish between signal and background events to achieve the best sensitivities on anomalous quartic gauge couplings. Our obtained results reveal that the limits on anomalous quartic gauge couplings $f_{T8}/Λ^{4}$ and $f_{T9}/Λ^{4}$ at 95\\% C.L. without systematic errors are about three orders of magnitude stronger compared to the best current experimental limits reported by the ATLAS collaboration at the LHC. Considering a realistic systematic uncertainty such as 10\\% from possible experimental sources, our obtained limits of anomalous quartic couplings get worse by about one order of magnitude compared to those without systematic uncertainty but are still two orders of magnitude better than those recently reported by ATLAS.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14805v1",
        "http://arxiv.org/pdf/2303.14805v2"
    ],
    "publication_venue": "18 pages, 7 figures, some typos corrected and reference added"
}