{
    "arxiv_id": "2303.17645",
    "paper_title": "Sequential epidemic spread between agglomerates of self-propelled agents in one dimension",
    "authors": [
        "Pablo de Castro",
        "Felipe Urbina",
        "Ariel Norambuena",
        "Francisca Guzmán-Lastra"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.PE",
        "cond-mat.soft",
        "cond-mat.stat-mech",
        "physics.bio-ph"
    ],
    "abstract": "Motile organisms can form stable agglomerates such as cities or colonies. In the outbreak of a highly contagious disease, the control of large-scale epidemic spread depends on factors like the number and size of agglomerates, travel rate between them, and disease recovery rate. While the emergence of agglomerates permits early interventions, it also explains longer real epidemics. In this work, we study the spread of susceptible-infected-recovered epidemics in one-dimensional spatially-structured systems. By working in one dimension, we mimic microorganisms in narrow channels and establish a necessary foundation for future investigation in higher dimensions. We employ a model of self-propelled particles which spontaneously form multiple clusters. As the rate of stochastic reorientation decreases, clusters become larger and less numerous. Besides examining the time evolution averaged over many epidemics, we show how the final number of ever-infected individuals depends non-trivially on single-individual parameters. In particular, the number of ever-infected individuals first increases with the reorientation rate since particles escape sooner from clusters and spread the disease. For higher reorientation rate, travel between clusters becomes too diffusive and the clusters too small, decreasing the number of ever-infected individuals.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17645v1"
    ],
    "publication_venue": "11 pages, 6 figures"
}