{
    "arxiv_id": "2303.14720",
    "paper_title": "Driver Profiling and Bayesian Workload Estimation Using Naturalistic Peripheral Detection Study Data",
    "authors": [
        "Nermin Caber",
        "Jiaming Liang",
        "Bashar I. Ahmad",
        "Simon Godsill",
        "Alexandra Bremers",
        "Philip Thomas",
        "David Oxtoby",
        "Lee Skrypchuk"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SP",
        "cs.LG",
        "eess.SY"
    ],
    "abstract": "Monitoring drivers' mental workload facilitates initiating and maintaining safe interactions with in-vehicle information systems, and thus delivers adaptive human machine interaction with reduced impact on the primary task of driving. In this paper, we tackle the problem of workload estimation from driving performance data. First, we present a novel on-road study for collecting subjective workload data via a modified peripheral detection task in naturalistic settings. Key environmental factors that induce a high mental workload are identified via video analysis, e.g. junctions and behaviour of vehicle in front. Second, a supervised learning framework using state-of-the-art time series classifiers (e.g. convolutional neural network and transform techniques) is introduced to profile drivers based on the average workload they experience during a journey. A Bayesian filtering approach is then proposed for sequentially estimating, in (near) real-time, the driver's instantaneous workload. This computationally efficient and flexible method can be easily personalised to a driver (e.g. incorporate their inferred average workload profile), adapted to driving/environmental contexts (e.g. road type) and extended with data streams from new sources. The efficacy of the presented profiling and instantaneous workload estimation approaches are demonstrated using the on-road study data, showing $F_{1}$ scores of up to 92% and 81%, respectively.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14720v1"
    ],
    "publication_venue": null
}