{
    "arxiv_id": "2303.09111",
    "paper_title": "Interaction of Acoustic and Optical Phonons in Soft Bonded Cu-Se Framework of Large Unit Cell Minerals with Anionic Disorders",
    "authors": [
        "Kewal Singh Rana",
        "Raveena Gupta",
        "Debattam Sarkar",
        "Niraj Kumar Singh",
        "Somnath Acharya",
        "Satish Vitta",
        "Chandan Bera",
        "Kanishka Biswas",
        "Ajay Soni"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-07-27"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "cond-mat.other"
    ],
    "abstract": "Large unit cell copper-chalcogenide based minerals with high crystalline anharmonicity have a potential for thermoelectric applications owing to their inherent poor lattice thermal conductivity. Here, the softening of copper-selenium bonding and hence crystal framework plays an important role in superionic conduction and thermal conductivity. We have studied Cu26Nb2Sn6Se32, Cu26Nb2Sn6Se31.5 and Cu26Nb2Sn6Se30Te2 minerals with a strategically tailored anionic disorders. These compounds have p-type degenerate behavior with carrier concentration ranging between 1020 cm-3 at 300 K, high power factor and low lattice thermal conductivity at 640 K. The existence of two low frequency Raman active optical modes associated with soft Cu and Se atoms, three localized Einstein modes in specific heat, suggest high scattering between acoustic and optical branches with very short phonon lifetime less than 1 ps. The excess vibrational density of states at low energies with compressed and flat optical branches strongly hinders the heat transport in these crystalline mineral. Comparatively, Cu26Nb2Sn6Se30Te2 is a promising thermoelectric material because of high crystalline anharmonicity and softening of Cu-Se framework due to heavier tellurium atom.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09111v1"
    ],
    "publication_venue": "20 Pages, 14 figures in main text and supporting information",
    "doi": "10.1103/PhysRevB.108.045202"
}