{
    "arxiv_id": "2303.11555",
    "paper_title": "LOFAR observations of gravitational wave merger events: O3 results and O4 strategy",
    "authors": [
        "Kelly Gourdji",
        "Antonia Rowlinson",
        "Ralph Wijers",
        "Jess Broderick",
        "Aleksandar Shulevski"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The electromagnetic counterparts to gravitational wave (GW) merger events hold immense scientific value, but are difficult to detect due to the typically large localisation errors associated with GW events. The Low-Frequency Array (LOFAR) is an attractive GW follow-up instrument owing to its high sensitivity, large instantaneous field of view, and ability to automatically trigger on events to probe potential prompt emission within minutes. Here, we report on 144-MHz LOFAR observations of three GW merger events containing at least one neutron star that were detected during the third GW observing run (S190426c, S191213g and S200213t). While these events are not particularly significant, we use multi-epoch LOFAR data to devise a sensitive wide-field GW follow-up strategy to be used in future GW observing runs. In particular, we improve on our previously published strategy by implementing direction dependent calibration and mosaicing, resulting in nearly an order of magnitude increase in sensitivity and more uniform coverage. We achieve a uniform $5σ$ sensitivity of $870$ $μ$Jy across a single instantaneous LOFAR pointing's 21 deg$^{2}$ core, and a median sensitivity of 1.1 mJy when including the full 89 deg$^{2}$ hexagonal beam pattern. We also place the deepest transient surface density limits yet on of order month timescales for surveys between 60--340 MHz (0.017 deg$^{-2}$ above $2.0$ mJy and 0.073 deg$^{-2}$ above $1.5$ mJy).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11555v1"
    ],
    "publication_venue": "Submitted to MNRAS. 8 pages, 5 figures"
}