{
    "arxiv_id": "2303.17048",
    "paper_title": "Applying Machine Learning to Understand Water Security and Water Access Inequality in Underserved Colonia Communities",
    "authors": [
        "Zhining Gu",
        "Wenwen Li",
        "Michael Hanemann",
        "Yushiou Tsai",
        "Amber Wutich",
        "Paul Westerhoff",
        "Laura Landes",
        "Anais D. Roque",
        "Madeleine Zheng",
        "Carmen A. Velasco",
        "Sarah Porter"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "stat.AP"
    ],
    "abstract": "This paper explores the application of machine learning to enhance our understanding of water accessibility issues in underserved communities called Colonias located along the northern part of the United States - Mexico border. We analyzed more than 2000 such communities using data from the Rural Community Assistance Partnership (RCAP) and applied hierarchical clustering and the adaptive affinity propagation algorithm to automatically group Colonias into clusters with different water access conditions. The Gower distance was introduced to make the algorithm capable of processing complex datasets containing both categorical and numerical attributes. To better understand and explain the clustering results derived from the machine learning process, we further applied a decision tree analysis algorithm to associate the input data with the derived clusters, to identify and rank the importance of factors that characterize different water access conditions in each cluster. Our results complement experts' priority rankings of water infrastructure needs, providing a more in-depth view of the water insecurity challenges that the Colonias suffer from. As an automated and reproducible workflow combining a series of tools, the proposed machine learning pipeline represents an operationalized solution for conducting data-driven analysis to understand water access inequality. This pipeline can be adapted to analyze different datasets and decision scenarios.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17048v1"
    ],
    "publication_venue": "26 pages, 7 figures, accepted by Computers, Environment and Urban Systems (CEUS)"
}