{
    "arxiv_id": "2303.13838",
    "paper_title": "Modelling of FG-TPMS plates",
    "authors": [
        "H. Nguyen-Xuan",
        "Kim Q. Tran",
        "Chien H. Thai",
        "Jaehong Lee"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-04-11"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Functionally graded porous plates have been validated as remarkable lightweight structures with excellent mechanical characteristics and numerous applications. With inspiration from the high strength-to-volume ratio of triply periodic minimal surface (TPMS) structures, a new model of porous plates, which is called a functionally graded TPMS (FG-TPMS) plate, is investigated in this paper. Three TPMS architectures including Primitive (P), Gyroid (G), and wrapped package-graph (IWP) with different graded functions are presented. To predict the mechanical responses, a new fitting technique based on a two-phase piece-wise function is employed to evaluate the effective moduli of TPMS structures, including elastic modulus, shear modulus, and bulk modulus. In addition, this function corresponds to the cellular structure formulation in the context of relative density. The separated phases of the function are divided by the different deformation behaviors. Furthermore, another crucial mechanical property of porous structure, i.e, Poisson's ratio, is also achieved by a similar fitting technique. To verify the mechanical characteristics of the FG-TPMS plate, the generalized displacement field is modeled by a seventh-order shear deformation theory (SeSDT) and isogeometric analysis (IGA). Numerical examples regarding static, buckling, and free vibration analyses of FG-TPMS plates are illustrated to confirm the reliability and accuracy of the proposed approach. Consequently, these FG-TPMS structures can provide much higher stiffness than the same-weight isotropic plate. The greater stiffness-to-weight ratio of these porous plates compared to the full-weight isotropic ones should be considered the most remarkable feature. Thus, these complex porous structures have numerous practical applications because of these high ratios and their fabrication ability through additive manufacturing (AM) technology.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13838v1"
    ],
    "publication_venue": "27 pages (including references), 15 figures, 12 tables"
}