{
    "arxiv_id": "2303.15177",
    "paper_title": "Planet formation via pebble accretion in externally photoevaporating discs",
    "authors": [
        "Lin Qiao",
        "Gavin A. L. Coleman",
        "Thomas J. Haworth"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "We demonstrate that planet formation via pebble accretion is sensitive to external photoevaporation of the outer disc. In pebble accretion, planets grow by accreting from a flux of solids (pebbles) that radially drift inwards from the pebble production front. If external photoevaporation truncates the outer disc fast enough, it can shorten the time before the pebble production front reaches the disc outer edge, cutting off the supply of pebble flux for accretion, hence limiting the pebble mass reservoir for planet growth. Conversely, cloud shielding can protect the disc from strong external photoevaporation and preserve the pebble reservoir. Because grain growth and drift can occur quickly, shielding even on a short time-scale (<1 Myr) can have a non-linear impact on the properties of planets growing by pebble accretion. For example a $10^{-3} M_\\oplus$ planetary seed at 25 au stays at 25 au with a lunar mass if the disc is immediately irradiated by a $10^3$ G$_0$ field, but grows and migrates to be approximately Earth-like in both mass and orbital radius if the disc is shielded for just 1 Myr. In NGC 2024, external photoevaporation is thought to happen to discs that are <0.5 Myr old, which coupled with the results here suggests that the exact planetary parameters can be very sensitive to the star forming environment. Universal shielding for time-scales of at least $\\sim1.5$ Myr would be required to completely nullify the environmental impact on planetary architectures.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15177v1"
    ],
    "publication_venue": "Accepted for publication in mnras, 12 pages, 8 figures",
    "doi": "10.1093/mnras/stad944"
}