{
    "arxiv_id": "2303.09899",
    "paper_title": "Global N-body simulations of circumbinary planet formation around Kepler-16 and -34 analogues I: Exploring the pebble accretion scenario",
    "authors": [
        "Gavin A. L. Coleman",
        "Richard P. Nelson",
        "Amaury H. M. J. Triaud"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Numerous circumbinary planets have been discovered in surveys of transiting planets. Often, these planets are found to orbit near to the zone of dynamical instability, close to the central binary. The existence of these planets has been explained by hydrodynamical simulations that show that migrating circumbinary planets, embedded in circumbinary discs, halt at the central cavity that is formed by the central binary. Transit surveys are naturally most sensitive to finding circumbinary planets with the shortest orbital periods. The future promise of detecting longer period systems using radial-velocity searches, combined with the anticipated detection of numerous circumbinary planets by ESA's PLATO mission, points to the need to model and understand the formation and evolution of circumbinary planets in a more general sense than has been considered before. With this goal in mind, we present a newly developed global model of circumbinary planet formation that is based on the mercury6 symplectic N-body integrator, combined with a model for the circumbinary disc and prescriptions for a range of processes involved in planet formation such as pebble accretion, gas envelope accretion and migration. Our results show that under reasonable assumptions, the pebble accretion scenario can produce circumbinary systems that are similar to those observed, and in particular is able to produce planets akin to Kepler-16b and Kepler-34b. Comparing our results to other systems, we find that our models also adequately reproduce such systems, including multi-planet systems. Resonances between neighbouring planets are frequently obtained, whilst ejections of planets by the central binary acts as an effective source of free floating planets.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09899v1"
    ],
    "publication_venue": "Accepted for publication in MNRAS, 23 pages, 16 figures",
    "doi": "10.1093/mnras/stad833"
}