{
    "arxiv_id": "2303.16055",
    "paper_title": "Augmented Reality Remote Operation of Dual Arm Manipulators in Hot Boxes",
    "authors": [
        "Frank Regal",
        "Young Soo Park",
        "Jerry Nolan",
        "Mitch Pryor"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cs.RO"
    ],
    "abstract": "In nuclear isotope and chemistry laboratories, hot cells and gloveboxes provide scientists with a controlled and safe environment to perform experiments. Working on experiments in these isolated containment cells requires scientists to be physically present. For hot cell work today, scientists manipulate equipment and radioactive material inside through a bilateral mechanical control mechanism. Motions produced outside the cell with the master control levers are mechanically transferred to the internal grippers inside the shielded containment cell. There is a growing need to have the capability to conduct experiments within these cells remotely. A simple method to enable remote manipulations within hot cell and glovebox cells is to mount two robotic arms inside a box to mimic the motions of human hands. An AR application was built in this work to allow a user wearing a Microsoft HoloLens 2 headset to teleoperate dual arm manipulators by grasping robotic end-effector digital replicas in AR from a remote location. In addition to the real-time replica of the physical robotic arms in AR, the application enables users to view a live video stream attached to the robotic arms and parse a 3D point cloud of 3D objects in their remote AR environment for better situational awareness. This work also provides users with virtual fixture to assist in manipulation and other teleoperation tasks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16055v1"
    ],
    "publication_venue": "Abstract Submitted to the First International Workshop \"Horizons of an Extended Robotics Reality\" at the 2022 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). https://sites.google.com/view/xr-robotics-iros2022/home?authuser=0"
}