{
    "arxiv_id": "2303.11199",
    "paper_title": "A Tensor Train Continuous Time Solver for Quantum Impurity Models",
    "authors": [
        "A. Erpenbeck",
        "W. -T. Lin",
        "T. Blommel",
        "L. Zhang",
        "S. Iskakov",
        "L. Bernheimer",
        "Y. Núñez-Fernández",
        "G. Cohen",
        "O. Parcollet",
        "X. Waintal",
        "E. Gull"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2024-01-22"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el",
        "cond-mat.mes-hall"
    ],
    "abstract": "The simulation of strongly correlated quantum impurity models is a significant challenge in modern condensed matter physics that has multiple important applications. Thus far, the most successful methods for approaching this challenge involve Monte Carlo techniques that accurately and reliably sample perturbative expansions to any order. However, the cost of obtaining high precision through these methods is high. Recently, tensor train decomposition techniques have been developed as an alternative to Monte Carlo integration. In this study, we apply these techniques to the single-impurity Anderson model at equilibrium by calculating the systematic expansion in power of the hybridization of the impurity with the bath. We demonstrate the performance of the method in a paradigmatic application, examining the first-order phase transition on the infinite dimensional Bethe lattice, which can be mapped to an impurity model through dynamical mean field theory. Our results indicate that using tensor train decomposition schemes allows the calculation of finite-temperature Green's functions and thermodynamic observables with unprecedented accuracy. The methodology holds promise for future applications to frustrated multi-orbital systems, using a combination of partially summed series with other techniques pioneered in diagrammatic and continuous-time quantum Monte Carlo.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11199v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevB.107.245135"
}