{
    "arxiv_id": "2303.12935",
    "paper_title": "GRB 191019A: a short gamma-ray burst in disguise from the disk of an active galactic nucleus",
    "authors": [
        "Davide Lazzati",
        "Rosalba Perna",
        "BenJamin Gompertz",
        "Andrew Levan"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.SR"
    ],
    "abstract": "Long and short gamma-ray bursts (GRBs), canonically separated at around 2 seconds duration, are associated with different progenitors: the collapse of a massive star and the merger of two compact objects, respectively. GRB 191019A was a long GRB ($T_{90}\\sim64$ s). Despite the relatively small redshift z=0.248 and HST followup observations, an accompanying supernova was not detected. In addition, the host galaxy did not have significant star formation activity. Here we propose that GRB 191019A was produced by a binary compact merger, whose prompt emission was stretched in time by the interaction with a dense external medium. This would be expected if the burst progenitor was located in the disk of an active galactic nucleus, as supported by the burst localization close to the center of its host galaxy. We show that the light curve of GRB 191019A can be well modeled by a burst of intrinsic duration t=1.1 s and of energy $E_{\\rm{iso}}=10^{51}$ erg seen moderately off-axis, exploding in a medium of density $10^7-10^8$ cm$^{-3}$. The double-peaked light curve carries the telltale features predicted for GRBs in high-density media, where the first peak is produced by the photosphere, and the second by the overlap of reverse shocks that take place before the internal shocks could happen. This would make GRB 191019A the first confirmed stellar explosion from within an accretion disk, with important implications for the formation and evolution of stars in accretion flows and for gravitational waves source populations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12935v1"
    ],
    "publication_venue": "6 pages, 2 figures. Submitted to ApJL"
}