{
    "arxiv_id": "2303.10091",
    "paper_title": "Energetics and Dynamics of a stable Bloch point",
    "authors": [
        "Thomas Brian Winkler",
        "Marijan Beg",
        "Martin Lang",
        "Mathias Kläui",
        "Hans Fangohr"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.comp-ph"
    ],
    "abstract": "Magnetic Bloch points (BPs) are highly confined magnetization configurations, that often occur in transient spin dynamics processes. However, opposing chiralities of adjacent layers for instance in a FeGe bilayer stack can stabilize such magnetic BPs at the layer interface. These BPs configurations are metastable and consist of two coupled vortices (one in each layer) with same circularity and opposite polarity. Each vortex is stabilized by opposite sign Dzyaloshinskii-Moriya interactions. This stabilization mechanism potentially opens the door towards BP-based spintronic applications. An open question, from a methodological point of view, is whether the Heisenberg (HB) model approach (atomistic model) as to be used to study such systems or if the -- computationally more efficient -- micromagnetic (MM) models can be used and still obtain robust results. We are modelling and comparing the energetics and dynamics of a stable BP obtained using both HB and MM approaches. We find that an MM description of a stable BP leads qualitatively to the same results as the HB description, and that an appropriate mesh discretization plays a more important role than the chosen model. Further, we study the dynamics by shifting the BP with an applied in-plane field and investigating the relaxation after switching the filed off abruptly. The precessional motion of coupled vortices in a BP state can be drastically reduced compared to a classical vortex, which may be also an interesting feature for fast and efficient devices. A recent study has shown that a bilayer stack hosting BPs can be used to retain information [1].",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10091v1"
    ],
    "publication_venue": "19 pages, 6 figures"
}