{
    "arxiv_id": "2303.16902",
    "paper_title": "GRB-SN Association within the Binary-Driven Hypernova Model",
    "authors": [
        "Y. Aimuratov",
        "L. M. Becerra",
        "C. L. Bianco",
        "C. Cherubini",
        "M. Della Valle",
        "S. Filippi",
        "Liang Li",
        "R. Moradi",
        "J. A. Rueda",
        "R. Ruffini",
        "N. Sahakyan",
        "Y. Wang",
        "S. R. Zhang"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The observations of Ic supernovae (Ic/SNe) occurring after the prompt emission of long gamma-ray bursts (GRBs) are addressed within the binary-driven hypernova (BdHN) model. The GRBs originate from a binary composed of a $\\sim 10~M_\\odot$ carbon-oxygen (CO) star and a companion neutron star (NS). We assume these same progenitors originate the Ic/SN. The binary evolution depends strongly on the binary period, $P_{\\rm bin}$. The trigger, given by the CO core collapse, for $P_{\\rm bin}$ of up to a few hours leads to an Ic/SN with a fast-spinning NS ($ν$NS) at its center. For $P_{\\rm bin} \\sim 4$--$5$ min, BdHN I occur with energies $10^{52}$--$10^{54}$ erg, a contribution by the black hole (BH) created by the NS companion collapse, originates the Mev/GeV radiations. The $\\sim$~1 millisecond $ν$NS originates, by synchrotron radiation, the X-ray afterglow. For $P_{\\rm bin} \\sim 10$~min, BdHN II occurs with energies of $10^{50}$--$10^{52}$~erg. For $P_{\\rm bin} \\sim$ hours, BdHN III occurs with energies below $10^{50}$~erg. The $1$--$1000$ ms $ν$NS, in all BdHNe, originates the X-ray afterglow by synchrotron emission. The SN Ic follows an independent evolution, becoming observable by the nickel decay after the GRB prompt emission. We report $24$ Ic/SNe associated with BdHNe; their optical peak luminosity and their time of occurrence are similar and independent of the associated GRBs. We give four examples of BdHNe and their associated hypernovae. For the first time, we approach new physical processes in BdHNe, identifying seven episodes and their signatures in their spectra.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16902v1"
    ],
    "publication_venue": "Submitted on January 17, 2023"
}