{
    "arxiv_id": "2303.11794",
    "paper_title": "Robust intralayer antiferromagnetism and tricriticality in a van der Waals compound: VBr3 case",
    "authors": [
        "Dávid Hovančík",
        "Marie Kratochvílová",
        "Tetiana Haidamak",
        "Petr Doležal",
        "Karel Carva",
        "Anežka Bendová",
        "Jan Prokleška",
        "Petr Proschek",
        "Martin Míšek",
        "Denis I. Gorbunov",
        "Jan Kotek",
        "Vladimír Sechovský",
        "Jiří Pospíšil"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-09-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "cond-mat.str-el"
    ],
    "abstract": "We studied magnetic states and phase transitions in the van der Waals antiferromagnet VBr3 by specific heat and magnetization measurements of single crystals in high magnetic fields and by ab initio density functional theory calculations focused on exchange interactions. The magnetization behavior resembles Ising antiferromagnets with magnetic moments kept in the out-of-plane direction by strong uniaxial magnetocrystalline anisotropy. The out-of-plane magnetic field induces a spin-flip metamagnetic transition, which is of first-order type at low temperatures while at higher temperatures the transition becomes continuous. The first-order and continuous transition segments in the field-temperature phase diagram meet at a tricritical point at = 12 K. The magnetization response to the in-plane field manifests a continuous spin-flop transition, which at 2 K terminates at a field mu0Hc = 27 T that can serve as an estimate of the anisotropy field in VBr3. The magnetization curves above the metamagnetic transition saturate at the same value of magnetic moment musat = 1.2 muB/f.u., which is much smaller than the spin-only (S = 1) moment of the V3+ ion. The reduced moment can be explained by the existence of a significant orbital magnetic moment antiparallel to the spin. The orbital moment is a key ingredient of a mechanism responsible for the observed large anisotropy. The exact energy evaluation of possible magnetic orders unambiguously shows that the magnetic ground state of VBr3 is the intralayer zigzag antiferromagnetic order that renders the antiferromagnetic ground state significantly more stable against the spin-flip transition than the other options. The calculations also predict that a minimal distortion of the Br ion sublattice causes a radical change of the orbital occupation in the ground state, connected with the formation of the orbital moment and the stability of magnetic order.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11794v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevB.108.104416"
}