{
    "arxiv_id": "2303.09554",
    "paper_title": "PartNeRF: Generating Part-Aware Editable 3D Shapes without 3D Supervision",
    "authors": [
        "Konstantinos Tertikas",
        "Paschalidou Despoina",
        "Boxiao Pan",
        "Jeong Joon Park",
        "Mikaela Angelina Uy",
        "Ioannis Emiris",
        "Yannis Avrithis",
        "Leonidas Guibas"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Impressive progress in generative models and implicit representations gave rise to methods that can generate 3D shapes of high quality. However, being able to locally control and edit shapes is another essential property that can unlock several content creation applications. Local control can be achieved with part-aware models, but existing methods require 3D supervision and cannot produce textures. In this work, we devise PartNeRF, a novel part-aware generative model for editable 3D shape synthesis that does not require any explicit 3D supervision. Our model generates objects as a set of locally defined NeRFs, augmented with an affine transformation. This enables several editing operations such as applying transformations on parts, mixing parts from different objects etc. To ensure distinct, manipulable parts we enforce a hard assignment of rays to parts that makes sure that the color of each ray is only determined by a single NeRF. As a result, altering one part does not affect the appearance of the others. Evaluations on various ShapeNet categories demonstrate the ability of our model to generate editable 3D objects of improved fidelity, compared to previous part-based generative approaches that require 3D supervision or models relying on NeRFs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09554v1",
        "http://arxiv.org/pdf/2303.09554v2"
    ],
    "publication_venue": "To appear in CVPR 2023, Project Page: https://ktertikas.github.io/part_nerf"
}