{
    "arxiv_id": "2303.10599",
    "paper_title": "Provable Convergence of Variational Monte Carlo Methods",
    "authors": [
        "Tianyou Li",
        "Fan Chen",
        "Huajie Chen",
        "Zaiwen Wen"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "stat.ML",
        "math.OC"
    ],
    "abstract": "The Variational Monte Carlo (VMC) is a promising approach for computing the ground state energy of many-body quantum problems and attracts more and more interests due to the development of machine learning. The recent paradigms in VMC construct neural networks as trial wave functions, sample quantum configurations using Markov chain Monte Carlo (MCMC) and train neural networks with stochastic gradient descent (SGD) method. However, the theoretical convergence of VMC is still unknown when SGD interacts with MCMC sampling given a well-designed trial wave function. Since MCMC reduces the difficulty of estimating gradients, it has inevitable bias in practice. Moreover, the local energy may be unbounded, which makes it harder to analyze the error of MCMC sampling. Therefore, we assume that the local energy is sub-exponential and use the Bernstein inequality for non-stationary Markov chains to derive error bounds of the MCMC estimator. Consequently, VMC is proven to have a first order convergence rate $O(\\log K/\\sqrt{n K})$ with $K$ iterations and a sample size $n$. It partially explains how MCMC influences the behavior of SGD. Furthermore, we verify the so-called correlated negative curvature condition and relate it to the zero-variance phenomena in solving eigenvalue functions. It is shown that VMC escapes from saddle points and reaches $(ε,ε^{1/4})$ -approximate second order stationary points or $ε^{1/2}$-variance points in at least $O(ε^{-11/2}\\log^{2}(1/ε) )$ steps with high probability. Our analysis enriches the understanding of how VMC converges efficiently and can be applied to general variational methods in physics and statistics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10599v1"
    ],
    "publication_venue": null
}