{
    "arxiv_id": "2303.08737",
    "paper_title": "Evaluating gesture-generation in a large-scale open challenge: The GENEA Challenge 2022",
    "authors": [
        "Taras Kucherenko",
        "Pieter Wolfert",
        "Youngwoo Yoon",
        "Carla Viegas",
        "Teodor Nikolov",
        "Mihail Tsakov",
        "Gustav Eje Henter"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cs.HC",
        "cs.LG",
        "cs.MM"
    ],
    "abstract": "This paper reports on the second GENEA Challenge to benchmark data-driven automatic co-speech gesture generation. Participating teams used the same speech and motion dataset to build gesture-generation systems. Motion generated by all these systems was rendered to video using a standardised visualisation pipeline and evaluated in several large, crowdsourced user studies. Unlike when comparing different research papers, differences in results are here only due to differences between methods, enabling direct comparison between systems. The dataset was based on 18 hours of full-body motion capture, including fingers, of different persons engaging in a dyadic conversation. Ten teams participated in the challenge across two tiers: full-body and upper-body gesticulation. For each tier, we evaluated both the human-likeness of the gesture motion and its appropriateness for the specific speech signal. Our evaluations decouple human-likeness from gesture appropriateness, which has been a difficult problem in the field.\n  The evaluation results are a revolution, and a revelation. Some synthetic conditions are rated as significantly more human-like than human motion capture. To the best of our knowledge, this has never been shown before on a high-fidelity avatar. On the other hand, all synthetic motion is found to be vastly less appropriate for the speech than the original motion-capture recordings. We also find that conventional objective metrics do not correlate well with subjective human-likeness ratings in this large evaluation. The one exception is the Fréchet gesture distance (FGD), which achieves a Kendall's tau rank correlation of around -0.5. Based on the challenge results we formulate numerous recommendations for system building and evaluation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08737v1"
    ],
    "publication_venue": "The first three authors made equal contributions and share joint first authorship. arXiv admin note: substantial text overlap with arXiv:2208.10441"
}