{
    "arxiv_id": "2303.10222",
    "paper_title": "CerviFormer: A Pap-smear based cervical cancer classification method using cross attention and latent transformer",
    "authors": [
        "Bhaswati Singha Deo",
        "Mayukha Pal",
        "Prasanta K. Panigarhi",
        "Asima Pradhan"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "eess.IV",
        "cs.CV",
        "cs.LG"
    ],
    "abstract": "Purpose: Cervical cancer is one of the primary causes of death in women. It should be diagnosed early and treated according to the best medical advice, as with other diseases, to ensure that its effects are as minimal as possible. Pap smear images are one of the most constructive ways for identifying this type of cancer. This study proposes a cross-attention-based Transfomer approach for the reliable classification of cervical cancer in Pap smear images. Methods: In this study, we propose the CerviFormer -- a model that depends on the Transformers and thereby requires minimal architectural assumptions about the size of the input data. The model uses a cross-attention technique to repeatedly consolidate the input data into a compact latent Transformer module, which enables it to manage very large-scale inputs. We evaluated our model on two publicly available Pap smear datasets. Results: For 3-state classification on the Sipakmed data, the model achieved an accuracy of 93.70%. For 2-state classification on the Herlev data, the model achieved an accuracy of 94.57%. Conclusion: Experimental results on two publicly accessible datasets demonstrate that the proposed method achieves competitive results when compared to contemporary approaches. The proposed method brings forth a comprehensive classification model to detect cervical cancer in Pap smear images. This may aid medical professionals in providing better cervical cancer treatment, consequently, enhancing the overall effectiveness of the entire testing process.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10222v1"
    ],
    "publication_venue": null
}