{
    "arxiv_id": "2303.14120",
    "paper_title": "Deformed Special Relativity with a minimum speed as explanation of the tiny value of the cosmological constant based on the Boomerang experiment in the $ΛCDM$ scenario",
    "authors": [
        "Cláudio Nassif Cruz",
        "A. C. Amaro de Faria"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "physics.gen-ph"
    ],
    "abstract": "In this paper we will show that a new structure of space-time with a minimum speed reveals a connection with Weyl geometry in the approximation of weak-field Newtonian limit. Symmetrical Special Relativity (SSR) has a minimum speed $V$ that plays the role of a preferred reference frame $S_V$ of vacuum that leads to the cosmological constant $Λ$. In order to realize such a connection between $V$ and $Λ$ within a scenario of space-time metric, we will use a model of spherical universe with Hubble radius $R_H$ filled by a low vacuum energy density $ρ_Λ$ that governs the accelerated expansion of the universe. In doing this, we will show that SSR-metric plays the role of a de-Sitter (dS)-metric with a positive cosmological constant ($Λ>0$). On the other hand, according to the Boomerang experiment as it is shown that the three-dimensional space of the universe is Euclidean and with a slightly accelerated expansion, SSR leads to a dS-metric with an approximation for $Λ<<1$ close to a flat space-time, which is in the $ΛCDM$ scenario where the space is quasi-flat, so that $Ω_{m}+Ω_Λ\\approx 1$. We have $Ω{cdm}\\approx 23\\%$ by representing dark cold matter, $Ω_m\\approx 27\\%$ for matter and $Ω_Λ\\approx 73\\%$ for the vacuum energy. Thus, the theory is adjusted for redshift $z=1$, i.e., the time $τ_0$ at which the universe goes over from a decelerating to an accelerating expansion by obtaining the numerical value $Λ_0=1.934\\times 10^{-35}s^{-2}$, being in agreement with measurements.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14120v1"
    ],
    "publication_venue": "11 pages, 2 figures. Still to be submitted to Journal of Cosmology and Astroparticle Physics (JCAP). arXiv admin note: substantial text overlap with arXiv:2203.16327"
}