{
    "arxiv_id": "2303.17587",
    "paper_title": "Observation of non-superconducting phase changes in LuH$_{2\\pm\\text{x}}$N$_y$",
    "authors": [
        "Xiangzhuo Xing1",
        "Chao Wang",
        "Linchao Yu",
        "Jie Xu",
        "Chutong Zhang",
        "Mengge Zhang",
        "Song Huang",
        "Xiaoran Zhang",
        "Bingchao Yang",
        "Xin Chen",
        "Yongsheng Zhang",
        "Jian-gang Guo",
        "Zhixiang Shi",
        "Yanming Ma",
        "Changfeng Chen",
        "Xiaobing Liu"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "The recent report of near-ambient superconductivity in nitrogen doped lutetium hydride1 has triggered a worldwide fanaticism and raised major questions about the latest claims. An intriguing phenomenon of color changes in pressurized samples from blue to pink to red was observed and correlated with the claimed superconducting transition, but the origin and underlying physics of these color changes have yet to be elucidated2-7. Here we report synthesis and characterization of high-purity nitrogen doped lutetium hydride LuH_{2\\pm\\text{x}}N_y with the same structure and composition as in the main phase of near-ambient superconductor1. We find a new purple phase of LuH_{2\\pm\\text{x}}N_y between blue and pink phase, and reveal that the sample color changes likely stem from pressure-driven redistribution of nitrogen and its interaction with the LuH2 framework. No superconducting transition is found in all blue, purple, pink and red phases at temperatures 1.8-300 K and pressures 0-30 GPa. Instead, we identify a notable temperature-induced resistance anomaly of structural and/or electronic origin in LuH_{2\\pm\\text{x}}N_y, which is most pronounced in the pink phase and may have been erroneously interpreted as a sign of superconducting transition. This work establishes key benchmarks for nitrogen doped lutetium hydrides, allowing an in-depth understanding of the novel pressure-induced phase changes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17587v1"
    ],
    "publication_venue": "26 pages, 5 figures. Any valuable comments and suggestions are warmly welcomed"
}