{
    "arxiv_id": "2303.14009",
    "paper_title": "PoisonedGNN: Backdoor Attack on Graph Neural Networks-based Hardware Security Systems",
    "authors": [
        "Lilas Alrahis",
        "Satwik Patnaik",
        "Muhammad Abdullah Hanif",
        "Muhammad Shafique",
        "Ozgur Sinanoglu"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CR"
    ],
    "abstract": "Graph neural networks (GNNs) have shown great success in detecting intellectual property (IP) piracy and hardware Trojans (HTs). However, the machine learning community has demonstrated that GNNs are susceptible to data poisoning attacks, which result in GNNs performing abnormally on graphs with pre-defined backdoor triggers (realized using crafted subgraphs). Thus, it is imperative to ensure that the adoption of GNNs should not introduce security vulnerabilities in critical security frameworks.\n  Existing backdoor attacks on GNNs generate random subgraphs with specific sizes/densities to act as backdoor triggers. However, for Boolean circuits, backdoor triggers cannot be randomized since the added structures should not affect the functionality of a design.\n  We explore this threat and develop PoisonedGNN as the first backdoor attack on GNNs in the context of hardware design. We design and inject backdoor triggers into the register-transfer- or the gate-level representation of a given design without affecting the functionality to evade some GNN-based detection procedures. To demonstrate the effectiveness of PoisonedGNN, we consider two case studies: (i) Hiding HTs and (ii) IP piracy. Our experiments on TrustHub datasets demonstrate that PoisonedGNN can hide HTs and IP piracy from advanced GNN-based detection platforms with an attack success rate of up to 100%.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14009v1"
    ],
    "publication_venue": "This manuscript is currently under review at IEEE Transactions on Computers"
}