{
    "arxiv_id": "2303.15758",
    "paper_title": "Heating of quiescent coronal loops caused by nearby eruptions observed with the Solar Dynamics Observatory and the Solar Upper Transition Region Imager",
    "authors": [
        "Leping Li",
        "Hui Tian",
        "Huadong Chen",
        "Hongqiang Song",
        "Zhenyong Hou",
        "Xianyong Bai",
        "Kaifan Ji",
        "Yuanyong Deng"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "How structures, e.g., magnetic loops, in the upper atmosphere, i.e., the transition region and corona, are heated and sustained is one of the major unresolved issues in solar and stellar physics. Various theoretical and observational studies on the heating of coronal loops have been undertaken. The heating of quiescent loops caused by eruptions is, however, rarely observed. In this study, employing data from the Solar Dynamics Observatory (SDO) and Solar Upper Transition Region Imager (SUTRI), we report the heating of quiescent loops associated with nearby eruptions. In active regions (ARs) 13092 and 13093, a long filament and a short filament, and their overlying loops are observed on 2022 September 4. In AR 13093, a warm channel erupted toward the northeast, whose material moved along its axis toward the northwest under the long filament, turned to the west above the long filament, and divided into two branches falling to the solar surface. Subsequently, the short filament erupted toward the southeast. Associated with these two eruptions, the quiescent loops overlying the long filament appeared in SDO/Atmospheric Imaging Assembly (AIA) high-temperature images, indicating the heating of loops. During the heating, signature of magnetic reconnection between loops is identified, including the inflowing motions of loops, and the formation of X-type structures and newly reconnected loops. The heated loops then cooled down. They appeared sequentially in AIA and SUTRI lower-temperature images. All the results suggest that the quiescent loops are heated by reconnection between loops caused by the nearby warm channel and filament eruptions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15758v1"
    ],
    "publication_venue": "20 pages, 12 figures, accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc8c6"
}