{
    "arxiv_id": "2303.13890",
    "paper_title": "Regularity and asymptotics of densities of inverse subordinators",
    "authors": [
        "Giacomo Ascione",
        "Mladen Savov",
        "Bruno Toaldo"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-04-18"
    ],
    "latest_version": 2,
    "categories": [
        "math.PR"
    ],
    "abstract": "In this article densities (and their derivatives) of subordinators and inverse subordinators are considered. Under minor restrictions, milder than the existing in the literature, using a useful modification of the saddle point method, we obtain the large asymptotic behaviour of these densities (and their derivatives) for a specific region of space and time and quantify how the ratio between time and space affects the explicit speed of convergence. The asymptotics is governed by an exponential term depending on the Laplace exponent of the subordinator and the region represents the behaviour of the subordinator when it is atypically small (the inverse one is larger than usual). As a result a route to the derivation of novel general or particular fine estimates for densities with explicit constants in the speed of convergence in the region of the lower envelope/the law of iterated logarithm is available. Furthermore, under mild conditions, we provide a power series representation for densities (and their derivatives) of subordinators and inverse subordinators. This representation is explicit and based on the derivatives of the convolution of the tails of the corresponding Lévy measure, whose smoothness is also investigated. In this context the methods adopted are based on Laplace inversion and strongly rely on the theory of Bernstein functions extended to the cut complex plane. As a result, smoothness properties of densities (and their derivatives) and their behaviour near zero immediately follow.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13890v1",
        "http://arxiv.org/pdf/2303.13890v2"
    ],
    "publication_venue": "43 pages, 2 figures"
}