{
    "arxiv_id": "2303.07931",
    "paper_title": "The ionising photon production efficiency at z~6 for a sample of bright Lyman-alpha emitters using JEMS and MUSE",
    "authors": [
        "Charlotte Simmonds",
        "Sandro Tacchella",
        "Michael V. Maseda",
        "Christina Williams",
        "William M. Baker",
        "Callum Witten",
        "Benjamin D. Johnson",
        "Brant Robertson",
        "Aayush Saxena",
        "Fengwu Sun",
        "Joris Witstok",
        "Rachana Bhatawdekar",
        "Kristan Boyett",
        "Andrew J. Bunker",
        "Stephane Charlot",
        "Emma Curtis-Lake",
        "Eiichi Egami",
        "Daniel J. Eisenstein",
        "Zhiyuan Ji",
        "Roberto Maiolino",
        "Lester Sandles",
        "Renske Smit",
        "Hannah Übler",
        "Chris Willott"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We study the ionising photon production efficiency at the end of the Epoch of\nReionisation ($z \\sim 5.4 - 6.6$) for a sample of 35 bright Lyman-$\\alpha$\nemitters, this quantity is crucial to infer the ionising photon budget of the\nUniverse. These objects were selected to have reliable spectroscopic redshifts,\nassigned based on the profile of their Lyman-$\\alpha$ emission line, detected\nin the MUSE deep fields. We exploit medium-band observations from the JWST\nextragalactic medium band survey (JEMS) to find the flux excess corresponding\nto the redshifted \\ha\\ emission line. We estimate the UV luminosity by fitting\nthe full JEMS photometry, along with several HST photometric points, with\n\\texttt{Prospector}. We find a median ultra-violet continuum slope of $\\beta =\n-2.21^{+0.26}_{-0.17}$ for the sample, indicating young stellar populations\nwith little-to-no dust attenuation. Supported by this, we derive $\\xi_{ion,0}$\nwith no dust attenuation and find a median value of\nlog$\\frac{\\xi_{ion,0}}{\\text{Hz erg}^{-1}} = 26.36^{+0.17}_{-0.14}$. If we\nperform dust attenuation corrections and assume a Calzetti attenuation law, our\nvalues are lowered by $\\sim 0.1$ dex. Our results suggest Lyman-$\\alpha$\nemitters at the Epoch of Reionisation have enhanced $\\xi_{ion,0}$ compared to\nprevious estimations from literature, in particular, when compared to the\nnon-Lyman-$\\alpha$ emitting population. This initial study provides a promising\noutlook on the characterisation of ionising photon production in the early\nUniverse. In the future, a more extensive study will be performed on the entire\ndataset provided by the JWST Advanced Deep Extragalactic Survey (JADES). Thus,\nfor the first time, allowing us to",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07931v1"
    ],
    "publication_venue": "11 pages, 5 figures in main paper. 10 pages, 30 figures in appendix.\n  Submitted to MNRAS"
}