{
    "arxiv_id": "2303.10308",
    "paper_title": "A VMS-FEM for the stress-history-dependent materials (fluid or solid) interacting with the rigid body structure: formulation, numerical verification and application in the pipe-soil-water interaction analysis",
    "authors": [
        "Tianyu Li"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "math.NA"
    ],
    "abstract": "The problem of multiphase materials (fluid or solid) interacting with the rigid body structure is studied by proposing a novel VMS-FEM (variational multi-scale finite element method) in the Eulerian framework using the fixed mesh. The incompressible N-S equation with high Reynolds number is stabilized using the idea of the VMS stabilization. To model the multiphase materials, a modified level set method is used to track the development of interfaces between different phases of materials. The interaction between the materials and the rigid body structure is realized using the Lagrangian multiplier method. The mesh of the rigid body structure domain is incompatible with the Eulerian fixed mesh for material domains. A cutting finite element scheme is used to satisfy the coupling condition between the rigid body structure boundary and the deformeable multiphase materials. A novel algorithm is proposed to track the stress history of the material point in the Eulerian fixed-mesh framework such that the stress-history-dependent fluid or solid materials (e.g. as soil) are also analysable using fixed-mesh. The non-local stress theory is used. To consider the stress-history-dependent material in the Eulerian fixed mesh, in the step of calculating the non-local relative-distance-based averaging treatment, the field point location is based on the updated material point position,rather than the spatial field point location. Thus, the convective effect of the previous stress history and the calculation of the non-local stress fields are realized in one shot. Thus, the proposed novel VMS-FEM can solve almost any history-dependent materials (fluid or solid) in the Eulerian framework (fixed mesh), where the distorted mesh problem is not existent.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10308v1"
    ],
    "publication_venue": null
}