{
    "arxiv_id": "2303.11397",
    "paper_title": "A JWST/NIRSpec Exploration of the Connection between Ionization Parameter, Electron Density, and Star-Formation-Rate Surface Density in z=2.7-6.3 Galaxies",
    "authors": [
        "Naveen A. Reddy",
        "Michael W. Topping",
        "Ryan L. Sanders",
        "Alice E. Shapley",
        "Gabriel Brammer"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-08-02"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We conduct a statistical analysis of the factors responsible for the variation in the ionization parameter (U) of high-redshift star-forming galaxies based on medium resolution JWST/NIRSpec observations obtained by the Cosmic Evolution Early Release Science (CEERS) survey. The sample consists of 48 galaxies with spectroscopic redshifts z=2.7-6.3 which are largely representative of typical star-forming galaxies at these redshifts. The [SII] 6718, 6733 doublet is used to estimate electron densities (n_e), and dust-corrected Ha luminosities are used to compute total ionizing photon rates (Q). Using composite spectra of galaxies in bins of [OIII]/[OII] (i.e., O32) as a proxy for U, we determine that galaxies with higher O32 have <n_e> ~ 500 cm^-3 that are at least a factor of ~5 larger than that of lower-O32 galaxies. We do not find a significant difference in <Q> between low- and high-O32 galaxies. Photoionization modeling of all available strong rest-frame optical emission lines is used to simultaneously constrain U and oxygen abundance (Z_neb). We find a large spread in log U of ~1.5 dex at a fixed Z_neb. On the other hand, the data indicate a highly significant correlation between U and star-formation-rate surface density (Sigma_SFR) which appears to be redshift invariant at z~1.6-6.3, and possibly up to z~9.5. We consider several avenues through which metallicity and Sigma_SFR (or gas density) may influence U, including variations in n_e and Q that are tied to metallicity and gas density, internal dust extinction of ionizing photons, and the effects of gas density on the volume filling fraction of dense clumps in HII regions and the escape fraction of ionizing photons. Based on these considerations, we conclude that gas density may play a more central role than metallicity in modulating U at these redshifts.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11397v1"
    ],
    "publication_venue": "16 pages, 13 figures, 4 tables",
    "doi": "10.3847/1538-4357/acd754"
}