{
    "arxiv_id": "2303.15838",
    "paper_title": "Efficacy of virtual purification-based error mitigation on quantum metrology",
    "authors": [
        "Hyukgun Kwon",
        "Changhun Oh",
        "Youngrong Lim",
        "Hyunseok Jeong",
        "Liang Jiang"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Noise is the main source that hinders us from fully exploiting quantum advantages in various quantum informational tasks. However, characterizing and calibrating the effect of noise is not always feasible in practice. Especially for quantum parameter estimation, an estimator constructed without precise knowledge of noise entails an inevitable bias. Recently, virtual purification-based error mitigation (VPEM) has been proposed to apply for quantum metrology to reduce such a bias occurring from unknown noise. While it was demonstrated to work for particular cases, whether VPEM always reduces a bias for general estimation schemes is unclear yet. For more general applications of VPEM to quantum metrology, we study factors determining whether VPEM can reduce the bias. We find that the closeness between the dominant eigenvector of a noisy state and the ideal quantum probe (without noise) with respect to an observable determines the reducible amount of bias by VPEM. Next, we show that one should carefully choose the reference point of the target parameter, which gives the smallest bias because the bias depends on the reference point. Otherwise, even if the dominant eigenvector and the ideal quantum probe are close, the bias of the mitigated case could be larger than the non-mitigated one. %We emphasize that the optimal reference point is a unique feature that comes from the characteristic of quantum metrology. Finally, we analyze the error mitigation for a phase estimation scheme under various noises. Based on our analysis, we predict whether VPEM can effectively reduce a bias and numerically verify our results.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15838v1"
    ],
    "publication_venue": "13 pages, 10 figures"
}