{
    "arxiv_id": "2303.17051",
    "paper_title": "Towards Foundation Models and Few-Shot Parameter-Efficient Fine-Tuning for Volumetric Organ Segmentation",
    "authors": [
        "Julio Silva-Rodríguez",
        "Jose Dolz",
        "Ismail Ben Ayed"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2024-10-04"
    ],
    "latest_version": 3,
    "categories": [
        "cs.CV"
    ],
    "abstract": "The recent popularity of foundation models and the pre-train-and-adapt paradigm, where a large-scale model is transferred to downstream tasks, is gaining attention for volumetric medical image segmentation. However, current transfer learning strategies devoted to full fine-tuning for transfer learning may require significant resources and yield sub-optimal results when the labeled data of the target task is scarce. This makes its applicability in real clinical settings challenging since these institutions are usually constrained on data and computational resources to develop proprietary solutions. To address this challenge, we formalize Few-Shot Efficient Fine-Tuning (FSEFT), a novel and realistic scenario for adapting medical image segmentation foundation models. This setting considers the key role of both data- and parameter- efficiency during adaptation. Building on a foundation model pre-trained on open-access CT organ segmentation sources, we propose leveraging Parameter-Efficient Fine-Tuning and black-box Adapters to address such challenges. Furthermore, novel efficient adaptation methodologies are introduced in this work, which include Spatial black-box Adapters that are more appropriate for dense prediction tasks and constrained transductive inference, leveraging task-specific prior knowledge. Our comprehensive transfer learning experiments confirm the suitability of foundation models in medical image segmentation and unveil the limitations of popular fine-tuning strategies in few-shot scenarios.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17051v1",
        "http://arxiv.org/pdf/2303.17051v2",
        "http://arxiv.org/pdf/2303.17051v3"
    ],
    "publication_venue": "Journal Extension of MICCAI - MedAGI Workshop 2023. Code in https://github.com/jusiro/fewshot-finetuning"
}