{
    "arxiv_id": "2303.17507",
    "paper_title": "Unextendibility, uncompletability, and many-copy indistinguishable ensembles",
    "authors": [
        "Saronath Halder",
        "Alexander Streltsov"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2024-11-27"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Given an ensemble of orthogonal quantum states, we consider that the states cannot be perfectly distinguished by local operations and classical communication (LOCC). If such states remain indistinguishable under LOCC when multiple (finite) identical copies of the states are available, then in brief, we say that the ensemble is many-copy indistinguishable. Here we explore the notions -- unextendibility, uncompletability and analyze their connections to many-copy indistinguishable ensembles. We show that the orthogonal complement of any bipartite pure entangled state is spanned by product states which form a nonorthogonal unextendible product basis (nUPB) of maximum cardinality. This subspace, which is spanned by the states of an nUPB of maximum cardinality, has one to one correspondence with the maximum dimensional subspace where there is no orthonormal product basis. Explicit construction of the product states, forming any such nUPB is shown. Due to these, the proof of indistinguishability of a class of ensembles under LOCC in many-copy scenario becomes simpler. Furthermore, it is now clear that there are several many-copy indistinguishable ensembles, construction-wise they are different but if we consider only indistinguishability property under LOCC, then, many of them are connected through the general notion of unextendible product basis. Thereafter, we introduce the notion of positive partial transpose uncompletability to unify different many-copy indistinguishable ensembles. We also report a class of multipartite many-copy indistinguishable ensembles for which local indistinguishability property increases with decreasing mixedness. This is not usual as mixedness usually introduce difficulty in discrimination. Finally, we discuss the role of bound entanglement in this context.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17507v1"
    ],
    "publication_venue": "8 pages, 1 figure",
    "doi": "10.26421/QIC24.13-14-1"
}