{
    "arxiv_id": "2303.16320",
    "paper_title": "SynthRAD2023 Grand Challenge dataset: generating synthetic CT for radiotherapy",
    "authors": [
        "Adrian Thummerer",
        "Erik van der Bijl",
        "Arthur Jr Galapon",
        "Joost JC Verhoeff",
        "Johannes A Langendijk",
        "Stefan Both",
        "Cornelis",
        "AT van den Berg",
        "Matteo Maspero"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-06-09"
    ],
    "latest_version": 1,
    "categories": [
        "physics.med-ph",
        "cs.CV"
    ],
    "abstract": "Purpose: Medical imaging has become increasingly important in diagnosing and treating oncological patients, particularly in radiotherapy. Recent advances in synthetic computed tomography (sCT) generation have increased interest in public challenges to provide data and evaluation metrics for comparing different approaches openly. This paper describes a dataset of brain and pelvis computed tomography (CT) images with rigidly registered CBCT and MRI images to facilitate the development and evaluation of sCT generation for radiotherapy planning.\n  Acquisition and validation methods: The dataset consists of CT, CBCT, and MRI of 540 brains and 540 pelvic radiotherapy patients from three Dutch university medical centers. Subjects' ages ranged from 3 to 93 years, with a mean age of 60. Various scanner models and acquisition settings were used across patients from the three data-providing centers. Details are available in CSV files provided with the datasets.\n  Data format and usage notes: The data is available on Zenodo (https://doi.org/10.5281/zenodo.7260705) under the SynthRAD2023 collection. The images for each subject are available in nifti format.\n  Potential applications: This dataset will enable the evaluation and development of image synthesis algorithms for radiotherapy purposes on a realistic multi-center dataset with varying acquisition protocols. Synthetic CT generation has numerous applications in radiation therapy, including diagnosis, treatment planning, treatment monitoring, and surgical planning.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16320v1"
    ],
    "publication_venue": "15 pages, 4 figures, 9 tables, pre-print submitted to Medical Physics - dataset. The training dataset is available on Zenodo at https://doi.org/10.5281/zenodo.7260705 from April, 1st 2023",
    "doi": "10.1002/mp.16529"
}