{
    "arxiv_id": "2303.09249",
    "paper_title": "Prospects for measuring the longitudinal particle distribution of cosmic-ray air showers with SKA",
    "authors": [
        "A. Corstanje",
        "S. Buitink",
        "J. Bhavani",
        "M. Desmet",
        "H. Falcke",
        "B. M. Hare",
        "J. R. Hörandel",
        "T. Huege",
        "N. Karasthatis",
        "G. K. Krampah",
        "P. Mitra",
        "K. Mulrey",
        "A. Nelles",
        "K. Nivedita",
        "H. Pandya",
        "J. P. Rachen",
        "O. Scholten",
        "S. Thoudam",
        "G. Trinh",
        "S. ter Veen"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
    ],
    "abstract": "We explore the possibilities of measuring the longitudinal profile of individual air showers beyond $X_{\\rm max}$ when using very dense radio arrays such as SKA. The low-frequency part of the Square Kilometre Array, to be built in Australia, features an enormous antenna density of about $50,000$ antennas in the inner core region of radius 500 m, with a frequency band from 50 to 350 MHz. From CoREAS simulations, a SKA-Low antenna model plus noise contributions, and adapted LOFAR analysis scripts, we obtain a resolution in the shower maximum $X_{\\rm max}$ and energy that is considerably better than at LOFAR. Already from this setup, we show that at least one additional parameter of the longitudinal profile can be measured. This would improve mass composition analysis by measuring an additional composition-dependent quantity. Moreover, it would offer an opportunity to discriminate between the different predictions of hadronic interaction models, hence contributing to hadronic physics at energy levels beyond man-made accelerators.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09249v1"
    ],
    "publication_venue": "8 pages, 6 figures. Presented at ARENA Conference 2022, Santiago de Compostela, Spain"
}