{
    "arxiv_id": "2303.12858",
    "paper_title": "The impact of AGN-driven winds on physical and observable galaxy sizes",
    "authors": [
        "R. K. Cochrane",
        "D. Anglés-Alcázar",
        "J. Mercedes-Feliz",
        "C. C. Hayward",
        "C. -A. Faucher-Giguère",
        "S. Wellons",
        "B. A. Terrazas",
        "A. Wetzel",
        "P. F. Hopkins",
        "J. Moreno",
        "K. -Y. Su",
        "R. S. Somerville"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
    ],
    "abstract": "Without AGN feedback, simulated massive, star-forming galaxies become too compact relative to observed galaxies at z<2. In this paper, we perform high-resolution re-simulations of a massive (M*~10^11M_sol) galaxy at z~2, drawn from the FIRE project. In the simulation without AGN feedback, the galaxy experiences a rapid starburst and shrinking of its half-mass radius at z~2.3. In this paper, we experiment with driving mechanical AGN winds using a state-of-the-art hyper-Lagrangian refinement technique to increase particle resolution. These winds reduce the gas surface density in the inner regions of the galaxy, suppressing the very compact starburst and maintaining an approximately constant half-mass radius. Using radiative transfer, we study the observable impact of AGN feedback on multi-wavelength continuum emission and find notable differences in both the magnitude and spatial extent of emission between the simulations with and without winds. When AGN winds are included, the suppression of the compact, dusty starburst results in lowered flux at FIR wavelengths (due to decreased star formation) but increased flux at optical-to-near-IR wavelengths (due to decreased dust attenuation, in spite of the lowered star formation rate), relative to the case without AGN winds. The FIR half-light radius decreases from ~1kpc to ~0.1kpc in <40Myr when AGN winds are not included, but increases to ~2kpc when they are. The impact of AGN-driven winds at shorter wavelengths is less intuitive, with half-light radii of optical-NIR emission remaining approximately constant over 35Myr, for simulations with and without AGN winds. In the case without winds, this occurs despite the rapid compaction, and is due to heavy dust obscuration in the inner regions of the galaxy. This work highlights the importance of forward-modelling when comparing simulated and observed galaxy populations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12858v1"
    ],
    "publication_venue": "14 pages, 10 figures. Submitted to MNRAS"
}