{
    "arxiv_id": "2303.09764",
    "paper_title": "Rapid Sensing of Hidden Objects and Defects using a Single-Pixel Diffractive Terahertz Processor",
    "authors": [
        "Jingxi Li",
        "Xurong Li",
        "Nezih T. Yardimci",
        "Jingtian Hu",
        "Yuhang Li",
        "Junjie Chen",
        "Yi-Chun Hung",
        "Mona Jarrahi",
        "Aydogan Ozcan"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-10-27"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics",
        "physics.app-ph"
    ],
    "abstract": "Terahertz waves offer numerous advantages for the nondestructive detection of hidden objects/defects in materials, as they can penetrate through most optically-opaque materials. However, existing terahertz inspection systems are restricted in their throughput and accuracy (especially for detecting small features) due to their limited speed and resolution. Furthermore, machine vision-based continuous sensing systems that use large-pixel-count imaging are generally bottlenecked due to their digital storage, data transmission and image processing requirements. Here, we report a diffractive processor that rapidly detects hidden defects/objects within a target sample using a single-pixel spectroscopic terahertz detector, without scanning the sample or forming/processing its image. This terahertz processor consists of passive diffractive layers that are optimized using deep learning to modify the spectrum of the terahertz radiation according to the absence/presence of hidden structures or defects. After its fabrication, the resulting diffractive processor all-optically probes the structural information of the sample volume and outputs a spectrum that directly indicates the presence or absence of hidden structures, not visible from outside. As a proof-of-concept, we trained a diffractive terahertz processor to sense hidden defects (including subwavelength features) inside test samples, and evaluated its performance by analyzing the detection sensitivity as a function of the size and position of the unknown defects. We validated its feasibility using a single-pixel terahertz time-domain spectroscopy setup and 3D-printed diffractive layers, successfully detecting hidden defects using pulsed terahertz illumination. This technique will be valuable for various applications, e.g., security screening, biomedical sensing, quality control, anti-counterfeiting measures and cultural heritage protection.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09764v1"
    ],
    "publication_venue": "23 Pages, 5 Figures",
    "doi": "10.1038/s41467-023-42554-2"
}