{
    "arxiv_id": "2303.17493",
    "paper_title": "Intention-Aware Decision-Making for Mixed Intersection Scenarios",
    "authors": [
        "Balint Varga",
        "Dongxu Yang",
        "Soeren Hohmann"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-07-17"
    ],
    "latest_version": 1,
    "categories": [
        "cs.AI",
        "eess.SY"
    ],
    "abstract": "This paper presents a white-box intention-aware decision-making for the handling of interactions between a pedestrian and an automated vehicle (AV) in an unsignalized street crossing scenario. Moreover, a design framework has been developed, which enables automated parameterization of the decision-making. This decision-making is designed in such a manner that it can understand pedestrians in urban traffic and can react accordingly to their intentions. That way, a human-like response to the actions of the pedestrian is ensured, leading to a higher acceptance of AVs. The core notion of this paper is that the intention prediction of the pedestrian to cross the street and decision-making are divided into two subsystems. On the one hand, the intention detection is a data-driven, black-box model. Thus, it can model the complex behavior of the pedestrians. On the other hand, the decision-making is a white-box model to ensure traceability and to enable a rapid verification and validation of AVs. This white-box decision-making provides human-like behavior and a guaranteed prevention of deadlocks. An additional benefit is that the proposed decision-making requires low computational resources only enabling real world usage. The automated parameterization uses a particle swarm optimization and compares two different models of the pedestrian: The social force model and the Markov decision process model. Consequently, a rapid design of the decision-making is possible and different pedestrian behaviors can be taken into account. The results reinforce the applicability of the proposed intention-aware decision-making.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17493v1"
    ],
    "publication_venue": null,
    "doi": "10.1109/SACI58269.2023.10158550"
}