{
    "arxiv_id": "2303.12110",
    "paper_title": "The Gas Mass Reservoir of Quiescent Galaxies at Cosmic Noon",
    "authors": [
        "David Blánquez-Sesé",
        "C. Gómez-Guijarro",
        "G. E. Magdis",
        "B. Magnelli",
        "R. Gobat",
        "E. Daddi",
        "M. Franco",
        "K. Whitaker",
        "F. Valentino",
        "S. Adscheid",
        "E. Schinnerer",
        "A. Zanella",
        "M. Xiao",
        "T. Wang",
        "D. Liu",
        "V. Kokorev",
        "D. Elbaz"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present a 1.1mm stacking analysis of moderately massive (log($M_{*}$/$M_{\\odot}$) = 10.7 $\\pm$ 0.2) quiescent galaxies (QGs) at $\\langle z\\rangle \\sim1.5$, searching for cold dust continuum emission, an excellent tracer of dust and gas mass. Using both the recent GOODS-ALMA survey as well as the full suite of ALMA Band-6 ancillary data in the GOODS-S field, we report the tentative detection of dust continuum equivalent of dust mass log($M_{dust}$/$M_{\\odot}$) = 7.47 $\\pm$ 0.13 and gas mass log($M_{gas}$/$M_{\\odot}$) = 9.42 $\\pm$ 0.14. The emerging gas fraction is $f_{gas}$ = 5.3 $\\pm$ 1.8%, consistent with the results of previous stacking analyses based on lower resolution sub(mm) observations. Our results support the scenario where high-z QGs have an order of magnitude larger $f_{gas}$ compared to their local counterparts and have experienced quenching with a non negligible gas reservoir in their interstellar medium - i.e. with gas retention. Subsequent analysis yields an anti-correlation between the $f_{gas}$ and the stellar mass of QGs, especially in the high mass end where galaxies reside in the most massive haloes. The $f_{gas}$ - $M_{*}$ anti-correlation promotes the selection bias as a possible solution to the tension between the stacking results pointing towards gas retention in high-z QGs of moderate $M_{*}$ and the studies of individual targets that favour a fully depleted ISM in massive (log($M_{*}$/$M_{\\odot}$) high-z QGs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12110v1"
    ],
    "publication_venue": "Accepted to A&A on the 16/03/2023",
    "doi": "10.1051/0004-6361/202345977"
}