{
    "arxiv_id": "2303.11024",
    "paper_title": "Mass Metallicity Relationship of SDSS Star Forming Galaxies: Population Synthesis Analysis and Effects of Star Burst Length, Extinction Law, Initial Mass Function and Star Formation Rate",
    "authors": [
        "Eva Sextl",
        "Rolf-Peter Kudritzki",
        "H. Jabran Zahid",
        "I-Ting Ho"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-06-07"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We investigate the mass-metallicity relationship of star forming galaxies by analysing the absorption line spectra of $\\sim$200,000 galaxies in the Sloan Digital Sky Survey. The galaxy spectra are stacked in bins of stellar mass and a population synthesis technique is applied yielding metallicities, ages and star formation history of the young and old stellar population together with interstellar reddening and extinction. We adopt different lengths of the initial starbursts and different initial mass functions for the calculation of model spectra of the single stellar populations contributing to the total integrated spectrum. We also allow for deviations of the ratio of extinction to reddening RV from 3.1 and determine the value from the spectral fit. We find that burst length and RV have a significant influence on the determination of metallicities whereas the effect of the initial mass function is small. RV values are larger than 3.1. The metallicities of the young stellar population agree with extragalactic spectroscopic studies of individual massive supergiant stars and are significantly higher than those of the older stellar population. This confirms galaxy evolution models where metallicity depends on the ratio of gas to stellar mass and where this ratio decreases with time. Star formation history is found to depend on galaxy stellar mass. Massive galaxies are dominated by stars formed at early times.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11024v1"
    ],
    "publication_venue": "18 pages, 20 figures",
    "doi": "10.3847/1538-4357/acc579"
}