{
    "arxiv_id": "2303.11432",
    "paper_title": "Dynamics and Charge Fluctuations in Large-q Sachdev-Ye-Kitaev Lattices",
    "authors": [
        "Rishabh Jha",
        "Jan C. Louw"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2024-02-12"
    ],
    "latest_version": 6,
    "categories": [
        "cond-mat.str-el"
    ],
    "abstract": "It is known that the large-$q$ complex Sachdev-Ye-Kitaev (SYK) dot thermalizes instantaneously under rather general dynamical protocols. We consider a lattice of such dots coupled together, allowing for $r/2$ body hopping of particles between nearest neighbors. We develop a rather general analytical framework to study the dynamics to leading order in $1/q$ on such a lattice, allowing for arbitrary time dependent couplings, hence general dynamical protocols. We find that the physics of the diffusive case $r>2$ is effectively the same as the kinetic case $r=2$, assuming $r=\\mathcal{O}(q^0)$. Remarkably, we find that the local charge densities $\\mathcal{Q}_i$ form a closed set of equations. They however only show fluctuations of the order $\\mathcal{O}(\\mathcal{Q}_i/q)$, hence remaining constant in the limit $q\\rightarrow \\infty$. Despite this effective lack of charge dynamics, the dots do not in fact behave as isolated lattice sites which would thermalize instantaneously. Indeed, we show via a proof by contradiction that such instantaneously thermalize is not generally possible for a connected lattice. Importantly, the results are shown to be independent of the dimensionality of the lattice.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11432v1",
        "http://arxiv.org/pdf/2303.11432v2",
        "http://arxiv.org/pdf/2303.11432v3",
        "http://arxiv.org/pdf/2303.11432v4",
        "http://arxiv.org/pdf/2303.11432v5",
        "http://arxiv.org/pdf/2303.11432v6"
    ],
    "publication_venue": "Corrected a typo in eq. (8), 15 pages, 1 figure",
    "doi": "10.1103/PhysRevB.107.235114"
}