{
    "arxiv_id": "2303.12500",
    "paper_title": "The first stars: formation, properties, and impact",
    "authors": [
        "Ralf S. Klessen",
        "Simon C. O. Glover"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "The first generation of stars, often called Population III (or Pop III), form from metal-free primordial gas at redshifts 30 and below. They dominate the cosmic star formation history until redshifts 15 to 20, at which point the formation of metal-enriched Pop II stars takes over. We review current theoretical models for the formation, properties and impact of Pop III stars, and discuss existing and future observational constraints. Key takeaways from this review include the following: (1) Primordial gas is highly susceptible to fragmentation and Pop III stars form as members of small clusters with a logarithmically flat mass function. (2) Feedback from massive Pop III stars plays a central role in regulating subsequent star formation, but major uncertainties remain regarding its immediate impact. (3) In extreme conditions, supermassive Pop III stars can form, reaching masses of several 10^5 Msun. Their remnants may be the seeds of the supermassive black holes observed in high-redshift quasars. (4) Direct observations of Pop III stars in the early Universe remain extremely challenging. Indirect constraints from the global 21cm signal or gravitational waves are more promising. (5) Stellar archeological surveys allow us to constrain both the low-mass and the high-mass ends of the Pop III mass distribution. Observations suggest that most massive Pop III stars end their lives as core-collapse supernovae rather than as pair-instability supernovae.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12500v1"
    ],
    "publication_venue": "To appear in Annual Reviews of Astronomy and Astrophysics (75 pages, 14 figures, 500+ references)"
}