{
    "arxiv_id": "2303.11522",
    "paper_title": "Online Learning for Equilibrium Pricing in Markets under Incomplete Information",
    "authors": [
        "Devansh Jalota",
        "Haoyuan Sun",
        "Navid Azizan"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 2,
    "categories": [
        "cs.GT",
        "cs.LG"
    ],
    "abstract": "The study of market equilibria is central to economic theory, particularly in efficiently allocating scarce resources. However, the computation of equilibrium prices at which the supply of goods matches their demand typically relies on having access to complete information on private attributes of agents, e.g., suppliers' cost functions, which are often unavailable in practice. Motivated by this practical consideration, we consider the problem of setting equilibrium prices in the incomplete information setting wherein a market operator seeks to satisfy the customer demand for a commodity by purchasing the required amount from competing suppliers with privately known cost functions unknown to the market operator. In this incomplete information setting, we consider the online learning problem of learning equilibrium prices over time while jointly optimizing three performance metrics -- unmet demand, cost regret, and payment regret -- pertinent in the context of equilibrium pricing over a horizon of $T$ periods. We first consider the setting when suppliers' cost functions are fixed and develop algorithms that achieve a regret of $O(\\log \\log T)$ when the customer demand is constant over time, or $O(\\sqrt{T} \\log \\log T)$ when the demand is variable over time. Next, we consider the setting when the suppliers' cost functions can vary over time and illustrate that no online algorithm can achieve sublinear regret on all three metrics when the market operator has no information about how the cost functions change over time. Thus, we consider an augmented setting wherein the operator has access to hints/contexts that, without revealing the complete specification of the cost functions, reflect the variation in the cost functions over time and propose an algorithm with sublinear regret in this augmented setting.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11522v1",
        "http://arxiv.org/pdf/2303.11522v2"
    ],
    "publication_venue": null
}