{
    "arxiv_id": "2303.12982",
    "paper_title": "Fault Prognosis of Turbofan Engines: Eventual Failure Prediction and Remaining Useful Life Estimation",
    "authors": [
        "Joseph Cohen",
        "Xun Huan",
        "Jun Ni"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2024-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "eess.SP",
        "eess.SY"
    ],
    "abstract": "In the era of industrial big data, prognostics and health management is essential to improve the prediction of future failures to minimize inventory, maintenance, and human costs. Used for the 2021 PHM Data Challenge, the new Commercial Modular Aero-Propulsion System Simulation dataset from NASA is an open-source benchmark containing simulated turbofan engine units flown under realistic flight conditions. Deep learning approaches implemented previously for this application attempt to predict the remaining useful life of the engine units, but have not utilized labeled failure mode information, impeding practical usage and explainability. To address these limitations, a new prognostics approach is formulated with a customized loss function to simultaneously predict the current health state, the eventual failing component(s), and the remaining useful life. The proposed method incorporates principal component analysis to orthogonalize statistical time-domain features, which are inputs into supervised regressors such as random forests, extreme random forests, XGBoost, and artificial neural networks. The highest performing algorithm, ANN-Flux, achieves AUROC and AUPR scores exceeding 0.95 for each classification. In addition, ANN-Flux reduces the remaining useful life RMSE by 38% for the same test split of the dataset compared to past work, with significantly less computational cost.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12982v1"
    ],
    "publication_venue": "Preprint with 10 pages, 5 figures. Submitted to International Journal of Prognostics and Health Management (IJPHM)",
    "doi": "10.36001/ijphm.2023.v14i2.3486"
}