{
    "arxiv_id": "2303.10197",
    "paper_title": "Spreading entanglement through pairwise exchange interactions",
    "authors": [
        "L. Theerthagiri",
        "R. Ganesh"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "The spread of entanglement is a problem of great interest. It is particularly relevant to quantum state synthesis, where an initial direct-product state is sought to be converted into a highly entangled target state. In devices based on pairwise exchange interactions, such a process can be carried out and optimized in various ways. As a benchmark problem, we consider the task of spreading one excitation among N two-level atoms or qubits. Starting from an initial state where one qubit is excited, we seek a target state where all qubits have the same excitation-amplitude -- a generalized-W state. This target is to be reached by suitably chosen pairwise exchange interactions. For example, we may have a setup where any pair of qubits can be brought into proximity for a controllable period of time. We describe three protocols that accomplish this task, each with N-1 tightly-constrained steps. In the first, one atom acts as a flying qubit that sequentially interacts with all others. In the second, qubits interact pairwise in sequential order. In these two cases, the required interaction times follow a pattern with an elegant geometric interpretation. They correspond to angles within the spiral of Theodorus -- a construction known for more than two millennia. The third protocol follows a divide-and-conquer approach -- dividing equally between two qubits at each step. For large N, the flying-qubit protocol yields a total interaction time that scales as \\sqrt{N}, while the sequential approach scales linearly with N. For the divide-and-conquer approach, the time has a lower bound that scales as \\ln N. With any such protocol, we show that the phase differences in the final state cannot be independently controlled. For instance, a W-state (where all phases are equal) cannot be generated by pairwise exchange.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10197v1"
    ],
    "publication_venue": "6 pages, 3 figures"
}