{
    "arxiv_id": "2303.13718",
    "paper_title": "Reflection and timing study of the transient black hole X-ray binary MAXI J1803-298 with NuSTAR",
    "authors": [
        "Benjamin M. Coughenour",
        "John A. Tomsick",
        "Guglielmo Mastroserio",
        "James M. Steiner",
        "Riley M. T. Connors",
        "Jiachen Jiang",
        "Jeremy Hare",
        "Aarran W. Shaw",
        "Renee M. Ludlam",
        "A. C. Fabian",
        "Javier García",
        "Joel B. Coley"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-06-14"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The transient black hole X-ray binary MAXI J1803-298 was discovered on 2021 May 1, as it went into outburst from a quiescent state. As the source rose in flux it showed periodic absorption dips and fit the timing and spectral characteristics of a hard state accreting black hole. We report on the results of a Target-of-Opportunity observation with NuSTAR obtained near the peak outburst flux beginning on 2021 May 13, after the source had transitioned into an intermediate state. MAXI J1803-298 is variable across the observation, which we investigate by extracting spectral and timing products separately for different levels of flux throughout the observation. Our timing analysis reveals two distinct potential QPOs which are not harmonically related at 5.4+/-0.2 Hz and 9.4+/-0.3 Hz, present only during periods of lower flux. With clear relativistic reflection signatures detected in the source spectrum, we applied several different reflection models to the spectra of MAXI J1803-298. Here we report our results, utilizing high density reflection models to constrain the disk geometry, and assess changes in the spectrum dependent on the source flux. With a standard broken power-law emissivity, we find a near-maximal spin for the black hole, and we are able to constrain the inclination of the accretion disk at 75+/-2 degrees, which is expected for a source that has shown periodic absorption dips. We also significantly detect a narrow absorption feature at 6.91+/-0.06 keV with an equivalent width between 4 and 9 eV, which we interpret as the signature of a disk wind.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13718v1"
    ],
    "publication_venue": "14 pages, 8 figures, accepted for publication (ApJ)",
    "doi": "10.3847/1538-4357/acc65c"
}