{
    "arxiv_id": "2303.15492",
    "paper_title": "Linking Unserved Energy to Weather Regimes",
    "authors": [
        "Rogier H. Wuijts",
        "Laurens P. Stoop",
        "Jing Hu",
        "Arno Haverkamp",
        "Frank Wiersma",
        "William Zappa",
        "Gerard van der Schrier",
        "Marjan van den Akker",
        "Machteld van den Broek"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "physics.soc-ph",
        "physics.ao-ph",
        "physics.app-ph"
    ],
    "abstract": "The integration of renewable energy sources into power systems is expected to increase significantly in the coming decades. This can result in critical situations related to the strong variability in space and time of weather patterns. During these critical situations the power system experiences a structural shortage of energy across multiple time steps and regions, leading to Energy Not Served (ENS) events. Our research explores the relationship between six weather regimes that describe the large scale atmospheric flow and ENS events in Europe by simulating future power systems. Our results indicate that most regions have a specific weather regime that leads to the highest number of ENS events. However, ENS events can still occur during any weather regime, but with a lower probability.\n  In particular, our findings show that ENS events in western and central European countries often coincide with either the positive Scandinavian Blocking (SB+), characterised by cold air penetrating Europe under calm weather conditions from north-eastern regions, or North Atlantic Oscillation (NAO+) weather regime, characterised by westerly flow and cold air in the southern half of Europe. Additionally, we found that the relative impact of one of these regimes reaches a peak 10 days before ENS events in these countries. In Scandinavian and Baltic countries, on the other hand, our results indicate that the relative prevalence of the negative Atlantic Ridge (AR-) weather regime is higher during and leading up to the ENS event.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15492v1"
    ],
    "publication_venue": "Rogier H. Wuijts and Laurens P. Stoop contributed equally to this work"
}