{
    "arxiv_id": "2303.11672",
    "paper_title": "What governs the spin distribution of very young < 1 Myr low mass stars",
    "authors": [
        "L. Gehrig",
        "E. I. Vorobyov"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "We compute the evolution and rotational periods of young stars, using the MESA code, starting from a stellar seed, and take protostellar accretion, stellar winds, and the magnetic star-disk interaction into account. Furthermore, we add a certain fraction of the energy of accreted material into the stellar interior as additional heat and combine the resulting effects on stellar evolution with the stellar spin model. For different combinations of parameters, stellar periods at an age of 1~Myr range between 0.6~days and 12.9~days. Thus, during the relatively short time period of 1~Myr, a significant amount of stellar angular momentum can already be removed by the interaction between the star and its accretion disk. The amount of additional heat added into the stellar interior, the accretion history, and the presence of disk and stellar winds have the strongest impact on the stellar spin evolution during the first million years. The slowest stellar rotations result from a combination of strong magnetic fields, a large amount of additional heat, and effective winds. The fastest rotators combine weak magnetic fields and ineffective winds or result from a small amount of additional heat added to the star. Scenarios that could lead to such configurations are discussed. Different initial rotation periods of the stellar seed, on the other hand, quickly converges and do not affect the stellar period at all. Our model matches up to 90\\% of the observed rotation periods in six young ($\\lesssim 3$~Myr) clusters. Based on these intriguing results, we motivate to combine our model with a hydrodynamic disk evolution code to self-consistently include several important aspects such as episodic accretion events, magnetic disk winds, internal, and external photo-evaporation. (Shortened)",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11672v1"
    ],
    "publication_venue": "17 pages, 15 figures, accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202345916"
}