{
    "arxiv_id": "2303.08321",
    "paper_title": "Magnetization Dynamics and Peierls Instability in Topological Josephson Structures",
    "authors": [
        "Adrian Reich",
        "Erez Berg",
        "Jörg Schmalian",
        "Alexander Shnirman"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-06-13"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "We study a long topological Josephson junction with a ferromagnetic strip between two superconductors. The low-energy theory exhibits a non-local in time and space interaction between chiral Majorana fermions, mediated by the magnonic excitations in the ferromagnet. While short ranged interactions turn out to be irrelevant by power counting, we show that sufficiently strong and long-ranged interactions may induce a $\\mathbb{Z}_2$-symmetry breaking. This spontaneous breaking leads to a tilting of the magnetization perpendicular to the Majorana propagation direction and the opening of a fermionic gap (Majorana mass). It is analogous to the Peierls instability in the commensurate Fröhlich model and reflects the nontrivial interplay between Majorana modes and magnetization dynamics. Within a Gaussian fluctuation analysis, we estimate critical values for the temporal and spatial non-locality of the interaction, beyond which the symmetry breaking is stable at zero temperature -- despite the effective one-dimensionality of the model. We conclude that non-locality, i.e., the stiffness of the magnetization in space and time, stabilizes the symmetry breaking. In the stabilized regime, we expect the current-phase relation to exhibit an experimentally accessible discontinuous jump. At nonzero temperatures, as usual in the 1D Ising model, the long-range order is destroyed by solitonic excitations, which in our case carry each a Majorana zero mode. In order to estimate the correlation length, we investigate the solitons within a self-consistent mean-field approach.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08321v1"
    ],
    "publication_venue": "10 pages, 6 figures",
    "doi": "10.1103/PhysRevB.107.245411"
}