{
    "arxiv_id": "2303.09874",
    "paper_title": "Disentangling the Link Between Image Statistics and Human Perception",
    "authors": [
        "Alexander Hepburn",
        "Valero Laparra",
        "Raúl Santos-Rodriguez",
        "Jesús Malo"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-10-06"
    ],
    "latest_version": 3,
    "categories": [
        "cs.CV",
        "cs.LG",
        "q-bio.NC"
    ],
    "abstract": "In the 1950s, Barlow and Attneave hypothesised a link between biological vision and information maximisation. Following Shannon, information was defined using the probability of natural images. A number of physiological and psychophysical phenomena have been derived ever since from principles like info-max, efficient coding, or optimal denoising. However, it remains unclear how this link is expressed in mathematical terms from image probability. First, classical derivations were subjected to strong assumptions on the probability models and on the behaviour of the sensors. Moreover, the direct evaluation of the hypothesis was limited by the inability of the classical image models to deliver accurate estimates of the probability. In this work we directly evaluate image probabilities using an advanced generative model for natural images, and we analyse how probability-related factors can be combined to predict human perception via sensitivity of state-of-the-art subjective image quality metrics. We use information theory and regression analysis to find a combination of just two probability-related factors that achieves 0.8 correlation with subjective metrics. This probability-based sensitivity is psychophysically validated by reproducing the basic trends of the Contrast Sensitivity Function, its suprathreshold variation, and trends of the Weber-law and masking.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09874v1",
        "http://arxiv.org/pdf/2303.09874v2",
        "http://arxiv.org/pdf/2303.09874v3"
    ],
    "publication_venue": null
}