{
    "arxiv_id": "2303.10120",
    "paper_title": "Design and validation of a state-dependent Riccati equation filter for state of charge estimation in a latent thermal storage device",
    "authors": [
        "Michael Shanks",
        "Uduak Inyang-Udoh",
        "Neera Jain"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY"
    ],
    "abstract": "Latent thermal energy storage (TES) devices could enable advances in many thermal management applications, including peak load shifting for reducing energy demand and cost of HVAC or providing supplemental heat rejection in transient thermal management systems. However, real-time feedback control of such devices is currently limited by the absence of suitable state of charge estimation techniques, given the nonlinearities associated with phase change dynamics. In this paper we design and experimentally validate a state-dependent Riccati equation (SDRE) filter for state of charge estimation in a phase change material (PCM)-based TES device integrated into a single-phase thermal-fluid loop. The advantage of the SDRE filter is that it does not require linearization of the nonlinear finite-volume model; instead, it uses a linear parameter-varying system model which can be quickly derived using graph-based methods. We leverage graph-based methods to prove that the system model is uniformly detectable, guaranteeing that the state estimates are bounded. Using measurements from five thermocouples embedded in the PCM of the TES and two thermocouples measuring the fluid temperature at the inlet and outlet of the device, the state estimator uses a reduced-order finite-volume model to determine the temperature distribution inside the PCM and in turn, the state of charge of the device. We demonstrate the state estimator in simulation and on experimental data collected from a thermal management system testbed to show that the state estimation error converges near zero and remains bounded.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10120v1"
    ],
    "publication_venue": "Manuscript submitted to the ASME Journal on Dynamic Systems, Measurement and Control (JDSMC)"
}