{
    "arxiv_id": "2303.14374",
    "paper_title": "Ag/Au coated inverted nanopyramids as flexible and wearable SERS substrates for biomolecular sensing",
    "authors": [
        "Anindita Das",
        "Udit Pant",
        "Cuong Cao",
        "Rakesh S. Moirangthem",
        "Hitesh Bhanudas Kamble"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph"
    ],
    "abstract": "Surface enhanced Raman spectroscopy (SERS) has established itself as a promising tool in optical sensing technology. Efforts have been made to improve practicalities of the technology with regards to costs of production, stability, reproducibility, flexibility and robustness. Here, we demonstrate a method to fabricate Ag/Au bimetallic inverted nanopyramid (i-NPyr) and upright nanopyramid (u-NPyr) using a multi-step molding process on flexible plastics as SERS sensors for the ultrasensitive detection of haemoglobin at a very low concentration (down to nM). First, a Si i-NPyr master was created using electron beam lithography, then i-NPyr and u-NPyr structures were imprinted on flexible polymer substrates using nanoimprinting lithography, and last, Ag/Au coatings were coated on top of them. The SERS activity of the imprinted i-NPyr and u-NPyr substrates were evaluated using rhodamine 6G (Rh6G) as probe molecules. Enhancement factor (EF) values of 3.88 x 10^6 and 7.86 x 10^5 respectively for the iNPyr and u-NPyr substrates, and the i-NPyr SERS substrate was able to detect Rh6G at concentrations as low as 1pM. In addition, we investigated the stability and resilience of i-NPyr by thoroughly analysing signal performance under angled bending and delicate crumpling. Finally, a proof-of-concept application as a wearable i-NPyr SERS sensor was demonstrated by detecting the analyte in sweat excreted during running and walking. We believe that this extremely sensitive i-NPyr SERS substrate with dense electric field confinement around hotspots (confirmed using computational simulations), as well as its good stability, durability, and low production cost, may enable in-situ measurement of analytes in wearable technologies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14374v1"
    ],
    "publication_venue": null
}