{
    "arxiv_id": "2303.12874",
    "paper_title": "Accurate simulation of direct laser acceleration in a laser wakefield accelerator",
    "authors": [
        "Kyle G. Miller",
        "John P. Palastro",
        "Jessica L. Shaw",
        "Fei Li",
        "Frank S. Tsung",
        "Viktor K. Decyk",
        "Warren B. Mori"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-07-19"
    ],
    "latest_version": 1,
    "categories": [
        "physics.plasm-ph",
        "physics.comp-ph"
    ],
    "abstract": "In a laser wakefield accelerator (LWFA), an intense laser pulse excites a plasma wave that traps and accelerates electrons to relativistic energies. When the pulse overlaps the accelerated electrons, it can enhance the energy gain through direct laser acceleration (DLA) by resonantly driving the betatron oscillations of the electrons in the plasma wave. The particle-in-cell (PIC) algorithm, although often the tool of choice to study DLA, contains inherent errors due to numerical dispersion and the time staggering of the electric and magnetic fields. Further, conventional PIC implementations cannot reliably disentangle the fields of the plasma wave and laser pulse, which obscures interpretation of the dominant acceleration mechanism. Here, a customized field solver that reduces errors from both numerical dispersion and time staggering is used in conjunction with a field decomposition into azimuthal modes to perform PIC simulations of DLA in an LWFA. Comparisons with traditional PIC methods, model equations, and experimental data show improved accuracy with the customized solver and convergence with an order-of-magnitude fewer cells. The azimuthal-mode decomposition reveals that the most energetic electrons receive comparable energy from DLA and LWFA.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12874v1"
    ],
    "publication_venue": "10 pages, 5 figures, to submit to Physics of Plasmas",
    "doi": "10.1063/5.0152383"
}