{
    "arxiv_id": "2303.12836",
    "paper_title": "Photogalvanic response in multi-Weyl semimetals",
    "authors": [
        "Arpit Raj",
        "Swati Chaudhary",
        "Gregory A. Fiete"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "We investigate the dependence of the photogalvanic response of a multi-Weyl semimetal on its topological charge, tilt, and chemical potential. We derive analytical expressions for the shift and injection conductivities for tilted charge-$n$ Weyl points $(n=1,2,3)$ using a low energy two-band effective Hamiltonian. For double-Weyl semimetals, we also compute the response from two-band and four-band tight-binding models with broken time-reversal symmetry to study the effect of band bending and the contributions from higher bands. We find a significant deviation in the responses obtained from the effective low-energy continuum model and more realistic four-band continuum and tight-binding models. We analyze several different limits of these models. We describe the nature of the deviations and provide estimates of their dependence on the frequency and other model parameters. Our analysis provides a simple explanation for the first-principle calculation based frequency dependence of the injection current in SrSi$_2$. Additionally, we find interesting parameter regimes where the frequency dependence of the non-linear optical response can be directly used to probe the type-I/type-II nature of the Weyl cone. We obtain analytical results for the charge-4 Weyl semimetal by reducing the original problem involving a triple $k$-space integral to one with only a double integral. This simplification allows us to extract all relevant information about the nature of its second-order dc response and the precise condition for observing circular photogalvanic effect quantization. The semi-analytical approach presented here can also be extended to a systematic study of second harmonic generation and first-order optical conductivity in charge-4 Weyl semimetals.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12836v1"
    ],
    "publication_venue": "16 pages, 7 figures"
}