{
    "arxiv_id": "2303.12201",
    "paper_title": "Semianalytically Designed Dual Polarized Printed-Circuit-Board (PCB) Metagratings",
    "authors": [
        "Yuval Shklarsh",
        "Ariel Epstein"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2024-08-09"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "physics.optics"
    ],
    "abstract": "Metagratings (MGs), sparse (periodic) composites of subwavelength polarizable particles (meta-atoms), have demonstrated highly efficient diffraction engineering capabilities via meticulous tailoring of the interaction between individual scatterers. To date, MGs at microwave frequencies have mostly been devised for either transverse electric (TE) or transverse magnetic (TM) polarized scenarios, which limits their use in many practical applications. Herein, we bridge this gap and present a comprehensive semianalytical design method for dual-polarized MGs with a separable response for TE and TM waves. First, by relating a printed circuit board (PCB) compatible array of dog-bone elements with the canonical dipole line analytical model, we establish a meta-atom for TM-polarized MGs, featuring negligible interaction with TE waves. Subsequently, we integrate the proposed configuration with a systematic synthesis scheme to implement a TM beam splitter MG, harnessing the equivalent dipole line model to resolve analytically the optimal meta-atom coordinates and dog-bone polarizability, without resorting to full-wave optimization. Finally, we show that a dual-polarized MG beam splitter can be conveniently synthesized correspondingly, combining the TM-polarized structure as is with previously reported TE-polarized MG designs. This work paves a clear path towards integration of sparse, semianlaytically synthesized, efficient MGs in practical dual-polarized communication and imaging applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12201v1"
    ],
    "publication_venue": "9 pages, 9 figures",
    "doi": "10.1109/TAP.2023.3340013"
}