{
    "arxiv_id": "2303.11847",
    "paper_title": "New evidence for the precession of tilted disk in SDSS J081256.85+191157.8",
    "authors": [
        "Qi-Bin Sun",
        "Sheng-Bang Qian",
        "Li-Ying Zhu",
        "Wen-Ping Liao",
        "Er-Gang Zhao",
        "Fu-Xing Li",
        "Xiang-Dong Shi",
        "Min-Yu Li"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Super-orbital signals and negative superhumps are thought to be related to the reverse precession of the nodal line in a tilted disk, but the evidence is lacking. Our results provide new evidence for the precession of the tilted disk. Based on the TESS and K2 photometry, we investigate the super-orbital signals, negative superhumps, positive superhumps, and eclipse characteristics of the long-period eclipsing cataclysmic variable star SDSS J0812. We find super-orbital signals, negative superhumps, and positive superhumps with periods of 3.0451(5) d, 0.152047(2) d, and 0.174686(7) d, respectively, in the K2 photometry, but all disappear in the TESS photometry, where the positive superhumps are present only in the first half of the same campaign, confirming that none of them is permanently present in SDSS J0812. In addition, we find for the first time a cyclic variation of the O-C of minima, eclipse depth, and negative superhumps amplitudes for 3.045(8) d, 3.040(6) d, and 3.053(8) d in SDSS J0812, respectively, and all reach the maximum at ~ 0.75 precession phases of the tilted disk, which provides new evidence for the precession of the tilted disk. We suggest that the O-C and eclipse depth variations may come from a shift of the brightness center of the precession tilted disk. Our first finding on the periodic variation of negative superhumps amplitude with the super-orbital signals is significant evidence that the origin of negative superhumps is related to the precession of the tilted disk.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11847v1"
    ],
    "publication_venue": "21 pages, 16 figures"
}