{
    "arxiv_id": "2303.12656",
    "paper_title": "Scattering and conversion of electromagnetic and gravitational waves by Reissner-Nordström black holes: the Regge pole description",
    "authors": [
        "Mohamed Ould El Hadj"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
    ],
    "abstract": "We investigate the problem of scattering and conversion of monochromatic planar gravitational and electromagnetic waves impinging upon a Reissner-Nordström black hole using a Regge pole description, i.e., a complex angular momentum approach. For this purpose, we first compute numerically the Regge pole spectrum for various charge-to-mass ratio configurations. We then derive an asymptotic expressions for the lowest Regge poles, and by considering Bohr-Sommerfeld-type quantization conditions, obtain the spectrum of weakly damped quasinormal frequencies from the Regge trajectories. Next, we construct the scattering and conversion amplitudes as well as the total differential cross sections for different processes using both a complex angular momentum representation and a partial wave expansion method. Finally, we provide an analytical approximation of the scattering and conversion cross sections of different processes from asymptotic expressions for the lowest Regge poles and the associated residues based on the correspondence Regge poles, \"surface waves\" propagating close to the photon (graviton) sphere. This allows us to extract the physical interpretation encoded in the partial wave expansions in the high-frequency regime (i.e., in the short-wavelength regime), and to describe semiclassically with very good agreement both black hole glory and a large part of the orbiting oscillations, thus unifying these two phenomena from a purely wave point of view.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12656v1"
    ],
    "publication_venue": null
}