{
    "arxiv_id": "2303.15761",
    "paper_title": "Learning Second-Order Attentive Context for Efficient Correspondence Pruning",
    "authors": [
        "Xinyi Ye",
        "Weiyue Zhao",
        "Hao Lu",
        "Zhiguo Cao"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-06-30"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Correspondence pruning aims to search consistent correspondences (inliers) from a set of putative correspondences. It is challenging because of the disorganized spatial distribution of numerous outliers, especially when putative correspondences are largely dominated by outliers. It's more challenging to ensure effectiveness while maintaining efficiency. In this paper, we propose an effective and efficient method for correspondence pruning. Inspired by the success of attentive context in correspondence problems, we first extend the attentive context to the first-order attentive context and then introduce the idea of attention in attention (ANA) to model second-order attentive context for correspondence pruning. Compared with first-order attention that focuses on feature-consistent context, second-order attention dedicates to attention weights itself and provides an additional source to encode consistent context from the attention map. For efficiency, we derive two approximate formulations for the naive implementation of second-order attention to optimize the cubic complexity to linear complexity, such that second-order attention can be used with negligible computational overheads. We further implement our formulations in a second-order context layer and then incorporate the layer in an ANA block. Extensive experiments demonstrate that our method is effective and efficient in pruning outliers, especially in high-outlier-ratio cases. Compared with the state-of-the-art correspondence pruning approach LMCNet, our method runs 14 times faster while maintaining a competitive accuracy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15761v1"
    ],
    "publication_venue": "9 pages, 8 figures; Accepted to AAAI 2023 (Oral)",
    "doi": "10.1609/aaai.v37i3.25431"
}