{
    "arxiv_id": "2303.14050",
    "paper_title": "Unveiling the mechanism for the rapid acceleration phase in a solar eruption",
    "authors": [
        "Ze Zhong",
        "Yang Guo",
        "Thomas Wiegelmann",
        "Mingde Ding",
        "Yao Chen"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-04-19"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "physics.plasm-ph",
        "physics.space-ph"
    ],
    "abstract": "Two major mechanisms have been proposed to drive the solar eruptions: the ideal magnetohydrodynamic instability and the resistive magnetic reconnection. Due to the close coupling and synchronicity of the two mechanisms, it is difficult to identify their respective contribution to solar eruptions, especially to the critical rapid acceleration phase. Here, to shed light on this problem, we conduct a data-driven numerical simulation for the flux rope eruption on 2011 August 4, and quantify the contributions of the upward exhaust of the magnetic reconnection along the flaring current sheet and the work done by the large-scale Lorentz force acting on the flux rope. Major simulation results of the eruption, such as the macroscopic morphology, early kinematics of the flux rope and flare ribbons, match well with the observations. We estimate the energy converted from the magnetic slingshot above the current sheet and the large-scale Lorentz force exerting on the flux rope during the rapid acceleration phase, and find that (1) the work done by the large-scale Lorentz force is about 4.6 times higher than the former, and (2) decreased strapping force generated by the overlying field facilitates the eruption. These results indicate that the large-scale Lorentz force plays a dominant role in the rapid acceleration phase for this eruption.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14050v1"
    ],
    "publication_venue": "12 pages, 5 figures; Accepted for publication in ApJL",
    "doi": "10.3847/2041-8213/acc6ce"
}