{
    "arxiv_id": "2303.12929",
    "paper_title": "Coronal X-Ray Emission from Nearby, Low-Mass, Exoplanet Host Stars Observed by the MUSCLES and Mega-MUSCLES HST Treasury Survey Projects",
    "authors": [
        "Alexander Brown",
        "P. Christian Schneider",
        "Kevin France",
        "Cynthia S. Froning",
        "Allison A. Youngblood",
        "David J. Wilson",
        "R. O. Parke Loyd",
        "J. Sebastian Pineda",
        "Girish M. Duvvuri",
        "Adam F. Kowalski",
        "Zachory K. Berta-Thompson"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
    ],
    "abstract": "The high energy X-ray and ultraviolet (UV) radiation fields of exoplanet host stars play a crucial role in controlling the atmospheric conditions and the potential habitability of exoplanets. Major surveys of the X-ray/UV emissions from late-type (K and M spectral type) exoplanet hosts have been conducted by the MUSCLES and Mega-MUSCLES Hubble Space Telescope (HST) Treasury programs. These samples primarily consist of relatively old, ``inactive'', low mass stars. In this paper we present results from X-ray observations of the coronal emission from these stars obtained using the Chandra X-ray Observatory, the XMM-Newton Observatory, and the Neil Gehrels Swift Observatory. The stars effectively sample the coronal activity of low-mass stars at a wide range of masses and ages. The vast majority (21 of 23) of the stars are detected and their X-ray luminosities measured. Short-term flaring variability is detected for most of the fully-convective (M $\\leq$ 0.35 M$_{\\odot}$) stars but not for the more massive M dwarfs during these observations. Despite this difference, the mean X-ray luminosities for these two sets of M dwarfs are similar with more massive (0.35 M$_{\\odot}$ $\\leq$ M $\\leq$ 0.6 M$_{\\odot}$) M dwarfs at $\\sim$5 $\\times$ 10$^{26}$ erg s$^{-1}$ compared to $\\sim$2 $\\times$ 10$^{26}$ erg s$^{-1}$ for fully-convective stars older than 1 Gyr. Younger, fully-convective M dwarfs have X-ray luminosities between 3 and 6 $\\times$ 10$^{27}$ erg s$^{-1}$.The coronal X-ray spectra have been characterized and provide important information that is vital for the modeling of the stellar EUV spectra.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12929v1"
    ],
    "publication_venue": "39 pages, 15 figures. Accepted for publication in The Astronomical Journal",
    "doi": "10.3847/1538-3881/acc38a"
}