{
    "arxiv_id": "2303.14586",
    "paper_title": "A Large Double-ring Disk around the Taurus M Dwarf J04124068+2438157",
    "authors": [
        "Feng Long",
        "Bin B. Ren",
        "Nicole L. Wallack",
        "Daniel Harsono",
        "Gregory J. Herczeg",
        "Paola Pinilla",
        "Dimitri Mawet",
        "Michael C. Liu",
        "Sean M. Andrews",
        "Xue-Ning Bai",
        "Sylvie Cabrit",
        "Lucas A. Cieza",
        "Doug Johnstone",
        "Jarron M. Leisenring",
        "Giuseppe Lodato",
        "Yao Liu",
        "Carlo F. Manara",
        "Gijs D. Mulders",
        "Enrico Ragusa",
        "Steph Sallum",
        "Yangfan Shi",
        "Marco Tazzari",
        "Taichi Uyama",
        "Kevin Wagner",
        "David J. Wilner",
        "Jerry W. Xuan"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-05-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Planet formation imprints signatures on the physical structures of disks. In this paper, we present high-resolution ($\\sim$50 mas, 8 au) Atacama Large Millimeter/submillimeter Array (ALMA) observations of 1.3 mm dust continuum and CO line emission toward the disk around the M3.5 star 2MASS J04124068+2438157. The dust disk consists only of two narrow rings at radial distances of 0.47 and 0.78 arcsec ($\\sim$70 and 116 au), with Gaussian $σ$ widths of 5.6 and 8.5 au, respectively. The width of the outer ring is smaller than the estimated pressure scale height by $\\sim25\\%$, suggesting dust trapping in a radial pressure bump. The dust disk size, set by the location of the outermost ring, is significantly larger (by $3σ$) than other disks with similar millimeter luminosity, which can be explained by an early formation of local pressure bump to stop radial drift of millimeter dust grains. After considering the disk's physical structure and accretion properties, we prefer planet--disk interaction over dead zone or photoevaporation models to explain the observed dust disk morphology. We carry out high-contrast imaging at $L'$ band using Keck/NIRC2 to search for potential young planets, but do not identify any source above $5σ$. Within the dust gap between the two rings, we reach a contrast level of $\\sim$7 mag, constraining the possible planet below $\\sim$2--4 $M_{\\rm Jup}$. Analyses of the gap/ring properties suggest a $\\sim$Saturn mass planet at $\\sim$90 au is likely responsible for the formation of the outer ring, which can be potentially revealed with JWST.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14586v1"
    ],
    "publication_venue": "15 pages, 5 figures. Accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc843"
}