{
    "arxiv_id": "2303.15259",
    "paper_title": "Temporal Alignment of Human Motion Data: A Geometric Point of View",
    "authors": [
        "Alice Barbara Tumpach",
        "Peter Kán"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "math.DG"
    ],
    "abstract": "Temporal alignment is an inherent task in most applications dealing with videos: action recognition, motion transfer, virtual trainers, rehabilitation, etc. In this paper we dive into the understanding of this task from a geometric point of view: in particular, we show that the basic properties that are expected from a temporal alignment procedure imply that the set of aligned motions to a template form a slice to a principal fiber bundle for the group of temporal reparameterizations. A temporal alignment procedure provides a reparameterization invariant projection onto this particular slice. This geometric presentation allows to elaborate a consistency check for testing the accuracy of any temporal alignment procedure. We give examples of alignment procedures from the literature applied to motions of tennis players. Most of them use dynamic programming to compute the best correspondence between two motions relative to a given cost function. This step is computationally expensive (of complexity $O(NM)$ where $N$ and $M$ are the numbers of frames). Moreover most methods use features that are invariant by translations and rotations in $\\mathbb{R}^3$, whereas most actions are only invariant by translation along and rotation around the vertical axis, where the vertical axis is aligned with the gravitational field. The discarded information contained in the vertical direction is crucial for accurate synchronization of motions. We propose to incorporate keyframe correspondences into the dynamic programming algorithm based on coarse information extracted from the vertical variations, in our case from the elevation of the arm holding the racket. The temporal alignment procedures produced are not only more accurate, but also computationally more efficient.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15259v1"
    ],
    "publication_venue": null
}