{
    "arxiv_id": "2303.09519",
    "paper_title": "PyVBMC: Efficient Bayesian inference in Python",
    "authors": [
        "Bobby Huggins",
        "Chengkun Li",
        "Marlon Tobaben",
        "Mikko J. Aarnos",
        "Luigi Acerbi"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-06-23"
    ],
    "latest_version": 1,
    "categories": [
        "stat.ML",
        "cs.LG",
        "stat.CO",
        "stat.ME"
    ],
    "abstract": "PyVBMC is a Python implementation of the Variational Bayesian Monte Carlo (VBMC) algorithm for posterior and model inference for black-box computational models (Acerbi, 2018, 2020). VBMC is an approximate inference method designed for efficient parameter estimation and model assessment when model evaluations are mildly-to-very expensive (e.g., a second or more) and/or noisy. Specifically, VBMC computes:\n  - a flexible (non-Gaussian) approximate posterior distribution of the model parameters, from which statistics and posterior samples can be easily extracted;\n  - an approximation of the model evidence or marginal likelihood, a metric used for Bayesian model selection.\n  PyVBMC can be applied to any computational or statistical model with up to roughly 10-15 continuous parameters, with the only requirement that the user can provide a Python function that computes the target log likelihood of the model, or an approximation thereof (e.g., an estimate of the likelihood obtained via simulation or Monte Carlo methods). PyVBMC is particularly effective when the model takes more than about a second per evaluation, with dramatic speed-ups of 1-2 orders of magnitude when compared to traditional approximate inference methods.\n  Extensive benchmarks on both artificial test problems and a large number of real models from the computational sciences, particularly computational and cognitive neuroscience, show that VBMC generally - and often vastly - outperforms alternative methods for sample-efficient Bayesian inference, and is applicable to both exact and simulator-based models (Acerbi, 2018, 2019, 2020). PyVBMC brings this state-of-the-art inference algorithm to Python, along with an easy-to-use Pythonic interface for running the algorithm and manipulating and visualizing its results.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09519v1"
    ],
    "publication_venue": "6 pages, 1 figure. Submitted to The Journal of Open Source Software. Documentation is available at https://acerbilab.github.io/pyvbmc and source code is available at https://github.com/acerbilab/pyvbmc",
    "doi": "10.21105/joss.05428"
}