{
    "arxiv_id": "2303.11521",
    "paper_title": "Non-perturbative particle production and differential geometry",
    "authors": [
        "Tomohiro Matsuda"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-09-22"
    ],
    "latest_version": 4,
    "categories": [
        "hep-th",
        "gr-qc",
        "hep-ph"
    ],
    "abstract": "We studied the Stokes phenomena of the Schwinger and the Unruh effects in detail. We found a possibility that conventional calculations may not explain the experimental results. This paper proposes a basic method for understanding stationary particle production on manifolds by means of the Stokes phenomenon. To address the problem of the vacuum definition and stationary particle production, we show how to understand the ``vacuum'' of the Schwinger effect. The Stokes phenomenon in the Unruh effect is then discussed and the differences to the Schwinger effect are explained. Normally, when calculating the Bogoliubov transformation of the Unruh effect, it is derived from the consistency of the whole space. However, if the constant acceleration is a temporal approximation, this extrapolation may incorrectly imply distant correlations that do not originally exist. To answer this question, one has to derive an explicit local Unruh effect. We have identified the Stokes phenomenon of the Unruh effect and calculated the Bogoliubov transformation in local. Our result (the Unruh temperature) differs from conventional calculations by a factor of 2, which seems to be suggesting the absence of the distant correlation. This will be tested by experimentation because this factor appears in the Unruh temperature. Then, we show that the Schwinger and the Unruh effects should occur simultaneously under a strong electric field, which can be verified experimentally as an enhancement of the Schwinger effect. Identifying the Stokes phenomena of particle production and discriminating between similar phenomena will allow us to clearly understand the origin of the phenomena. We hope that such analytical methods will help to unravel many mysteries of physics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11521v1",
        "http://arxiv.org/pdf/2303.11521v2",
        "http://arxiv.org/pdf/2303.11521v3",
        "http://arxiv.org/pdf/2303.11521v4"
    ],
    "publication_venue": "15pages, 2 figure, improved discussions"
}