{
    "arxiv_id": "2303.08836",
    "paper_title": "Tracking the Enigmatic Globular Cluster Ultracompact X-ray Binary X1850--087: Extreme Radio Variability in the Hard State",
    "authors": [
        "T. Panurach",
        "R. Urquhart",
        "J. Strader",
        "L. Chomiuk",
        "A. Bahramian",
        "C. O. Heinke",
        "T. J. Maccarone",
        "J. C. A. Miller-Jones",
        "G. R. Sivakoff"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The conditions under which accreting neutron stars launch radio-emitting jets and/or outflows are still poorly understood. The ultracompact X-ray binary X1850--087, located in the globular cluster NGC 6712, is a persistent atoll-type X-ray source that has previously shown unusual radio continuum variability. Here we present the results of a pilot radio monitoring program of X1850--087 undertaken with the Karl G. Jansky Very Large Array, with simultaneous or quasi-simultaneous Swift/XRT data obtained at each epoch. The binary is clearly detected in the radio in two of the six new epochs. When combined with previous data, these results suggest that X1850--087 shows radio emission at a slightly elevated hard state X-ray luminosity of L_X > 2x10^36 erg/s, but no radio emission in its baseline hard state L_X ~10^36 erg/s. No clear X-ray spectral changes are associated with this factor of > 10 radio variability. At all detected epochs X1850--087 has a flat-to-inverted radio spectral index, more consistent with the partially absorbed optically thick synchrotron of a compact jet rather than the evolving optically thick to thin emission associated with transient expanding synchrotron-emitting ejecta. If the radio emission in X1850--087 is indeed due to a compact jet, then it is plausibly being launched and quenched in the hard state on timescales as short as a few days. Future radio monitoring of X1850--087 could help elucidate the conditions under which compact jets are produced around hard state accreting neutron stars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08836v1"
    ],
    "publication_venue": "9 pages, 2 figures, 2 tables, accepted for publication in ApJ",
    "doi": "10.3847/1538-4357/acc4bf"
}