{
    "arxiv_id": "2303.12539",
    "paper_title": "Enhanced Blackhole mergers in AGN discs due to Precession induced resonances",
    "authors": [
        "Hareesh Gautham Bhaskar",
        "Gongjie Li",
        "Doug Lin"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Recent studies have shown that AGN discs can host sources of gravitational waves. Compact binaries can form and merge in AGN discs through their interactions with the gas and other compact objects in the disc. It is also possible for the binaries to shorten the merging timescale due to eccentricity excitation caused by perturbations from the supermassive blackhole (SMBH). In this paper we focus on effects due to precession-induced (eviction-like) resonances, where nodal and apsidal precession rates of the binary is commensurable with the mean motion of the binary around the SMBH. We focus on intermediate mass black hole (IMBH)-stellar mass black hole (SBH) binaries, and consider binary orbit inclined from the circum-IMBH disk which leads to the orbital $J_2$ precession. We show that if a binary is captured in these resonances and is migrating towards the companion, it can undergo large eccentricity and inclination variations. We derive analytical expressions for the location of fixed points, libration timescale and width for these resonances, and identified two resonances in the near coplanar regime (the evection and eviction resonances) as well as two resonances in the near polar regime that can lead to mergers. We also derive analytical expressions for the maximum eccentricity that a migrating binary can achieve for given initial conditions. Specifically, the maximum eccentricity can reach 0.9 when captured in these resonances before orbital decay due to gravitational wave emission dominates, and the capture is only possible for slow migration ($\\sim 10$ Myr) 2-3 order of magnitude longer than the resonance libration timescale. We also show that capture into multiple resonances is possible, and can further excite eccentricities.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12539v1"
    ],
    "publication_venue": "Submitted to ApJ"
}