{
    "arxiv_id": "2303.13298",
    "paper_title": "Krein and Koplienko trace formulas on normed ideals in several variables",
    "authors": [
        "Arup Chattopadhyay",
        "Saikat Giri",
        "Chandan Pradhan"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2024-02-21"
    ],
    "latest_version": 4,
    "categories": [
        "math.FA"
    ],
    "abstract": "The focus of the paper lies in deriving the first and second-order Taylor remainder formulas for multivariable operator functions on normed ideals in $σ$-finite, semifinite von Neumann algebra factors associated with a positive trace, which need not be singular. This includes the case of Dixmier traces. Specifically, we establish the Krein and Koplienko trace formulas for pairs of tuples of commuting self-adjoint operators (not necessarily bounded). These formulas are linked to a diverse range of multivariable scalar functions, encompassing both analytic and non-analytic functions. This addresses, at least partially, an unresolved question posed by Aleksandrov, Peller, and Potapov \\cite[Open problems]{AlPePo19} regarding the existence of Krein spectral shift measures for pairs of commuting tuples of self-adjoint operators. As a consequence, we derive trace formulas for pairs of tuples of commuting maximal dissipative operators by employing dilation theory based on the trace formulas for self-adjoint operators. Furthermore, we establish a linearization formula for a Dixmier trace applied to perturbed operator functions, a feature not typically applicable to normal traces. Our work continues the work initiated by Skripka \\cite{Sk15} on multivariable trace formulas and broadens the trace formulas previously derived by Dykema and Skripka \\cite{DySk14} from single variable to multivariable operator functions. The foundation of our results crucially relies on the fundamental concept of multiple operator integrals presented in this paper to replace the prior restrictive analytic approach of \\cite{Sk15}.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13298v1",
        "http://arxiv.org/pdf/2303.13298v2",
        "http://arxiv.org/pdf/2303.13298v3",
        "http://arxiv.org/pdf/2303.13298v4"
    ],
    "publication_venue": "Change the abstract, One section has been removed"
}