{
    "arxiv_id": "2303.16973",
    "paper_title": "Constraining viscous dark energy equation of state in $f(R,L_m)$ gravity",
    "authors": [
        "Lakhan V. Jaybhaye",
        "Raja Solanki",
        "Sanjay Mandal",
        "Pradyumn Kumar Sahoo"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc"
    ],
    "abstract": "In this article, we attempt to describe cosmic late-time acceleration of the universe in the framework of $f(R,L_m)$ gravity by using an effective equation of state when the account is taken of bulk viscosity. We presume a non-linear $f(R,L_m)$ functional form, specifically, $f(R,L_m)=\\frac{R}{2}+L_m^α$, where $α$ is free model parameter. We obtain the exact solution of our bulk viscous matter dominated $f(R,L_m)$ model, and then we utilize the combined $H(z)+Pantheon+Analysis$ data sets to estimate the best fit values of the free parameters of our model. Then we characterize the behaviour of the matter-energy density, effective pressure, and the equation of state (EoS) parameter incorporating the viscous type fluid. The evolution profile of the effective EoS parameter depicts an acceleration phase of the cosmic expansion whereas the pressure with the effect of viscosity exhibits negative behaviour that can lead to the accelerating expansion of the universe. Moreover, the cosmic matter-energy density shows expected positive behaviour. Further, we investigate the behaviour of statefinder parameters for the assumed $f(R,L_m)$ model. We find that the evolutionary trajectory of the given model lies in the quintessence region. In addition, we employ the Om diagnostic test that indicates our model exhibits quintessence behavior. Lastly, we check the energy condition criteria and find that violation of SEC occurs in the past, whereas NEC and DEC satisfies the positivity criteria. We find that our $f(R,L_m)$ cosmological model with the effect of bulk viscosity provides a good fit of the recent observational data and can efficiently describe the cosmic expansion scenario.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16973v1"
    ],
    "publication_venue": "Universe published version",
    "doi": "10.3390/universe9040163"
}