{
    "arxiv_id": "2303.10339",
    "paper_title": "Compact stellar structures in Weyl geometric gravity",
    "authors": [
        "Zahra Haghani",
        "Tiberiu Harko"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
    ],
    "abstract": "We consider the structure and physical properties of specific classes of neutron, quark, and Bose-Einstein Condensate stars in the conformally invariant Weyl geometric gravity theory. The basic theory is derived from the simplest conformally invariant action, constructed, in Weyl geometry, from the square of the Weyl scalar, the strength of the Weyl vector, and a matter term, respectively. The action is linearized in the Weyl scalar by introducing an auxiliary scalar field. To keep the theory conformally invariant the trace condition is imposed on the matter energy-momentum tensor. The field equations are derived by varying the action with respect to the metric tensor, Weyl vector field and scalar field. By adopting a static spherically symmetric interior geometry, we obtain the field equations, describing the structure and properties of stellar objects in Weyl geometric gravity. The solutions of the field equations are obtained numerically, for different equations of state of the neutron and quark matter. More specifically, constant density stellar models, and models described by the stiff fluid, radiation fluid, quark bag model, and Bose-Einstein Condensate equations of state are explicitly constructed numerically in both general relativity and Weyl geometric gravity, thus allowing an in depth comparison between the predictions of these two gravitational theories. As a general result it turns out that for all the considered equations of state, Weyl geometric gravity stars are more massive than their general relativistic counterparts. As a possible astrophysical application of the obtained results we suggest that the recently observed neutron stars, with masses in the range of 2$M_{\\odot}$ and 3$M_{\\odot}$, respectively, could be in fact conformally invariant Weyl geometric neutron or quark stars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10339v1"
    ],
    "publication_venue": "20 pages, 15 figures, accepted for publication in PRD",
    "doi": "10.1103/PhysRevD.107.064068"
}