{
    "arxiv_id": "2303.15202",
    "paper_title": "Towards Outcome-Driven Patient Subgroups: A Machine Learning Analysis Across Six Depression Treatment Studies",
    "authors": [
        "David Benrimoh",
        "Akiva Kleinerman",
        "Toshi A. Furukawa",
        "Charles F. Reynolds",
        "Eric Lenze",
        "Jordan Karp",
        "Benoit Mulsant",
        "Caitrin Armstrong",
        "Joseph Mehltretter",
        "Robert Fratila",
        "Kelly Perlman",
        "Sonia Israel",
        "Christina Popescu",
        "Grace Golden",
        "Sabrina Qassim",
        "Alexandra Anacleto",
        "Adam Kapelner",
        "Ariel Rosenfeld",
        "Gustavo Turecki"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG",
        "cs.AI"
    ],
    "abstract": "Major depressive disorder (MDD) is a heterogeneous condition; multiple underlying neurobiological substrates could be associated with treatment response variability. Understanding the sources of this variability and predicting outcomes has been elusive. Machine learning has shown promise in predicting treatment response in MDD, but one limitation has been the lack of clinical interpretability of machine learning models. We analyzed data from six clinical trials of pharmacological treatment for depression (total n = 5438) using the Differential Prototypes Neural Network (DPNN), a neural network model that derives patient prototypes which can be used to derive treatment-relevant patient clusters while learning to generate probabilities for differential treatment response. A model classifying remission and outputting individual remission probabilities for five first-line monotherapies and three combination treatments was trained using clinical and demographic data. Model validity and clinical utility were measured based on area under the curve (AUC) and expected improvement in sample remission rate with model-guided treatment, respectively. Post-hoc analyses yielded clusters (subgroups) based on patient prototypes learned during training. Prototypes were evaluated for interpretability by assessing differences in feature distributions and treatment-specific outcomes. A 3-prototype model achieved an AUC of 0.66 and an expected absolute improvement in population remission rate compared to the sample remission rate. We identified three treatment-relevant patient clusters which were clinically interpretable. It is possible to produce novel treatment-relevant patient profiles using machine learning models; doing so may improve precision medicine for depression. Note: This model is not currently the subject of any active clinical trials and is not intended for clinical use.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15202v1"
    ],
    "publication_venue": null
}