{
    "arxiv_id": "2303.13250",
    "paper_title": "Metal content of relativistically jetted and radio-quiet quasars in the main sequence context",
    "authors": [
        "Paola Marziani",
        "Swayamtrupta Panda",
        "Alice Deconto Machado",
        "Ascension Del Olmo"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Optical and UV properties of radio-quiet (RQ) and radio-loud (RL, relativistically \"jetted\") active galactic nuclei (AGN) are known to differ markedly; however, it is still unclear what is due to a sample selection and what is associated with intrinsic differences in the inner workings of their emitting regions. Chemical composition is an important parameter related to the trends of the quasar main sequence. Recent works suggest that in addition to physical properties such as density, column density, and ionization level, strong FeII emitters require very high metal content. Little is known, however, about the chemical composition of jetted radio-loud sources. In this short note, we present a pilot analysis of the chemical composition of low-z radio-loud and radio-quiet quasars. Optical and UV spectra from ground and space were combined to allow for precise measurements of metallicity-sensitive diagnostic ratios. The comparison between radio-quiet and radio-loud was carried out for sources in the same domain of the Eigenvector 1 / main sequence parameter space. Arrays of dedicated photoionization simulations with the input of appropriate spectral energy distributions indicate that metallicity is sub-solar for RL AGN, and slightly sub-solar or around solar for RQ AGN. The metal content of the broad line emitting region likely reflects a similar enrichment story for both classes of AGN not involving recent circum-nuclear or nuclear starbursts.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13250v1"
    ],
    "publication_venue": "14 pages, 5 figures, to appear in Galaxies"
}