{
    "arxiv_id": "2303.14879",
    "paper_title": "Biased thermodynamics can explain the behaviour of smart optimization algorithms that work above the dynamical threshold",
    "authors": [
        "Angelo Giorgio Cavaliere",
        "Federico Ricci-Tersenghi"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2025-07-29"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.stat-mech",
        "cond-mat.dis-nn"
    ],
    "abstract": "Random constraint satisfaction problems can display a very rich structure in the space of solutions, with often an ergodicity breaking -- also known as clustering or dynamical -- transition preceding the satisfiability threshold when the constraint-to-variables ratio $α$ is increased. However, smart algorithms start to fail finding solutions in polynomial time at some threshold $α_{\\rm alg}$ which is algorithmic dependent and generally bigger than the dynamical one $α_d$. The reason for this discrepancy is due to the fact that $α_d$ is traditionally computed according to the uniform measure over all the solutions. Thus, while bounding the region where a uniform sampling of the solutions is easy, it cannot predict the performance of off-equilibrium processes, that are still able of finding atypical solutions even beyond $α_d$. Here we show that a reconciliation between algorithmic behaviour and thermodynamic prediction is nonetheless possible at least up to some threshold $α_d^{\\rm opt}\\geqα_d$, which is defined as the maximum value of the dynamical threshold computed on all possible probability measures over the solutions. We consider a simple Monte Carlo-based optimization algorithm, which is restricted to the solution space, and we demonstrate that sampling the equilibrium distribution of a biased measure improving on $α_d$ is still possible even beyond the ergodicity breaking point for the uniform measure, where other algorithms hopelessly enter the out-of-equilibrium regime. The conjecture we put forward is that many smart algorithms sample the solution space according to a biased measure: once this measure is identified, the algorithmic threshold is given by the corresponding ergodicity-breaking transition.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14879v1"
    ],
    "publication_venue": null,
    "doi": "10.1088/1742-5468/add510"
}