{
    "arxiv_id": "2303.12928",
    "paper_title": "Leveraging Multi-time Hamilton-Jacobi PDEs for Certain Scientific Machine Learning Problems",
    "authors": [
        "Paula Chen",
        "Tingwei Meng",
        "Zongren Zou",
        "Jérôme Darbon",
        "George Em Karniadakis"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-05-19"
    ],
    "latest_version": 2,
    "categories": [
        "cs.LG",
        "math.OC"
    ],
    "abstract": "Hamilton-Jacobi partial differential equations (HJ PDEs) have deep connections with a wide range of fields, including optimal control, differential games, and imaging sciences. By considering the time variable to be a higher dimensional quantity, HJ PDEs can be extended to the multi-time case. In this paper, we establish a novel theoretical connection between specific optimization problems arising in machine learning and the multi-time Hopf formula, which corresponds to a representation of the solution to certain multi-time HJ PDEs. Through this connection, we increase the interpretability of the training process of certain machine learning applications by showing that when we solve these learning problems, we also solve a multi-time HJ PDE and, by extension, its corresponding optimal control problem. As a first exploration of this connection, we develop the relation between the regularized linear regression problem and the Linear Quadratic Regulator (LQR). We then leverage our theoretical connection to adapt standard LQR solvers (namely, those based on the Riccati ordinary differential equations) to design new training approaches for machine learning. Finally, we provide some numerical examples that demonstrate the versatility and possible computational advantages of our Riccati-based approach in the context of continual learning, post-training calibration, transfer learning, and sparse dynamics identification.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12928v1",
        "http://arxiv.org/pdf/2303.12928v2"
    ],
    "publication_venue": "26 pages in total, 23 pages for the main text, 9 figures"
}