{
    "arxiv_id": "2303.10462",
    "paper_title": "Machine learning with data assimilation and uncertainty quantification for dynamical systems: a review",
    "authors": [
        "Sibo Cheng",
        "Cesar Quilodran-Casas",
        "Said Ouala",
        "Alban Farchi",
        "Che Liu",
        "Pierre Tandeo",
        "Ronan Fablet",
        "Didier Lucor",
        "Bertrand Iooss",
        "Julien Brajard",
        "Dunhui Xiao",
        "Tijana Janjic",
        "Weiping Ding",
        "Yike Guo",
        "Alberto Carrassi",
        "Marc Bocquet",
        "Rossella Arcucci"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cs.LG"
    ],
    "abstract": "Data Assimilation (DA) and Uncertainty quantification (UQ) are extensively used in analysing and reducing error propagation in high-dimensional spatial-temporal dynamics. Typical applications span from computational fluid dynamics (CFD) to geoscience and climate systems. Recently, much effort has been given in combining DA, UQ and machine learning (ML) techniques. These research efforts seek to address some critical challenges in high-dimensional dynamical systems, including but not limited to dynamical system identification, reduced order surrogate modelling, error covariance specification and model error correction. A large number of developed techniques and methodologies exhibit a broad applicability across numerous domains, resulting in the necessity for a comprehensive guide. This paper provides the first overview of the state-of-the-art researches in this interdisciplinary field, covering a wide range of applications. This review aims at ML scientists who attempt to apply DA and UQ techniques to improve the accuracy and the interpretability of their models, but also at DA and UQ experts who intend to integrate cutting-edge ML approaches to their systems. Therefore, this article has a special focus on how ML methods can overcome the existing limits of DA and UQ, and vice versa. Some exciting perspectives of this rapidly developing research field are also discussed.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10462v1"
    ],
    "publication_venue": null
}