{
    "arxiv_id": "2303.15411",
    "paper_title": "Dynamical masses of two young transiting sub-Neptunes orbiting HD 63433",
    "authors": [
        "M. Mallorquín",
        "V. J. S. Béjar",
        "N. Lodieu",
        "M. R. Zapatero Osorio",
        "H. Tabernero",
        "A. Suárez Mascareño",
        "M. Zechmeister",
        "R. Luque",
        "E. Pallé",
        "D. Montes"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Although the number of exoplanets reported in the literature exceeds 5000 so far, only a few dozen of them are young planets ($\\le$900 Myr). However, a complete characterization of these young planets is key to understanding the current properties of the entire population. Hence, it is necessary to constrain the planetary formation processes and the timescales of dynamical evolution by measuring the masses of exoplanets transiting young stars. We characterize and measure the masses of two transiting planets orbiting the 400 Myr old solar-type star HD\\,63433, which is a member of the Ursa Major moving group. We analysed precise photometric light curves of five sectors of the TESS mission with a baseline of $\\sim$750 days and obtained $\\sim$150 precise radial velocity measurements with the visible and infrared arms of the CARMENES instrument at the Calar Alto 3.5 m telescope in two different campaigns of $\\sim$500 days. We performed a combined photometric and spectroscopic analysis to retrieve the planetary properties of two young planets. The strong stellar activity signal was modelled by Gaussian regression processes. We have updated the transit parameters of HD\\,63433\\,b and c and obtained planet radii of R$_p^b$\\,=\\,2.140\\,$\\pm$\\,0.087 R$_\\oplus$ and R$_p^c$\\,=\\,2.692\\,$\\pm$\\,0.108 R$_\\oplus$. Our analysis allowed us to determine the dynamical mass of the outer planet with a 4$σ$ significance ($M_p^c$\\,=\\,15.54\\,$\\pm$\\,3.86 M$_\\oplus$) and set an upper limit on the mass of the inner planet at 3$σ$ ($M_p^b$\\,$<$\\,21.76 M$_\\oplus$). According to theoretical models, both planets are expected to be sub-Neptunes, whose interiors mostly consist of silicates and water with no dominant composition of iron, and whose gas envelopes are lower than 2\\% in the case of HD\\,63433\\,c. The envelope is unconstrained in HD\\,63433\\,b.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15411v1"
    ],
    "publication_venue": null,
    "doi": "10.1051/0004-6361/202245397"
}