{
    "arxiv_id": "2303.09011",
    "paper_title": "Economics of In-Space Industry and Competitiveness of Lunar-Derived Rocket Propellant",
    "authors": [
        "Philip Metzger"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-04-26"
    ],
    "latest_version": 1,
    "categories": [
        "econ.GN",
        "physics.soc-ph"
    ],
    "abstract": "Economic parameters are identified for an in-space industry where the capital is made on one planet, it is transported to and teleoperated on a second planet, and the product is transported off the second planet for consumption. This framework is used to model the long-run cost of lunar propellant production to help answer whether it is commercially competitive against propellant launched from Earth. The prior techno-economic analyses (TEAs) of lunar propellant production had disagreed over this. The \"gear ratio on cost\" for capital transport, G, and the production mass ratio of the capital, phi, are identified as the most important factors determining competitiveness. The prior TEAs are examined for how they handled these two metrics. This identifies crucial mistakes in some of the TEAs: choosing transportation architectures with high G, and neglecting to make choices for the capital that could achieve adequate phi. The tent sublimation technology has a value of phi that is an order of magnitude better than the threshold for competitiveness even in low Earth orbit (LEO). The strip mining technology is closer to the threshold, but technological improvements plus several years of operating experience will improve its competitiveness, according to the model. Objections from members of the aerospace community are discussed, especially the question whether the technology can attain adequate reliability in the lunar environment. The results suggest that lunar propellant production will be commercially viable and that it should lower the cost of doing everything else in space.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09011v1"
    ],
    "publication_venue": "To be published in Acta Astronautica. 50 pages, 16 figures",
    "doi": "10.1016/j.actaastro.2023.03.014"
}