{
    "arxiv_id": "2303.09963",
    "paper_title": "Microstrip Patch Antenna Design at 10 GHz for X Band Applications",
    "authors": [
        "Mehmet Karahan",
        "Mertcan Inal",
        "Alperen Dilmen",
        "Furkan Lacinkaya",
        "Ahmet Nuri Akay",
        "Cosku Kasnakoglu"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2024-02-13"
    ],
    "latest_version": 4,
    "categories": [
        "physics.app-ph",
        "eess.SP"
    ],
    "abstract": "Microstrip patch antennas are used in satellite imaging systems, wireless communication equipment, military radios, GPS (Global Positioning System) and GSM (Global System for Mobile Communications) applications. Its advantages are its small size and light weight, thin structure, low power consumption, use in dual frequency applications, and patching in various geometric shapes. Developing technology has facilitated and accelerated the production of microstrip antennas. In this study, microstrip antenna design operating at 10 GHz frequency for X band applications has been made. X band is used for air traffic control, weather traffic control, vessel traffic control, defense tracking and vehicle speed detection, terrestrial communications and networking, space communications and amateur radio. HFSS program was used in antenna design. AWR program was used to find transmission line parameters. In addition, MATLAB program was used to calculate some parameters. First of all, information is given about the working principle of the antenna, the selected dielectric layer and the working frequency. Schematic drawings of the designed antenna were made from above and from the side. S11 reflection coefficient magnitude graphs are drawn below and above the operating frequency. The radiation pattern is drawn for the E-plane and H-plane at the operating frequency. 3-D (dimensional) plot of antenna gain at operating frequency is drawn. The simulations performed have shown that the designed antenna works successfully.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09963v1",
        "http://arxiv.org/pdf/2303.09963v2",
        "http://arxiv.org/pdf/2303.09963v3",
        "http://arxiv.org/pdf/2303.09963v4"
    ],
    "publication_venue": "13 pages, 13 figures",
    "doi": "10.59324/ejtas.2024.2(1).33"
}