{
    "arxiv_id": "2303.17632",
    "paper_title": "Boosting Line Intensity Map Signal-to-Noise with the Ly-$α$ Forest Cross-Correlation",
    "authors": [
        "Mahdi Qezlou",
        "Simeon Bird",
        "Adam Lidz",
        "Guochao Sun",
        "Andrew B. Newman",
        "Gwen C. Rudie",
        "Yueying Ni",
        "Rupert Croft",
        "Tiziana Di Matteo"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-07-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.IM"
    ],
    "abstract": "We forecast the prospects for cross-correlating future line intensity mapping (LIM) surveys with the current and future Ly-$α$ forest data. We use large cosmological hydrodynamic simulations to model the expected emission signal for the CO rotational transition in the COMAP LIM experiment at the 5-year benchmark and the Ly-$α$ forest absorption signal for various surveys, including eBOSS, DESI, and PFS. We show that CO$\\times$Ly-$α$ forest can significantly enhance the detection signal-to-noise ratio of CO, with a $200$ to $300 \\%$ improvement when cross-correlated with the forest observed in the Prime Focus Spectrograph (PFS) survey and a $50$ to $75\\%$ enhancement for the currently available eBOSS or the upcoming DESI observations. We compare to the signal-to-noise improvements expected for a galaxy survey and show that CO$\\times$Ly-$α$ is competitive with even a spectroscopic galaxy survey in raw signal-to-noise. Furthermore, our study suggests that the clustering of CO emission is tightly constrained by CO$\\times$Ly-$α$ forest, due to the increased signal-to-noise ratio and the simplicity of Ly-$α$ absorption power spectrum modeling. Any foreground contamination or systematics are expected not to be shared between LIM surveys and Ly-$α$ forest observations; this provides an unbiased inference. Our findings highlight the potential benefits of utilizing the Ly-$α$ forest to aid in the initial detection of signals in line intensity experiments. For example, we also estimate that [CII]$\\times$Ly-$α$ forest measurements from EXCLAIM and DESI/eBOSS, respectively, should have a larger signal-to-noise ratio than planned [CII]$\\times$quasar observations by about an order of magnitude. Our results can be readily applied to actual data thanks to the observed quasar spectra in eBOSS Stripe 82, which overlaps with several LIM surveys.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17632v1"
    ],
    "publication_venue": "Codes and the produced data are available at https://github.com/qezlou/lali",
    "doi": "10.1093/mnras/stad1906"
}