{
    "arxiv_id": "2303.12841",
    "paper_title": "Evolution of binary stars in the early evolutionary phases of ultra-faint dwarf galaxies",
    "authors": [
        "Alexander R. Livernois",
        "Enrico Vesperini",
        "Václav Pavlík"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "The dynamics of binary stars provides a unique avenue to gather insight into the study of the structure and dynamics of star clusters and galaxies. In this paper, we present the results of a set of $N$-body simulations aimed at exploring the evolution of binary stars during the early evolutionary phases of ultra-faint dwarf galaxies (UFD). In our simulations, we assume that the stellar component of the UFD is initially dynamically cold and evolves towards its final equilibrium after undergoing the violent relaxation phase. We show that the early evolutionary phases of the UFD significantly enhance the disruption of wide binaries and leave their dynamical fingerprints on the semi-major axis distribution of the surviving binaries as compared to models initially in equilibrium. An initially thermal eccentricity distribution is preserved except for the widest binaries for which it evolves towards a superthermal distribution; for a binary population with an initially uniform eccentricity distribution, memory of this initial distribution is rapidly lost for most binaries as wider binaries evolve to approach a thermal/superthermal distribution. The evolution of binaries is driven both by tidal effects due to the potential of the UFD dark matter halo and collisional effects associated to binary-binary/single star encounters. Collisional effects are particularly important within the clumpy substructure characterizing the system during its early evolution; in addition to enhancing binary ionization and evolution of the binary orbital parameters, encounters may lead to exchanges of either of the primordial binary components with one of the interacting stars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12841v1"
    ],
    "publication_venue": "11 pages, 12 figures, Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad826"
}