{
    "arxiv_id": "2303.08178",
    "paper_title": "Dense Molecular Gas Properties of the Central Kpc of Nearby Ultraluminous Infrared Galaxies Constrained by ALMA Three Transition-line Observations",
    "authors": [
        "Masatoshi Imanishi",
        "Shunsuke Baba",
        "Kouichiro Nakanishi",
        "Takuma Izumi"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We report the results of ALMA 1-2 kpc-resolution, three rotational transition line (J=2-1, J=3-2, and J=4-3) observations of multiple dense molecular gas tracers (HCN, HCO$^{+}$, and HNC) for ten nearby (ultra)luminous infrared galaxies ([U]LIRGs). Following the matching of beam sizes to 1-2 kpc for each (U)LIRG, the high-J to low-J transition-line flux ratios of each molecule and the emission line flux ratios of different molecules at each J transition are derived. We conduct RADEX non-LTE model calculations and find that, under a wide range of gas density and kinetic temperature, the observed HCN-to-HCO$^{+}$ flux ratios in the overall (U)LIRGs are naturally reproduced with enhanced HCN abundance compared to HCO$^{+}$. Thereafter, molecular gas properties are constrained primarily through the use of HCN and HCO$^{+}$ data and the adoption of fiducial values for the HCO$^{+}$ column density and HCN-to-HCO$^{+}$ abundance ratio. We quantitatively confirm the following: (1) Molecular gas at the (U)LIRGs' nuclei is dense ($\\gtrsim$10$^{3-4}$ cm$^{-3}$) and warm ($\\gtrsim$100 K). (2) Molecular gas density and temperature in nine ULIRGs' nuclei are significantly higher than that of one LIRG's nucleus. (3) Molecular gas in starburst-dominated sources tends to be less dense and cooler than ULIRGs with luminous AGN signatures. For six selected sources, we also apply a Bayesian approach by freeing all parameters and support the above main results. Our ALMA 1-2 kpc resolution, multiple transition-line data of multiple molecules are a very powerful tool for scrutinizing the properties of molecular gas concentrated around luminous energy sources in nearby (U)LIRGs' nuclei.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08178v1"
    ],
    "publication_venue": "42 pages, 13 figures. ApJ accepted",
    "doi": "10.3847/1538-4357/acc388"
}