{
    "arxiv_id": "2303.16925",
    "paper_title": "The Bactrian? Broad-lined Type-Ic supernova SN 2022xxf with extraordinary two-humped light curves",
    "authors": [
        "H. Kuncarayakti",
        "J. Sollerman",
        "L. Izzo",
        "K. Maeda",
        "S. Yang",
        "S. Schulze",
        "C. R. Angus",
        "M. Aubert",
        "K. Auchettl",
        "M. Della Valle",
        "L. Dessart",
        "K. Hinds",
        "E. Kankare",
        "M. Kawabata",
        "P. Lundqvist",
        "T. Nakaoka",
        "D. Perley",
        "S. I. Raimundo",
        "N. L. Strotjohann",
        "K. Taguchi",
        "Y. -Z. Cai",
        "P. Charalampopoulos",
        "Q. Fang",
        "M. Fraser",
        "C. P. Gutierrez",
        "R. Imazawa",
        "T. Kangas",
        "K. S. Kawabata",
        "R. Kotak",
        "T. Kravtsov",
        "K. Matilainen",
        "S. Mattila",
        "S. Moran",
        "I. Murata",
        "I. Salmaso",
        "J. P. Anderson",
        "C. Ashall",
        "E. C. Bellm",
        "S. Benetti",
        "K. C. Chambers",
        "T. -W. Chen",
        "M. Coughlin",
        "F. De Colle",
        "C. Fremling",
        "L. Galbany",
        "A. Gal-Yam",
        "M. Gromadzki",
        "S. L. Groom",
        "A. Hajela",
        "C. Inserra",
        "M. M. Kasliwal",
        "A. A. Mahabal",
        "A. Martin-Carrillo",
        "T. Moore",
        "T. E. Muller-Bravo",
        "M. Nicholl",
        "F. Ragosta",
        "R. L. Riddle",
        "Y. Sharma",
        "S. Srivastav",
        "M. D. Stritzinger",
        "A. Wold",
        "D. R. Young"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE"
    ],
    "abstract": "We report on our study of SN 2022xxf during the first four months of its evolution. The light curves (LCs) display two humps at similar maximum brightness separated by 75d, unprecedented for a broad-lined Type Ic supernova (SN IcBL). SN~2022xxf is the most nearby SN IcBL to date (in NGC~3705, $z = 0.0037$, 20 Mpc). Optical and NIR photometry and spectroscopy are used to identify the energy source powering the LC. Nearly 50 epochs of high S/N-ratio spectroscopy were obtained within 130d, comprising an unparalleled dataset for a SN IcBL, and one of the best-sampled SN datasets to date. The global spectral appearance and evolution of SN~2022xxf points to typical SN Ic/IcBL, with broad features (up to $\\sim14000$ km~s$^{-1}$) and a gradual transition from the photospheric to the nebular phase. However, narrow emission lines (corresponding to $\\sim1000-2500$ km~s$^{-1}$) are present from the time of the second rise, suggesting slower-moving circumstellar material (CSM). These lines are subtle, but some are readily noticeable at late times such as in Mg~I $λ$5170 and [O~I] $λ$5577. Unusually, the near-infrared spectra show narrow line peaks, especially among features formed by ions of O and Mg. We infer the presence of CSM that is free of H and He. We propose that the radiative energy from the ejecta-CSM interaction is a plausible explanation for the second LC hump. This interaction scenario is supported by the color evolution, which progresses to the blue as the light curve evolves along the second hump, and the slow second rise and subsequent rapid LC drop. SN~2022xxf may be related to an emerging number of CSM-interacting SNe Ic, which show slow, peculiar LCs, blue colors, and subtle CSM interaction lines. The progenitor stars of these SNe likely experienced an episode of mass loss shortly prior to explosion consisting of H/He-free material.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16925v1"
    ],
    "publication_venue": "Submitted. SN~2022xxf is still bright ($\\sim18$ mag), has good sky visibility in the next few months, and shows a flattening in the current LC. The community is urged to join the monitoring effort in all wavelengths in order to understand this extraordinary object and its pre-SN behavior"
}