{
    "arxiv_id": "2303.09984",
    "paper_title": "Synthetic photometry for carbon-rich giants. V. Effects of grain-size-dependent dust opacities",
    "authors": [
        "Kjell Eriksson",
        "Susanne Höfner",
        "Bernhard Aringer"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "The properties and the evolution of asymptotic giant branch (AGB) stars are strongly influenced by their mass loss through a stellar wind. This is believed to be caused by radiation pressure due to the absorption and scattering of the stellar radiation by the dust grains formed in the atmosphere. The optical properties of dust are often estimated using the small particle limit (SPL) approximation, and it has been used frequently in modelling AGB stellar winds when performing radiation-hydrodynamics (RHD) simulations. We aim to investigate the effects of replacing the SPL approximation by detailed Mie calculations of the size-dependent opacities for grains of amorphous carbon forming in C-rich AGB star atmospheres. We performed RHD simulations for a large grid of carbon star atmosphere+wind models with different effective temperatures, luminosities, stellar masses, carbon excesses, and pulsation properties. Also, a posteriori radiative transfer calculations for many radial structures (snapshots) of these models were done, resulting in spectra and filter magnitudes. We find, when giving up the SPL approximation, the wind models become more strongly variable and more dominated by gusts, although the average mass-loss rates and outflow speeds do not change significantly; the increased radiative pressure on the dust throughout its formation zone does, however, result in smaller grains and lower condensation fractions (and thus higher gas-to-dust ratios). The photometric K magnitudes are generally brighter, but at V the effects of using size-dependent dust opacities are more complex: brighter for low mass-loss rates and dimmer for massive stellar winds. Given the large effects on spectra and photometric properties, it is necessary to use the detailed dust optical data instead of the simple SPL approximation in stellar atmosphere+wind modelling where dust is formed.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09984v1"
    ],
    "publication_venue": "14 pages, 24 figures. Accepted for publication in Astronomy \\& Astrophysics",
    "doi": "10.1051/0004-6361/202245206"
}