{
    "arxiv_id": "2303.12106",
    "paper_title": "Do the CMB Temperature Fluctuations Conserve Parity?",
    "authors": [
        "Oliver H. E. Philcox"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ex",
        "hep-ph",
        "hep-th"
    ],
    "abstract": "Observations of the Cosmic Microwave Background (CMB) have cemented the notion that the large-scale Universe is both statistically homogeneous and isotropic. But is it invariant also under mirror reflections? To probe this we require parity-sensitive statistics: for scalar observables, the simplest is the four-point function. We make the first measurements of the parity-odd CMB trispectrum, focusing on the large-scale ($2<\\ell<510$) temperature anisotropies measured by Planck. This is facilitated by new maximum-likelihood estimators for binned correlators, which account for mask convolution and leakage between even- and odd-parity components, and achieve optimal variances within $\\approx 20\\%$. We perform a blind test for parity violation by comparing a $χ^2$ statistic from Planck to theoretical expectations, using two suites of simulations to account for the possible likelihood non-Gaussianity and residual foregrounds. We find consistency at the $\\approx 0.5σ$ level, yielding no evidence for parity violation, with roughly $250\\times$ the squared sensitivity of large scale structure measurements (according to mode-counting arguments), and with the advantage of linear physics, Gaussian statistics, and accurate mocks. The measured trispectra can be used to constrain physical models of inflationary parity violation, including Ghost Inflation, Cosmological Collider scenarios, and Chern-Simons gauge fields. Considering eight such models, we find no evidence for new physics, with a maximal detection significance of $2.0σ$. These results suggest that the recent parity excesses seen in the BOSS galaxy survey are not primordial in origin. Tighter constraints can be wrought by including smaller scales (though rotational invariance washes out the flat-sky limit) and adding polarization data.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12106v1",
        "http://arxiv.org/pdf/2303.12106v2"
    ],
    "publication_venue": "7+12 pages, 4+5 figures, submitted to Phys. Rev. Lett. Code available at https://github.com/oliverphilcox/PolyBin/tree/main/planck_public"
}