{
    "arxiv_id": "2303.16922",
    "paper_title": "The Standard Model effective field theory at work",
    "authors": [
        "Gino Isidori",
        "Felix Wilsch",
        "Daniel Wyler"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph"
    ],
    "abstract": "The striking success of the Standard Model in explaining precision data and, at the same time, its lack of explanations for various fundamental phenomena, such as dark matter or the baryon asymmetry of the universe, suggests new physics at an energy scale much larger than the electroweak scale. In the absence of a short-range-long-range conspiracy, the Standard Model can be viewed as the leading term of an effective \"remnant\" theory (referred to as the SMEFT) of a more fundamental structure. Over the last years, many aspects of the SMEFT have been investigated and it has become a standard tool to analyze experimental results in an integral way. In this article, after briefly presenting the salient features of the Standard Model, we review the construction of the SMEFT. We discuss the range of its applicability and bounds on its coefficients imposed by general theoretical considerations. Since new physics models are likely to exhibit exact or approximate accidental global symmetries, especially in the flavor sector, we also discuss their implications for the SMEFT. The main focus of our review is the phenomenological analysis of experimental results. We show explicitly how to use various effective field theories to study the phenomenology of theories beyond the Standard Model. We give a detailed description of the matching procedure and the use of the renormalization group equations, allowing to connect multiple effective theories valid at different energy scales. Explicit examples from low-energy experiments and from high-$p_T$ physics illustrate the workflow. We also comment on the non-linear realization of the electroweak symmetry breaking and its phenomenological implications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16922v1"
    ],
    "publication_venue": "61 pages, 14 figures"
}