{
    "arxiv_id": "2303.14590",
    "paper_title": "A note on retrodiction and machine evolution",
    "authors": [
        "Gustavo Caetano-Anollés"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-09-04"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.BM"
    ],
    "abstract": "Biomolecular communication demands that interactions between parts of a molecular system act as scaffolds for message transmission. It also requires an evolving and organized system of signs - a communicative agency - for creating and transmitting meaning. Here I explore the need to dissect biomolecular communication with retrodiction approaches that make claims about the past given information that is available in the present. While the passage of time restricts the explanatory power of retrodiction, the use of molecular structure in biology offsets information erosion. This allows description of the gradual evolutionary rise of structural and functional innovations in RNA and proteins. The resulting chronologies can also describe the gradual rise of molecular machines of increasing complexity and computation capabilities. For example, the accretion of rRNA substructures and ribosomal proteins can be traced in time and placed within a geological timescale. Phylogenetic, algorithmic and theoretical-inspired accretion models can be reconciled into a congruent evolutionary model. Remarkably, the time of origin of enzymes, functional RNA, non-ribosomal peptide synthetase (NRPS) complexes, and ribosomes suggest they gradually climbed Chomsky's hierarchy of formal grammars, supporting the gradual complexification of machines and communication in molecular biology. Future retrodiction approaches and in-depth exploration of theoretical models of computation will need to confirm such evolutionary progression.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14590v1"
    ],
    "publication_venue": "7 pages, 1 figure",
    "doi": "10.1111/nyas.15005"
}