{
    "arxiv_id": "2303.12409",
    "paper_title": "The Masses of a Sample of Radial-Velocity Exoplanets with Astrometric Measurements",
    "authors": [
        "Guang-Yao Xiao",
        "Yu-Juan Liu",
        "Huan-Yu Teng",
        "Wei Wang",
        "Timothy D. Brandt",
        "Gang Zhao",
        "Fei Zhao",
        "Meng Zhai",
        "Qi Gao"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Being one of the most fundamental physical parameter of astronomical objects, mass plays a vital role in the study of exoplanets, including their temperature structure, chemical composition, formation, and evolution. However, nearly a quarter of the known confirmed exoplanets lack measurements of their masses. This is particularly severe for those discovered via the radial-velocity (RV) technique, which alone could only yield the minimum mass of planets. In this study, we use published RV data combined with astrometric data from a cross-calibrated Hipparcos-Gaia Catalog of Accelerations (HGCA) to jointly constrain the masses of 115 RV-detected substellar companions, by conducting full orbital fits using the public tool \\texttt{orvara}. Among them, 9 exoplanets with $M_{\\rm p}\\,{\\rm sin}\\,i<13.5\\ M_{\\rm Jup}$ are reclassified to the brown dwarf (BD) regime, and 16 BD candidates ($13.5\\leqslant M_{\\rm p}\\,{\\rm sin}\\,i<80\\,M_{\\rm Jup}$) turn out to be low-mass M dwarfs. We point out the presence of a transition in the BD regime as seen in the distributions of host star metallicity and orbital eccentricity with respect to planet masses. We confirm the previous findings that companions with masses below $42.5\\ M_{\\rm Jup}$ might primarily form in the protoplanetary disc through core accretion or disc gravitational instability, while those with masses above $42.5\\ M_{\\rm Jup}$ formed through the gravitational instability of molecular cloud like stars. Selection effects and detection biases which may affect our analysis to some extent, are discussed.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12409v1"
    ],
    "publication_venue": "37 pages, 14 figures, accepted by Research in Astronomy and Astrophysics",
    "doi": "10.1088/1674-4527/accb7e"
}