{
    "arxiv_id": "2303.10836",
    "paper_title": "On the effects of strain, defects, and interactions on the topological properties of HfTe5",
    "authors": [
        "Na Hyun Jo",
        "Omar A. Ashour",
        "Zhixue Shu",
        "Chris Jozwiak",
        "Aaron Bostwick",
        "Sae Hee Ryu",
        "Kai Sun",
        "Tai Kong",
        "Sinead M. Griffin",
        "Eli Rotenberg"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2024-07-26"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Topological insulators are characterized by spin-momentum-locked massless surface states which are robust under various perturbations. Manipulating such surface states is a topic of vigorous research, as a possible route for the realization of emergent many-body physics in topological systems. Thus far, time-reversal symmetry breaking via Coulomb and magnetic perturbations has been a dominant approach for the tuning of topological states. However, the effect of the structural degrees of freedom on quasi-particle dynamics in topological materials remains elusive. In this work, we demonstrate a transition in HfTe5 between distinct topological phases as a function of either Te vacancy concentration or applied strain; these phases are characterized theoretically as a transition from strong to weak topological insulator and experimentally by a transition from sharp surface states and Dirac crossing to a Fermi-liquid-like quasiparticle state in which these surface-localized features are heavily suppressed. Although vacancies can result in various consequences such as scattering, doping, and structural distortions, we show that changes in the lattice constants play the foremost role in determining the electronic structure, self-energy, and topological states of HfTe5. Our results demonstrate the possibility of using both defect chemistry and strain as control parameters for topological phase transitions and associated many-body physics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10836v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevB.109.235122"
}