{
    "arxiv_id": "2303.13013",
    "paper_title": "GesGPT: Speech Gesture Synthesis With Text Parsing from GPT",
    "authors": [
        "Nan Gao",
        "Zeyu Zhao",
        "Zhi Zeng",
        "Shuwu Zhang",
        "Dongdong Weng",
        "Yihua Bao"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2024-05-28"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CL",
        "cs.CV",
        "cs.HC"
    ],
    "abstract": "Gesture synthesis has gained significant attention as a critical research field, aiming to produce contextually appropriate and natural gestures corresponding to speech or textual input. Although deep learning-based approaches have achieved remarkable progress, they often overlook the rich semantic information present in the text, leading to less expressive and meaningful gestures. In this letter, we propose GesGPT, a novel approach to gesture generation that leverages the semantic analysis capabilities of large language models , such as ChatGPT. By capitalizing on the strengths of LLMs for text analysis, we adopt a controlled approach to generate and integrate professional gestures and base gestures through a text parsing script, resulting in diverse and meaningful gestures. Firstly, our approach involves the development of prompt principles that transform gesture generation into an intention classification problem using ChatGPT. We also conduct further analysis on emphasis words and semantic words to aid in gesture generation. Subsequently, we construct a specialized gesture lexicon with multiple semantic annotations, decoupling the synthesis of gestures into professional gestures and base gestures. Finally, we merge the professional gestures with base gestures. Experimental results demonstrate that GesGPT effectively generates contextually appropriate and expressive gestures.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13013v1",
        "http://arxiv.org/pdf/2303.13013v2"
    ],
    "publication_venue": null,
    "doi": "10.1109/LRA.2024.3359544"
}