{
    "arxiv_id": "2303.10600",
    "paper_title": "Reduced Lagrange multiplier approach for non-matching coupling of mixed-dimensional domains",
    "authors": [
        "Luca Heltai",
        "Paolo Zunino"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "math.NA"
    ],
    "abstract": "Many physical problems involving heterogeneous spatial scales, such as the flow through fractured porous media, the study of fiber-reinforced materials, or the modeling of the small circulation in living tissues -- just to mention a few examples -- can be described as coupled partial differential equations defined in domains of heterogeneous dimensions that are embedded into each other. This formulation is a consequence of geometric model reduction techniques that transform the original problems defined in complex three-dimensional domains into more tractable ones. The definition and the approximation of coupling operators suitable for this class of problems is still a challenge. We develop a general mathematical framework for the analysis and the approximation of partial differential equations coupled by non-matching constraints across different dimensions, focusing on their enforcement using Lagrange multipliers. In this context, we address in abstract and general terms the well-posedness, stability, and robustness of the problem with respect to the smallest characteristic length of the embedded domain. We also address the numerical approximation of the problem and we discuss the inf-sup stability of the proposed numerical scheme for some representative configuration of the embedded domain. The main message of this work is twofold: from the standpoint of the theory of mixed-dimensional problems, we provide general and abstract mathematical tools to formulate coupled problems across dimensions. From the practical standpoint of the numerical approximation, we show the interplay between the mesh characteristic size, the dimension of the Lagrange multiplier space, and the size of the inclusion in representative configurations interesting for applications. The latter analysis is complemented with illustrative numerical examples.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10600v1"
    ],
    "publication_venue": "41 pages, 11 Figures"
}