{
    "arxiv_id": "2303.08144",
    "paper_title": "Root bundles: Applications to F-theory Standard Models",
    "authors": [
        "Martin Bies"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2024-06-14"
    ],
    "latest_version": 1,
    "categories": [
        "hep-th",
        "math.AG"
    ],
    "abstract": "The study of vector-like spectra in 4-dimensional F-theory compactifications involves root bundles, which are important for understanding the Quadrillion F-theory Standard Models (F-theory QSMs) and their potential implications in physics. Recent studies focused on a superset of physical root bundles whose cohomologies encode the vector-like spectra for certain matter representations. It was found that more than 99.995\\% of the roots in this superset for the family $B_3( Δ_4^\\circ )$ of $\\mathcal{O}(10^{11})$ different F-theory QSM geometries had no vector-like exotics, indicating that this scenario is highly likely.\n  To study the vector-like spectra, the matter curves in the F-theory QSMs were analyzed. It was found that each of them can be deformed to nodal curve that is identical across all spaces in $B_3( Δ^\\circ )$. Therefore, from studying a few nodal curves, one can probe the vector-like spectra of a large fraction of F-theory QSMs. To this end, the cohomologies of all limit roots were determined, with line bundle cohomology on rational nodal curves playing a major role. A computer algorithm was used to enumerate all limit roots and analyze the global sections of all tree-like limit roots. For the remaining circuit-like limit roots, the global sections were manually determined. These results were organized into tables, which represent -- to the best knowledge of the author -- the first arithmetic steps towards Brill-Noether theory of limit roots.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08144v1"
    ],
    "publication_venue": "25 pages in preparation for \"String Math 2022 proceedings\"",
    "doi": "10.1090/pspum/107"
}