{
    "arxiv_id": "2303.08975",
    "paper_title": "Learning to Trace and Untangle Semi-planar Knots (TUSK)",
    "authors": [
        "Vainavi Viswanath",
        "Kaushik Shivakumar",
        "Jainil Ajmera",
        "Mallika Parulekar",
        "Justin Kerr",
        "Jeffrey Ichnowski",
        "Richard Cheng",
        "Thomas Kollar",
        "Ken Goldberg"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "cs.RO"
    ],
    "abstract": "This paper extends prior work on untangling long cables and presents TUSK (Tracing to Untangle Semi-planar Knots), a learned cable-tracing algorithm that resolves over-crossings and undercrossings to recognize the structure of knots and grasp points for untangling from a single RGB image. This work focuses on semi-planar knots, which are knots composed of crossings that each include at most 2 cable segments. We conduct experiments on long cables (3 m in length) with up to 15 semi-planar crossings across 6 different knot types. Crops of crossings from 3 knots (overhand, figure 8, and bowline) of the 6 are seen during training, but none of the full knots are seen during training. This is an improvement from prior work on long cables that can only untangle 2 knot types. Experiments find that in settings with multiple identical cables, TUSK can trace a single cable with 81% accuracy on 7 new knot types. In single-cable images, TUSK can trace and identify the correct knot with 77% success on 3 new knot types. We incorporate TUSK into a bimanual robot system and find that it successfully untangles 64% of cable configurations, including those with new knots unseen during training, across 3 levels of difficulty. Supplementary material, including an annotated dataset of 500 RGB-D images of a knotted cable along with ground-truth traces, can be found at https://sites.google.com/view/tusk-rss.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08975v1"
    ],
    "publication_venue": null
}