{
    "arxiv_id": "2303.11031",
    "paper_title": "Characterizing the ELG luminosity functions in the nearby Universe",
    "authors": [
        "G. Favole",
        "V. Gonzalez-Perez",
        "Y. Ascasibar",
        "P. Corcho-Caballero",
        "A. D. Montero-Dorta",
        "A. J. Benson",
        "J. Comparat",
        "S. A. Cora",
        "D. Croton",
        "H. Guo",
        "D. Izquierdo-Villalba",
        "A. Knebe",
        "Á. Orsi",
        "D. Stoppacher",
        "C. A. Vega-Martínez"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Nebular emission lines are powerful diagnostics for the physical processes at play in galaxy formation and evolution. Moreover, emission-line galaxies (ELGs) are one of the main targets of current and forthcoming spectroscopic cosmological surveys. We investigate the contributions to the line luminosity functions (LFs) of different galaxy populations in the local Universe, providing a benchmark for future surveys of earlier cosmic epochs. The large statistics of the observations from the SDSS DR7 Main galaxy sample and the MPA-JHU spectral catalogue enables us to precisely measure the H$α$, H$β$, [OII], [OIII], [NII], and [SII] emission-line LFs over ~2.4 Gyrs in the low-z Universe, 0.02<z<0.22. We present a generalised 1/Vmax LF estimator capable of simultaneously correcting for spectroscopic, r-band magnitude, and emission-line incompleteness. We study the contribution to the LF of different types of ELGs classified using two methods: (i) the specific star formation rate (sSFR), and (ii) the line ratios on the Baldwin-Phillips-Terlevich (BPT) and WHAN (i.e. H$α$ equivalent width versus the [NII]/H$α$ ratio) diagrams. The ELGs in our sample are mostly star forming, with 83.6 per cent having sSFR>10$^{-11}$/yr. When classifying ELGs using the BPT+WHAN diagrams, we find that 63 per cent are star forming, 1.5 are passively evolving, and 2.9 have nuclear activity (Seyfert). The rest are LINERs and composite ELGs. We find that a Saunders function is the most appropriate to describe all the emission-line LFs. They are dominated by star-forming regions, except for the bright end of the [OIII] and [NII] LFs (i.e. L[NII]>10$^{42}$ erg/s, L[OIII]>10$^{43}$ erg/s), where the contribution of Seyfert galaxies is not negligible. Besides the star-forming population, composite galaxies and LINERs are the ones that contribute the most to the ELG numbers at L<10$^{41}$ erg/s.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11031v1"
    ],
    "publication_venue": null
}