{
    "arxiv_id": "2303.12053",
    "paper_title": "Tomography Scan of Charge Density Wave in NbSe2",
    "authors": [
        "Jyun-Yu Wu",
        "Yung-Ting Lee",
        "Guan-Hao Chen",
        "Zheng-Hong Li",
        "Chang-Tsan Lee",
        "Jie-Yu Hsu",
        "Chia-Nung Kuo",
        "Juhn-Jong Lin",
        "Wen-Hao Chang",
        "Chin-Shan Lue",
        "Po-Tuan Cheng",
        "Cheng-Tien Chiang",
        "Chien-Cheng Kuo",
        "Chien-Te Wu",
        "Chi-Cheng Lee",
        "Ming-Chiang Chung",
        "Hung-Chung Hsueh",
        "Chun-Liang Lin"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph"
    ],
    "abstract": "Charge density wave (CDW) resulted from a small distortion in the lattice is able to create new orders beyond the original lattice. In 2H-NbSe2, one of the layered transition metal dichalcogenides (TMD), the 3x3 charge order appears in two-dimensional (2D) layers. Although CDW is usually described by a sine wave, the spatial distribution within a 2D layer has never been systematically visualized. Here by using scanning tunneling microscopy (STM) and density functional theory (DFT), we have monitored the evolution of 3x3 CDW along c-axis and realized a nearly tomography scan of CDW of the topmost layer. The results show that the strength of 3x3 charge order varies while increasing the tunneling current. The 3x3 charge order is relatively strong at the outermost Se level and decreases while probing in between Se and Nb levels. Interestingly, the 3x3 charge order gets strong again as reaching Nb level but along with a phase shift. We further calculated the orbital charge distributions and found that both CDW intensity modulation and phase shift are strongly correlated with the distribution of Se p orbitals and Nb d orbitals.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12053v1"
    ],
    "publication_venue": "12 pages, 4 figures"
}