{
    "arxiv_id": "2303.16295",
    "paper_title": "Self-consistent Models of Y Dwarf Atmospheres with Water Clouds and Disequilibrium Chemistry",
    "authors": [
        "Brianna Lacy",
        "Adam Burrows"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-06-14"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
    ],
    "abstract": "Y dwarfs are the coolest spectral class of brown dwarf. They have effective temperatures less than 500 K, with the coolest detection as low as ~250 K. Their spectra are shaped predominantly by gaseous water, methane, and ammonia. At the warmer end of the Y dwarf temperature range, spectral signatures of disequilibrium carbon monoxide have been observed. Cooler Y dwarfs could host water clouds in their atmospheres. Since they make up the low-mass tail of the star formation process, and are a valuable analogue to the atmospheres of giant gaseous exoplanets in a temperature range that is difficult to observe, understanding Y dwarf atmospheric compositions and processes will both deepen our understanding of planet and star formation, and provide a stepping stone towards characterizing cool exoplanets. JWST spectral observations are anticipated to provide an unprecedented level of detail for these objects, and yet published self-consistent model grids do not accurately replicate even the existing HST and ground-based observations. In this work, we present a new suite of 1-d radiative-convective equilibrium models to aid in the characterization of Y dwarf atmospheres and spectra. We compute clear, cloudy, equilibrium-chemistry and disequilibrium-chemistry models, providing a comprehensive suite of models in support of the impending JWST era of panchromatic Y dwarf characterization. Comparing these models against current observations, we find that disequilibrium CH4-CO and NH3-N2 chemistry and the presence of water clouds can bring models and observations into better, though still not complete, agreement.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16295v1"
    ],
    "publication_venue": "main text: 27 pages, 19 figures, 4 tables; appendix + references: 13 pages, 3 figures, 4 tables; model grid available on zenodo https://doi.org/10.5281/zenodo.7779180",
    "doi": "10.3847/1538-4357/acc8cb"
}