{
    "arxiv_id": "2303.12301",
    "paper_title": "Open-tunneled oxides as intercalation host for multivalent ion (Ca and Al) batteries: A DFT study",
    "authors": [
        "Joy Datta",
        "Nikhil Koratkar",
        "Dibakar Datta"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Lithium-ion batteries (LIBs) are ubiquitous in everyday applications. However, Lithium (Li) is a limited resource on the planet and is therefore not sustainable. As an alternative to lithium, earth-abundant and cheaper multivalent metals such as aluminum (Al) and calcium (Ca) have been actively researched in battery systems. However, finding suitable intercalation hosts for multivalent-ion batteries is urgently needed. Open-tunneled oxides are a particular category of microparticles distinguished by the presence of integrated one-dimensional channels or nanopores. This work focuses on two promising open-tunnel oxides, viz: Niobium Tungsten Oxide (NTO) and Molybdenum Vanadium Oxide (MoVO). We find that the MoVO structure can adsorb greater numbers of multivalent ions than NTO due to its larger surface area and different shapes. The MoVO structure can adsorb Ca, Li, and Al ions with adsorption potential at around 4 to 5 eV. However, the adsorption potential for hexagonal channels of Al ion drops to 1.73 eV because of less channel area. NTO structure has an insertion/adsorption potential of 4.4 eV, 3.4 eV, and 0.9 eV for one Li, Ca, and Al, respectively. In general, Ca ion is more adsorbable than Al ion in both MoVO and NTO structures. Bader charge analysis and charge density plot reveals the role of charge transfer and ion size on the insertion of multivalent ions such as Ca and Al into MoVO and NTO systems. Our results provide general guidelines to explore other multivalent ions for battery applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12301v1"
    ],
    "publication_venue": "19 pages, 8 figures"
}