{
    "arxiv_id": "2303.08195",
    "paper_title": "Relative In-flight Response of IBEX-Lo to Interstellar Neutral Helium Atoms",
    "authors": [
        "P. Swaczyna",
        "M. Bzowski",
        "S. A. Fuselier",
        "A. Galli",
        "J. Heerikhuisen",
        "M. A. Kubiak",
        "D. J. McComas",
        "E. Möbius",
        "F. Rahmanifard",
        "N. A. Schwadron"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-04-26"
    ],
    "latest_version": 1,
    "categories": [
        "physics.space-ph",
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "The IBEX-Lo instrument on the Interstellar Boundary Explorer (IBEX) mission measures interstellar neutral (ISN) helium atoms. The detection of helium atoms is made through negative hydrogen (H$^-$) ions sputtered by the helium atoms from the IBEX-Lo conversion surface. The energy spectrum of ions sputtered by ISN helium atoms is broad and overlaps the four lowest IBEX-Lo electrostatic analyzer (ESA) steps. Consequently, the energy response function for helium atoms does not correspond to the nominal energy step transmission. Moreover, laboratory calibration is incomplete because it is difficult to produce narrow-energy neutral atom beams that are expected for ISN helium atoms. Here, we analyze the ISN helium observations in ESA steps 1-4 to derive the relative in-flight response of IBEX-Lo to helium atoms. We compare the ratios of the observed count rates as a function of the mean ISN helium atom energy estimated using the Warsaw Test Particle Model (WTPM). The WTPM uses a global heliosphere model to calculate charge exchange gains and losses to estimate the secondary ISN helium population. We find that the modeled mean energies of ISN helium atoms, unlike their modeled fluxes, are not very sensitive to the very local interstellar medium parameters. The obtained relative responses supplement the laboratory calibration and enable more detailed quantitative studies of the ISN helium signal. A similar procedure that we applied to the IBEX-Lo observations may be used to complement laboratory calibration of the next-generation IMAP-Lo instrument on the Interstellar Mapping and Acceleration Probe (IMAP) mission.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08195v1"
    ],
    "publication_venue": "17 pages, 8 figures, 1 table, accepted for publication in ApJS",
    "doi": "10.3847/1538-4365/acc397"
}