{
    "arxiv_id": "2303.14614",
    "paper_title": "A Golden Decade of Polar Codes: From Basic Principle to 5G Applications",
    "authors": [
        "Kai Niu",
        "Ping Zhang",
        "Jincheng Dai",
        "Zhongwei Si",
        "Chao Dong"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.IT"
    ],
    "abstract": "After the pursuit of seventy years, the invention of polar codes indicates that we have found the first capacity-achieving coding with low complexity construction and decoding, which is the great breakthrough of the coding theory in the past two decades. In this survey, we retrospect the history of polar codes and summarize the advancement in the past ten years. First, the primary principle of channel polarization is investigated such that the basic construction, coding method, and classic successive cancellation (SC) decoding are reviewed. Second, in order to improve the performance of the finite code length, we introduce the guiding principle and conclude five design criteria for the construction, design, and implementation of the polar code in the practical communication system based on the exemplar schemes in the literature. Especially, we explain the design principle behind the concatenated coding and rate matching of polar codes in a 5G wireless system. Furthermore, the improved SC decoding algorithms, such as SC list (SCL) decoding and SC stack (SCS) decoding, etc., are investigated and compared. Finally, the research prospects of polar codes for the future 6G communication system are explored, including the optimization of short polar codes, coding construction in fading channels, polar coded modulation and HARQ, and the polar coded transmission, namely polar processing. Predictably, as a new coding methodology, polar codes will shine a light on communication theory and unveil a revolution in transmission technology.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14614v1"
    ],
    "publication_venue": "29 pages, 21 figures, Published in China Communications",
    "doi": "10.23919/JCC.2023.02.015"
}