{
    "arxiv_id": "2303.09073",
    "paper_title": "Combined Machine Learning and Physics-Based Forecaster for Intra-day and 1-Week Ahead Solar Irradiance Forecasting Under Variable Weather Conditions",
    "authors": [
        "Hugo Riggs",
        "Shahid Tufail",
        "Mohd Tariq",
        "Arif Sarwat"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY"
    ],
    "abstract": "Power systems engineers are actively developing larger power plants out of photovoltaics imposing some major challenges which include its intermittent power generation and its poor dispatchability. The issue is that PV is a variable generation source unless additional planning and system additions for mitigation of generation intermittencies. One underlying factor that can enhance the applications around mitigating distributed energy resource intermittency challenges is forecasting the generation output. This is challenging especially with renewable energy sources which are weather dependent as due to the random nature of weather variance. This work puts forth a forecasting model which uses the solar variables to produce a PV generation forecast and evaluates a set of machine learning models for this task. In this paper, a forecaster for irradiance prediction for intra-day is proposed. This forecaster is capable of forecasting 15 minutes and hourly irradiance up to one week ahead. The paper performed a correlation and sensitivity analysis of the strength of the relationship between local weather parameters and system generation. In this study performance of SVM, CART, ANN, and Ensemble learning were analyzed for the prediction of 15-minute intraday and day-ahead irradiance. The results show that SVM and Ensemble learning yielded the lowest MAE for 15-minute intraday and day-ahead irradiance, respectively.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09073v1"
    ],
    "publication_venue": null
}