{
    "arxiv_id": "2303.08499",
    "paper_title": "Dynamical evolution of basaltic asteroids outside the Vesta family in the inner main belt",
    "authors": [
        "Volodymyr Troianskyi",
        "Pawel Kankiewicz",
        "Dagmara Oszkiewicz"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Basaltic V-type asteroids are leftovers from the formation and evolution of differentiated planetesimals. They are thought to originate from mantles and crusts of multiple different parent bodies. Identifying the links between individual V-type asteroids and multiple planetesimals is challenging, especially in the inner part of the main asteroid belt, where the majority of V-type asteroids are expected to have originated from a single planetesimal, namely, (4) Vesta.\n  In this work, we aim to trace the origin of a number of individual V-type asteroids from the inner part of the main asteroid belt. The main goal is to identify asteroids that may not be traced back to (4) Vesta and may therefore originate from other differentiated planetesimals.\n  We performed a 2 Gy backward numerical integration of the orbits of the selected V-type asteroids. For each asteroid, we used 1001 clones to map the effect of orbital uncertainties. In the integration, we use information on physical properties of the considered V-type asteroids such as pole orientation, rotational period, and thermal parameters.\n  The majority of V-types in the inner main belt outside the Vesta family are clearly Vesta fugitives. Two objects, namely, (3307) Athabasca and (17028) 1999 FJ$_{5}$, show no clear dynamical link to (4) Vesta. Together with (809) Lundia (from our previous work), these objects could represent the parent bodies of anomalous HED meteorites such as the Banbura Rockhole. Furthermore, some objects of the low-inclination population cannot be traced back to (4) Vesta within the 2 Gy integration.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08499v1"
    ],
    "publication_venue": null,
    "doi": "10.1051/0004-6361/202245678"
}