{
    "arxiv_id": "2303.13467",
    "paper_title": "Probing C-I Bond Fission in the UV Photochemistry of 2-Iodothiophene with Core-to-Valence Transient Absorption Spectroscopy",
    "authors": [
        "Benjamin W. Toulson",
        "Diptarka Hait",
        "Davide Faccialà",
        "Daniel M. Neumark",
        "Stephen R. Leone",
        "Martin Head-Gordon",
        "Oliver Gessner"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph"
    ],
    "abstract": "The UV photochemistry of small heteroaromatic molecules serves as a testbed for understanding fundamental photoinduced transformations in moderately complex compounds, including isomerization, ring-opening, and molecular dissociation. Here, a combined experimental-theoretical study of 268 nm UV light-induced dynamics in 2-iodothiophene (C$_4$H$_3$IS) is performed. The dynamics are experimentally monitored with a femtosecond XUV probe pulse that measures iodine N-edge 4d core-to-valence transitions. Experiments are complemented by density functional theory calculations of both the pump-pulse induced valence excitations as well as the XUV probe-induced core-to-valence transitions. Possible intramolecular relaxation dynamics are investigated by ab initio molecular dynamics simulations. Gradual absorption changes up to ~0.5-1 ps after excitation are observed for both the parent molecular species and emerging iodine fragments, with the latter appearing with a characteristic rise time of 160$\\pm$30 fs. Comparison of spectral intensities and energies with the calculations identify an iodine dissociation pathway initiated by a predominant $π\\toπ^*$ excitation. In contrast, initial excitation to a nearby n$_\\perp\\toσ^*$ excited state appears unlikely based on a significantly smaller oscillator strength and the absence of any corresponding XUV absorption signatures. Excitation to the $π\\toπ^*$ state is followed by contraction of the C-I bond, enabling a nonadiabatic transition to a dissociative $π\\toσ_\\textrm{C-I}^*$ state. For the subsequent fragmentation, a narrow bond-length region along the C-I stretch coordinate between 260 and 280 pm is identified, where the transition between the parent molecule and the thienyl radical + iodine atom products becomes prominent in the XUV spectrum due to rapid localization of two singly-occupied molecular orbitals on the two fragments.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13467v1"
    ],
    "publication_venue": null
}