{
    "arxiv_id": "2303.17143",
    "paper_title": "Orientation of Finite Reynolds Number Anisotropic Particles Settling in Turbulence",
    "authors": [
        "Anubhab Roy",
        "Stefan Kramel",
        "Udayshankar Menon",
        "Greg A. Voth",
        "Donald L. Koch"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "We present experimental and computational results for the orientation distributions of slender fibers and ramified particles settling in an isotropic turbulent flow. The rotational dynamics of the particles is modeled using a slender-body theory that includes the inertial torque due to sedimentation that tends to rotate the particles toward a broadside orientation. The particles are assumed to rotate due to viscous forces associated with the turbulent velocity gradients occurring on the particle length scale. In the simulations, the turbulence is obtained from a stochastic model of the velocity gradient in a Lagrangian reference frame. In the experiments, the turbulence is generated by active jets in a vertical water tunnel. It is well known that axisymmetric particles rotate according to Jeffery's solution for the rotation of a spheroidal particle if one adopts an appropriate effective aspect ratio. We show that the same result applies to a ramified particle consisting of three coplanar fibers connected with equal angles at a central point which rotates like a thin oblate spheroid. The orientation statistics can be quantified with a single non-dimensional parameter, the settling factor $S_F$, defined as the ratio of rotations due to sedimentation and turbulent shear. For low values of $S_F$, we observe nearly isotropically oriented particles, whereas particles become strongly aligned near the horizontal plane for high values of $S_F$. The variance of the angle away from horizontal scales as $S_F^{-2}$ for $S_F \\gg 1$, but the orientation distribution is non-Gaussian due to turbulent intermittency in this limit.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17143v1"
    ],
    "publication_venue": "58 pages, 16 figures, 4 tables"
}