{
    "arxiv_id": "2303.14142",
    "paper_title": "Early phases of the Galaxy from the chemical imprint on the iron-poor stars J0815+4729 and J0023+0307",
    "authors": [
        "Jonay I. González Hernández",
        "David S. Aguado",
        "Carlos Allende-Prieto",
        "Adam Burgasser",
        "Rafael Rebolo"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "We have been exploring large spectroscopic databases such as SDSS to search for unique stars with extremely low iron content with the goal of extracting detailed information from the early phases of the Galaxy. We recently identified two extremely iron-poor dwarf stars J0815+4729 (Aguado et al. 2018a) and J0023+0307 (Aguado et al. 2018b) from SDSS/BOSS database and confirmed from high-quality spectra taken with ISIS and OSIRIS spectrographs at the 4.2m WHT and 10.4m GTC telescopes, respectively, located in La Palma (Canary Islands, Spain). We have also acquired high-resolution spectroscopy with UVES at 8.2m VLT telescope (Paranal, ESO, Chile) and HIRES at the 10m KeckI telescope (Mauna Kea, Hawaii, USA), uncovering the unique abundance pattern of these stars, that reveal e.g. the extreme CNO abundances in J0815+4729 with ratios [X/Fe]~$> 4$ (González Hernández et al. 2020). In addition, we are able to detect Li at the level of the lithium plateau in J0023+0307 (Aguado et al. 2019a), whereas we are only able to give a Li upper-limit 0.7 dex below the lithium plateau in J0815+4729, thus adding more complexity to the cosmological lithium problem. New upcoming surveys such as WEAVE, 4MOST and DESI will likely allow us to discover new interesting extremely iron-poor stars, that will certainly contribute to our understanding of the Early Galaxy, and the properties of the first stars and the first supernovae.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14142v1"
    ],
    "publication_venue": "Accepted for publication in Memorie della Società Astronomica Italiana"
}