{
    "arxiv_id": "2303.14070",
    "paper_title": "ChatDoctor: A Medical Chat Model Fine-tuned on LLaMA Model using Medical Domain Knowledge",
    "authors": [
        "Yunxiang Li",
        "Zihan Li",
        "Kai Zhang",
        "Ruilong Dan",
        "You Zhang"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-04-20"
    ],
    "latest_version": 4,
    "categories": [
        "cs.CL"
    ],
    "abstract": "Recent large language models (LLMs) in the general domain, such as ChatGPT, have shown remarkable success in following instructions and producing human-like responses. However, such language models have yet to be adapted for the medical domain, resulting in poor accuracy of responses and an inability to provide sound advice on medical diagnoses, medications, etc. To address this problem, we fine-tuned our ChatDoctor model based on 100k real-world patient-physician conversations from an online medical consultation site. Besides, we add autonomous knowledge retrieval capabilities to our ChatDoctor, for example, Wikipedia or a disease database as a knowledge brain. By fine-tuning the LLMs using these 100k patient-physician conversations, our model showed significant improvements in understanding patients' needs and providing informed advice. The autonomous ChatDoctor model based on Wikipedia and Database Brain can access real-time and authoritative information and answer patient questions based on this information, significantly improving the accuracy of the model's responses, which shows extraordinary potential for the medical field with a low tolerance for error. To facilitate the further development of dialogue models in the medical field, we make available all source code, datasets, and model weights available at: https://github.com/Kent0n-Li/ChatDoctor.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14070v1",
        "http://arxiv.org/pdf/2303.14070v2",
        "http://arxiv.org/pdf/2303.14070v3",
        "http://arxiv.org/pdf/2303.14070v4"
    ],
    "publication_venue": null
}