{
    "arxiv_id": "2303.14180",
    "paper_title": "On-the-fly precision spectroscopy with a dual-modulated tunable diode laser and Hz-level referencing to a cavity",
    "authors": [
        "Shuangyou Zhang",
        "Toby Bi",
        "Pascal Del'Haye"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics",
        "physics.ins-det"
    ],
    "abstract": "Advances in high-resolution laser spectroscopy have enabled many scientific breakthroughs in physics, chemistry, biology and astronomy. Optical frequency combs have pushed measurement limits with ultrahigh-frequency accuracy and fast-measurement speed while tunable diode laser spectroscopy is used in scenarios that require high power and continuous spectral coverage. Despite these advantages of tunable diode laser spectroscopy, it is challenging to precisely determine the instantaneous frequency of the laser because of fluctuations in the scan speed. Here we demonstrate a simple spectroscopy scheme with a frequency modulated diode laser that references the diode laser on-the-fly to a fiber cavity with sub-15 Hz frequency precision over an 11-THz range at a measurement speed of 1 THz/s. This is an improvement of more than two orders of magnitude compared to existing diode laser spectroscopy methods. Our scheme provides precise frequency calibration markers while simultaneously tracking the instantaneous scan speed of the laser. We demonstrate several applications, including dispersion measurement of an ultra-high-Q microresonator and spectroscopy of an HF gas cell, which can be used for absolute frequency referencing of the tunable diode laser. The simplicity, robustness and low costs of this spectroscopy scheme could prove extremely valuable for out-of-the-lab applications like LIDAR, gas spectroscopy and environmental monitoring.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14180v1"
    ],
    "publication_venue": null
}