{
    "arxiv_id": "2303.09459",
    "paper_title": "Books, Hallways and Social Butterflies: A Note on Sliding Block Puzzles",
    "authors": [
        "Florestan Brunck",
        "Matthew Kwan"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-06-19"
    ],
    "latest_version": 2,
    "categories": [
        "math.CO"
    ],
    "abstract": "Recall the classical 15-puzzle, consisting of 15 sliding blocks in a $4\\times 4$ grid. Famously, the configuration space of this puzzle consists of two connected components, corresponding to the odd and even permutations of the symmetric group $S_{15}$. In 1974, Wilson generalised sliding block puzzles beyond the $4\\times 4$ grid to arbitrary graphs (considering $n-1$ sliding blocks on a graph with $n$ vertices), and characterised the graphs for which the corresponding configuration space is connected.\n  In this work, we extend Wilson's characterisation to sliding block puzzles with an arbitrary number of blocks (potentially leaving more than one empty vertex). For any graph, we determine how many empty vertices are necessary to connect the corresponding configuration space, and more generally we provide an algorithm to determine whether any two configurations are connected. Our work may also be interpreted within the framework of \"Friends and Strangers graphs\", where empty vertices correspond to \"social butterflies\" and sliding blocks to \"asocial\" people.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09459v1",
        "http://arxiv.org/pdf/2303.09459v2"
    ],
    "publication_venue": "Since posting our preprint, we were made aware that our main theorem has previously appeared in the literature. Specifically, this result (in different language) is claimed without proof in a paper of Kornhauser, Miller and Spirakis, appearing in the conference proceedings of FOCS'84 (there are connections to memory management in distributed systems). The proof can be found in Kornhauser's thesis"
}