{
    "arxiv_id": "2303.12259",
    "paper_title": "Brain-inspired bodily self-perception model that replicates the rubber hand illusion",
    "authors": [
        "Yuxuan Zhao",
        "Enmeng Lu",
        "Yi Zeng"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 2,
    "categories": [
        "q-bio.NC",
        "cs.AI"
    ],
    "abstract": "At the core of bodily self-consciousness is the perception of the ownership of one's body. Recent efforts to gain a deeper understanding of the mechanisms behind the brain's encoding of the self-body have led to various attempts to develop a unified theoretical framework to explain related behavioral and neurophysiological phenomena. A central question to be explained is how body illusions such as the rubber hand illusion actually occur. Despite the conceptual descriptions of the mechanisms of bodily self-consciousness and the possible relevant brain areas, the existing theoretical models still lack an explanation of the computational mechanisms by which the brain encodes the perception of one's body and how our subjectively perceived body illusions can be generated by neural networks. Here we integrate the biological findings of bodily self-consciousness to propose a Brain-inspired bodily self-perception model, by which perceptions of bodily self can be autonomously constructed without any supervision signals. We successfully validated our computational model with six rubber hand illusion experiments on platforms including a iCub humanoid robot and simulated environments. The experimental results show that our model can not only well replicate the behavioral and neural data of monkeys in biological experiments, but also reasonably explain the causes and results of the rubber hand illusion from the neuronal level due to advantages in biological interpretability, thus contributing to the revealing of the computational and neural mechanisms underlying the occurrence of the rubber hand illusion.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12259v1",
        "http://arxiv.org/pdf/2303.12259v2"
    ],
    "publication_venue": "32 pages, 10 figures and 1 table"
}