{
    "arxiv_id": "2303.14523",
    "paper_title": "OpenSCV: An Open Hierarchical Taxonomy for Smart Contract Vulnerabilities",
    "authors": [
        "Fernando Richter Vidal",
        "Naghmeh Ivaki",
        "Nuno Laranjeiro"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-04-10"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CR",
        "cs.SE"
    ],
    "abstract": "Smart contracts are nowadays at the core of most blockchain systems, as they specify and allow an agreement between entities that wish to perform a transaction. As any computer program, smart contracts are subject to the presence of residual faults, including severe security vulnerabilities, which require that the vulnerable contract is terminated in the blockchain. In this context, research began to be developed to prevent the deployment of smart contract holding vulnerabilities, mostly in the form of vulnerability detection tools. Along with these efforts, several and heterogeneous vulnerability classification schemes arised (e.g., most notably DASP and SWC). At the time of writing, these are mostly outdated initiatives, despite the fact that smart contract vulnerabilities are continuously being discovered and the associated rich information being mostly disregarded. In this paper, we propose OpenSCV, a new and Open hierarchical taxonomy for Smart Contract Vulnerabilities, which is open to community contributions and matches the current state of the practice, while being prepared to handle future modifications and evolution. The taxonomy was built based on the analysis of research on vulnerability classification, community-maintained classification schemes, and research on smart contract vulnerability detection. We show how OpenSCV covers the announced detection ability of current vulnerability detection tools, and highlight its usefulness as a resource in smart contract vulnerability research.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14523v1"
    ],
    "publication_venue": null
}