{
    "arxiv_id": "2303.09326",
    "paper_title": "4D-Printing of Smart, Nacre-Inspired, Organic-Ceramic Composites",
    "authors": [
        "Benedikt F. Winhard",
        "Philipp Haida",
        "Alexander Plunkett",
        "Julian Katz",
        "Berta Domènech",
        "Volker Abetz",
        "Kaline P. Furlan",
        "Gerold A. Schneider"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "cond-mat.soft"
    ],
    "abstract": "Additive manufacturing of shape memory polymers has gained tremendous interest in recent years due to their versatile potential applications in various industries, such as biomedicine and aerospace. However, the polymers' mechanical properties, specifically stiffness and strength, often hinder their use in mechanically demanding applications, e.g. as structural materials. In this work we produced nacre-inspired composites with a covalent adaptable network, which enables fast and mechanically lossless self-healing, reshaping, and shape memory capabilities. We demonstrate a novel direct write 4D-printing strategy to print smart, nacre-inspired, organic-ceramic composites based on alumina platelets and vitrimers with up to 3.3 and 26.7 times higher tensile strength and stiffness, respectively, in comparison to the pristine vitrimer. To the best of our knowledge, we introduce for the first time a single step 4D-printing process for nacre-inspired composites, that exploits suspension spreading to align micron sized alumina platelets along a common plane, and which utilizes solvent evaporation to induce polycondensation of the monomers resulting in a vinylogous urethane vitrimer after extrusion of the suspension. This work presents a facile, direct write 4D-printing strategy at ambient printing conditions, establishing a foundation for adaptive additive manufacturing of smart organic-ceramic composites of interest to various industries.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09326v1"
    ],
    "publication_venue": null
}