{
    "arxiv_id": "2303.11414",
    "paper_title": "Cost of Implementation of Basel III reforms in Bangladesh -- A Panel data analysis",
    "authors": [
        "Dipti Rani Hazra",
        "Md. Shah Naoaj",
        "Mohammed Mahinur Alam",
        "Abdul Kader"
    ],
    "submission_date": "2023-03-11",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "q-fin.RM"
    ],
    "abstract": "Inspired by the recent debate on the macroeconomic implications of the new bank regulatory standards known as Basel III, we tried to find out in this study that the impact of Basel III liquidity and capital requirements in Bangladesh proposed by Basel Committee on Banking Supervision (BCBS, 2010a). A small set of macro variables, using a sample of 22 private commercial banks operating in Bangladesh for the period of 2010-2014, are used to estimate long-run relationships among the variables. The macroeconomic variables are included The profitability of banks, GDP, banks' lending to private sector, Net Stable Funding Ratio, Tier 1 capital Ratio, Interest rate spread, real interest rate. The cost is quantified using Driscoll and Kraay panel data models with fixed effect. Impact of higher capital and liquidity requirement on Interest rate spread and lending to private sector of banks were considered as the cost to the economy as a whole whereas impact of higher capital and liquidity requirement on profitability of banks(ROE) was considered as the cost of banks. Here it is found that, the interest rate level is positively affected by the tighter liquidity and capital requirements which driven toward lessen of the private sector lending of banks. The return on equity of banks varies negatively with the liquidity and capital. The economic costs are considerably below the estimated positive benefit that the reform should have by reducing the probability of banking crises and the associated banking losses (BCBS, 2010b).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11414v1"
    ],
    "publication_venue": "13 pages"
}