{
    "arxiv_id": "2303.17605",
    "paper_title": "SparseViT: Revisiting Activation Sparsity for Efficient High-Resolution Vision Transformer",
    "authors": [
        "Xuanyao Chen",
        "Zhijian Liu",
        "Haotian Tang",
        "Li Yi",
        "Hang Zhao",
        "Song Han"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV"
    ],
    "abstract": "High-resolution images enable neural networks to learn richer visual representations. However, this improved performance comes at the cost of growing computational complexity, hindering their usage in latency-sensitive applications. As not all pixels are equal, skipping computations for less-important regions offers a simple and effective measure to reduce the computation. This, however, is hard to be translated into actual speedup for CNNs since it breaks the regularity of the dense convolution workload. In this paper, we introduce SparseViT that revisits activation sparsity for recent window-based vision transformers (ViTs). As window attentions are naturally batched over blocks, actual speedup with window activation pruning becomes possible: i.e., ~50% latency reduction with 60% sparsity. Different layers should be assigned with different pruning ratios due to their diverse sensitivities and computational costs. We introduce sparsity-aware adaptation and apply the evolutionary search to efficiently find the optimal layerwise sparsity configuration within the vast search space. SparseViT achieves speedups of 1.5x, 1.4x, and 1.3x compared to its dense counterpart in monocular 3D object detection, 2D instance segmentation, and 2D semantic segmentation, respectively, with negligible to no loss of accuracy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17605v1"
    ],
    "publication_venue": "CVPR 2023. The first two authors contributed equally to this work. Project page: https://sparsevit.mit.edu"
}