{
    "arxiv_id": "2303.16651",
    "paper_title": "Traffic flow clustering framework using drone video trajectories to identify surrogate safety measures",
    "authors": [
        "Shengxuan Ding",
        "Mohamed Abdel-Aty",
        "Ou Zheng",
        "Zijin Wang",
        "Dongdong Wang"
    ],
    "submission_date": "2023-03-10",
    "revised_dates": [
        "2023-07-06"
    ],
    "latest_version": 3,
    "categories": [
        "physics.soc-ph"
    ],
    "abstract": "Traffic conflict indicators are essential for evaluating traffic safety and analyzing trajectory data, especially in the absence of crash data. Previous studies have used traffic conflict indicators to predict and identify conflicts, including time-to-collision (TTC), proportion of stopping distance (PSD), and deceleration rate to avoid a crash (DRAC). However, limited research is conducted to understand how to set thresholds for these indicators while accounting for traffic flow characteristics at different traffic states. This paper proposes a clustering framework for determining surrogate safety measures (SSM) thresholds and identifying traffic conflicts in different traffic states using high-resolution trajectory data from the Citysim dataset. In this study, unsupervised clustering is employed to identify different traffic states and their transitions under a three-phase theory framework. The resulting clusters can then be utilized in conjunction with surrogate safety measures (SSM) to identify traffic conflicts and assess safety performance in each traffic state. From different perspectives of time, space, and deceleration, we chose three compatible conflict indicators: TTC, DRAC, and PSD, considering functional differences and empirical correlations of different SSMs. A total of three models were chosen by learning these indicators to identify traffic conflict and non-conflict clusters. It is observed that Mclust outperforms the other two. The results show that the distribution of traffic conflicts varies significantly across traffic states. A wide moving jam (J) is found to be the phase with largest amount of conflicts, followed by synchronized flow phase (S) and free flow phase(F). Meanwhile, conflict risk and thresholds exhibit similar levels across transitional states.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16651v1",
        "http://arxiv.org/pdf/2303.16651v2",
        "http://arxiv.org/pdf/2303.16651v3"
    ],
    "publication_venue": null
}