{
    "arxiv_id": "2303.15442",
    "paper_title": "The Need For Speed: Rapid Refitting Techniques for Bayesian Spectral Characterization of the Gravitational Wave Background Using PTAs",
    "authors": [
        "William G. Lamb",
        "Stephen R. Taylor",
        "Rutger van Haasteren"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.IM",
        "gr-qc"
    ],
    "abstract": "Current pulsar timing array (PTA) techniques for characterizing the spectrum of a nanohertz-frequency stochastic gravitational-wave background (SGWB) begin at the stage of timing data. This can be slow and memory intensive with computational scaling that will worsen PTA analysis times as more pulsars and observations are added. Given recent evidence for a common-spectrum process in PTA data sets and the need to understand present and future PTA capabilities to characterize the SGWB through large-scale simulations, we have developed efficient and rapid approaches that operate on intermediate SGWB analysis products. These methods refit SGWB spectral models to previously-computed Bayesian posterior estimations of the timing power spectra. We test our new methods on simulated PTA data sets and the NANOGrav $12.5$-year data set, where in the latter our refit posterior achieves a Hellinger distance from the current full production-level pipeline that is $\\lesssim 0.1$. Our methods are $\\sim10^2$--$10^4$ times faster than the production-level likelihood and scale sub-linearly as a PTA is expanded with new pulsars or observations. Our methods also demonstrate that SGWB spectral characterization in PTA data sets is driven by the longest-timed pulsars with the best-measured power spectral densities which is not necessarily the case for SGWB detection that is predicated on correlating many pulsars. Indeed, the common-process spectral properties found in the NANOGrav $12.5$-year data set are given by analyzing only the $\\sim10$ longest-timed pulsars out of the full $45$ pulsar array, and we find that the ``shallowing'' of the common-process power-law model occurs when gravitational-wave frequencies higher than $\\sim 50$~nanohertz are included. The implementation of our methods is openly available as a software suite to allow fast and flexible PTA SGWB spectral characterization and model selection.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15442v1",
        "http://arxiv.org/pdf/2303.15442v2"
    ],
    "publication_venue": "19 pages, 12 figures. Submitting to Physical Review D; eq.10 corrected, latex env fix"
}