{
    "arxiv_id": "2303.09783",
    "paper_title": "WIYN Open Cluster Study 89. M48 (NGC 2548) 2: Lithium Abundances in the 420 Myr Open Cluster M48 From Giants Through K Dwarfs",
    "authors": [
        "Qinghui Sun",
        "Constantine P. Deliyannis",
        "Aaron Steinhauer",
        "Barbara J. Anthony-Twarog",
        "Bruce A. Twarog"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "We consider WIYN/Hydra spectra of 329 photometric candidate members of the 420-Myr-old open cluster M48, and report Lithium detections or upper limits for 234 members and likely members. The 171 single members define a number of notable Li-mass trends, some delineated even more clearly than in Hyades/Praesepe: The giants are consistent with subgiant Li dilution and prior MS Li depletion due to rotational mixing. A dwarfs (8600-7700K) have upper limits higher than the presumed initial cluster Li abundance. Two of five late A dwarfs (7700- 7200K) are Li-rich, possibly due to diffusion, planetesimal accretion, and/or engulfment of hydrogen-poor planets. Early F dwarfs already show evidence of Li depletion seen in older clusters. The Li-$T_{\\rm eff}$ trends of the Li Dip (6675-6200K), Li Plateau (6200-6000K), and G and K dwarfs (6000-4000K) are very clearly delineated and are intermediate to those of the 120-Myr-old Pleiades and 650-Myr-old Hyades/Praesepe, which suggests a sequence of Li depletion with age. The cool side of the Li Dip is especially well-defined with little scatter. The Li-$T_{\\rm eff}$ trend is very tight in the Li Plateau and early G dwarfs, but scatter increases gradually for cooler dwarfs. These patterns support and constrain models of the universally dominant Li depletion mechanism for FGK dwarfs, namely rotational mixing due to angular momentum loss; we discuss how diffusion and gravity-wave driven mixing may also play roles. For late-G/K dwarfs, faster rotators show higher Li than slower rotators, and we discuss possible connections between angular momentum loss and Li depletion.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09783v1",
        "http://arxiv.org/pdf/2303.09783v2"
    ],
    "publication_venue": "29 pages, 10 figures, 5 tables, accepted for publication in the Astrophysical Journal"
}