{
    "arxiv_id": "2303.14016",
    "paper_title": "The GALAH survey: New diffuse interstellar bands found in residuals of 872,000 stellar spectra",
    "authors": [
        "Rok Vogrinčič",
        "Janez Kos",
        "Tomaž Zwitter",
        "Gregor Traven",
        "Kevin L. Beeson",
        "Klemen Čotar",
        "Ulisse Munari",
        "Sven Buder",
        "Sarah L. Martell",
        "Geraint F. Lewis",
        "Gayandhi M De Silva",
        "Michael R. Hayden",
        "Joss Bland-Hawthorn",
        "Valentina D'Orazi"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.IM",
        "astro-ph.SR"
    ],
    "abstract": "We use more than 872,000 mid-to-high resolution (R $\\sim$ 20,000) spectra of stars from the GALAH survey to discern the spectra of diffuse interstellar bands (DIBs). We use four windows with the wavelength range from 4718 to 4903, 5649 to 5873, 6481 to 6739, and 7590 to 7890 Å, giving a total coverage of 967 Å. We produce $\\sim$400,000 spectra of interstellar medium (ISM) absorption features and correct them for radial velocities of the DIB clouds. Ultimately, we combine the 33,115 best ISM spectra into six reddening bins with a range of $0.1 \\,\\mathrm{mag} < E\\mathrm{(B-V)} < 0.7\\, \\mathrm{mag}$. A total of 183 absorption features in these spectra qualify as DIBs, their fitted model parameters are summarized in a detailed catalogue. From these, 64 are not reported in the literature, among these 17 are certain, 14 are probable and 33 are possible. We find that the broad DIBs can be fitted with a multitude of narrower DIBs. Finally, we create a synthetic DIB spectrum at unit reddening which should allow us to narrow down the possible carriers of DIBs and explore the composition of the ISM and ultimately better model dust and star formation as well as to correct Galactic and extragalactic observations. The majority of certain DIBs show a significant excess of equivalent width when compared to reddening. We explain this with observed lines of sight penetrating more uniform DIB clouds compared to clumpy dust clouds.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14016v1"
    ],
    "publication_venue": "28 pages, 15 figures, 11 tables, accepted for publication in MNRAS"
}