{
    "arxiv_id": "2303.16338",
    "paper_title": "Determining electron column density fluctuations in a dominant scattering region using pulsar scintillation",
    "authors": [
        "Daniel J. Reardon",
        "William A. Coles"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
    ],
    "abstract": "Density fluctuations in the ionised interstellar medium have a profound effect on radio pulsar observations, through angular scattering, intensity scintillations, and small changes in time delays from dispersion. Here we show that it is possible to recover the variations in dispersive delays that originate from a dominant scattering region using measurements of the dynamic spectrum of intensity scintillations, provided that the pulsar velocity and scattering region location are known. We provide a theoretical framework for the technique, which involves estimating the phase gradient from the dynamic spectra and integrating that gradient to obtain phase variations. It can be used to search for \"extreme scattering events\" (ESEs) in pulsars for which precision dispersion delay measurements are not otherwise possible, or to separate true dispersion variations from apparent variability caused by frequency-dependent pulse shape changes. We demonstrate that it works in practice by recovering an ESE in PSR J1603$-$7202, which is known from precision dispersion delay measurements from pulsar timing. For this pulsar, we find that the phase gradients also track the long-term variations in electron column density observed by pulsar timing, indicating that the column density variations and the scattering are dominated by the same thin scattering screen. We identify a sudden increase in the scintillation strength and magnitude of phase gradients over $\\sim$days in 2010, indicating a compact structure. A decrease in the electron density in 2012 was associated with persistent phase gradients and preceded a period of decreased scintillation strength and an absence of scintillation arcs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16338v1"
    ],
    "publication_venue": "9 pages, 7 figures, Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad962"
}