{
    "arxiv_id": "2303.17384",
    "paper_title": "Thermal instability as a constraint for warm X-ray corona in AGN",
    "authors": [
        "Dominik Gronkiewicz",
        "Agata Różańska",
        "Pierre-Olivier Petrucci",
        "Renaud Belmont"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-07-26"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Context. Warm corona is a possible explanation for Soft X-ray Excess in Active Galactic Nuclei (AGN). This paper contains self consistent modeling of both: accretion disk with optically thick corona, where the gas is heated by magneto-rotational instability dynamo (MRI), and cooled by radiation which undergoes free-free absorption and Compton scattering. Aims. We determine the parameters of warm corona in AGN using disk-corona structure model that takes into account magnetic and radiation pressure. We aim to show the role of thermal instability (TI) as a constraint for warm, optically thick X-ray corona in AGN. Methods. With the use of relaxation code, the vertical solution of the disk driven by MRI together with radiative transfer in hydrostatic and radiative equilibrium is calculated, which allows us to point out how TI affects the corona for wide range of global parameters. Results. We show that magnetic heating is strong enough to heat upper layers of the accretion disk atmosphere, which form the warm corona covering the disk. Magnetic pressure does not remove TI caused by radiative processes operating in X-ray emitting plasma. TI disappears only in case of accretion rates higher than 0.2 of Eddington, and high magnetic field parameter $α_{\\rm B}$ > 0.1. Conclusions. TI plays the major role in the formation of the warm corona above magnetically driven accretion disk in AGN. The warm, Compton cooled corona, responsible for soft X-ray excess, resulted from our model has typical temperature in the range of 0.01 - 2 keV and optical depth even up to 50, which agrees with recent observations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17384v1"
    ],
    "publication_venue": null,
    "doi": "10.1051/0004-6361/202244410"
}