{
    "arxiv_id": "2303.07953",
    "paper_title": "Optimal Study Designs for Cluster Randomised Trials: An Overview of Methods and Results",
    "authors": [
        "Samuel I. Watson",
        "Alan Girling",
        "Karla Hemming"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [],
    "latest_version": 1,
    "categories": [
        "stat.ME",
        "stat.AP"
    ],
    "abstract": "There are multiple cluster randomised trial designs that vary in when the\nclusters cross between control and intervention states, when observations are\nmade within clusters, and how many observations are made at that time point.\nIdentifying the most efficient study design is complex though, owing to the\ncorrelation between observations within clusters and over time. In this\narticle, we present a review of statistical and computational methods for\nidentifying optimal cluster randomised trial designs. We also adapt methods\nfrom the experimental design literature for experimental designs with\ncorrelated observations to the cluster trial context. We identify three broad\nclasses of methods: using exact formulae for the treatment effect estimator\nvariance for specific models to derive algorithms or weights for cluster\nsequences; generalised methods for estimating weights for experimental units;\nand, combinatorial optimisation algorithms to select an optimal subset of\nexperimental units. We also discuss methods for rounding weights to whole\nnumbers of clusters and extensions to non-Gaussian models. We present results\nfrom multiple cluster trial examples that compare the different methods,\nincluding problems involving determining optimal allocation of clusters across\na set of cluster sequences, and selecting the optimal number of single\nobservations to make in each cluster-period for both Gaussian and non-Gaussian\nmodels, and including exchangeable and exponential decay covariance structures.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07953v1"
    ],
    "publication_venue": null
}