{
    "arxiv_id": "2303.11789",
    "paper_title": "Decentralized Online Learning for Random Inverse Problems Over Graphs",
    "authors": [
        "Tao Li",
        "Xiwei Zhang",
        "Yan Chen"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2025-03-11"
    ],
    "latest_version": 9,
    "categories": [
        "cs.LG",
        "cs.DC",
        "eess.SY",
        "math.PR"
    ],
    "abstract": "We propose a decentralized online learning algorithm for distributed random inverse problems over network graphs with online measurements, and unifies the distributed parameter estimation in Hilbert spaces and the least mean square problem in reproducing kernel Hilbert spaces (RKHS-LMS). We transform the convergence of the algorithm into the asymptotic stability of a class of inhomogeneous random difference equations in Hilbert spaces with $L_{2}$-bounded martingale difference terms and develop the $L_2$-asymptotic stability theory in Hilbert spaces. We show that if the network graph is connected and the sequence of forward operators satisfies the infinite-dimensional spatio-temporal persistence of excitation condition, then the estimates of all nodes are mean square and almost surely strongly consistent. Moreover, we propose a decentralized online learning algorithm in RKHS based on non-stationary online data streams, and prove that the algorithm is mean square and almost surely strongly consistent if the operators induced by the random input data satisfy the infinite-dimensional spatio-temporal persistence of excitation condition.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11789v1",
        "http://arxiv.org/pdf/2303.11789v2",
        "http://arxiv.org/pdf/2303.11789v3",
        "http://arxiv.org/pdf/2303.11789v4",
        "http://arxiv.org/pdf/2303.11789v5",
        "http://arxiv.org/pdf/2303.11789v6",
        "http://arxiv.org/pdf/2303.11789v7",
        "http://arxiv.org/pdf/2303.11789v8",
        "http://arxiv.org/pdf/2303.11789v9"
    ],
    "publication_venue": null
}