{
    "arxiv_id": "2303.10188",
    "paper_title": "Stellar-mass black holes in the Hyades star cluster?",
    "authors": [
        "Stefano Torniamenti",
        "Mark Gieles",
        "Zephyr Penoyre",
        "Tereza Jerabkova",
        "Long Wang",
        "Friedrich Anders"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-07-05"
    ],
    "latest_version": 3,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Astrophysical models of binary-black hole mergers in the Universe require a significant fraction of stellar-mass black holes (BHs) to receive negligible natal kicks to explain the gravitational wave detections. This implies that BHs should be retained even in open clusters with low escape velocities ($\\lesssim1~\\mathrm{km \\, s^{-1}}$). We search for signatures of the presence of BHs in the nearest open cluster to the Sun - the Hyades - by comparing density profiles of direct $N$-body models to data from $Gaia$. The observations are best reproduced by models with $2-3$ BHs at present. Models that never possessed BHs have an half-mass radius $\\sim30\\%$ smaller than the observed value, while those where the last BHs were ejected recently ($\\lesssim150~$Myr ago) can still reproduce the density profile. In 50% of the models hosting BHs, we find BHs with stellar companion(s). Their period distribution peaks at $\\sim10^3$ yr, making them unlikely to be found through velocity variations. We look for potential BH companions through large $Gaia$ astrometric and spectroscopic errors, identifying 56 binary candidates - none of which consistent with a massive compact companion. Models with $2-3$ BHs have an elevated central velocity dispersion, but observations can not yet discriminate. We conclude that the present-day structure of the Hyades requires a significant fraction of BHs to receive natal kicks smaller than the escape velocity of $\\sim 3\\, \\mathrm{km \\, s^{-1}}$ at the time of BH formation and that the nearest BHs to the Sun are in, or near, Hyades.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10188v1",
        "http://arxiv.org/pdf/2303.10188v2",
        "http://arxiv.org/pdf/2303.10188v3"
    ],
    "publication_venue": "20 pages, 15 figures, 5 tables. Accepted for publication in MNRAS. Comments welcome",
    "doi": "10.1093/mnras/stad1925"
}