{
    "arxiv_id": "2303.13694",
    "paper_title": "Ensemble Gaussian Processes for Adaptive Autonomous Driving on Multi-friction Surfaces",
    "authors": [
        "Tomáš Nagy",
        "Ahmad Amine",
        "Truong X. Nghiem",
        "Ugo Rosolia",
        "Zirui Zang",
        "Rahul Mangharam"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cs.RO",
        "eess.SY"
    ],
    "abstract": "Driving under varying road conditions is challenging, especially for autonomous vehicles that must adapt in real-time to changes in the environment, e.g., rain, snow, etc. It is difficult to apply offline learning-based methods in these time-varying settings, as the controller should be trained on datasets representing all conditions it might encounter in the future. While online learning may adapt a model from real-time data, its convergence is often too slow for fast varying road conditions. We study this problem in autonomous racing, where driving at the limits of handling under varying road conditions is required for winning races. We propose a computationally-efficient approach that leverages an ensemble of Gaussian processes (GPs) to generalize and adapt pre-trained GPs to unseen conditions. Each GP is trained on driving data with a different road surface friction. A time-varying convex combination of these GPs is used within a model predictive control (MPC) framework, where the model weights are adapted online to the current road condition based on real-time data. The predictive variance of the ensemble Gaussian process (EGP) model allows the controller to account for prediction uncertainty and enables safe autonomous driving. Extensive simulations of a full scale autonomous car demonstrated the effectiveness of our proposed EGP-MPC method for providing good tracking performance in varying road conditions and the ability to generalize to unknown maps.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13694v1"
    ],
    "publication_venue": "8 pages, 12 figures, accepted for publication in IFAC World Congress 2023"
}