{
    "arxiv_id": "2303.17348",
    "paper_title": "Highly tunable NbTiN Josephson junctions fabricated with focused helium ion beam",
    "authors": [
        "Aki Ruhtinas",
        "Ilari J. Maasilta"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con",
        "cond-mat.mes-hall"
    ],
    "abstract": "We demonstrate a \"direct writing\" method for the fabrication of planar Josephson junctions from high quality superconducting niobium titanium nitride (NbTiN) thin films using focused He-ion beam irradiation. Compared to the materials previously used in such processing, YBCO and MgB$_2$, NbTiN has much better mechanical and electrical properties, as well as good corrosion resistance. We show that we can control the suppression of superconductivity in NbTiN as a function of the helium ion beam fluence, and that this controllable critical temperature suppression combined with the high spatial resolution and position control of the He-ion beam in a helium ion microscope enables us to successfully fabricate Josephson junctions with highly tunable weak links. Because of the continuous nature of the disorder-induced metal-insulator transition, this method allows the creation of barriers with wide range of resistivities ranging from the metallic to the insulating state, with the critical current and the junction resistance varying over two orders of magnitude. Electrical transport measurements show that junctions follow closely the ideal resistively and capacitively shunted junction behavior, have high characteristic voltages ($0.2-1.4$ mV) and show Shapiro steps up to very high orders. This suggests that these type of junctions are suitable for a wide range of applications in superconducting electronics and quantum information technology, with the bonus that a whole device can be fabricated from just a single thin film, with the excellent electrical and microwave characteristics offered by NbTiN.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17348v1"
    ],
    "publication_venue": null
}