{
    "arxiv_id": "2303.17397",
    "paper_title": "Efficient Thermal Transport across Molecular Chains in Hybrid 2D Lead Bromide Perovskites",
    "authors": [
        "Nabeel S. Dahod",
        "Watcharaphol Paritmongkol",
        "William A. Tisdale"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "We report measurements of the heat capacity and cross-plane thermal conductivity of 2D (CxH2x+1NH3)2[MAPbBr3]n-1PbBr4 (MA = methylammonium) lead bromide perovskites (2D LHPs) at room temperature as a function of both the octahedral layer thickness (n = 1,2,3) and the organic spacer chain length (x=4,5,6,7,8) using differential scanning calorimetry (DSC) and frequency domain thermoreflectance (FDTR) respectively. We observe ultralow thermal conductivities (0.18-0.51 W/m K) for all 2D LHPs studied, but surprisingly minimal suppression of thermal conductivity with respect to bulk MAPbBr3 (0.5 W/m K). Cross-plane thermal conductivity is found to increase monotonically as a function of both the octahedral layer thickness (0.18-0.26 W/m K for n=1-3) and the organic chain length (0.18-0.51 W/m K for x=4-8). Additionally, we measure heat capacities that are well described by composite theory, suggesting bulk-like phonon density-of-states within the separate organic and inorganic subphases of the layered structure. The striking observation of increasing thermal conductivity with increasing organic phase fraction (i.e. increasing organic chain length) indicates efficient thermal transport along the ordered alkyl chain backbone. Our experimental results agree most closely with a predictive model of ballistic phonon transport with diffuse interface scattering - rather than normal thermal conduction within each phase. This study indicates the potential for synthesizing 2D LHPs with thermal conductivity that exceeds the bulk perovskite phase, while also shedding light on relevant phonon transport pathways in 2D LHPs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17397v1"
    ],
    "publication_venue": null
}