{
    "arxiv_id": "2303.13172",
    "paper_title": "JOYS: JWST Observations of Young protoStars: Outflows and accretion in the high-mass star-forming region IRAS23385+605",
    "authors": [
        "H. Beuther",
        "E. F. van Dishoeck",
        "L. Tychoniec",
        "C. Gieser",
        "P. J. Kavanagh",
        "G. Perotti",
        "M. L. van Gelder",
        "P. Klaassen",
        "A. Caratti o Garatti",
        "L. Francis",
        "W. R. M. Rocha",
        "K. Slavicinska",
        "T. Ray",
        "K. Justtanont",
        "H. Linnartz",
        "C. Weakens",
        "L. Colina",
        "T. Greve",
        "M. Guedel",
        "T. Henning",
        "P. O. Lagage",
        "B. Vandenbussche",
        "G. Oestlin",
        "G. Wright"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "Aims: The JWST program JOYS (JWST Observations of Young protoStars) aims at characterizing the physical and chemical properties of young high- and low-mass star-forming regions, in particular the unique mid-infrared diagnostics of the warmer gas and solid-state components. We present early results from the high-mass star formation region IRAS23385+6053. Methods: The JOYS program uses the MIRI MRS with its IFU to investigate a sample of high- and low-mass star-forming protostellar systems. Results: The 5 to 28mum MIRI spectrum of IRAS23385+6053 shows a plethora of features. While the general spectrum is typical for an embedded protostar, we see many atomic and molecular gas lines boosted by the higher spectral resolution and sensitivity compared to previous space missions. Furthermore, ice and dust absorption features are also present. Here, we focus on the continuum emission, outflow tracers like the H2, [FeII] and [NeII] lines as well as the potential accretion tracer Humphreys alpha HI(7--6). The short-wavelength MIRI data resolve two continuum sources A and B, where mid-infrared source A is associated with the main mm continuum peak. The combination of mid-infrared and mm data reveals a young cluster in its making. Combining the mid-infrared outflow tracer H2, [FeII] and [NeII] with mm SiO data shows a complex interplay of at least three molecular outflows driven by protostars in the forming cluster. Furthermore, the Humphreys alpha line is detected at a 3-4sigma level towards the mid-infrared sources A and B. Following Rigliaco et al. (2015), one can roughly estimate accretion luminosities and corresponding accretion rates between ~2.6x10^-6 and ~0.9x10^-4 M_sun/yr. This is discussed in the context of the observed outflow rates. Conclusions: The analysis of the MIRI MRS observations for this young high-mass star-forming region reveals connected outflow and accretion signatures.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13172v1"
    ],
    "publication_venue": "12 pages, 9 figures, accepted for Astronomy & Astrophysics, the paper is also available at https://www2.mpia-hd.mpg.de/homes/beuther/papers.html",
    "doi": "10.1051/0004-6361/202346167"
}