{
    "arxiv_id": "2303.12730",
    "paper_title": "Toward Data-Driven Glare Classification and Prediction for Marine Megafauna Survey",
    "authors": [
        "Joshua Power",
        "Derek Jacoby",
        "Marc-Antoine Drouin",
        "Guillaume Durand",
        "Yvonne Coady",
        "Julian Meng"
    ],
    "submission_date": "2023-03-03",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
    ],
    "abstract": "Critically endangered species in Canadian North Atlantic waters are systematically surveyed to estimate species populations which influence governing policies. Due to its impact on policy, population accuracy is important. This paper lays the foundation towards a data-driven glare modelling system, which will allow surveyors to preemptively minimize glare. Surveyors use a detection function to estimate megafauna populations which are not explicitly seen. A goal of the research is to maximize useful imagery collected, to that end we will use our glare model to predict glare and optimize for glare-free data collection. To build this model, we leverage a small labelled dataset to perform semi-supervised learning. The large dataset is labelled with a Cascading Random Forest Model using a naïve pseudo-labelling approach. A reflectance model is used, which pinpoints features of interest, to populate our datasets which allows for context-aware machine learning models. The pseudo-labelled dataset is used on two models: a Multilayer Perceptron and a Recurrent Neural Network. With this paper, we lay the foundation for data-driven mission planning; a glare modelling system which allows surveyors to preemptively minimize glare and reduces survey reliance on the detection function as an estimator of whale populations during periods of poor subsurface visibility.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12730v1"
    ],
    "publication_venue": "15 pages, 4 figures, 5th ICPR Workshop on Computer Vison for Automated Analysis of Underwater Imagery (CVAUI 2022)"
}