{
    "arxiv_id": "2303.11107",
    "paper_title": "Landauer-QFLPS model for mixed Schottky-Ohmic contact two-dimensional transistors",
    "authors": [
        "Zhao-Yi Yan",
        "Zhan Hou",
        "Kan-Hao Xue",
        "Tian Lu",
        "Ruiting Zhao",
        "Junying Xue",
        "Fan Wu",
        "Minghao Shao",
        "Jianlan Yan",
        "Anzhi Yan",
        "Zhenze Wang",
        "Penghui Shen",
        "Mingyue Zhao",
        "Xiangshui Miao",
        "Zhaoyang Lin",
        "Houfang Liu",
        "He Tian",
        "Yi Yang",
        "Tian-Ling Ren"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "cond-mat.mes-hall"
    ],
    "abstract": "Two-dimensional material-based field effect transistors (2DM-FETs) are playing a revolutionary role in electronic devices. However, after years of development, no device model can match the Pao-Sah model for standard silicon-based transistors in terms of physical accuracy and computational efficiency to support large-scale integrated circuit design. One remaining critical obstacle is the contacts of 2DM-FETs. In order to self-consistently include the contact effect in the current model, it is necessary to perform self-consistent calculations, which is a fatal flaw for applications that prioritize efficiency. Here, we report that the Landauer-QFLPS model effectively overcomes the above contradiction, where QFLPS means quasi-Fermi-level phase space theory. By connecting the physical pictures of the contact and the intrinsic channel part, we have successfully derived a drain-source current formula including the contact effect. To verify the model, we prepared transistors based on two typical 2DMs, black phosphorus (BP) and molybdenum disulfide (MoS2), the former having ambipolar transport and the latter showing electron-dominant unipolar transport. The proposed new formula could describe both 2DM-FETs with Schottky or Ohmic contacts. Moreover, compared with traditional methods, the proposed model has the advantages of accuracy and efficiency, especially in describing non-monotonic drain conductance characteristics, because the contact effect is self-consistently and compactly packaged as an exponential term. More importantly, we also examined the model at the circuit level. Here, we fabricated a three-bit threshold inverter quantizer circuit based on ambipolar-BP process and experimentally demonstrated that the model can accurately predict the circuit performance. This industry-benign 2DM-FET model is supposed to be very useful for the development of 2DM-FET-based integrated circuits.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11107v1"
    ],
    "publication_venue": null
}