{
    "arxiv_id": "2303.09749",
    "paper_title": "Surrogate models for the magnitude of convection in droplets levitated through EML, ADL, and ESL methods",
    "authors": [
        "Takuro Usui",
        "Suguru Shiratori",
        "Kohei Tanimoto",
        "Shumpei Ozawa",
        "Takehiko Ishikawa",
        "Shinsuke Suzuki",
        "Hideaki Nagano",
        "Kenjiro Shimano"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "Fluid flow and heat transfer in levitated droplets were numerically investigated. Three levitation methods: electro-magnetic levitation (EML), aerodynamic levitation (ADL), and electro-static levitation (ESL) were considered, and conservative laws of mass, momentum, and energy were applied as common models. The Marangoni effect was applied as a velocity boundary condition, whereas heat transfer and radiation heat loss were considered as thermal boundary conditions. As specific models to EML, the Lorentz force, and Joule heat were calculated based on the analytical solution of the electromagnetic field. For ADL model, besides the Marangoni effect, the flow driven by the surface shear force was considered. For ADL and ESL models, the effect of laser heating was introduced as a boundary condition. All the equations were nondimensionalized using common scales for all three levitations. Numerical simulations were performed for several materials and droplet sizes, and the results were evaluated in terms of the Reynolds number based on the maximum velocity of the flow in the droplet. The order of magnitude of Reynolds numbers was evaluated as $\\mathcal{O}(10^4)$ for EML, $\\mathcal{O}(10^3)$ for ADL, and $\\mathcal{O}(10^1)$ for ESL. Based on the simulation results, we proposed simple formulas for predicting the Reynolds number of droplet internal convection using combinations of nondimensional numbers determined from the physical properties of the material and the driving conditions. The proposed formulas can be used as surrogate models to predict the Reynolds numbers, even for materials other than those used in this study.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09749v1"
    ],
    "publication_venue": null
}