{
    "arxiv_id": "2303.15759",
    "paper_title": "Performance Analysis of Non-ideal Wireless PBFT Networks with mmWave and Terahertz Signals",
    "authors": [
        "Haoxiang Luo",
        "Xiangyue Yang",
        "Hongfang Yu",
        "Gang Sun",
        "Shizhong Xu",
        "Long Luo"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cs.NI",
        "eess.SP"
    ],
    "abstract": "Due to advantages in security and privacy, blockchain is considered a key enabling technology to support 6G communications. Practical Byzantine Fault Tolerance (PBFT) is seen as the most applicable consensus mechanism in blockchain-enabled wireless networks. However, previous studies on PBFT do not consider the channel performance of the physical layer, such as path loss and channel fading, resulting in research results that are far from real networks. Additionally, 6G communications will widely deploy high frequency signals such as millimeter wave (mmWave) and terahertz (THz), while the performance of PBFT is still unknown when these signals are transmitted in wireless PBFT networks. Therefore, it is urgent to study the performance of non-ideal wireless PBFT networks with mmWave and THz siganls, so as to better make PBFT play a role in 6G era. In this paper, we study and compare the performance of mmWave and THz signals in non-ideal wireless PBFT networks, considering Rayleigh Fading (RF) and close-in Free Space (FS) reference distance path loss. Performance is evaluated by consensus success rate and delay. Meanwhile, we find and derive that there is a maximum distance between two nodes that can make PBFT consensus inevitably successful, and it is named active distance of PBFT in this paper. The research results not only analyze the performance of non-ideal wireless PBFT networks, but also provide an important reference for the future transmission of mmWave and THz signals in PBFT networks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15759v1"
    ],
    "publication_venue": "IEEE International Conference on Metaverse Computing, Networking and Applications (MetaCom) 2023"
}