{
    "arxiv_id": "2303.11712",
    "paper_title": "Efficiently Explaining CSPs with Unsatisfiable Subset Optimization (extended algorithms and examples)",
    "authors": [
        "Emilio Gamba",
        "Bart Bogaerts",
        "Tias Guns"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-10-02"
    ],
    "latest_version": 2,
    "categories": [
        "cs.AI",
        "cs.LO"
    ],
    "abstract": "We build on a recently proposed method for stepwise explaining solutions of Constraint Satisfaction Problems (CSP) in a human-understandable way. An explanation here is a sequence of simple inference steps where simplicity is quantified using a cost function. The algorithms for explanation generation rely on extracting Minimal Unsatisfiable Subsets (MUS) of a derived unsatisfiable formula, exploiting a one-to-one correspondence between so-called non-redundant explanations and MUSs. However, MUS extraction algorithms do not provide any guarantee of subset minimality or optimality with respect to a given cost function. Therefore, we build on these formal foundations and tackle the main points of improvement, namely how to generate explanations efficiently that are provably optimal (with respect to the given cost metric). For that, we developed (1) a hitting set-based algorithm for finding the optimal constrained unsatisfiable subsets; (2) a method for re-using relevant information over multiple algorithm calls; and (3) methods exploiting domain-specific information to speed up the explanation sequence generation. We experimentally validated our algorithms on a large number of CSP problems. We found that our algorithms outperform the MUS approach in terms of explanation quality and computational time (on average up to 56 % faster than a standard MUS approach).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11712v1",
        "http://arxiv.org/pdf/2303.11712v2"
    ],
    "publication_venue": "arXiv admin note: text overlap with arXiv:2105.11763"
}