{
    "arxiv_id": "2303.12405",
    "paper_title": "The formation of globular clusters with top-heavy initial mass functions",
    "authors": [
        "Hajime Fukushima",
        "Hidenobu Yajima"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We study the formation of globular clusters in massive compact clouds with the low-metallicity of $Z=10^{-3}~Z_{\\odot}$ by performing three-dimensional radiative-hydrodynamics simulations. Considering the uncertainty of the initial mass function (IMF) of stars formed in low-metallicity and high-density clouds, we investigate the impacts of the IMF on the cloud condition for the GC formation with the range of the power-law index of IMF as $γ= 1-2.35$. We find that the threshold surface density ($Σ_{\\rm thr}$) for the GC formation increases from $800~M_{\\odot} \\; {\\rm pc^{-2}}$ at $γ= 2.35$ to $1600~M_{\\odot}\\; {\\rm pc^{-2}}$ at $γ= 1.5$ in the cases of clouds with $M_{\\rm cl} = 10^6~M_{\\odot}$ because the emissivity of ionizing photons per stellar mass increases as $γ$ decreases. For $γ< 1.5$, $Σ_{\\rm thr}$ saturates with $\\sim 2000~M_{\\odot}\\; {\\rm pc^{-2}}$ that is quite rare and observed only in local starburst galaxies due to e.g., merger processes. Thus, we suggest that formation sites of low-metallicity GCs could be limited only in the very high-surface density regions. We also find that $Σ_{\\rm thr}$ can be modelled by a power-law function with the cloud mass ($M_{\\rm cl}$) and the emissivity of ionizing photons ($s_*$) as $\\propto M_{\\rm cl}^{-1/5} s_{*}^{2/5}$. Based on the relation between the power-law slope of IMF and $Σ_{\\rm thr}$, future observations with e.g., the James Webb Space Telescope can allow us to constrain the IMF of GCs.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12405v1"
    ],
    "publication_venue": "9 pages, 6 figures, submitted to MNRAS"
}