{
    "arxiv_id": "2303.16096",
    "paper_title": "The galaxy-halo connection of DESI luminous red galaxies with subhalo abundance matching",
    "authors": [
        "Angela M. Berti",
        "Kyle S. Dawson",
        "Wilber Dominguez"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO"
    ],
    "abstract": "We use subhalo abundance and age distribution matching to create magnitude-limited mock galaxy catalogs at $z\\sim0.43$, $0.52$, and $0.63$ with $z$-band and $3.4$ micron $W1$-band absolute magnitudes and ${r-z}$ and ${r-W1}$ colors. From these magnitude-limited mocks we select mock luminous red galaxy (LRG) samples according to the $(r-z)$-based (optical) and $(r-W1)$-based (infrared) selection criteria for the LRG sample of the Dark Energy Spectroscopic Instrument (DESI) Survey. Our models reproduce the number densities, luminosity functions, color distributions, and projected clustering of the DESI Legacy Surveys that are the basis for DESI LRG target selection. We predict the halo occupation statistics of both optical and IR DESI LRGs at fixed cosmology, and assess the differences between the two LRG samples. We find that IR-based SHAM modeling represents the differences between the optical and IR LRG populations better than using the $z$-band, and that age distribution matching overpredicts the clustering of LRGs, implying that galaxy color is uncorrelated with halo age in the LRG regime. Both the optical and IR DESI LRG target selections exclude some of the most luminous galaxies that would appear to be LRGs based on their position on the red sequence in optical color-magnitude space. Both selections also yield populations with a non-trivial LRG-halo connection that does not reach unity for the most massive halos. We find the IR selection achieves greater completeness ($\\gtrsim 90\\%$) than the optical selection across all redshift bins studied.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16096v1"
    ],
    "publication_venue": "20 pages, 14 figures, submitted to ApJ"
}