{
    "arxiv_id": "2303.16920",
    "paper_title": "On the impact of spectral template uncertainties in synthetic stellar populations",
    "authors": [
        "C. M. Byrne",
        "E. R. Stanway"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.SR"
    ],
    "abstract": "Uncertainties in stellar population models, both in terms of stellar evolution and stellar spectra, translate into uncertainties in our interpretation of stellar populations in galaxies, since stars are the source of most of the light we receive from them. Observations by JWST are revealing high-redshift galaxies in great detail, which must then be compared to models. One significant source of uncertainty is in the stellar spectra used to generate composite spectra of stellar populations, which are then compared to data. Confidence in theoretical models is important to enable reliable determination of the properties of these galaxies such as their ages and star formation history. Here we present a comparison of spectral synthesis carried out with 6 different stellar spectral libraries using the Binary Population and Spectral Synthesis (BPASS) framework. In photometric colours, the differences between theoretical libraries are relatively small (<0.10 mag), similar to typical observational uncertainties on individual galaxy observations. Differences become more pronounced when detailed spectroscopic properties are examined. Predictions for spectral line indices can vary significantly, with equivalent widths differing by a factor of two in some cases. With these index strengths, some of the libraries yield predictions of ages and metallicities which are unphysical. Many spectral libraries lack wavelength coverage in the ultraviolet, which is of growing importance in the era of JWST observations of distant galaxies, whose flux is dominated by hot, young stars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16920v1"
    ],
    "publication_venue": "Accepted for publication in MNRAS. Supplemental material attached as an appendix. Output data available from https://warwick.ac.uk/bpass or https://bpass.auckland.ac.nz/",
    "doi": "10.1093/mnras/stad832"
}