{
    "arxiv_id": "2303.08673",
    "paper_title": "Successive magnetic orderings in the Ising spin chain magnet DyNi$_5$Ge$_3$",
    "authors": [
        "H. Ge",
        "L. Zhang",
        "N. Zhao",
        "J. Yang",
        "L. Wang",
        "L. Zhou",
        "Y. Fu",
        "T. T. Li",
        "Z. M. Song",
        "F. Ding",
        "J. B. Xu",
        "Y. F. Zhang",
        "S. M. Wang",
        "J. W. Mei",
        "X. Tong",
        "P. Miao",
        "H. He",
        "Q. Zhanghang",
        "L. S. Wu",
        "J. M. Sheng"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el"
    ],
    "abstract": "In this report, we investigated a new rare earth based one-dimensional Ising spin chain magnet~\\DNG~by means of magnetization, specific heat and powder neutron diffraction measurements. Due to the crystalline electrical field splitting, the magnetic Dy ions share an Ising like ground doublet state. Owning to the local point symmetry, these Ising moments form into two canted magnetic sublattices, which were further confirmed by the angle-dependent magnetization measurement. In zero fields, two successive antiferromagnetic phase transitions were found at temperatures $T_{\\mathrm{N1}}=6~\\rm K$ and $T_{\\mathrm{N2}}=5~\\rm K$, respectively. Only part of the moments are statically ordered in this intermediate state between $T_{\\mathrm{N1}}$ and $T_{\\mathrm{N2}}$. Powder neutron diffraction experiments at different temperatures were performed as well. An incommensurate magnetic propagation vector of $\\mathbf{k_{\\rm m}}=(0.5,0.4,0.5)$ was identified. The refined spin configurations through the irreducible representation analysis confirmed that these Ising spins are canted in the crystal $ab$~plane.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08673v1"
    ],
    "publication_venue": "9 pages, 7 figures",
    "doi": "10.1103/PhysRevMaterials.6.085001"
}