{
    "arxiv_id": "2303.13940",
    "paper_title": "Femtosecond pulse parameter estimation from photoelectron momenta using machine learning",
    "authors": [
        "Tomasz Szołdra",
        "Marcelo F. Ciappina",
        "Nicholas Werby",
        "Philip H. Bucksbaum",
        "Maciej Lewenstein",
        "Jakub Zakrzewski",
        "Andrew S. Maxwell"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-10-12"
    ],
    "latest_version": 1,
    "categories": [
        "physics.atom-ph",
        "physics.optics",
        "quant-ph"
    ],
    "abstract": "Deep learning models have provided huge interpretation power for image-like data. Specifically, convolutional neural networks (CNNs) have demonstrated incredible acuity for tasks such as feature extraction or parameter estimation. Here we test CNNs on strong-field ionization photoelectron spectra, training on theoretical data sets to `invert' experimental data. Pulse characterization is used as a `testing ground', specifically we retrieve the laser intensity, where `traditional' measurements typically leads to 20\\% uncertainty. We report on crucial data augmentation techniques required to successfully train on theoretical data and return consistent results from experiments, including accounting for detector saturation. The same procedure can be repeated to apply CNNs in a range of scenarios for strong-field ionization. Using a predictive uncertainty estimation, reliable laser intensity uncertainties of a few percent can be extracted, which are consistently lower than those given by traditional techniques. Using interpretability methods can reveal parts of the distribution that are most sensitive to laser intensity, which can be directly associated to holographic interferences. The CNNs employed provide an accurate and convenient ways to extract parameters, and represent a novel interpretational tool for strong-field ionization spectra.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13940v1"
    ],
    "publication_venue": "13 pages, 5 figures",
    "doi": "10.1088/1367-2630/acee19"
}