{
    "arxiv_id": "2303.14650",
    "paper_title": "Magnetic nanofibers for remotely triggered catalytic activity applied to the degradation of organic pollutants",
    "authors": [
        "Jesús A. Fuentes-García",
        "Beatriz Sanz-Sagué",
        "Reyes Mallada",
        "M. Ricardo Ibarra",
        "Gerardo F. Goya"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph",
        "cond-mat.soft"
    ],
    "abstract": "This work reports on the synthesis and characterization of a new type of electrospun magnetic nanofibers (MNFs), and their application for degradation of organic pollutants using remote magnetic inductive heating. We describe a simple protocol combining a fast (app. 5 min) synthesis of MnFe\\textsubscript{2}O\\textsubscript{4} magnetic nanoparticles (MNPs) by sonochemical route, optimized for inductive heating, with their subsequent incorporation in electrospun MNFs composed of polyacrylonitrile (PAN) nanofibers. The resulting multifunctional MNFs (average diameter $φ= 760 \\pm 150$ nm) contain up to $\\approx 30%$wt. of the MNPs. The composite showed superhydrophobic behaviour ($θ_c = 165^\\circ$) and a band gap value of 1.75 eV. We found that the presence of MNPs embedded into the polymeric nanofibers modify the exothermic and the glass transitions temperatures compared with pure PAN nanofibers, suggesting a strong attachment between MNPs and polymeric chains. The MNFs could be remotely activated by alternating magnetic fields (AMF, $f = 200-800$ kHz, $H_0 = 10-36$ kA/m) for accelerating the catalytic reactions of the organic dye methylene blue (MB). A remarkable stability of the MNFs against degradation under extreme pH conditions ($3<pH<10$) resulted in a sustained heating efficiency after many heating cycles. We observed a degradation efficiency $>80%$ in the presence of hydrogen peroxide under AMFs, attributed to Fe\\textsuperscript{2+}/\\textsuperscript{3+} and Mn\\textsuperscript{2+}/\\textsuperscript{3+}/\\textsuperscript{4+} active centers on the surface of the MNP/MNFs observed from XPS data. The capacity of these materials for magnetic remote activation appeals catalytic applications under conditions of darkness or restrained access, where no photocatalytic reactions can be achieved.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14650v1"
    ],
    "publication_venue": "31 pages, 16 figures",
    "doi": "10.1016/j.matdes.2023.111615"
}