{
    "arxiv_id": "2303.14786",
    "paper_title": "Detecting Low-Mass Perturbers in Cluster Lenses using Curved Arc Bases",
    "authors": [
        "Atınç Çağan Şengül",
        "Simon Birrer",
        "Priyamvada Natarajan",
        "Cora Dvorkin"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
    ],
    "abstract": "Strong gravitationally lensed arcs and arclets produced by the mass distribution in galaxy clusters have been observationally detected for several decades now. These strong lensing constraints provided high-fidelity mass models for cluster lenses that include a detailed census of the substructure down to $10^{9-10}\\,\\mathrm{M}_\\odot$. Optimizing lens models, where the cluster mass distribution is modeled by a smooth component and subhalos associated with the locations of individual cluster galaxies, has enabled deriving the subhalo mass function, providing important constraints on the nature and granularity of dark matter. In this work, we explore and present a novel method to detect and measure individual perturbers (subhalos, line-of-sight halos, and wandering supermassive black holes) by exploiting their proximity to highly distorted lensed arcs in galaxy clusters, and by modeling the local lensing distortions with curved arc bases. This method offers the possibility of detecting individual low-mass perturber subhalos in clusters and halos along the line-of-sight down to a mass resolution of $10^8\\, \\mathrm{M}_\\odot$. We quantify our sensitivity to low-mass perturbers with masses $M \\sim 10^{7-9}\\,\\mathrm{M}_\\odot$ in clusters with masses $M \\sim 10^{14-15}\\mathrm{M}_\\odot$, by creating realistic mock data. Using three lensed images of a background galaxy in the cluster SMACS J0723, as seen by the $\\textit{James Webb Space Telescope}$, we study the retrieval of the properties of potential perturbers with masses $M = 10^{7-9}\\,\\mathrm{M}_\\odot$. From the derived posterior probability distributions for the perturber, we constrain its concentration, redshift, and ellipticity. By allowing us to probe lower-mass substructures, the use of the curved arc bases can lead to powerful constraints on the nature of dark matter as discrimination between dark matter models appears on smaller scales.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14786v1"
    ],
    "publication_venue": "12 pages, 15 figures"
}