{
    "arxiv_id": "2303.09485",
    "paper_title": "Variations of the relative biological effectiveness with fractionation in proton therapy: analysis of prostate cancer response",
    "authors": [
        "Juan Pardo-Montero",
        "Miguel Pombar",
        "Antonio Gómez-Caamaño",
        "Simona Giordanengo",
        "Isabel González-Crespo"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-10-03"
    ],
    "latest_version": 2,
    "categories": [
        "physics.med-ph"
    ],
    "abstract": "Purpose: To present a methodology to analyze the variation of the relative biological effectiveness (RBE) with fractionation from clinical data of tumor control probability (TCP) and to apply it to study the response of prostate cancer to proton therapy.\n  Methods: We have analyzed the dependence of the RBE on the dose per fraction by using the LQ model and the Poisson TCP formalism. Experimental TCPs for prostate cancer (low risk, LR, and intermediate risk, IR) treated with photon and proton therapy for conventional fractionation (2 GyE$\\times$37 fractions), moderate hypofractionation (3 GyE$\\times$20 fractions) and hypofractionation (7.25 GyE$\\times$5 fractions) were obtained from the literature and analyzed.\n  Results: The dependence of the RBE on the dose per fraction presents three theoretical regions, with RBE monotonically decreasing, increasing or constant with the dose per fraction, depending on the change of ($α$, $β$) values between photon and proton irradiation (the equilibrium point being at ($α_p$/$β_p$)=($α_X$/$β_X$)($α_X$/$α_p$)). An analysis of the clinical data shows RBE values that decline with increasing dose per fraction: for LR RBE=1.124, 1.119, and 1.102 for 1.82 Gy, 2.73 Gy and 6.59 Gy per fraction (proton doses), respectively; for IR RBE=1.119, and 1.102 for 1.82 Gy, and 6.59 Gy per fraction, respectively.\n  Conclusions: Our analysis shows a monotonically decreasing RBE with increasing dose per fraction for prostate cancer, which is expected from the LQ formalism and the changes in ($α$, $β$) between photon and proton irradiation. However, due to the limited number of schedules and patients per schedule, the observed decrease of RBE with increasing dose is not significant for LR prostate cancer. For IR prostate cancer, the RBE obtained at 7.25 GyE seems to be significantly lower than that obtained at 2 GyE.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09485v1",
        "http://arxiv.org/pdf/2303.09485v2"
    ],
    "publication_venue": "Minor changes to match accepted manuscript ; to be published in Medical Physics"
}