{
    "arxiv_id": "2303.12156",
    "paper_title": "Neutron Skin Thickness Dependence of Astrophysical $S$-factor",
    "authors": [
        "T. Ghosh",
        "Sangeeta",
        "G. Saxena",
        "B. K. Agrawal",
        "Ushasi Datta"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "nucl-th",
        "astro-ph.HE",
        "astro-ph.SR"
    ],
    "abstract": "Background: The density dependence of nuclear symmetry energy is crucial in determining several properties of finite nuclei to the neutron stars with mass $\\sim$ 1.4 $M_\\odot$. The values of neutron skin thickness, isovector giant dipole resonances energies and various nuclear reaction cross-sections in asymmetric nuclei have been utilized to determine the slope of symmetry energy ($L_0$) at the saturation density. Recent PREX-II and CREX measurements of neutron skin thickness in $^{208}$Pb and $^{48}$Ca nuclei yield very different values of $L_0$ which overlap marginally within 90$\\%$ confidence interval.\n  Purpose: Our objective is to demonstrate the role of symmetry energy on the sub-barrier fusion cross-section and the astrophysical $S$-factor for asymmetric nuclei.\n  Method: The nucleus nucleus potentials are generated using the double folding model (DFM) for three different nucleon-nucleon interactions. These DFM potentials are used for the calculation of the sub-barrier fusion cross-section and the astrophysical $S$-factor. The nucleon densities required for DFM potentials are generated from different families of non-relativistic and relativistic mean-field models which correspond to a wide range of neutron skin thickness or $L_0$.\n  Results: We have calculated the sub-barrier fusion cross-section for several asymmetric nuclei involving O, Ca, Ni, and Sn isotopes. The results are presented for the barrier parameters, cross-section, and astrophysical $S$-factor for $^{54}$Ca+$^{54}$Ca and $^{124}$Sn+$^{124}$Sn as a function of neutron skin thickness.\n  Conclusions: The cross-section for the neutron-rich nuclei show a strong dependence on the behavior of symmetry energy or the neutron skin thickness. The increase in skin thickness lowers the height of the barrier as well as its width which enhances the values of the $S$-factor by more than an order of magnitude.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12156v1"
    ],
    "publication_venue": "8 pages, 7 figures"
}