{
    "arxiv_id": "2303.14567",
    "paper_title": "Photometric classification of QSOs from ALHAMBRA survey using random forest",
    "authors": [
        "Benjamin Arroquia-Cuadros",
        "Nestor Sanchez",
        "Vicent Gomez",
        "Pere Blay",
        "Vicent Martinez-Badenes",
        "Lorena Nieves-Seoane"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
    ],
    "abstract": "Context: Given the current big data era in Astronomy, machine learning based methods have being applied over the last years to identify or classify objects like quasars, galaxies and stars from full sky photometric surveys. Aims: Here we systematically evaluate the performance of Random Forests (RF) in classifying quasars using either magnitudes or colours, both from broad and narrow-band filters, as features. Methods: The working data consists of photometry from the ALHAMBRA Gold Catalogue that we cross-matched with the Sloan Digital Sky Survey (SDSS) and with the Million Quasars Catalogue (Milliquas) for objects labelled as quasars, galaxies or stars. A RF classifier is trained and tested to evaluate the effect on final accuracy and precision of varying the free parameters and the effect of using narrow or broad-band magnitudes or colours. Results: Best performances of the classifier yielded global accuracy and quasar precision around 0.9. Varying model free parameters (within reasonable ranges of values) has no significant effects on the final classification. Using colours instead of magnitudes as features results in better performances of the classifier, especially using colours from the ALHAMBRA Survey. Colours that contribute the most to the classification are those containing the near-infrared $JHK$ bands.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14567v1"
    ],
    "publication_venue": "7 pages including 6 figures and 3 tables. Accepted for publication in Astronomy and Astrophysics",
    "doi": "10.1051/0004-6361/202245531"
}