{
    "arxiv_id": "2303.12088",
    "paper_title": "CSK Realization for MC via Spatially Distributed Multicellular Consortia",
    "authors": [
        "Rinrada Jadsadaphongphaibool",
        "Dadi Bi",
        "Yansha Deng"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-10-19"
    ],
    "latest_version": 1,
    "categories": [
        "cs.IT"
    ],
    "abstract": "The design and engineering of molecular communication (MC) components capable of processing chemical concentration signals is the key to unleashing the potential of MC for interdisciplinary applications. By controlling the signaling pathway and molecule exchange between cell devices, synthetic biology provides the MC community with tools and techniques to achieve various signal processing functions. In this paper, we propose a design framework to realize any order concentration shift keying (CSK) systems based on simple and reusable single-input single-output cells. The design framework also exploits the distributed multicellular consortia with spatial segregation, which has advantages in system scalability, low genetic manipulation, and signal orthogonality. We also create a small library of reusable engineered cells and apply them to implement binary CSK (BCSK) and quadruple CSK (QCSK) systems to demonstrate the feasibility of our proposed design framework. Importantly, we establish a mathematical framework to theoretically characterize our proposed distributed multicellular systems. Specially, we divide a system into fundamental building blocks, from which we derive the impulse response of each block and the cascade of the impulse responses leads to the end-to-end response of the system. Simulation results obtained from the agent-based simulator BSim not only validate our CSK design framework but also demonstrate the accuracy of the proposed mathematical analysis.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12088v1"
    ],
    "publication_venue": "30 pages, 13 figures",
    "doi": "10.1109/TCOMM.2023.3324995"
}