{
    "arxiv_id": "2303.14273",
    "paper_title": "Dynamics of rapidly spinning blob-filaments: fluid theory with a parallel kinetic extension",
    "authors": [
        "J. R. Myra",
        "J. Cheng",
        "S. E. Parker"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.plasm-ph"
    ],
    "abstract": "Blob-filaments (or simply 'blobs') are coherent structures formed by turbulence and sustained by nonlinear processes in the edge and scrape-off layer (SOL) of tokamaks and other magnetically confined plasmas. The dynamics of these blob-filaments, in particular their radial motion, can influence the scrape-off layer width and plasma interactions with both the divertor target and with the main chamber walls. Motivated by recent results from the XGC1 gyrokinetic simulation code reported on elsewhere [J. Cheng et al. submitted to Nucl. Fusion and available at arXiv:2302.02877v1], a theory of rapidly spinning blob-filaments has been developed. The theory treats blob filaments in the closed flux surface region or the region that is disconnected from sheaths in the SOL. It extends previous work by treating blob spin, arising from partially or fully adiabatic electrons, as the leading order effect and retaining inertial (ion charge polarization) physics in next order. Spin helps to maintain blob coherency and affects the blob's propagation speed. Dipole charge polarization, treated perturbatively, gives rise to blob-filaments with relatively slow radial velocity, comparable to that observed in the simulations. The theory also treats the interaction of rapidly spinning blob filaments with a zonal flow layer. It is shown analytically that the flow layer can act like a transport barrier for these structures. Finally parallel electron kinetic effects are incorporated into the theory. Various asymptotic parameter regimes are discussed and asymptotic expressions for the radial and poloidal motion of the blob-filaments are obtained.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14273v1"
    ],
    "publication_venue": "31 pages, 2 figures"
}