{
    "arxiv_id": "2303.09631",
    "paper_title": "Observing the onset of the accretion wake in Vela X-1",
    "authors": [
        "C. M. Diez",
        "V. Grinberg",
        "F. Fürst",
        "I. El Mellah",
        "M. Zhou",
        "A. Santangelo",
        "S. Martínez-Núñez",
        "R. Amato",
        "N. Hell",
        "P. Kretschmar"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "High-Mass X-ray Binaries (HMXBs) offer a unique opportunity for the investigation of accretion onto compact objects and of wind structure in massive stars. A key source for such studies is the bright neutron star HMXB Vela X-1 whose convenient physical and orbital parameters facilitate the analysis and in particular enable studies of the wind structure in HMXBs. Here, we analyse simultaneous XMM-Newton and NuSTAR observations at $φ_{\\mathrm{orb}} \\approx$ 0.36-0.52 and perform time-resolved spectral analysis down to the pulse period of the neutron star, based on our previous NuSTAR-only results. For the first time, we are able to trace the onset of the wakes in a broad 0.5-78 keV range with a high-time resolution of $\\sim$283 s and compare to theoretical predictions. We observe a clear rise of the absorption column density of the stellar wind $N_{\\mathrm{H,1}}$ starting at orbital phase $\\sim$0.44, corresponding to the wake structure entering our line of sight towards the neutron star, together with local extrema throughout the observation possibly associated with clumps or other structures in the wind. Periods of high absorption reveal the presence of multiple fluorescent emission lines of highly ionised species, mainly in the soft X-ray band between 0.5 and 4 keV, indicating photoionisation of the wind.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09631v1"
    ],
    "publication_venue": "18 pages, 18 figures",
    "doi": "10.1051/0004-6361/202245708"
}