{
    "arxiv_id": "2303.14634",
    "paper_title": "Resource Efficiency vs Performance Isolation Tradeoff in Network Slicing",
    "authors": [
        "Panagiotis Nikolaidis",
        "Asim Zoulkarni",
        "John Baras"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cs.NI",
        "eess.SY"
    ],
    "abstract": "We consider the tradeoff between resource efficiency and performance isolation that emerges when multiplexing the resource demands of Network Slices (NSs). On the one hand, multiplexing allows the use of idle resources, which increases resource efficiency. On the other hand, the performance of each NS becomes susceptible to traffic surges in other NSs, which degrades performance isolation. The analysis of this tradeoff enables network operators to determine the effect of performance isolation on the operating cost of each NS.\n  To study the tradeoff, we solve an optimization problem where we find the multiplexing policy that requires the least provisioned resources to honor the Service Level Agreements (SLAs) of all NSs. The SLA of each NS i states that its resource demand should be met for $P^H_i$ fraction of time, and for $P^L_i \\leq P^H_i$ fraction of time, it should be met regardless of the demands of other NSs.\n  For resource demands that follow ergodic Markov chains, we show that the well-known Max-Weight scheduler is an optimal multiplexing policy. Since the Max-Weight scheduler does not require any knowledge of the statistics of the resource demands, we also propose its use in non-markovian settings. For resource demands obtained in the LTE module of ns-3, we show that the Max-Weight scheduler reduces the provisioned bandwidth by 36.2% when no performance isolation is required. Lastly, for these non-markovian resource demands, the Max-Weight scheduler maintains its optimality since it requires as much provisioned bandwidth as the best non-causal scheduler.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14634v1"
    ],
    "publication_venue": null
}