{
    "arxiv_id": "2303.10729",
    "paper_title": "A Target-Based Extrinsic Calibration Framework for Non-Overlapping Camera-Lidar Systems Using a Motion Capture System",
    "authors": [
        "Nicholas Charron",
        "Steven L. Waslander",
        "Sriram Narasimhan"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-06-16"
    ],
    "latest_version": 2,
    "categories": [
        "cs.RO"
    ],
    "abstract": "In this work, we present a novel target-based lidar-camera extrinsic calibration methodology that can be used for non-overlapping field of view (FOV) sensors. Contrary to previous work, our methodology overcomes the non-overlapping FOV challenge using a motion capture system (MCS) instead of traditional simultaneous localization and mapping approaches. Due to the high relative precision of the MCS, our methodology can achieve both the high accuracy and repeatable calibrations of traditional target-based methods, regardless of the amount of overlap in the field of view of the sensors. We show using simulation that we can accurately recover extrinsic calibrations for a range of perturbations to the true calibration that would be expected in real circumstances. We also validate that high accuracy calibrations can be achieved on experimental data. Furthermore, We implement the described approach in an extensible way that allows any camera model, target shape, or feature extraction methodology to be used within our framework. We validate this implementation on two target shapes: an easy to construct cylinder target and a diamond target with a checkerboard. The cylinder target shape results show that our methodology can be used for degenerate target shapes where target poses cannot be fully constrained from a single observation, and distinct repeatable features need not be detected on the target.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10729v1",
        "http://arxiv.org/pdf/2303.10729v2"
    ],
    "publication_venue": "8 pages, 15 figures"
}