{
    "arxiv_id": "2303.11843",
    "paper_title": "Optimal Fully Dynamic $k$-Center Clustering for Adaptive and Oblivious Adversaries",
    "authors": [
        "MohammadHossein Bateni",
        "Hossein Esfandiari",
        "Hendrik Fichtenberger",
        "Monika Henzinger",
        "Rajesh Jayaram",
        "Vahab Mirrokni",
        "Andreas Wiese"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cs.DS"
    ],
    "abstract": "In fully dynamic clustering problems, a clustering of a given data set in a metric space must be maintained while it is modified through insertions and deletions of individual points. In this paper, we resolve the complexity of fully dynamic $k$-center clustering against both adaptive and oblivious adversaries. Against oblivious adversaries, we present the first algorithm for fully dynamic $k$-center in an arbitrary metric space that maintains an optimal $(2+ε)$-approximation in $O(k \\cdot \\mathrm{polylog}(n,Δ))$ amortized update time. Here, $n$ is an upper bound on the number of active points at any time, and $Δ$ is the aspect ratio of the metric space. Previously, the best known amortized update time was $O(k^2\\cdot \\mathrm{polylog}(n,Δ))$, and is due to Chan, Gourqin, and Sozio (2018). Moreover, we demonstrate that our runtime is optimal up to $\\mathrm{polylog}(n,Δ)$ factors. In fact, we prove that even offline algorithms for $k$-clustering tasks in arbitrary metric spaces, including $k$-medians, $k$-means, and $k$-center, must make at least $Ω(n k)$ distance queries to achieve any non-trivial approximation factor. This implies a lower bound of $Ω(k)$ which holds even for the insertions-only setting.\n  We also show deterministic lower and upper bounds for adaptive adversaries, demonstrate that an update time sublinear in $k$ is possible against oblivious adversaries for metric spaces which admit locally sensitive hash functions (LSH) and give the first fully dynamic $O(1)$-approximation algorithms for the closely related $k$-sum-of-radii and $k$-sum-of-diameter problems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11843v1"
    ],
    "publication_venue": "arXiv admin note: substantial text overlap with arXiv:2112.07050, arXiv:2112.07217",
    "doi": "10.1137/1.9781611977554.ch101"
}