{
    "arxiv_id": "2303.12205",
    "paper_title": "Asteroseismic age constraints on the open cluster NGC 2477 using oscillating stars identified with TESS FFI",
    "authors": [
        "D. B. Palakkatharappil",
        "O. L. Creevey"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "The ages of pulsating stars in clusters can be determined by isochrone fitting and it can be further improved by asteroseismic modelling. We analyse the intermediate-age open cluster NGC2477, known to suffer from differential extinction, to explore if asteroseismology and clusters characteristics can help understand the metallicity, extinction and result in better age determinations than isochrone-fitting alone. We combine a multitude of recent observations from Gaia, high-resolution spectroscopy, and extinction maps to analyse the cluster and then search for and detect variability in the member stars using TESS FFI data. To interpret all of these data, we used stellar structure, evolution and oscillation codes. We performed an isochrone fitting to the cluster using publically-available isochrones, which provides a cluster age of between 0.6 to 1.1 Ga. Then using TESS Full-frame images, we analysed the time dimension of the members of this cluster. We created optimised pixel light curves using the ${\\tt tessipack}$ package which allows us to consider possible contamination by nearby stars. Using these light curves, we identified many interesting levels of variability of stars in this cluster, including binaries and oscillating stars. For the asteroseismic analysis, we selected a few uncontaminated A--F type oscillating stars and used the MESA and GYRE codes to interpret the frequency signals. By comparing the theoretical and the observed spectra, we identified frequency separations, $Δν$, for four stars. Then using the identified $Δν$ and imposing that the best matched theoretical models have the same age, metallicity and background extinction, we constrained the cluster's age to 1.0 $\\pm$ 0.1 Ga. We conclude that using the TESS FFI data, we can identify oscillating stars in clusters, which allows us to better refine their ages.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12205v1"
    ],
    "publication_venue": "26 pages, 30 figures; accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202243624"
}