{
    "arxiv_id": "2303.10135",
    "paper_title": "Efficient and Feasible Robotic Assembly Sequence Planning via Graph Representation Learning",
    "authors": [
        "Matan Atad",
        "Jianxiang Feng",
        "Ismael Rodríguez",
        "Maximilian Durner",
        "Rudolph Triebel"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-07-07"
    ],
    "latest_version": 3,
    "categories": [
        "cs.RO",
        "cs.LG"
    ],
    "abstract": "Automatic Robotic Assembly Sequence Planning (RASP) can significantly improve productivity and resilience in modern manufacturing along with the growing need for greater product customization. One of the main challenges in realizing such automation resides in efficiently finding solutions from a growing number of potential sequences for increasingly complex assemblies. Besides, costly feasibility checks are always required for the robotic system. To address this, we propose a holistic graphical approach including a graph representation called Assembly Graph for product assemblies and a policy architecture, Graph Assembly Processing Network, dubbed GRACE for assembly sequence generation. Secondly, we use GRACE to extract meaningful information from the graph input and predict assembly sequences in a step-by-step manner. In experiments, we show that our approach can predict feasible assembly sequences across product variants of aluminum profiles based on data collected in simulation of a dual-armed robotic system. We further demonstrate that our method is capable of detecting infeasible assemblies, substantially alleviating the undesirable impacts from false predictions, and hence facilitating real-world deployment soon. Code and training data are available at https://github.com/DLR-RM/GRACE.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10135v1",
        "http://arxiv.org/pdf/2303.10135v2",
        "http://arxiv.org/pdf/2303.10135v3"
    ],
    "publication_venue": "Accepted to RSS 2023"
}