{
    "arxiv_id": "2303.15500",
    "paper_title": "Turbulence in the Tail of a Jellyfish Galaxy",
    "authors": [
        "Yuan Li",
        "Rongxin Luo",
        "Matteo Fossati",
        "Ming Sun",
        "Pavel Jáchym"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "When galaxies move through the intracluster medium (ICM) inside galaxy clusters, the ram pressure of the ICM can strip the gas from galaxies. The stripped gas forms tails on the trailing side. These galaxies are hence dubbed ``jellyfish galaxies''. ESO 137-001 is a quintessential jellyfish galaxy located in the nearest rich cluster, the Norma cluster. Its spectacular multiphase tail has complex morphology and kinematics both from the imprinted galaxy's interstellar medium (ISM) and as a result of the interactions between the stripped gas and the surrounding hot plasma, mediated by radiative cooling and magnetic fields. We study the kinematics of the multiphase tail using high-resolution observations of the ionized and the molecular gas in the entire structure. We calculate the velocity structure functions (VSFs) in moving frames along the tail and find that turbulence driven by Kelvin-Helmholtz (KH) instability quickly overwhelms the original ISM turbulence and saturates at $\\sim 30$ kpc. There is also a hint that the far end of the tail has possibly started to inherit pre-existing large-scale ICM turbulence likely caused by structure formation. Turbulence measured by the molecular gas is generally consistent with that measured by the ionized gas in the tail but has a slightly lower amplitude. Most of the measured turbulence is below the mean free path of the hot ICM ($\\sim 11$ kpc). Using warm/cool gas as a tracer of the hot ICM, we find that the isotropic viscosity of the hot plasma must be suppressed below 0.01 percent Spitzer level.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15500v1"
    ],
    "publication_venue": "7 pages, 6 figures, accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad874"
}