{
    "arxiv_id": "2303.09569",
    "paper_title": "Multimessenger study of merging massive black holes in the Obelisk simulation: gravitational waves, electromagnetic counterparts, and their link to galaxy and black hole populations",
    "authors": [
        "C. A. Dong-Páez",
        "M. Volonteri",
        "R. S. Beckmann",
        "Y. Dubois",
        "A. Mangiagli",
        "M. Trebitsch",
        "S. Vergani",
        "N. Webb"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-07-26"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
    ],
    "abstract": "Massive black hole (BH) mergers are predicted to be powerful sources of low-frequency gravitational waves (GWs). Coupling the detection of GWs with electromagnetic (EM) detection can provide key information about merging BHs and their environments. We study the high-resolution cosmological radiation-hydrodynamics simulation Obelisk, run to redshift $z=3.5$, to assess the GW and EM detectability of high-redshift BH mergers, modelling spectral energy distribution and obscuration. For EM detectability we further consider sub-grid dynamical delays in postprocessing. We find that most of the merger events can be detected by LISA, except for high-mass mergers with very unequal mass ratios. Intrinsic binary parameters are accurately measured, but the sky localisation is poor generally. Only $\\sim 40\\%$ of these high-redshift sources have sky localisation better than $10\\,\\mathrm{deg}^2$. Merging BHs are hard to detect in the restframe UV since they are fainter than the host galaxies, which at high $z$ are star-forming. A significant fraction, $15-35\\%$, of BH mergers instead outshines the galaxy in X-rays, and about $5-15\\%$ are sufficiently bright to be detected with sensitive X-ray instruments. If mergers induce an Eddington-limited brightening, up to $30\\%$ of sources can become observable. The transient flux change originating from such a brightening is often large, allowing $4-20\\%$ of mergers to be detected as EM counterparts. A fraction $1-30\\%$ of mergers is also detectable at radio frequencies. Observable merging BHs tend to have higher accretion rates and masses and are overmassive at fixed galaxy mass with respect to the full population. Most EM-observable mergers can also be GW-detected with LISA, but their sky localisation is generally poorer. This has to be considered when using EM counterparts to obtain information about the properties of merging BHs and their environment.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09569v1"
    ],
    "publication_venue": "17 pages, 11 figures, submitted to A&A",
    "doi": "10.1051/0004-6361/202346435"
}