{
    "arxiv_id": "2303.15418",
    "paper_title": "Towards robust corrections for stellar contamination in JWST exoplanet transmission spectra",
    "authors": [
        "Benjamin V. Rackham",
        "Julien de Wit"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
    ],
    "abstract": "Transmission spectroscopy is still the preferred characterization technique for exoplanet atmospheres, although it presents unique challenges which translate into characterization bottlenecks when robust mitigation strategies are missing. Stellar contamination is one of such challenges that can overpower the planetary signal by up to an order of magnitude, and thus not accounting for stellar contamination can lead to significant biases in the derived atmospheric properties. Yet, accounting for stellar contamination may not be straightforward, as important discrepancies exist between state-of-the-art stellar models and measured spectra and between models themselves. Here we explore the extent to which stellar models can be used to reliably correct for stellar contamination and yield a planet's uncontaminated transmission spectrum. We find that (1) discrepancies between stellar models can dominate the noise budget of JWST transmission spectra of planets around stars with heterogeneous photospheres; (2) the true number of unique photospheric spectral components and their properties can only be accurately retrieved when the stellar models have a sufficient fidelity; and (3) under such optimistic circumstances the contribution of stellar contamination to the noise budget of a transmission spectrum is considerably below that of the photon noise for the standard transit observation setup. Therefore, we suggest (1) increased efforts towards development of model spectra of stars and their active regions in a data-driven manner; and (2) the development of empirical approaches for deriving spectra of photospheric components using the observatories with which the atmospheric explorations are carried out.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15418v1"
    ],
    "publication_venue": "15 pages, 8 figures, 2 tables"
}