{
    "arxiv_id": "2303.11598",
    "paper_title": "Anomalous second magnetization peak in 12442-type RbCa$_2$Fe$_4$As$_4$F$_2$ superconductors",
    "authors": [
        "Xiaolei Yi",
        "Xiangzhuo Xing",
        "Yan Meng",
        "Nan Zhou",
        "Chunlei Wang",
        "Yue Sun",
        "Zhixiang Shi"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con"
    ],
    "abstract": "The second magnetization peak (SMP) appears in most superconductors and is crucial for the understanding of vortex physics as well as the application. Although it is well known that the SMP is related to the type and quantity of disorder/defects, the mechanism has not been universally understood. In this work, we selected three stoichiometric superconducting RbCa$_2$Fe$_4$As$_4$F$_2$ single crystals with identical superconducting critical temperature $T_c$ $\\sim$ 31 K and similar self-field critical current density $J_c$, but with different amounts of disorder/defects, to study the SMP effect. It is found that only the sample S2 with a moderate disorder/defects shows a significant SMP effect. The evolution of the normalized pinning force density $f_p$ demonstrates that the dominant pinning mechanism changes from weak pinning at low temperatures to strong pinning at high temperatures. The microstructure study for sample S2 reveals some expanded Ca$_2$F$_2$ layers and dislocation defects in RbFe$_2$As$_2$ layers. The normalized magnetic relaxation results indicate that the SMP is strongly associated with the elastic to plastic (E-P) vortex transition. As temperature increases, the SMP gradually evolves into a step-like shape and then becomes a sharp peak near the irreversibility field similar to what is usually observed in low-temperature superconductors. Our findings connect the low field SMP of high-temperature superconductors and the high field peak of low-temperature superconductors, revealing the possible universal origin related to the E-P phase transition.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11598v1"
    ],
    "publication_venue": "9 pages, 5 figures",
    "doi": "10.1088/0256-307X/40/2/027401"
}