{
    "arxiv_id": "2303.10604",
    "paper_title": "Rainy downdrafts in abyssal atmospheres",
    "authors": [
        "S. Markham",
        "T. Guillot",
        "C. Li"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
    ],
    "abstract": "Results from Juno's microwave radiometer indicate non-uniform mixing of ammonia vapor in Jupiter's atmosphere down to tens of bars, far beneath the cloud level. Helioseismic observations suggest solar convection may require narrow, concentrated downdrafts called entropy rain to accommodate the Sun's luminosity. Both observations suggest some mechanism of non-local convective transport. We seek to predict the depth that a concentrated density anomaly can reach before efficiently mixing with its environment in bottomless atmospheres. We modify classic self-similar analytical models of entraining thermals to account for the compressibility of an abyssal atmosphere. We compare these models to the output of high resolution three dimensional fluid dynamical simulations to more accurately model the chaotic influence of turbulence. We find that localized density anomalies propagate down to ~3-8 times their initial size without substantially mixing with their environment. Our analytic model accurately predicts the initial flow, but the self-similarity assumption breaks down after the flow becomes unstable at a characteristic penetration depth. In the context of Jupiter, our findings suggest that precipitation concentrated into localized downdrafts of size ~20km can coherently penetrate to on the order of a hundred kilometers (tens of bars) beneath its initial vaporization level without mixing with its environment. This finding is consistent with expected convective storm length-scales, and Juno MWR measurements of ammonia depletion. Compositional gradients of volatiles beneath their cloud levels may be common on stormy giant planets. In the context of the Sun, we find that turbulent downdrafts in abyssal atmospheres cannot maintain their coherence through the Sun's convective layer, a potential challenge for the entropy rain hypothesis.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10604v1"
    ],
    "publication_venue": "20 pages, 16 figures. Accepted by A&A",
    "doi": "10.1051/0004-6361/202245609"
}