{
    "arxiv_id": "2303.15516",
    "paper_title": "A systematic survey of millimetre-wavelength flaring variability of Young Stellar Objects in the Orion Nebula Cluster",
    "authors": [
        "J. Vargas-González",
        "J. Forbrich",
        "V. M. Rivilla",
        "K. M. Menten",
        "M. Güdel",
        "A. Hacar"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
    ],
    "abstract": "High-energy processes are ubiquitous even in the earliest stages of protostellar evolution. Motivated by the results of our systematic search for intense centimeter radio flares in Young Stellar Objects (YSOs) and by rare findings of strong millimeter-wavelength variability, we have conducted a systematic search for such variability in the Orion Nebula Cluster (ONC) using Atacama Large Millimeter/submillimeter Array (ALMA). Rapid variability on timescales of minutes to hours in the (centimeter)millimeter-wavelength range indicates (gyro)synchrotron radiation. Additionally, mass accretion will also affect the millimeter-wavelength luminosity but typically on longer timescales. Beyond studies of individual YSOs, our characterization of strong millimeter-wavelength variability with ALMA in the ONC sets first systematic constraints on the occurrence of such variability in a large number of YSOs ($\\sim$130). We report the discovery of an order of magnitude millimeter-flare within just a few minutes from a known YSO previously reported as a radio flaring source at cm-wavelengths (the \"ORBS'' source). We also present an assessment of the systematic variability effects caused by the use of time-sliced imaging of a complex region. These are mostly due to the impact of a changing synthesized beam throughout the observations. We use simulated ALMA observations to reproduce and quantify these effects and set a lower limit for the variability that can be studied using our method in a complex region such as the ONC. Our results demonstrate that the utility of time domain analysis of YSOs extends into the millimeter-wavelength range, potentially interfering with the conversion of observed fluxes into dust masses.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15516v1"
    ],
    "publication_venue": "15 pages, 8 figures, accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad926"
}