{
    "arxiv_id": "2303.16223",
    "paper_title": "A bright megaelectronvolt emission line in $γ$-ray burst GRB 221009A",
    "authors": [
        "Maria Edvige Ravasio",
        "Om Sharan Salafia",
        "Gor Oganesyan",
        "Alessio Mei",
        "Giancarlo Ghirlanda",
        "Stefano Ascenzi",
        "Biswajit Banerjee",
        "Samanta Macera",
        "Marica Branchesi",
        "Peter G. Jonker",
        "Andrew J. Levan",
        "Daniele B. Malesani",
        "Katharine B. Mulrey",
        "Andrea Giuliani",
        "Annalisa Celotti",
        "Gabriele Ghisellini"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The highly variable and energetic pulsed emission of a long gamma-ray burst (GRB) is thought to originate from local, rapid dissipation of kinetic or magnetic energy within an ultra-relativistic jet launched by a newborn compact object, formed during the collapse of a massive star. The spectra of GRB pulses are best modelled by power-law segments, indicating the dominance of non-thermal radiation processes. Spectral lines in the X-ray and soft $γ$-ray regime for the afterglow have been searched for intensively, but never confirmed. No line features ever been identified in the high energy prompt emission. Here we report the discovery of a highly significant ($> 6 σ$) narrow emission feature at around $10$ MeV in the brightest ever GRB 221009A. By modelling its profile with a Gaussian, we find a roughly constant width $σ\\sim 1$ MeV and temporal evolution both in energy ($\\sim 12$ MeV to $\\sim 6$ MeV) and luminosity ($\\sim 10^{50}$ erg/s to $\\sim 2 \\times 10^{49}$ erg/s) over 80 seconds. We interpret this feature as a blue-shifted annihilation line of relatively cold ($k_\\mathrm{B}T\\ll m_\\mathrm{e}c^2$) electron-positron pairs, which could have formed within the jet region where the brightest pulses of the GRB were produced. A detailed understanding of the conditions that can give rise to such a feature could shed light on the so far poorly understood GRB jet properties and energy dissipation mechanism.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16223v1"
    ],
    "publication_venue": "Submitted"
}