{
    "arxiv_id": "2303.16826",
    "paper_title": "Galaxy interactions in filaments and sheets: insights from EAGLE simulations",
    "authors": [
        "Apashanka Das",
        "Biswajit Pandey",
        "Suman Sarkar"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
    ],
    "abstract": "We study the colour and star formation rates of paired galaxies in filaments and sheets using the EAGLE simulations. We find that the major pairs with pair separation $<50$ kpc are bluer and more star forming in filamentary environments compared to those hosted in sheet-like environments. This trend reverses beyond a pair separation of $\\sim 50$ kpc. The interacting pairs with larger separations ($>50$ kpc) in filaments are on average redder and low-star forming when compared to those embedded in sheets. The galaxies in filaments and sheets may have different stellar mass and cold gas mass distributions. Using a Kolmogorov-Smirnov test, we find that for paired galaxies with pair separation $<50$ kpc, there are no significant differences in these properties in sheets and filaments. The filaments transport gas towards the cluster of galaxies. Some earlier studies find preferential alignment of galaxy pairs with filament axis. Such alignment of galaxy pairs may lead to different gas accretion efficiency in galaxies residing in filaments and sheets. We propose that the enhancement of star formation rate at smaller pair separation in filaments is caused by the alignment of galaxy pairs. A recent study with the SDSS data (Das et al., 2023) reports the same findings. The confirmation of these results by the EAGLE simulations suggests that the hydrodynamical simulations are powerful theoretical tools for studying the galaxy formation and evolution in the cosmic web.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16826v1"
    ],
    "publication_venue": "9 pages, 2 figures, 2 tables"
}