{
    "arxiv_id": "2303.09371",
    "paper_title": "MIGHTEE-\\HI: Possible interactions with the galaxy NGC~895",
    "authors": [
        "Brenda Namumba",
        "Javier Román",
        "Jesus Falcon Barroso",
        "Johan H. Knapen",
        "Ianjamasimanana Roger",
        "Elizabeth Naluminsa",
        "Gyula I. G. Jozsa",
        "Marie Korsaga",
        "Natasha Maddox",
        "Brad Frank",
        "Sinenhlanhla Sikhosana",
        "Samuel Legodi",
        "Claude Carignan",
        "Anastasia A. Ponomareva",
        "Tom Jarrett",
        "Danielle Lucero",
        "Oleg M. Smirnov",
        "Thijs van der Hulst",
        "D. J. Pisano",
        "kasia Malek",
        "Lucia Marchetti",
        "Mattia Vaccari",
        "Matt Jarvis",
        "Maarten Baes",
        "Martin Meyer",
        "Elizabeth A. K. Adams",
        "Jacinta Delhaize",
        "Hao Chen",
        "Sambatriniaina Rajohnson",
        "Sushma Kurapati",
        "Ian Heywood",
        "Lourdes Verdes-Montenegro"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "The transformation and evolution of a galaxy is strongly influenced by interactions with its environment. Neutral hydrogen (\\HI) is an excellent way to trace these interactions. Here, we present \\HI\\ observations of the spiral galaxy NGC~895, which was previously thought to be isolated. High-sensitivity \\HI\\ observations from the MeerKAT large survey project MIGHTEE reveal possible interaction features, such as extended spiral arms, and the two newly discovered \\HI\\ companions, that drive us to change the narrative that it is an isolated galaxy. We combine these observations with deep optical images from the Hyper Suprime Camera to show an absence of tidal debris between NGC 895 and its companions. We do find an excess of light in the outer parts of the companion galaxy MGTH$\\_$J022138.1-052631 which could be an indication of external perturbation and thus possible sign of interactions. Our analysis shows that NGC~895 is an actively star-forming galaxy with a SFR of $\\mathrm{1.75 \\pm 0.09 [M_{\\odot}/yr]}$, a value typical for high stellar mass galaxies on the star forming main sequence. It is reasonable to state that different mechanisms may have contributed to the observed features in NGC~895 and this emphasizes the need to revisit the target with more detailed observations. Our work shows the high potential and synergy of using state-of-the-art data in both \\HI\\ and optical to reveal a more complete picture of galaxy environments.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09371v1"
    ],
    "publication_venue": "14 pages, 10 figures. Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad857"
}