{
    "arxiv_id": "2303.11357",
    "paper_title": "Towards a Comprehensive Catalog of Bona Fide Compact Symmetric Objects",
    "authors": [
        "S. Kiehlmann",
        "M. L. Lister",
        "A. C. S. Readhead",
        "I. Liodakis",
        "S. O'Neill",
        "T. J. Pearson",
        "E. Sheldahl",
        "A. Siemiginowska",
        "K. Tassis",
        "G. B. Taylor",
        "P. N. Wilkinson"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
    ],
    "abstract": "Compact Symmetric Objects (CSOs) are jetted Active Galactic Nuclei (AGN) with overall projected size < 1 kpc. The classification was introduced to distinguish these objects from the majority of known compact jetted-AGN, where the observed emission is relativistically boosted towards the observer. The original classification criteria for CSOs were: (i) evidence of emission on both sides of the center of activity, and (ii) overall size < 1 kpc. However some relativistically boosted objects with jet axes close to the line of sight appear symmetric and have been mis-classified as CSOs in the literature, thereby undermining the CSO classification. We introduce two new CSO classification criteria based on (iii) flux density variability, and (iv) the apparent velocity of components moving along the jets. As a first step towards creating a comprehensive catalog of \"bona fide\" CSOs, in this paper we identify 79 bona fide CSOs that meet our expanded CSO selection criteria. This sample of bona fide CSOs can be used for astrophysical studies of CSOs without fear of contamination by objects incorrectly identified as CSOs. We define three complete sub-samples of the 79 CSOs, which are suitable for statistical tests, and show that the fraction of CSOs in flux density limited samples with $\\rm S_{5~GHz}$ > 700 mJy is between 6.4% and 8.2%.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11357v1"
    ],
    "publication_venue": "21 pages, 7 figures, 3 tables"
}