{
    "arxiv_id": "2303.08365",
    "paper_title": "Gamify Stencil Dwarf on Cloud for Democratizing Scientific Computing",
    "authors": [
        "Kun Li",
        "Zhichun Li",
        "Yuetao Chen",
        "Zixuan Wang",
        "Yiwei Zhang",
        "Liang Yuan",
        "Haipeng Jia",
        "Yunquan Zhang",
        "Ting Cao",
        "Mao Yang"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "cs.DC"
    ],
    "abstract": "Stencil computation is one of the most important kernels in various scientific computing. Nowadays, most Stencil-driven scientific computing still relies heavily on supercomputers, suffering from expensive access, poor scalability, and duplicated optimizations.\n  This paper proposes Tetris, the first system for high-performance Stencil on heterogeneous CPU+GPU, towards democratizing Stencil-driven scientific computing on Cloud. In Tetris, polymorphic tiling tetrominoes are first proposed to bridge different hardware architectures and various application contexts with a perfect spatial and temporal tessellation automatically. Tetris is contributed by three main components: (1) Underlying hardware characteristics are first captured to achieve a sophisticated Pattern Mapping by register-level tetrominoes; (2) An efficient Locality Enhancer is first presented for data reuse on spatial and temporal dimensions simultaneously by cache/SMEM-level tetrominoes; (3) A novel Concurrent Scheduler is first designed to exploit the full potential of on-cloud memory and computing power by memory-level tetrominoes. Tetris is orthogonal to (and complements) the optimizations or deployments for a wide variety of emerging and legacy scientific computing applications. Results of thermal diffusion simulation demonstrate that the performance is improved by 29.6x, reducing time cost from day to hour, while preserving the original accuracy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08365v1"
    ],
    "publication_venue": null
}