{
    "arxiv_id": "2303.07895",
    "paper_title": "The Learnability of In-Context Learning",
    "authors": [
        "Noam Wies",
        "Yoav Levine",
        "Amnon Shashua"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [],
    "latest_version": 1,
    "categories": [
        "cs.CL"
    ],
    "abstract": "In-context learning is a surprising and important phenomenon that emerged\nwhen modern language models were scaled to billions of learned parameters.\nWithout modifying a large language model's weights, it can be tuned to perform\nvarious downstream natural language tasks simply by including concatenated\ntraining examples of these tasks in its input. Though disruptive for many\npractical applications of large language models, this emergent learning\nparadigm is not well understood from a theoretical perspective. In this paper,\nwe propose a first-of-its-kind PAC based framework for in-context learnability,\nand use it to provide the first finite sample complexity results for the\nin-context learning setup. Our framework includes an initial pretraining phase,\nwhich fits a function to the pretraining distribution, and then a second\nin-context learning phase, which keeps this function constant and concatenates\ntraining examples of the downstream task in its input. We use our framework in\norder to prove that, under mild assumptions, when the pretraining distribution\nis a mixture of latent tasks (a model often considered for natural language\npretraining), these tasks can be efficiently learned via in-context learning,\neven though the model's weights are unchanged and the input significantly\ndiverges from the pretraining distribution. Our theoretical analysis reveals\nthat in this setting, in-context learning is more about identifying the task\nthan about learning it, a result which is in line with a series of recent\nempirical findings. We hope that the in-context learnability framework\npresented in this paper will facilitate future progress towards a deeper\nunderstanding of this important new learning paradigm.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07895v1"
    ],
    "publication_venue": null
}