{
    "arxiv_id": "2303.10768",
    "paper_title": "2D MXene Electrochemical Transistors",
    "authors": [
        "Min-A Kang",
        "Jyoti Shakya",
        "Jian Li",
        "Armin VahidMohammadi",
        "Weiqian Tian",
        "Erica Zeglio",
        "Mahiar Max Hamedi"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.app-ph"
    ],
    "abstract": "The solid-state field-effect transistor, FET, and its theories were paramount in the discovery and studies of graphene. In the past two decades, another transistor based on conducting polymers called the organic electrochemical transistor (ECT) was shown and largely studied. The main difference between ECTs and FETs is the mode and extent of channel doping: while in FETs the channel only has surface doping through dipoles, the mixed ionic-electronic conductivity of the channel material in Organic ECTs enables bulk electrochemical doping. As a result, the organic ECT maximizes conductance modulation at the expense of speed. Until now ECTs have been based on conducting polymers, but here we show for the first time that MXenes, a class of 2D materials beyond graphene, have mixed ionic-electronic properties that enable the realization of electrochemical transistors (ECTs). We show that the formulas for organic ECTs can be applied to these 2D ECTs and used to extract parameters like mobility. These MXene ECTs have high transconductance values but low on-off ratios. We further show that conductance switching data measured using ECT in combination with other in-situ ex-situ electrochemical measurements, is a powerful tool for correlating the change in conductance to that of redox state: to our knowledge, this is the first report of this important correlation for MXene films. Many future possibilities exist for MXenes ECTs, and we think other 2D materials with bandgaps can also form ECTs with single or heterostructured 2D materials. 2D ECTs can draw great inspiration and theoretical tools from the field of organic ECTs and have the potential to considerably extend the capabilities of transistors beyond that of conducting polymer ECTs, with added properties such as extreme heat resistance, tolerance for solvents, and higher conductivity for both electrons and ions than conducting polymers.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10768v1"
    ],
    "publication_venue": "14 pages, 12 figures"
}