{
    "arxiv_id": "2303.07974",
    "paper_title": "Thermal effects in hot and dilute homogeneous asymmetric nuclear matter",
    "authors": [
        "Vishal Parmar",
        "Manoj K Sharma",
        "S K Patra"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "nucl-th"
    ],
    "abstract": "We present a comprehensive analysis of hot and dilute isospin-asymmetric nuclear matter employing the temperature-dependent effective-relativistic mean-field theory (E-RMF). The E-RMF is applied to study the effect of $δ$ and $ω-ρ$ meson cross-coupling on the thermal properties of asymmetric nuclear matter using two recently developed IOPB-I and G3 parameter sets. These sets are known to reproduce the nuclear matter properties in agreement with various experimental and observational constraints. We consider the nuclear matter to be homogeneous and study the equation of state (EoS) for densities, temperature and asymmetry which are relevant for astrophysical simulations such as supernovae explosion. The effect of temperature is investigated in reference to the density-dependent free symmetry energy and its higher-order derivatives using the well known parabolic approximation. The larger value of $λ_ω$ cross-coupling in G3 in addition to the $δ$ meson coupling in G3 smoothen the free symmetry energy. Thermal effects on various state variables are examined at fixed temperature and isospin asymmetry by separating their T=0 and the finite-T expressions. The thermal effects are mainly governed by effective mass with larger effective mass estimating larger thermal contribution. The effect of temperature on isothermal and isentropic incompressibility is discussed which is in harmony with various available microscopic calculations. The liquid-gas phase transition properties are examined in asymmetric matter with two conserved charges in the context of different slope parameter and comparable symmetry energy in IOPB-I and G3 set. The spinodal instability, binodal curve and critical properties are found to be influenced by the slope parameter $L_{sym}$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07974v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevC.103.055817"
}