{
    "arxiv_id": "2303.15511",
    "paper_title": "Massive binary black holes from Population II and III stars",
    "authors": [
        "Guglielmo Costa",
        "Michela Mapelli",
        "Giuliano Iorio",
        "Filippo Santoliquido",
        "Gastón J. Escobar",
        "Ralf S. Klessen",
        "Alessandro Bressan"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
    ],
    "abstract": "Population III stars, born from the primordial gas in the Universe, lose a negligible fraction of their mass via stellar winds and possibly follow a top-heavy mass function. Hence, they have often been regarded as the ideal progenitors of massive black holes (BHs), even above the pair instability mass gap. Here, we evolve a large set of Population III binary stars (metallicity $Z=10^{-11}$) with our population-synthesis code SEVN, and compare them with Population II binary stars ($Z=10^{-4}$). In our models, the lower edge of the pair-instability mass gap corresponds to a BH mass of $\\approx{86}$ ($\\approx{91}$) M$_\\odot$ for single Population III (II) stars. Overall, we find only mild differences between the properties of binary BHs (BBHs) born from Population III and II stars, especially if we adopt the same initial mass function and initial orbital properties. Most BBH mergers born from Population III and II stars have primary BH mass below the pair-instability gap, and the maximum secondary BH mass is $ < 50$ M$_\\odot$. Only up to $\\approx{3.3}$% ($\\approx{0.09}$%) BBH mergers from Population III (II) progenitors have primary mass above the gap. Unlike metal-rich binary stars, the main formation channel of BBH mergers from Population III and II stars involves only stable mass transfer episodes in our fiducial model.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15511v1",
        "http://arxiv.org/pdf/2303.15511v2"
    ],
    "publication_venue": "15 pages, 17 figures, comments are welcome"
}