{
    "arxiv_id": "2303.09047",
    "paper_title": "Response Theory Identifies Reaction Coordinates and Explains Critical Phenomena in Noisy Interacting Systems",
    "authors": [
        "Niccolò Zagli",
        "Valerio Lucarini",
        "Grigorios A. Pavliotis"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.stat-mech",
        "cond-mat.dis-nn",
        "nlin.CD"
    ],
    "abstract": "We consider a nonequilibrium system of interacting agents with pairwise interactions and quenched disorder in the dynamics. Such systems are routinely used to model collective emergent behaviour in multiple areas of social and natural sciences as they exhibit, in the thermodynamic limit, both continuous and discontinuous phase transitions. The goal of this contribution is twofold. Firstly, we provide a framework to identify suitable reaction coordinates for the system starting from the microscopic properties of the interaction structure among the agents. We state conditions on the interactions that lead to a dimension reduction of the system in terms of a finite number of reaction coordinates. Secondly, we show that such reaction coordinates prove to be proper nonequilibrium thermodynamic variables as they carry information on correlation and memory properties and provide the natural way to probe the sensitivity of the system to external perturbations. In particular, we prove that the investigation of response properties of the observables corresponding to the reaction coordinates allows to identify, pinpoint and characterise phase transitions of the system as these manifest themselves as singularities in the corresponding susceptibility function. We apply our theory, corroborated by numerical evidence, to the investigation of static and dynamic phase transitions of the paradigmatic Kuramoto model. Our approach allows us to prove that the dynamic phase transition corresponds to an uncommon scenario of resonance originating from a non-vanishing real part of the residue associated to the singular part of the susceptibility. In this setting, the system exhibits a coherent behaviour characterised by a spontaneously acquired intrinsic phase, leading to the emergence of a phase shift of the response to sinusoidal forcings at the critical frequency.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09047v1"
    ],
    "publication_venue": null
}