{
    "arxiv_id": "2303.10082",
    "paper_title": "Scaling limits and universality: Critical percolation on weighted graphs converging to an $L^3$ graphon",
    "authors": [
        "Jnaneshwar Baslingker",
        "Shankar Bhamidi",
        "Nicolas Broutin",
        "Sanchayan Sen",
        "Xuan Wang"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-09-27"
    ],
    "latest_version": 2,
    "categories": [
        "math.PR",
        "math.CO"
    ],
    "abstract": "We develop a general universality technique for establishing metric scaling limits of critical random discrete structures exhibiting mean-field behavior that requires four ingredients: (i) from the barely subcritical regime to the critical window, components merge approximately like the multiplicative coalescent, (ii) asymptotics of the susceptibility functions are the same as that of the Erdos-Renyi random graph, (iii) asymptotic negligibility of the maximal component size and the diameter in the barely subcritical regime, and (iv) macroscopic averaging of distances between vertices in the barely subcritical regime.\n  As an application of the general universality theorem, we establish, under some regularity conditions, the critical percolation scaling limit of graphs that converge, in a suitable topology, to an $L^3$ graphon. In particular, we define a notion of the critical window in this setting. The $L^3$ assumption ensures that the model is in the Erdos-Renyi universality class and that the scaling limit is Brownian. Our results do not assume any specific functional form for the graphon. As a consequence of our results on graphons, we obtain the metric scaling limit for Aldous-Pittel's RGIV model [9] inside the critical window.\n  Our universality principle has applications in a number of other problems including in the study of noise sensitivity of critical random graphs [52]. In [10], we use our universality theorem to establish the metric scaling limit of critical bounded size rules. Our method should yield the critical metric scaling limit of Rucinski and Wormald's random graph process with degree restrictions [56] provided an additional technical condition about the barely subcritical behavior of this model can be proved.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10082v1",
        "http://arxiv.org/pdf/2303.10082v2"
    ],
    "publication_venue": "65 pages, 1 figure, the universality principle (Theorem 3.4) from arXiv:1411.3417 has now been included in this paper. v2: minor changes"
}