{
    "arxiv_id": "2303.08911",
    "paper_title": "Reconfigurable Intelligent Surface-Assisted Cross-Layer Authentication for Secure and Efficient Vehicular Communications",
    "authors": [
        "Mahmoud A. Shawky",
        "Syed Tariq Shah",
        "Michael S. Mollel",
        "Jalil R. Kazim",
        "Muhammad Ali Imran",
        "Qammer H. Abbasi",
        "Shuja Ansari",
        "Ahmad Taha"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SP",
        "eess.SY"
    ],
    "abstract": "Intelligent transportation systems increasingly depend on wireless communication, facilitating real-time vehicular communication. In this context, message authentication is crucial for establishing secure and reliable communication. However, security solutions must consider the dynamic nature of vehicular communication links, which fluctuate between line-of-sight (LoS) and non-line-of-sight (NLoS). In this paper, we propose a lightweight cross-layer authentication scheme that employs public-key infrastructure-based authentication for initial legitimacy detection while using keyed-based physical-layer re-authentication for message verification. However, the latter's detection probability (P_d) decreases with the reduction of the signal-to-noise ratio (SNR). Therefore, we examine using Reconfigurable Intelligent Surface (RIS) to enhance the SNR value directed toward the designated vehicle and consequently improve the P_d, especially for NLoS scenarios. We conducted theoretical analysis and practical implementation of the proposed scheme using a 1-bit RIS, consisting of 64 x 64 reflective units. Experimental results show a significant improvement in the P_d, increasing from 0.82 to 0.96 at SNR = - 6 dB for an orthogonal frequency division multiplexing system with 128 subcarriers. We also conducted informal and formal security analyses, using Burrows-Abadi-Needham (BAN)-logic, to prove the scheme's ability to resist passive and active attacks. Finally, the computation and communication comparisons demonstrate the superior performance of the proposed scheme compared to traditional crypto-based methods.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08911v1"
    ],
    "publication_venue": "12 pages, 12 figures and 5 tables"
}