{
    "arxiv_id": "2303.09137",
    "paper_title": "Morphological stability of solid-liquid interfaces under additive manufacturing conditions",
    "authors": [
        "D. Tourret",
        "J. Klemm-Toole",
        "A. Eres Castellanos",
        "B. Rodgers",
        "G. Becker",
        "A. Saville",
        "B. Ellyson",
        "C. Johnson",
        "B. Milligan",
        "J. Copley",
        "R. Ochoa",
        "A. Polonsky",
        "K. Pusch",
        "M. P. Haines",
        "K. Fezzaa",
        "T. Sun",
        "K. Clarke",
        "S. Babu",
        "T. Pollock",
        "A. Karma",
        "A. Clarke"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Understanding rapid solidification behavior at velocities relevant to additive manufacturing (AM) is critical to controlling microstructure selection. Although in-situ visualization of solidification dynamics is now possible, systematic studies under AM conditions with microstructural outcomes compared to solidification theory remain lacking. Here we measure solid-liquid interface velocities of Ni-Mo-Al alloy single crystals under AM conditions with synchrotron X-ray imaging, characterize the microstructures, and show discrepancies with classical theories regarding the onset velocity for absolute stability of a planar solid-liquid interface. Experimental observations reveal cellular/dendritic microstructures can persist at velocities larger than the expected absolute stability limit, where banded structure formation should theoretically appear. We show that theory and experimental observations can be reconciled by properly accounting for the effect of solute trapping and kinetic undercooling on the velocity-dependent solidus and liquidus temperatures of the alloy. Further theoretical developments and accurate assessments of key thermophysical parameters - like liquid diffusivities, solid-liquid interface excess free energies, and kinetic coefficients - remain needed to quantitatively investigate such discrepancies and pave the way for the prediction and control of microstructure selection under rapid solidification conditions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09137v1"
    ],
    "publication_venue": null,
    "doi": "10.1016/j.actamat.2023.118858"
}