{
    "arxiv_id": "2303.16839",
    "paper_title": "MaMMUT: A Simple Architecture for Joint Learning for MultiModal Tasks",
    "authors": [
        "Weicheng Kuo",
        "AJ Piergiovanni",
        "Dahun Kim",
        "Xiyang Luo",
        "Ben Caine",
        "Wei Li",
        "Abhijit Ogale",
        "Luowei Zhou",
        "Andrew Dai",
        "Zhifeng Chen",
        "Claire Cui",
        "Anelia Angelova"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV",
        "cs.CL",
        "cs.LG"
    ],
    "abstract": "The development of language models have moved from encoder-decoder to decoder-only designs. In addition, the common knowledge has it that the two most popular multimodal tasks, the generative and contrastive tasks, tend to conflict with one another, are hard to accommodate in one architecture, and further need complex adaptations for downstream tasks. We propose a novel paradigm of training with a decoder-only model for multimodal tasks, which is surprisingly effective in jointly learning of these disparate vision-language tasks. This is done with a simple model, called MaMMUT. It consists of a single vision encoder and a text decoder, and is able to accommodate contrastive and generative learning by a novel two-pass approach on the text decoder. We demonstrate that joint learning of these diverse objectives is simple, effective, and maximizes the weight-sharing of the model across these tasks. Furthermore, the same architecture enables straightforward extensions to open-vocabulary object detection and video-language tasks. The model tackles a diverse range of tasks, while being modest in capacity. Our model achieves the state of the art on image-text and text-image retrieval, video question answering and open-vocabulary detection tasks, outperforming much larger and more extensively trained foundational models. It shows very competitive results on VQA and Video Captioning, especially considering its capacity. Ablations confirm the flexibility and advantages of our approach.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16839v1",
        "http://arxiv.org/pdf/2303.16839v2"
    ],
    "publication_venue": null
}