{
    "arxiv_id": "2303.13532",
    "paper_title": "Enhanced Iterated local search for the technician routing and scheduling problem",
    "authors": [
        "Ala-Eddine Yahiaoui",
        "Sohaib Afifi",
        "Hamid Afifi"
    ],
    "submission_date": "2023-03-12",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cs.AI"
    ],
    "abstract": "Most public facilities in the European countries, including France, Germany, and the UK, were built during the reconstruction projects between 1950 and 1980. Owing to the deteriorating state of such vital infrastructure has become relatively expensive in the recent decades. A significant part of the maintenance operation costs is spent on the technical staff. Therefore, the optimal use of the available workforce is essential to optimize the operation costs. This includes planning technical interventions, workload balancing, productivity improvement, etc. In this paper, we focus on the routing of technicians and scheduling of their tasks. We address for this purpose a variant of the workforce scheduling problem called the technician routing and scheduling problem (TRSP). This problem has applications in different fields, such as transportation infrastructure (rail and road networks), telecommunications, and sewage facilities. To solve the TRSP, we propose an enhanced iterated local search (eILS) approach. The enhancement of the ILS firstly includes an intensification procedure that incorporates a set of local search operators and removal-repair heuristics crafted for the TRSP. Next, four different mechanisms are used in the perturbation phase. Finally, an elite set of solutions is used to extensively explore the neighborhood of local optima as well as to enhance diversification during search space exploration. To measure the performance of the proposed method, experiments were conducted based on benchmark instances from the literature, and the results obtained were compared with those of an existing method. Our method achieved very good results, since it reached the best overall gap, which is three times lower than that of the literature. Furthermore, eILS improved the best-known solution for $34$ instances among a total of $56$ while maintaining reasonable computational times.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13532v1"
    ],
    "publication_venue": "Submitted manuscript to Computers and Operations Research journal. 34 pages, 7 figures, 6 tables"
}