{
    "arxiv_id": "2303.09712",
    "paper_title": "A catalog of nearby accelerating star candidates in Gaia DR3",
    "authors": [
        "Marc L. Whiting",
        "Joshua B. Hill",
        "Benjamin C. Bromley",
        "Scott J. Kenyon"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-04-19"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
    ],
    "abstract": "We describe a new catalog of accelerating star candidates with Gaia $G\\le 17.5$ mag and distances $d\\le 100$ pc. Designated as Gaia Nearby Accelerating Star Catalog (GNASC), it contains 29,684 members identified using a supervised machine-learning algorithm trained on the Hipparcos-Gaia Catalog of Accelerations (HGCA), Gaia Data Release 2, and Gaia Early Data Release 3. We take advantage of the difference in observation timelines of the two Gaia catalogs and information about the quality of the astrometric modeling based on the premise that acceleration will correlate with astrometric uncertainties. Catalog membership is based on whether constant proper motion over three decades can be ruled out at high confidence (greater than 99.9%). Test data suggest that catalog members each have a 68% likelihood of true astrometric acceleration; subsets of the catalog perform even better, with the likelihood exceeding 85%. We compare the GNASC with Gaia Data Release 3 and its table of stars for which acceleration is detected at high confidence based on precise astrometric fits. Our catalog, derived without this information, captured over 96% of sources in the table that meet our selection criteria. In addition, the GNASC contains bright, nearby candidates that were not in the original Hipparcos survey, including members of known binary systems as well as stars with companions yet to be identified. It thus extends the HGCA and demonstrates the potential of the machine-learning approach to discover hidden partners of nearby stars in future astrometric surveys.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09712v1"
    ],
    "publication_venue": "AJ accepted, 14 pages, 6 figures, 3 tables. Catalog available with publication",
    "doi": "10.3847/1538-3881/acc526"
}