{
    "arxiv_id": "2303.17300",
    "paper_title": "Are there universal signatures of topological phases in high harmonic generation? Probably not",
    "authors": [
        "Ofer Neufeld",
        "Nicolas Tancogne-Dejean",
        "Hannes Hübener",
        "Umberto De Giovannini",
        "Angel Rubio"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-08-07"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.optics"
    ],
    "abstract": "High harmonic generation (HHG) has developed in recent years as a promising tool for ultrafast materials spectroscopy. At the forefront of these advancements, several works proposed to use HHG as an all-optical probe for topology of quantum matter by identifying its signatures in the emission spectra. However, it remains unclear if such spectral signatures are indeed a robust and general approach for probing topology. To address this point, we perform here a fully ab-initio study of HHG from prototypical two-dimensional topological insulators in the Kane-Mele quantum spin-Hall and anomalous-Hall phases. We analyze the spectra and previously proposed topological signatures by comparing HHG from the topological and trivial phases. We demonstrate and provide detailed microscopic explanations of why in these systems none of the thus far proposed observables uniquely and universally probe material topology. Specifically, we find that the: (i) HHG helicity, (ii) anomalous HHG ellipticity, (iii) HHG elliptical dichroism and (iv) temporal delays in HHG emission, are all unreliable signatures of topological phases. Our results suggest that extreme care must be taken when interpreting HHG spectra for topological signatures, and that contributions from the crystal symmetries and chemical nature might be dominant over those from topology. They hint that a truly universal topological signature in nonlinear optics is unlikely, and raise important questions regarding possible utilization and detection of topology in systems out-of-equilibrium.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17300v1"
    ],
    "publication_venue": "24 figures including appendices",
    "doi": "10.1103/PhysRevX.13.031011"
}