{
    "arxiv_id": "2303.15960",
    "paper_title": "ASCNet-ECG: Deep Autoencoder based Attention aware Skip Connection network for ECG filtering",
    "authors": [
        "Raghavendra Badiger",
        "M. Prabhakar"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SP",
        "cs.CY"
    ],
    "abstract": "Currently, the telehealth monitoring field has gained huge attention due to its noteworthy use in day-to-day life. This advancement has led to an increase in the data collection of electrophysiological signals. Due to this advancement, electrocardiogram (ECG) signal monitoring has become a leading task in the medical field. ECG plays an important role in the medical field by analysing cardiac physiology and abnormalities. However, these signals are affected due to numerous varieties of noises, such as electrode motion, baseline wander and white noise etc., which affects the diagnosis accuracy. Therefore, filtering ECG signals became an important task. Currently, deep learning schemes are widely employed in signal-filtering tasks due to their efficient architecture of feature learning. This work presents a deep learning-based scheme for ECG signal filtering, which is based on the deep autoencoder module. According to this scheme, the data is processed through the encoder and decoder layer to reconstruct by eliminating noises. The proposed deep learning architecture uses a modified ReLU function to improve the learning of attributes because standard ReLU cannot adapt to huge variations. Further, a skip connection is also incorporated in the proposed architecture, which retains the key feature of the encoder layer while mapping these features to the decoder layer. Similarly, an attention model is also included, which performs channel and spatial attention, which generates the robust map by using channel and average pooling operations, resulting in improving the learning performance. The proposed approach is tested on a publicly available MIT-BIH dataset where different types of noise, such as electrode motion, baseline water and motion artifacts, are added to the original signal at varied SNR levels.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15960v1"
    ],
    "publication_venue": null,
    "doi": "10.14445/22315381/IJETT-V71I2P240"
}