{
    "arxiv_id": "2303.09959",
    "paper_title": "Predicting the Yield of Small Transiting Exoplanets around Mid-M and Ultra-Cool Dwarfs in the Nancy Grace Roman Space Telescope Galactic Bulge Time Domain Survey",
    "authors": [
        "Patrick Tamburo",
        "Philip S. Muirhead",
        "Courtney D. Dressing"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "We simulate the yield of small (0.5-4.0 R$_\\oplus$) transiting exoplanets around single mid-M and ultra-cool dwarfs (UCDs) in the Nancy Grace Roman Space Telescope Galactic Bulge Time Domain Survey. We consider multiple approaches for simulating M3-T9 sources within the survey fields, including scaling local space densities and using Galactic stellar population synthesis models. These approaches independently predict $\\sim$100,000 single mid-M dwarfs and UCDs brighter than a Roman F146 magnitude of 21 that are within the survey fields. Assuming planet occurrence statistics previously measured for early-to-mid M dwarfs, we predict that the survey will discover 1347$^{+208}_{-124}$ small transiting planets around these sources, each to a significance of 7.1$σ$ or greater. Significant departures from this prediction would test whether the occurrence rates of small planets increase or decrease around mid-M dwarfs and UCDs compared to early-M dwarfs. We predict the detection of 13$^{+4}_{-3}$ habitable, terrestrial planets ($R_p<$1.23 R$_\\oplus$) in the survey. However, atmospheric characterization of these planets will be challenging with current or near-future space telescope facilities due to the faintness of the host stars. Nevertheless, accurate statistics for the occurrence of small planets around mid-M dwarfs and UCDs will enable direct tests of predictions from planet formation theories and will determine our understanding of planet demographics around the objects at the bottom of the main sequence. This understanding is critical given the prevalence of such objects in our Galaxy, whose planets may therefore comprise the bulk of the galactic census of exoplanets.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09959v1"
    ],
    "publication_venue": "19 pages, 10 figures, submitted to AJ"
}