{
    "arxiv_id": "2303.08461",
    "paper_title": "Simulating prethermalization using near-term quantum computers",
    "authors": [
        "Yilun Yang",
        "Arthur Christianen",
        "Sandra Coll-Vinent",
        "Vadim Smelyanskiy",
        "Mari Carmen Bañuls",
        "Thomas E. O'Brien",
        "Dominik S. Wild",
        "J. Ignacio Cirac"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-12-06"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Quantum simulation is one of the most promising scientific applications of quantum computers. Due to decoherence and noise in current devices, it is however challenging to perform digital quantum simulation in a regime that is intractable with classical computers. In this work, we propose an experimental protocol for probing dynamics and equilibrium properties on near-term digital quantum computers. As a key ingredient of our work, we show that it is possible to study thermalization even with a relatively coarse Trotter decomposition of the Hamiltonian evolution of interest. Even though the step size is too large to permit a rigorous bound on the Trotter error, we observe that the system prethermalizes in accordance with previous results for Floquet systems. The dynamics closely resemble the thermalization of the model underlying the Trotterization up to long times. We extend the reach of our approach by developing an error mitigation scheme based on measurement and rescaling of survival probabilities. To demonstrate the effectiveness of the entire protocol, we apply it to the two-dimensional XY model and numerically verify its performance with realistic noise parameters for superconducting quantum devices. Our proposal thus provides a route to achieving quantum advantage for relevant problems in condensed matter physics.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08461v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PRXQuantum.4.030320"
}