{
    "arxiv_id": "2303.12845",
    "paper_title": "Bulgeless disks, dark galaxies, inverted color gradients, and other expected phenomena at higher z. The chromatic surface brightness modulation (CMOD) effect",
    "authors": [
        "Polychronis Papaderos",
        "Göran Östlin",
        "Iris Breda"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "Since the k correction depends on the spectral energy distribution (SED) of a galaxy, any high-z galaxy with a spatially non-homogeneous SED will experience a spatially varying relative dimming or brightening in addition to the pure distance effect. The morphology of galaxies will therefore change with z. For instance, an early spiral galaxy observed in the V band would show a prominent bulge at z=0, whereas, if at z=1, the V filter probes the rest-frame near-UV where the bulge is faint and the disk relatively brighter, thus the galaxy may appear as bulgeless. For galaxies with strong nebular emission, an additional effect is that the shifting of strong nebular features in or out of filters will result in a non-monotonous color evolution with z. Hence, unlike the effects of distance, cosmological surface brightness dimming, and gravitational lensing, which are all achromatic, the fact that most galaxies have a spatially varying SED leads to a chromatic surface brightness modulation (CMOD) with z. While the CMOD effects are in principle easy to grasp, they affect the characterization of galaxies in a complex fashion. Properties such as the bulge-to-disk ratio, Sersic exponent, effective radius, radial color gradients, and stellar mass determinations from SED fitting will depend on z, the filters employed, and the rest-frame 2D SED patterns in a galaxy, and will bias results inferred on galaxy evolution across cosmic time (e.g., the evolution of the mass-size, bulge-SMBH, and Tully-Fisher relation), if these effects are not properly taken into account. In this article we quantify the CMOD effects for idealized galaxies built from spectral synthesis models and from galaxies with observed integral field spectroscopy, and we show that they are significant and should be taken into account in studies of resolved galaxy properties and their evolution with z. (abridged)",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12845v1"
    ],
    "publication_venue": "41 pages, 32 figures, accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202245769"
}