{
    "arxiv_id": "2303.09548",
    "paper_title": "Photometric study of the late-time near-infrared plateau in Type Ia supernovae",
    "authors": [
        "M. Deckers",
        "O. Graur",
        "K. Maguire",
        "L. Shingles",
        "S. J. Brennan",
        "J. P. Anderson",
        "J. Burke",
        "T. -W. Chen",
        "L. Galbany",
        "M. J. P. Grayling",
        "C. P. Gutiérrez",
        "L. Harvey",
        "D. Hiramatsu",
        "D. A. Howell",
        "C. Inserra",
        "T. Killestein",
        "C. McCully",
        "T. E. Müller-Bravo",
        "M. Nicholl",
        "M. Newsome",
        "E. Padilla Gonzalez",
        "C. Pellegrino",
        "G. Terreran",
        "J. H. Terwel",
        "M. Toy",
        "D. R. Young"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "We present an in-depth study of the late-time near-infrared plateau in Type Ia supernovae (SNe Ia), which occurs between 70-500 d. We double the existing sample of SNe Ia observed during the late-time near-infrared plateau with new observations taken with the Hubble Space Telescope, Gemini, New Technology Telescope, the 3.5m Calar Alto Telescope, and the Nordic Optical Telescope. Our sample consists of 24 nearby SNe Ia at redshift < 0.025. We are able to confirm that no plateau exists in the Ks band for most normal SNe Ia. SNe Ia with broader optical light curves at peak tend to have a higher average brightness on the plateau in J and H, most likely due to a shallower decline in the preceding 100 d. SNe Ia that are more luminous at peak also show a steeper decline during the plateau phase in H. We compare our data to state-of-the-art radiative transfer models of nebular SNe Ia in the near-infrared. We find good agreement with the sub-Mch model that has reduced non-thermal ionisation rates, but no physical justification for reducing these rates has yet been proposed. An analysis of the spectral evolution during the plateau demonstrates that the ratio of [Fe II] to [Fe III] contribution in a near-infrared filter determines the light curve evolution in said filter. We find that overluminous SNe decline slower during the plateau than expected from the trend seen for normal SNe Ia",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09548v1"
    ],
    "publication_venue": "17 pages, 8 figures, Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad841"
}