{
    "arxiv_id": "2303.10417",
    "paper_title": "On the Benefit of Nonlinear Control for Robust Logarithmic Growth: Coin Flipping Games as a Demonstration Case",
    "authors": [
        "Anton V. Proskurnikov",
        "B. Ross Barmish"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "math.OC",
        "eess.SY",
        "q-fin.MF"
    ],
    "abstract": "The takeoff point for this paper is the voluminous body of literature addressing recursive betting games with expected logarithmic growth of wealth being the performance criterion. Whereas almost all existing papers involve use of linear feedback, the use of nonlinear control is conspicuously absent. This is epitomized by the large subset of this literature dealing with Kelly Betting. With this as the high-level motivation, we study the potential for use of nonlinear control in this framework. To this end, we consider a ``demonstration case'' which is one of the simplest scenarios encountered in this line of research: repeated flips of a biased coin with probability of heads~$p$ and even-money payoff on each flip. First, we formulate a new robust nonlinear control problem which we believe is both simple to understand and apropos for dealing with concerns about distributional robustness; i.e., instead of assuming that~$p$ is perfectly known as in the case of the classical Kelly formulation, we begin with a bounding set for this probability. Then, we provide a theorem, our main result, which gives a closed-form description of the optimal robust nonlinear controller and a corollary which establishes that it robustly outperforms linear controllers such as those found in the literature. A second contribution of this paper bears upon the computability of our solution. For an $n$-flip game, whereas an admissible controller has~$2^n-1$ parameters, at the optimum only~$O(n^2)$ of them turn out to be distinct. Finally, we provide some illustrations comparing robust performance with what is possible when working with the so-called perfect-information Kelly optimum.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10417v1"
    ],
    "publication_venue": null
}