{
    "arxiv_id": "2303.08098",
    "paper_title": "Single Event Effects Assessment of UltraScale+ MPSoC Systems under Atmospheric Radiation",
    "authors": [
        "Dimitris Agiakatsikas",
        "Nikos Foutris",
        "Aitzan Sari",
        "Vasileios Vlagkoulis",
        "Ioanna Souvatzoglou",
        "Mihalis Psarakis",
        "Ruiqi Ye",
        "John Goodacre",
        "Mikel Lujan",
        "Maria Kastrioto",
        "Carlo Cazzaniga",
        "Chris Frost"
    ],
    "submission_date": "2023-02-21",
    "revised_dates": [
        "2023-03-15"
    ],
    "latest_version": 1,
    "categories": [
        "cs.DC"
    ],
    "abstract": "The AMD UltraScale+ XCZU9EG device is a Multi-Processor System-on-Chip (MPSoC) with embedded Programmable Logic (PL) that excels in many Edge (e.g., automotive or avionics) and Cloud (e.g., data centres) terrestrial applications. However, it incorporates a large amount of SRAM cells, making the device vulnerable to Neutron-induced Single Event Upsets (NSEUs) or otherwise soft errors. Semiconductor vendors incorporate soft error mitigation mechanisms to recover memory upsets (i.e., faults) before they propagate to the application output and become an error. But how effective are the MPSoC's mitigation schemes? Can they effectively recover upsets in high altitude or large scale applications under different workloads? This article answers the above research questions through a solid study that entails accelerated neutron radiation testing and dependability analysis. We test the device on a broad range of workloads, like multi-threaded software used for pose estimation and weather prediction or a software/hardware (SW/HW) co-design image classification application running on the AMD Deep Learning Processing Unit (DPU). Assuming a one-node MPSoC system in New York City (NYC) at 40k feet, all tested software applications achieve a Mean Time To Failure (MTTF) greater than 148 months, which shows that upsets are effectively recovered in the processing system of the MPSoC. However, the SW/HW co-design (i.e., DPU) in the same one-node system at 40k feet has an MTTF = 4 months due to the high failure rate of its PL accelerator, which emphasises that some MPSoC workloads may require additional NSEU mitigation schemes. Nevertheless, we show that the MTTF of the DPU can increase to 87 months without any overhead if one disregards the failure rate of tolerable errors since they do not affect the correctness of the classification output.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08098v1"
    ],
    "publication_venue": "This manuscript is under review at IEEE Transactions on Reliability"
}