{
    "arxiv_id": "2303.13449",
    "paper_title": "On a problem of El-Zahar and Erdoos",
    "authors": [
        "Tung Nguyen",
        "Alex Scott",
        "Paul Seymour"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "math.CO"
    ],
    "abstract": "Two subgraphs $A,B$ of a graph $G$ are anticomplete if they are vertex-disjoint and there are no edges joining them. Is it true that if $G$ is a graph with bounded clique number, and sufficiently large chromatic number, then it has two anticomplete subgraphs, both with large chromatic number? This is a question raised by El-Zahar and Erdős in 1986, and remains open. If so, then at least there should be two anticomplete subgraphs both with large minimum degree, and that is one of our results.\n  We prove two variants of this. First, a strengthening: we can ask for one of the two subgraphs to have large chromatic number: that is, for all $t, c\\ge 1$ there exists $d\\ge 1$ such that if $G$ has chromatic number at least $d$, and does not contain the complete graph $K_t$ as a subgraph, then there are anticomplete subgraphs $A,B$, where $A$ has minimum degree at least $c$ and $B$ has chromatic number at least $c$.\n  Second, we look at what happens if we replace the hypothesis that $G$ has sufficiently large chromatic number with the hypothesis that $G$ has sufficently large minimum degree. This, together with excluding $K_t$, is {\\em not} enough to guarantee two anticomplete subgraphs both with large minimum degree; but it works if instead of xcluding $K_t$ we exclude the complete bipartite graph $K_{t,t}$. More exactly: for all $t, c\\ge 1$ there exists $d\\ge 1$ such that if $G$ has minimum degree at least $d$, and does not contain the complete bipartite graph $K_{t,t}$ as a subgraph, then there are two anticomplete subgraphs both with minimum degree at least $c$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13449v1"
    ],
    "publication_venue": null
}