{
    "arxiv_id": "2303.12330",
    "paper_title": "Boltzmann entropy of a freely expanding quantum ideal gas",
    "authors": [
        "Saurav Pandey",
        "Junaid Majeed Bhat",
        "Abhishek Dhar",
        "Sheldon Goldstein",
        "David A. Huse",
        "Manas Kulkarni",
        "Anupam Kundu",
        "Joel L. Lebowitz"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2024-02-14"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.stat-mech",
        "cond-mat.quant-gas",
        "quant-ph"
    ],
    "abstract": "We study the time evolution of the Boltzmann entropy of a microstate during the non-equilibrium free expansion of a one-dimensional quantum ideal gas. This quantum Boltzmann entropy, $S_B$, essentially counts the \"number\" of independent wavefunctions (microstates) giving rise to a specified macrostate. It generally depends on the choice of macrovariables, such as the type and amount of coarse-graining, specifying a non-equilibrium macrostate of the system, but its extensive part agrees with the thermodynamic entropy in thermal equilibrium macrostates. We examine two choices of macrovariables: the $U$-macrovariables are local observables in position space, while the $f$-macrovariables also include structure in momentum space. For the quantum gas, we use a non-classical choice of the $f$-macrovariables. For both choices, the corresponding entropies $s_B^f$ and $s_B^U$ grow and eventually saturate. As in the classical case, the growth rate of $s_B^f$ depends on the momentum coarse-graining scale. If the gas is initially at equilibrium and is then released to expand to occupy twice the initial volume, the per-particle increase in the entropy for the $f$-macrostate, $Δs_B^f$, satisfies $\\log{2}\\leqΔs_B^f\\leq 2\\log{2}$ for fermions, and $0\\leqΔs_B^f\\leq\\log{2}$ for bosons. For the same initial conditions, the change in the entropy $Δs_B^U$ for the $U$-macrostate is greater than $Δs_B^f$ when the gas is in the quantum regime where the final stationary state is not at thermal equilibrium.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12330v1"
    ],
    "publication_venue": "31 pages, 14 figures",
    "doi": "10.1007/s10955-023-03154-y"
}