{
    "arxiv_id": "2303.10304",
    "paper_title": "Qualitative properties of solutions for dual fractional nonlinear parabolic equations",
    "authors": [
        "Wenxiong Chen",
        "Lingwei Ma"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "math.AP"
    ],
    "abstract": "In this paper, we consider the dual fractional parabolic problem in the right half space. We prove that the positive solutions are strictly increasing in $x_1$ direction without assuming the solutions be bounded.\n  So far as we know, this is the first paper to explore the monotonicity of possibly unbounded solutions for the nonlocal parabolic problem involving both the fractional time derivative $\\partial_t^α$ and the fractional Laplacian $(-Δ)^s$. To overcome the difficulties caused by the dual nonlocality in space-time and by the remarkably weak assumptions on solutions, we introduced several new ideas and our approaches are quite different from those in the previous literature. We first establish an unbounded narrow region principle without imposing any decay and boundedness assumptions on the antisymmetric functions at infinity by estimating the nonlocal operator $\\partial_t^α+(-Δ)^s$ along a sequence of suitable auxiliary functions at their minimum points, which is an essential ingredient to carry out the method of moving planes at the starting point. Then in order to remove the decay or bounded-ness assumption on the solutions, we develop a new novel approach lies in establishing the {\\em averaging effects} for such nonlocal operator and apply these {\\em averaging effects} twice to guarantee that the plane can be moved all the way to infinity to derive the monotonicity of solutions.\n  We believe that the new ideas and techniques developed here will become very useful tools in studying the qualitative properties of solutions, in particular of those unbounded solutions, for a wide range of fractional elliptic and parabolic problems.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10304v1"
    ],
    "publication_venue": null
}