{
    "arxiv_id": "2303.11117",
    "paper_title": "EmotionIC: Emotional Inertia and Contagion-Driven Dependency Modeling for Emotion Recognition in Conversation",
    "authors": [
        "Yingjian Liu",
        "Jiang Li",
        "Xiaoping Wang",
        "Zhigang Zeng"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-12-27"
    ],
    "latest_version": 4,
    "categories": [
        "cs.CL"
    ],
    "abstract": "Emotion Recognition in Conversation (ERC) has attracted growing attention in recent years as a result of the advancement and implementation of human-computer interface technologies. In this paper, we propose a novel approach to dependency modeling driven by Emotional Inertia and Contagion (EmotionIC) for ERC task. Our EmotionIC consists of three main components, i.e., Identity Masked Multi-Head Attention (IMMHA), Dialogue-based Gated Recurrent Unit (DiaGRU), and Skip-chain Conditional Random Field (SkipCRF). Compared to previous ERC models, EmotionIC can model a conversation more thoroughly at both the feature-extraction and classification levels. The proposed model attempts to integrate the advantages of attention- and recurrence-based methods at the feature-extraction level. Specifically, IMMHA is applied to capture identity-based global contextual dependencies, while DiaGRU is utilized to extract speaker- and temporal-aware local contextual information. At the classification level, SkipCRF can explicitly mine complex emotional flows from higher-order neighboring utterances in the conversation. Experimental results show that our method can significantly outperform the state-of-the-art models on four benchmark datasets. The ablation studies confirm that our modules can effectively model emotional inertia and contagion.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11117v1",
        "http://arxiv.org/pdf/2303.11117v2",
        "http://arxiv.org/pdf/2303.11117v3",
        "http://arxiv.org/pdf/2303.11117v4"
    ],
    "publication_venue": "Accepted by SCIENCE CHINA Information Sciences (SCIS)",
    "doi": "10.1007/s11432-023-3908-6"
}