{
    "arxiv_id": "2303.13372",
    "paper_title": "Adversarial Robustness of Learning-based Static Malware Classifiers",
    "authors": [
        "Shoumik Saha",
        "Wenxiao Wang",
        "Yigitcan Kaya",
        "Soheil Feizi",
        "Tudor Dumitras"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-06-21"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CR",
        "cs.LG"
    ],
    "abstract": "Malware detection has long been a stage for an ongoing arms race between malware authors and anti-virus systems. Solutions that utilize machine learning (ML) gain traction as the scale of this arms race increases. This trend, however, makes performing attacks directly on ML an attractive prospect for adversaries. We study this arms race from both perspectives in the context of MalConv, a popular convolutional neural network-based malware classifier that operates on raw bytes of files. First, we show that MalConv is vulnerable to adversarial patch attacks: appending a byte-level patch to malware files bypasses detection 94.3% of the time. Moreover, we develop a universal adversarial patch (UAP) attack where a single patch can drop the detection rate in constant time of any malware file that contains it by 80%. These patches are effective even being relatively small with respect to the original file size -- between 2%-8%. As a countermeasure, we then perform window ablation that allows us to apply de-randomized smoothing, a modern certified defense to patch attacks in vision tasks, to raw files. The resulting `smoothed-MalConv' can detect over 80% of malware that contains the universal patch and provides certified robustness up to 66%, outlining a promising step towards robust malware detection. To our knowledge, we are the first to apply universal adversarial patch attack and certified defense using ablations on byte level in the malware field.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13372v1",
        "http://arxiv.org/pdf/2303.13372v2"
    ],
    "publication_venue": null
}