{
    "arxiv_id": "2303.16111",
    "paper_title": "Rebuilding the Habitable Zone from the Bottom Up with Computational Zones",
    "authors": [
        "Caleb Scharf",
        "Olaf Witkowski"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.SR",
        "physics.bio-ph"
    ],
    "abstract": "Computation, if treated as a set of physical processes that act on information represented by states of matter, encompasses biological systems, digital systems, and other constructs, and may be a fundamental measure of living systems. The opportunity for biological computation, represented in the propagation and selection-driven evolution of information-carrying organic molecular structures, has been partially characterized in terms of planetary habitable zones based on primary conditions such as temperature and the presence of liquid water. A generalization of this concept to computational zones is proposed, with constraints set by three principal characteristics: capacity, energy, and instantiation (or substrate). Computational zones naturally combine traditional habitability factors, including those associated with biological function that incorporate the chemical milieu, constraints on nutrients and free energy, as well as element availability. Two example applications are presented by examining the fundamental thermodynamic work efficiency and Landauer limit of photon-driven biological computation on planetary surfaces and of generalized computation in stellar energy capture structures (a.k.a. Dyson structures). It is shown that computational zones involving nested structures or substellar objects could manifest unique observational signatures as cool far-infrared emitters. While this is an entirely hypothetical example, its simplicity offers a useful, complementary introduction to computational zones.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16111v1"
    ],
    "publication_venue": "31 pages, 3 figures, submitted to The Astrobiology Journal"
}