{
    "arxiv_id": "2303.16620",
    "paper_title": "Dimensionally-dependent uncertainty relations, or why we (probably) won't see micro-black holes at the LHC, even if large extra dimensions exist",
    "authors": [
        "Matthew J. Lake",
        "Shi-Dong Liang",
        "Anucha Watcharapasorn"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc",
        "hep-ph"
    ],
    "abstract": "We present a simple gedanken experiment in which a compact object traverses a spacetime with three macroscopic spatial dimensions and $n$ compact dimensions. The compactification radius is allowed to vary, as a function of the object's position in the four-dimensional space, and we show that the conservation of gravitational self-energy implies the dimensional dependence of the mass-radius relation. In spacetimes with extra dimensions that are compactified at the Planck scale, no deviation from the four-dimensional result is found, but, in spacetimes with extra dimensions that are much larger than the Planck length, energy conservation implies a deviation from the normal Compton wavelength formula. The new relation restores the symmetry between the Compton wavelength and Schwarzschild radius lines on the mass-radius diagram and precludes the formation of black holes at TeV scales, even if large extra dimensions exist. We show how this follows, intuitively, as a direct consequence of the increased gravitational field strength at distances below the compactification scale. Combining these results with the heuristic identification between the Compton wavelength and the minimum value of the position uncertainty, due to the Heisenberg uncertainty principle, suggests the existence of generalised, higher-dimensional uncertainty relations. These relations may be expected to hold for self-gravitating quantum wave packets, in higher-dimensional spacetimes, with interesting implications for particle physics and cosmology in extra-dimensional scenarios.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16620v1"
    ],
    "publication_venue": "14 pages, 2 figures. Matches the version published in Frontiers in Astronomy and Space Sciences (minus typos)",
    "doi": "10.3389/fspas.2023.1155667"
}