{
    "arxiv_id": "2303.15181",
    "paper_title": "DreamStone: Image as Stepping Stone for Text-Guided 3D Shape Generation",
    "authors": [
        "Zhengzhe Liu",
        "Peng Dai",
        "Ruihui Li",
        "Xiaojuan Qi",
        "Chi-Wing Fu"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-09-13"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV"
    ],
    "abstract": "In this paper, we present a new text-guided 3D shape generation approach DreamStone that uses images as a stepping stone to bridge the gap between text and shape modalities for generating 3D shapes without requiring paired text and 3D data. The core of our approach is a two-stage feature-space alignment strategy that leverages a pre-trained single-view reconstruction (SVR) model to map CLIP features to shapes: to begin with, map the CLIP image feature to the detail-rich 3D shape space of the SVR model, then map the CLIP text feature to the 3D shape space through encouraging the CLIP-consistency between rendered images and the input text. Besides, to extend beyond the generative capability of the SVR model, we design a text-guided 3D shape stylization module that can enhance the output shapes with novel structures and textures. Further, we exploit pre-trained text-to-image diffusion models to enhance the generative diversity, fidelity, and stylization capability. Our approach is generic, flexible, and scalable, and it can be easily integrated with various SVR models to expand the generative space and improve the generative fidelity. Extensive experimental results demonstrate that our approach outperforms the state-of-the-art methods in terms of generative quality and consistency with the input text. Codes and models are released at https://github.com/liuzhengzhe/DreamStone-ISS.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15181v1",
        "http://arxiv.org/pdf/2303.15181v2"
    ],
    "publication_venue": "Under review of TPAMI (with minor revision)"
}