{
    "arxiv_id": "2303.17657",
    "paper_title": "Progress towards an improved particle flow algorithm at CMS with machine learning",
    "authors": [
        "Farouk Mokhtar",
        "Joosep Pata",
        "Javier Duarte",
        "Eric Wulff",
        "Maurizio Pierini",
        "Jean-Roch Vlimant"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-03"
    ],
    "latest_version": 1,
    "categories": [
        "physics.data-an",
        "cs.LG",
        "hep-ex",
        "physics.ins-det"
    ],
    "abstract": "The particle-flow (PF) algorithm, which infers particles based on tracks and calorimeter clusters, is of central importance to event reconstruction in the CMS experiment at the CERN LHC, and has been a focus of development in light of planned Phase-2 running conditions with an increased pileup and detector granularity. In recent years, the machine learned particle-flow (MLPF) algorithm, a graph neural network that performs PF reconstruction, has been explored in CMS, with the possible advantages of directly optimizing for the physical quantities of interest, being highly reconfigurable to new conditions, and being a natural fit for deployment to heterogeneous accelerators. We discuss progress in CMS towards an improved implementation of the MLPF reconstruction, now optimized using generator/simulation-level particle information as the target for the first time. This paves the way to potentially improving the detector response in terms of physical quantities of interest. We describe the simulation-based training target, progress and studies on event-based loss terms, details on the model hyperparameter tuning, as well as physics validation with respect to the current PF algorithm in terms of high-level physical quantities such as the jet and missing transverse momentum resolutions. We find that the MLPF algorithm, trained on a generator/simulator level particle information for the first time, results in broadly compatible particle and jet reconstruction performance with the baseline PF, setting the stage for improving the physics performance by additional training statistics and model tuning.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17657v1"
    ],
    "publication_venue": "7 pages, 4 Figures, 1 Table"
}