{
    "arxiv_id": "2303.13079",
    "paper_title": "Implementation of communication media around a mixed reality experience with HoloLens headset, as part of a digitalization of a nutrition workshop",
    "authors": [
        "Owen Kevin Appadoo",
        "Hugo Rositi",
        "Sylvie Valarier",
        "Marie-Claire Ombret",
        "Émilie Gadéa",
        "Christine Barret-Grimault",
        "Christophe Lohou"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cs.HC",
        "cs.MM"
    ],
    "abstract": "The release of Microsoft's HoloLens headset addresses new types of issues that would have been difficult to design without such a hardware. This semi-transparent visor headset allows the user who wears it to view the projection of 3D virtual objects placed in its real environment. The user can also interact with these 3D objects, which can interact with each other. The framework of this new technology is called mixed reality. We had the opportunity to numerically transform a conventional human nutrition workshop for patients waiting for bariatric surgery by developing a software called HOLO_NUTRI using the HoloLens headset. Unlike our experience of user and conventional programmer specialized in the development of interactive 3D graphics applications, we realized that such a mixed reality experience required specific programming concepts quite different from those of conventional software or those of virtual reality applications, but above all required a thorough reflection about communication for users. In this article, we propose to explain our design of communication (graphic supports, tutorials of use of material, explanatory videos), a step which was crucial for the good progress of our project. The software was used by thirty patients from Le Puy-en-Velay Hospital during 10 sessions of one hour and a half during which patients had to take in hand the headset and software HOLO_NUTRI. We also proposed a series of questions to patients to have an assessment of both the adequacy and the importance of this communication approach for such experience. As the mixed reality technology is very recent but the number of applications based on it significantly increases, the reflection on the implementation of the elements of communication described in this article (videos, exercise of learning for the use of the headset, communication leaflet, etc.) can help developers of such applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13079v1"
    ],
    "publication_venue": "19 pages, 14 figures"
}