{
    "arxiv_id": "2303.15047",
    "paper_title": "Bubble nucleation and jetting inside a millimetric droplet",
    "authors": [
        "Juan Manuel Rosselló",
        "Hendrik Reese",
        "K. Ashoke Raman",
        "Claus-Dieter Ohl"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.flu-dyn"
    ],
    "abstract": "In this work, we present experiments and simulations on the nucleation and successive dynamics of laser-induced bubbles inside liquid droplets in free-fall motion, i.e. a case where the bubbles are subjected to the influence of a free boundary in all directions. The droplets of a millimetric size are released from a height of around 20\\,cm and acquire a velocity of around 2\\,m/s at the moment the bubble is nucleated. Within this droplet, we have investigated the nucleation of secondary bubbles induced by the rarefaction wave that is produced when the shock wave emitted by the laser-induced plasma reflects at the drop surface. Interestingly, three-dimensional clusters of cavitation bubbles are observed. Their shape is compared with the negative pressure distribution computed with a CFD model and allows us to estimate a cavitation threshold value. High-speed recordings of the drop/bubble dynamics are complemented by the velocity and pressure fields simulated for the same initial conditions. The effect of the proximity of a curved free surface on the jetting dynamics of the bubbles was qualitatively assessed by classifying the cavitation events using a non-dimensional stand-off parameter which depends on the drop size, the bubble maximum radius and the relative position of the bubble inside the drop. Here, we found that the curvature of the free surface does not play a determinant role on the jet dynamics, being the distance to the surface the dominant parameter. The oscillation of the laser-induced bubbles promote the onset of Rayleigh-Taylor and Rayleigh-Plateau instabilities, observed on the drop's surface. The specific mechanisms leading to the destabilisation of the droplet surface were identified through a careful inspection of the high speed images.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15047v1"
    ],
    "publication_venue": null
}