{
    "arxiv_id": "2303.12830",
    "paper_title": "A Quick Look at the 3GHz Radio Sky. II. Hunting for DRAGNs in the VLA Sky Survey",
    "authors": [
        "Yjan A. Gordon",
        "Lawrence Rudnick",
        "Heinz Andernach",
        "Leah K. Morabito",
        "Christopher P. O'Dea",
        "Kaylan-Marie Achong",
        "Stefi A. Baum",
        "Caryelis Bayona-Figueroa",
        "Eric J. Hooper",
        "Beatriz Mingo",
        "Melissa E. Morris",
        "Adrian N. Vantyghem"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
    ],
    "abstract": "Active Galactic Nuclei (AGN) can often be identified in radio images as two lobes, sometimes connected to a core by a radio jet. This multi-component morphology unfortunately creates difficulties for source-finders, leading to components that are a) separate parts of a wider whole, and b) offset from the multiwavelength cross identification of the host galaxy. In this work we define an algorithm, DRAGNhunter, for identifying Double Radio Sources associated with Active Galactic Nuclei (DRAGNs) from component catalog data in the first epoch images of the high resolution ($\\approx 3''$ beam size) Very Large Array Sky Survey (VLASS). We use DRAGNhunter to construct a catalog of $>17,000$ DRAGNs in VLASS for which contamination from spurious sources estimated at $\\approx 11\\,\\%$. A `high-fidelity' sample consisting of $90\\,\\%$ of our catalog is identified for which contamination is $<3\\,\\%$. Host galaxies are found for $\\approx 13,000$ DRAGNs as well as for an additional $234,000$ single-component radio sources. Using these data we explore the properties of our DRAGNs, finding them to be typically consistent with Fanaroff-Riley class II sources and allowing us to report the discovery of $31$ new giant radio galaxies identified using VLASS.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12830v1"
    ],
    "publication_venue": "34 pages, 25 figures, 7 tables, submitted to ApJS. Associated catalog to be release by CIRADA at https://cirada.ca"
}