{
    "arxiv_id": "2303.09557",
    "paper_title": "A nested hierarchy of second order upper bounds on system failure probability",
    "authors": [
        "Sourangshu Ghosh",
        "Baidurya Bhattacharya"
    ],
    "submission_date": "2023-02-12",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "math.PR",
        "math.OC"
    ],
    "abstract": "For a coherent, binary system made up of binary elements, the exact failure probability requires knowledge of statistical dependence of all orders among the minimal cut sets. Since dependence among the cut sets beyond the second order is generally difficult to obtain, second order bounds on system failure probability have practical value. The upper bound is conservative by definition and can be adopted in reliability based decision making. In this paper we propose a new hierarchy of m-level second order upper bounds, Bm : the well-known Kounias-Vanmarcke-Hunter-Ditlevsen (KVHD) bound - the current standard for upper bounds using second order joint probabilities - turns out to be the weakest member of this family (m = 1). We prove that Bm is non-increasing with level m in every ordering of the cut sets, and derive conditions under which Bm+1 is strictly less than Bm for any m and any ordering. We also derive conditions under which the optimal level m bound is strictly less than the optimal level m + 1 bound, and show that this improvement asymptotically achieves a probability of 1 as long as the second order joint probabilities are only constrained by the pair of corresponding first order probabilities. Numerical examples show that our second order upper bounds can yield tighter values than previously achieved and in every case exhibit considerable less scatter across the entire n! orderings of the cut sets compared to KVHD bounds. Our results therefore may lead to more efficient identification of the optimal upper bound when coupled with existing linear programming and tree search based approaches.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09557v1"
    ],
    "publication_venue": "copyright 2022. This manuscript version is made available under the CC-BY-NC-ND 4.0 license https://creativecommons.org/licenses/by-nc-nd/4.0/",
    "doi": "10.1016/j.probengmech.2022.103335"
}