{
    "arxiv_id": "2303.11458",
    "paper_title": "A chip-scale atomic beam clock",
    "authors": [
        "Gabriela D. Martinez",
        "Chao Li",
        "Alexander Staron",
        "John Kitching",
        "Chandra Raman",
        "William R. McGehee"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.atom-ph"
    ],
    "abstract": "Atomic beams are a longstanding technology for atom-based sensors and clocks with widespread use in commercial frequency standards. Here, we report the demonstration a chip-scale microwave atomic beam clock using coherent population trapping (CPT) interrogation in a passively pumped atomic beam device. The beam device consists of a hermetically sealed vacuum cell fabricated from an anodically bonded stack of glass and Si wafers. Atomic beams are created using a lithographically defined microcapillary array connected to a Rb reservoir1 and propagate in a 15 mm long drift cavity. We present a detailed characterization of the atomic beam performance (total Rb flux $\\approx 7.7 \\times 10^{11} s^{-1}$ at 363 K device temperature) and of the vacuum environment in the device (pressure < 1 Pa), which is sustained using getter materials which pump residual gases and Rb vapor. A chip-scale beam clock is realized using Ramsey CPT spectroscopy of the 87Rb ground state hyperfine transition over a 10 mm Ramsey distance in the atomic beam device. The prototype atomic beam clock demonstrates a fractional frequency stability of $\\approx 1.2 \\times 10^{-9}/\\sqrtτ$ for integration times $τ$ from 1 s to 250 s, limited by detection noise. Optimized atomic beam clocks based on this approach may exceed the long-term stability of existing chip-scale clocks, and leading long-term systematics are predicted to limit the ultimate fractional frequency stability below $10^{-12}$.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11458v1"
    ],
    "publication_venue": "22 pages, 4 figures",
    "doi": "10.1038/s41467-023-39166-1"
}