{
    "arxiv_id": "2303.13422",
    "paper_title": "All this for one qubit? Bounds on local circuit cutting schemes",
    "authors": [
        "Simon C. Marshall",
        "Jordi Tura",
        "Vedran Dunjko"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "quant-ph"
    ],
    "abstract": "Small numbers of qubits are one of the primary constraints on the near-term deployment of advantageous quantum computing. To mitigate this constraint, techniques have been developed to break up a large quantum computation into smaller computations. While this work is sometimes called circuit knitting or divide and quantum we generically refer to it as circuit cutting (CC). Much of the existing work has focused on the development of more efficient circuit cutting schemes, leaving open questions on the limits of what theoretically optimal schemes can achieve. We develop bounds by breaking up possible approaches into two distinct regimes: the first, where the input state and measurement are fixed and known, and the second, which requires a given cutting to work for a complete basis of input states and measurements. For the first case, it is easy to see that bounds addressing the efficiency of any approaches to circuit cutting amount to resolving BPP$\\stackrel{?}{=}$BQP. We therefore restrict ourselves to a simpler question, asking what \\textit{locally-acting} circuit cutting schemes can achieve, a technical restriction which still includes all existing circuit cutting schemes. In our first case we show that the existence of a locally-acting circuit cutting scheme which could efficiently partition even a single qubit from the rest of a circuit would imply BPP$=$BQP. In our second case, we obtain more general results, showing inefficiency unconditionally. We also show that any (local or otherwise) circuit cutting scheme cannot function by only applying unital channels.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13422v1"
    ],
    "publication_venue": null
}