{
    "arxiv_id": "2303.11168",
    "paper_title": "Modelling Star Cluster Formation: Gas Accretion",
    "authors": [
        "Jeremy Karam",
        "Alison Sills"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "The formation of star clusters involves the growth of smaller, gas-rich subclusters through accretion of gas from the giant molecular cloud within which the subclusters are embedded. The two main accretion mechanisms responsible for this are accretion of gas from dense filaments, and from the ambient background of the cloud. We perform simulations of both of these accretion processes onto gas-rich star clusters using coupled smoothed particle hydrodynamics to model the gas, and N-body dynamics to model the stars. We find that, for both accretion processes, the accreting star cluster loses some of its original mass while gaining mass from either the ambient background or the dense filament. The amount of mass lost from both these processes is small compared to the total mass of the cluster. However, in the case of accretion from a background medium, the net effect can be a decrease in the total mass of the cluster if it is travelling fast enough through the ambient medium ($> 4$kms$^{-1}$). We find that the amount of mass lost from the cluster through filamentary accretion is independent of the density, width, or number of filaments funneling gas into the cluster and is always such that the mass of the cluster is constantly increasing with time. We compare our results to idealized prescriptions used to model star cluster formation in larger scale GMC simulations and find that such prescriptions act as an upper limit when describing the mass of the star cluster they represent.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11168v1"
    ],
    "publication_venue": "Accepted for publication in MNRAS, 14 pages, 11 figures",
    "doi": "10.1093/mnras/stad850"
}