{
    "arxiv_id": "2303.16636",
    "paper_title": "Operational Neural Networks for Efficient Hyperspectral Single-Image Super-Resolution",
    "authors": [
        "Alexander Ulrichsen",
        "Paul Murray",
        "Stephen Marshall",
        "Moncef Gabbouj",
        "Serkan Kiranyaz",
        "Mehmet Yamac",
        "Nour Aburaed"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "eess.IV"
    ],
    "abstract": "Hyperspectral Imaging is a crucial tool in remote sensing which captures far more spectral information than standard color images. However, the increase in spectral information comes at the cost of spatial resolution. Super-resolution is a popular technique where the goal is to generate a high-resolution version of a given low-resolution input. The majority of modern super-resolution approaches use convolutional neural networks. However, convolution itself is a linear operation and the networks rely on the non-linear activation functions after each layer to provide the necessary non-linearity to learn the complex underlying function. This means that convolutional neural networks tend to be very deep to achieve the desired results. Recently, self-organized operational neural networks have been proposed that aim to overcome this limitation by replacing the convolutional filters with learnable non-linear functions through the use of MacLaurin series expansions. This work focuses on extending the convolutional filters of a popular super-resolution model to more powerful operational filters to enhance the model performance on hyperspectral images. We also investigate the effects that residual connections and different normalization types have on this type of enhanced network. Despite having fewer parameters than their convolutional network equivalents, our results show that operational neural networks achieve superior super-resolution performance on small hyperspectral image datasets.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16636v1"
    ],
    "publication_venue": "12 pages, 7 figures"
}