{
    "arxiv_id": "2303.12278",
    "paper_title": "X-CANIDS: Signal-Aware Explainable Intrusion Detection System for Controller Area Network-Based In-Vehicle Network",
    "authors": [
        "Seonghoon Jeong",
        "Sangho Lee",
        "Hwejae Lee",
        "Huy Kang Kim"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2024-01-19"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CR",
        "eess.SP"
    ],
    "abstract": "Controller Area Network (CAN) is an essential networking protocol that connects multiple electronic control units (ECUs) in a vehicle. However, CAN-based in-vehicle networks (IVNs) face security risks owing to the CAN mechanisms. An adversary can sabotage a vehicle by leveraging the security risks if they can access the CAN bus. Thus, recent actions and cybersecurity regulations (e.g., UNR 155) require carmakers to implement intrusion detection systems (IDSs) in their vehicles. The IDS should detect cyberattacks and provide additional information to analyze conducted attacks. Although many IDSs have been proposed, considerations regarding their feasibility and explainability remain lacking. This study proposes X-CANIDS, which is a novel IDS for CAN-based IVNs. X-CANIDS dissects the payloads in CAN messages into human-understandable signals using a CAN database. The signals improve the intrusion detection performance compared with the use of bit representations of raw payloads. These signals also enable an understanding of which signal or ECU is under attack. X-CANIDS can detect zero-day attacks because it does not require any labeled dataset in the training phase. We confirmed the feasibility of the proposed method through a benchmark test on an automotive-grade embedded device with a GPU. The results of this work will be valuable to carmakers and researchers considering the installation of in-vehicle IDSs for their vehicles.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12278v1",
        "http://arxiv.org/pdf/2303.12278v2"
    ],
    "publication_venue": "This is the Accepted version of an article for publication in IEEE TVT",
    "doi": "10.1109/TVT.2023.3327275"
}