{
    "arxiv_id": "2303.08952",
    "paper_title": "First results from the JWST Early Release Science Program Q3D: The Warm Ionized Gas Outflow in z ~ 1.6 Quasar XID 2028 and its Impact on the Host Galaxy",
    "authors": [
        "Sylvain Veilleux",
        "Weizhe Liu",
        "Andrey Vayner",
        "Dominika Wylezalek",
        "David S. N. Rupke",
        "Nadia L. Zakamska",
        "Yuzo Ishikawa",
        "Caroline Bertemes",
        "Jorge K. Barrera-Ballesteros",
        "Hsiao-Wen Chen",
        "Nadiia Diachenko",
        "Andy D. Goulding",
        "Jenny E. Greene",
        "Kevin N. Hainline",
        "Fred Hamann",
        "Timothy Heckman",
        "Sean D. Johnson",
        "Hui Xian Grace Lim",
        "Dieter Lutz",
        "Nora Lutzgendorf",
        "Vincenzo Mainieri",
        "Roberto Maiolino",
        "Ryan McCrory",
        "Grey Murphree",
        "Nicole P. H. Nesvadba",
        "Patrick Ogle",
        "Swetha Sankar",
        "Eckhard Sturm",
        "Lillian Whitesell"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
    ],
    "abstract": "Quasar feedback may regulate the growth of supermassive black holes, quench coeval star formation, and impact galaxy morphology and the circumgalactic medium. However, direct evidence for quasar feedback in action at the epoch of peak black hole accretion at z ~ 2 remains elusive. A good case in point is the z = 1.6 quasar WISEA J100211.29+013706.7 (XID 2028) where past analyses of the same ground-based data have come to different conclusions. Here we revisit this object with the integral field unit of the Near Infrared Spectrograph (NIRSpec) on board the James Webb Space Telescope (JWST) as part of Early Release Science program Q3D. The excellent angular resolution and sensitivity of the JWST data reveal new morphological and kinematic sub-structures in the outflowing gas plume. An analysis of the emission line ratios indicates that photoionization by the central quasar dominates the ionization state of the gas with no obvious sign for a major contribution from hot young stars anywhere in the host galaxy. Rest-frame near-ultraviolet emission aligned along the wide-angle cone of outflowing gas is interpreted as a scattering cone. The outflow has cleared a channel in the dusty host galaxy through which some of the quasar ionizing radiation is able to escape and heat the surrounding interstellar and circumgalactic media. The warm ionized outflow is not powerful enough to impact the host galaxy via mechanical feedback, but radiative feedback by the AGN, aided by the outflow, may help explain the unusually small molecular gas mass fraction in the galaxy host.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08952v1"
    ],
    "publication_venue": "16 pages, 6 figures, submitted to The Astrophysical Journal"
}