{
    "arxiv_id": "2303.13836",
    "paper_title": "A multi-stage, first-order phase transition in LaFe11.8Si1.2: interplay between the structural, magnetic and electronic degrees of freedom",
    "authors": [
        "K. P. Skokov",
        "A. Y. Karpenkov",
        "D. Y. Karpenkov",
        "I. A. Radulov",
        "D. Günzing",
        "B. Eggert",
        "A. Rogalev",
        "F. Wilhelm",
        "J. Liu",
        "Y. Shao",
        "K. Ollefs",
        "M. E. Gruner",
        "H. Wende",
        "O. Gutfleisch"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-27"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Alloys with a first-order magnetic transition are central to solid-state refrigeration technology, sensors and actuators, or spintronic devices. The discontinuous nature of the transition in these materials is a consequence of the coupling between the magnetic, electronic and structural subsystems, but in a real experiment, it is difficult to observe and analyze the simultaneous evolution of all the subsystems. As a result, it is very hard to determine the main mechanisms of the transition and purposefully develop these advanced magnetic materials. To resolve this issue, we changed the existing paradigm and conducted simultaneous measurements of the macroscopic properties - magnetization, temperature change of the sample, longitudinal and transversal magnetostrictions - to reveal the rich details of the magneto-structural, first-order transition occurring in the prototypical alloy LaFe11.8Si1.2. We complement these findings with experiments on the atomistic scale, i.e., x-ray absorption spectroscopy (XAS), x-ray magnetic circular dichroism (XMCD) and Mössbauer spectroscopy, and then combine them with first-principles calculations to reveal the full complexity and two-stage nature of the transition. This new approach can be successfully extended to a large class of advanced magnetic materials that exhibit analogous transformations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13836v1"
    ],
    "publication_venue": "24 pages"
}