{
    "arxiv_id": "2303.09290",
    "paper_title": "VDPVE: VQA Dataset for Perceptual Video Enhancement",
    "authors": [
        "Yixuan Gao",
        "Yuqin Cao",
        "Tengchuan Kou",
        "Wei Sun",
        "Yunlong Dong",
        "Xiaohong Liu",
        "Xiongkuo Min",
        "Guangtao Zhai"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "eess.IV"
    ],
    "abstract": "Recently, many video enhancement methods have been proposed to improve video quality from different aspects such as color, brightness, contrast, and stability. Therefore, how to evaluate the quality of the enhanced video in a way consistent with human visual perception is an important research topic. However, most video quality assessment methods mainly calculate video quality by estimating the distortion degrees of videos from an overall perspective. Few researchers have specifically proposed a video quality assessment method for video enhancement, and there is also no comprehensive video quality assessment dataset available in public. Therefore, we construct a Video quality assessment dataset for Perceptual Video Enhancement (VDPVE) in this paper. The VDPVE has 1211 videos with different enhancements, which can be divided into three sub-datasets: the first sub-dataset has 600 videos with color, brightness, and contrast enhancements; the second sub-dataset has 310 videos with deblurring; and the third sub-dataset has 301 deshaked videos. We invited 21 subjects (20 valid subjects) to rate all enhanced videos in the VDPVE. After normalizing and averaging the subjective opinion scores, the mean opinion score of each video can be obtained. Furthermore, we split the VDPVE into a training set, a validation set, and a test set, and verify the performance of several state-of-the-art video quality assessment methods on the test set of the VDPVE.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09290v1"
    ],
    "publication_venue": null
}