{
    "arxiv_id": "2303.15506",
    "paper_title": "Galaxy interactions are the dominant trigger for local type 2 quasars",
    "authors": [
        "J. C. S. Pierce",
        "C. Tadhunter",
        "C. Ramos Almeida",
        "P. Bessiere",
        "J. V. Heaton",
        "S. L. Ellison",
        "G. Speranza",
        "Y. Gordon",
        "C. O'Dea",
        "L. Grimmett",
        "L. Makrygianni"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "The triggering mechanism for the most luminous, quasar-like active galactic nuclei (AGN) remains a source of debate, with some studies favouring triggering via galaxy mergers, but others finding little evidence to support this mechanism. Here, we present deep Isaac Newton Telescope/Wide Field Camera imaging observations of a complete sample of 48 optically-selected type 2 quasars $-$ the QSOFEED sample (L$_{\\rm [OIII]}>$10$^{8.5}$$L_{\\odot}$; $z < 0.14$). Based on visual inspection by eight classifiers, we find clear evidence that galaxy interactions are the dominant triggering mechanism for quasar activity in the local universe, with 65$^{+6}_{-7}$ per cent of the type 2 quasar hosts showing morphological features consistent with galaxy mergers or encounters, compared with only 22$^{+5}_{-4}$ per cent of a stellar-mass- and redshift-matched comparison sample of non-AGN galaxies $-$ a 5$σ$ difference. The type 2 quasar hosts are a factor 3.0$^{+0.5}_{-0.8}$ more likely to be morphologically disturbed than their matched non-AGN counterparts, similar to our previous results for powerful 3CR radio AGN of comparable [OIII] emission-line luminosity and redshift. In contrast to the idea that quasars are triggered at the peaks of galaxy mergers as the two nuclei coalesce, and only become visible post-coalescence, the majority of morphologically-disturbed type 2 quasar sources in our sample are observed in the pre-coalescence phase (61$^{+8}_{-9}$ per cent). We argue that much of the apparent ambiguity that surrounds observational results in this field is a result of differences in the surface brightness depths of the observations, combined with the effects of cosmological surface brightness dimming.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15506v1"
    ],
    "publication_venue": "Accepted for publication in MNRAS. 17 pages, 7 figures",
    "doi": "10.1093/mnras/stad455"
}