{
    "arxiv_id": "2303.15461",
    "paper_title": "A diffuse scattering model of ultracold neutrons on wavy surfaces",
    "authors": [
        "S. Imajo",
        "H. Akatsuka",
        "K. Hatanaka",
        "T. Higuchi",
        "G. Ichikawa",
        "S. Kawasaki",
        "M. Kitaguchi",
        "R. Mammei",
        "R. Matsumiya",
        "K. Mishima",
        "R. Picker",
        "W. Schreyer",
        "H. M. Shimizu"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ins-det",
        "nucl-ex"
    ],
    "abstract": "Metal tubes plated with nickel-phosphorus are used in many fundamental physics experiments using ultracold neutrons (UCN) because of their ease of fabrication. These tubes are usually polished to a average roughness of 25-150 nm. However, there is no scattering model that accurately describes UCN scattering on such a rough guide surface with a mean-square roughness larger than 5 nm. We therefore developed a scattering model for UCN in which scattering from random surface waviness with a size larger than the UCN wavelength is described by a microfacet Bidirectional Reflectance Distribution Function model (mf-BRDF model), and scattering from smaller structures by the Lambert's cosine law (Lambert model). For the surface waviness, we used the statistical distribution of surface slope measured by an atomic force microscope on a sample piece of guide tube as input of the model. This model was used to describe UCN transmission experiments conducted at the pulsed UCN source at J-PARC. In these experiments, a UCN beam collimated to a divergence angle smaller than $\\pm 6^{\\circ}$ was directed into a guide tube with a mean-square roughness of 6.4 nm to 17 nm at an oblique angle, and the UCN transport performance and its time-of-flight distribution were measured while changing the angle of incidence. The mf-BRDF model combined with the Lambert model with scattering probability $p_{L} = 0.039\\pm0.003$ reproduced the experimental results well. We have thus established a procedure to evaluate the characteristics of UCN guide tubes with a surface roughness of approximately 10 nm.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15461v1"
    ],
    "publication_venue": "15 pages, 11 figures"
}