{
    "arxiv_id": "2303.16503",
    "paper_title": "Denoising Magnetic Resonance Spectroscopy (MRS) Data Using Stacked Autoencoder for Improving Signal-to-Noise Ratio and Speed of MRS",
    "authors": [
        "Jing Wang",
        "Bing Ji",
        "Yang Lei",
        "Tian Liu",
        "Hui Mao",
        "Xiaofeng Yang"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "physics.med-ph"
    ],
    "abstract": "Background: Magnetic resonance spectroscopy (MRS) enables non-invasive detection and measurement of biochemicals and metabolites. However, MRS has low signal-to-noise ratio (SNR) when concentrations of metabolites are in the range of the million molars. Standard approach of using a high number of signal averaging (NSA) to achieve sufficient NSR comes at the cost of a long acquisition time. Purpose: We propose to use deep-learning approaches to denoise MRS data without increasing the NSA. Methods: The study was conducted using data collected from the brain spectroscopy phantom and human subjects. We utilized a stack auto-encoder (SAE) network to train deep learning models for denoising low NSA data (NSA = 1, 2, 4, 8, and 16) randomly truncated from high SNR data collected with high NSA (NSA=192) which were also used to obtain the ground truth. We applied both self-supervised and fully-supervised training approaches and compared their performance of denoising low NSA data based on improved SNRs. Results: With the SAE model, the SNR of low NSA data (NSA = 1) obtained from the phantom increased by 22.8% and the MSE decreased by 47.3%. For low NSA images of the human parietal and temporal lobes, the SNR increased by 43.8% and the MSE decreased by 68.8%. In all cases, the chemical shift of NAA in the denoised spectra closely matched with the high SNR spectra, suggesting no distortion to the spectra from denoising. Furthermore, the denoising performance of the SAE model was more effective in denoising spectra with higher noise levels. Conclusions: The reported SAE denoising method is a model-free approach to enhance the SNR of low NSA MRS data. With the denoising capability, it is possible to acquire MRS data with a few NSA, resulting in shorter scan times while maintaining adequate spectroscopic information for detecting and quantifying the metabolites of interest.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16503v1"
    ],
    "publication_venue": null
}