{
    "arxiv_id": "2303.13202",
    "paper_title": "Tentative detection of titanium oxide in the atmosphere of WASP-69 b with a 4m ground-based telescope",
    "authors": [
        "Qinglin Ouyang",
        "Wei Wang",
        "Meng Zhai",
        "Guo Chen",
        "Patricio Rojo",
        "Yujuan Liu",
        "Fei Zhao",
        "Jia-Sheng Huang",
        "Gang Zhao"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP"
    ],
    "abstract": "Transiting planets provide unique opportunities for the atmospheric characterization of exoplanets as they can reveal composition and the temperature structures at the day-night terminator regions in planetary atmospheres, and help understand the atmospheric process and formation environments of exoplanets. Here, we present the optical transmission spectroscopic study of an inflated Saturn-mass planet WASP-69 b, obtained by the 4-meter ground-based telescope Southern Astrophysical Research Telescope (SOAR). We obtain spectroscopic transit light curves in 20 passbands from 502 to 890 nm, and fit them using Gaussian Processes and an analytical transit model to obtain independent transit depths for each. The derived transmission spectrum of WASP-69 b shows a slope with absorption depth increasing towards blue wavelengths, indicating a Rayleigh scattering in the atmosphere consistent with previous works. The retrieval analysis yields a tentative detection of TiO absorption feature in the transmission spectrum. We present the first results from the SOAR telescope to characterize exoplanetary atmospheres proving its capability and precision for hot Jupiters around bright stars in an area dominated by results from large ground-based telescopes or space telescopes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13202v1"
    ],
    "publication_venue": "21 pages, 17 figures, 9 tables, Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad893"
}