{
    "arxiv_id": "2303.15683",
    "paper_title": "Prospects for detection rate of very-high-energy γ-ray emissions from short γ-ray bursts with the HADAR experiment",
    "authors": [
        "Qi-Ling Chen",
        "Pei-Jin Hu",
        "Jing-Jing Su",
        "Ming-Ming Kang",
        "Yi-Qing Guo",
        "Tian-Lu Chen",
        "Dan-Zeng Luo-Bu",
        "Yu-fan Fan",
        "You-Liang Feng",
        "Qi Gao",
        "Quan-Bu Gou",
        "Hong-Bo Hu",
        "Hai-Jin Li",
        "Cheng Liu",
        "Mao-Yuan Liu",
        "Wei Liu",
        "Xiang-Li Qian",
        "Bing-Qiang Qiao",
        "Hui-Ying Sun",
        "Xu Wang",
        "Zhen Wang",
        "Guang-Guang Xin",
        "Yu-Hua Yao",
        "Qiang Yuan",
        "Yi Zhang"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "The observation of short gamma ray bursts (SGRBs) in the TeV energy range plays an important role in understanding the radiation mechanism and probing new areas of physics such as Lorentz invariance violation. However, no SGRB has been observed in this energy range due to the short duration of SGRBs and the weakness of current experiments. New experiments with new technology are required to detect sub-TeV SGRBs. In this work, we observe the very high energy (VHE) $γ$-ray emissions from SGRBs and calculate the annual detection rate with the High Altitude Detection of Astronomical Radiation HADAR (HADAR) experiment. First, a set of pseudo-SGRB samples is generated and checked using the observations of Fermi-GBM, Fermi-LAT, and SWIFT measurements. The annual detection rate is calculated from these SGRB samples based on the performance of the HADAR instrument. As a result, the HADAR experiment can detect 0.5 SGRB per year if the spectral break-off of $γ$-rays caused by the internal absorption is larger than 100 GeV. For a GRB09010-like GRB in HADAR's view, it should be possible to detect approximately 2000 photons considering the internal absorption. With a time delay assumption due to the Lorentz invariance violation effects, a simulated light curve of GRB090510 has evident energy dependence. We hope that the HADAR experiment can perform the SGRB observations and test our calculations in the future.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15683v1"
    ],
    "publication_venue": null
}