{
    "arxiv_id": "2303.13262",
    "paper_title": "Noise impact on recurrent neural network with linear activation function",
    "authors": [
        "V. M. Moskvitin",
        "N. Semenova"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-07-24"
    ],
    "latest_version": 1,
    "categories": [
        "cs.NE"
    ],
    "abstract": "In recent years, more and more researchers in the field of neural networks are interested in creating hardware implementations where neurons and the connection between them are realized physically. The physical implementation of ANN fundamentally changes the features of noise influence. In the case hardware ANNs, there are many internal sources of noise with different properties. The purpose of this paper is to study the peculiarities of internal noise propagation in recurrent ANN on the example of echo state network (ESN), to reveal ways to suppress such noises and to justify the stability of networks to some types of noises.\n  In this paper we analyse ESN in presence of uncorrelated additive and multiplicative white Gaussian noise. Here we consider the case when artificial neurons have linear activation function with different slope coefficients. Starting from studying only one noisy neuron we complicate the problem by considering how the input signal and the memory property affect the accumulation of noise in ESN. In addition, we consider the influence of the main types of coupling matrices on the accumulation of noise. So, as such matrices, we take a uniform matrix and a diagonal-like matrices with different coefficients called \"blurring\" coefficient.\n  We have found that the general view of variance and signal-to-noise ratio of ESN output signal is similar to only one neuron. The noise is less accumulated in ESN with diagonal reservoir connection matrix with large \"blurring\" coefficient. Especially it concerns uncorrelated multiplicative noise.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13262v1"
    ],
    "publication_venue": "12 pages, 6 figures, 23 references",
    "doi": "10.20537/nd230502"
}