{
    "arxiv_id": "2303.10698",
    "paper_title": "In-situ visualization of local distortions in the high-$T_c$ molecule-intercalated $Li_x(C_5H_5N)_yFe_{2-z}Se_2$ superconductor",
    "authors": [
        "Izar Capel Berdiell",
        "Edyta Pesko",
        "Elijah Lator",
        "Alexandros Deltsidis",
        "Anna Krzton-Maziopa",
        "A. M. Milinda Abeykoon",
        "Emil S. Bozin",
        "Alexandros Lappas"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con",
        "cond-mat.mtrl-sci",
        "cond-mat.str-el"
    ],
    "abstract": "A time-resolved synchrotron X-ray total scattering study sheds light on the evolution of the different structural length scales involved during the intercalation of the layered iron-selenide host by organic molecular donors, aiming at the formation of the expanded lattice $Li_x(C_5H_5N)_yFe_{2-z}Se_2$ hybrid superconductor. The intercalates are found to crystallize in the tetragonal $ThCr_2Si_2$-type structure at the average level, however, with an enhanced interlayer iron-selenide spacing (d= 16.2 Å) that accommodates the heterocyclic molecular spacers. Quantitative atomic pair distribution function (PDF) analysis at variable times, suggests distorted $FeSe_4$ tetrahedral local environments that appear swollen with respect to those in the parent $β$-FeSe. Simultaneously acquired, in-situ synchrotron X-ray powder diffraction data disclose that secondary phases ($α$-Fe and $Li_2Se$), grow significantly when higher Li-concentration is used in the solvothermal reaction or when the solution is aged. These observations are in line with the strongly reducing character of the intercalation medium's solvated electrons that mediate the defect chemistry of the expanded lattice superconductor. In the latter, intralayer correlated local distortions indicate electron donating aspects that reflect in somewhat enlarged Fe-Se bonds. They also reveal a degree of relief of chemical pressure associated with a large distance between Fe and Se sheets ('taller' anion height) and a stretched Fe-Fe square planar topology. The elongation of the latter, derived from the in-situ PDF study, speaks for a plausible increase in the Fe-site vacancy concentration. The evolution of the local structural parameters suggests an optimum reaction window where kinetically stabilized phases resemble the distortions of the edge-sharing Fe-Se tetrahedra, required for high-$T_c$ in expanded lattice iron-chalcogenides.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10698v1"
    ],
    "publication_venue": "Main text of 25 pages, 8 Figures. Supplemental Material of 19 pages, 10 Figures, 1 Table",
    "doi": "10.1021/acs.inorgchem.1c03610"
}