{
    "arxiv_id": "2303.10739",
    "paper_title": "Large active-area superconducting microwire detector array with single-photon sensitivity in the near-infrared",
    "authors": [
        "Jamie S. Luskin",
        "Ekkehart Schmidt",
        "Boris Korzh",
        "Andrew D. Beyer",
        "Bruce Bumble",
        "Jason P. Allmaras",
        "Alexander B. Walter",
        "Emma E. Wollman",
        "Lautaro Narváez",
        "Varun B. Verma",
        "Sae Woo Nam",
        "Ilya Charaev",
        "Marco Colangelo",
        "Karl K. Berggren",
        "Cristián Peña",
        "Maria Spiropulu",
        "Maurice Garcia-Sciveres",
        "Stephen Derenzo",
        "Matthew D. Shaw"
    ],
    "submission_date": "2023-03-19",
    "revised_dates": [
        "2023-06-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ins-det"
    ],
    "abstract": "Superconducting nanowire single photon detectors (SNSPDs) are the highest-performing technology for time-resolved single-photon counting from the UV to the near-infrared. The recent discovery of single-photon sensitivity in micrometer-scale superconducting wires is a promising pathway to explore for large active area devices with application to dark matter searches and fundamental physics experiments. We present 8-pixel $1 mm^2$ superconducting microwire single photon detectors (SMSPDs) with $1\\,\\mathrm{μm}$-wide wires fabricated from WSi and MoSi films of various stoichiometries using electron-beam and optical lithography. Devices made from all materials and fabrication techniques show saturated internal detection efficiency at 1064 nm in at least one pixel, and the best performing device made from silicon-rich WSi shows single-photon sensitivity in all 8 pixels and saturated internal detection efficiency in 6/8 pixels. This detector is the largest reported active-area SMSPD or SNSPD with near-IR sensitivity published to date, and the first report of an SMSPD array. By further optimizing the photolithography techniques presented in this work, a viable pathway exists to realize larger devices with $cm^2$-scale active area and beyond.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10739v1"
    ],
    "publication_venue": null,
    "doi": "10.1063/5.0150282"
}