{
    "arxiv_id": "2303.11590",
    "paper_title": "Koopman-Hopf Hamilton-Jacobi Reachability and Control",
    "authors": [
        "Will Sharpless",
        "Nikhil Shinde",
        "Matthew Kim",
        "Yat Tin Chow",
        "Sylvia Herbert"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-08-25"
    ],
    "latest_version": 6,
    "categories": [
        "eess.SY",
        "math.OC"
    ],
    "abstract": "The Hopf formula for Hamilton-Jacobi reachability (HJR) analysis has been proposed to solve high-dimensional differential games, producing the set of initial states and corresponding controller required to reach (or avoid) a target despite bounded disturbances. As a space-parallelizable method, the Hopf formula avoids the curse of dimensionality that afflicts standard dynamic-programming HJR, but is restricted to linear time-varying systems. To compute reachable sets for high-dimensional nonlinear systems, we pair the Hopf solution with Koopman theory for global linearization. By first lifting a nonlinear system to a linear space and then solving the Hopf formula, approximate reachable sets can be efficiently computed that are much more accurate than local linearizations. Furthermore, we construct a Koopman-Hopf disturbance-rejecting controller, and test its ability to drive a 10-dimensional nonlinear glycolysis model. We find that it significantly out-competes expectation-minimizing and game-theoretic model predictive controllers with the same Koopman linearization in the presence of bounded stochastic disturbance. In summary, we demonstrate a dimension-robust method to approximately solve HJR, allowing novel application to analyze and control high-dimensional, nonlinear systems with disturbance. An open-source toolbox in Julia is introduced for both Hopf and Koopman-Hopf reachability and control.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11590v1",
        "http://arxiv.org/pdf/2303.11590v2",
        "http://arxiv.org/pdf/2303.11590v3",
        "http://arxiv.org/pdf/2303.11590v4",
        "http://arxiv.org/pdf/2303.11590v5",
        "http://arxiv.org/pdf/2303.11590v6"
    ],
    "publication_venue": null
}