{
    "arxiv_id": "2303.10225",
    "paper_title": "Robust Mode Connectivity-Oriented Adversarial Defense: Enhancing Neural Network Robustness Against Diversified $\\ell_p$ Attacks",
    "authors": [
        "Ren Wang",
        "Yuxuan Li",
        "Sijia Liu"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cs.AI",
        "cs.LG",
        "cs.NE"
    ],
    "abstract": "Adversarial robustness is a key concept in measuring the ability of neural networks to defend against adversarial attacks during the inference phase. Recent studies have shown that despite the success of improving adversarial robustness against a single type of attack using robust training techniques, models are still vulnerable to diversified $\\ell_p$ attacks. To achieve diversified $\\ell_p$ robustness, we propose a novel robust mode connectivity (RMC)-oriented adversarial defense that contains two population-based learning phases. The first phase, RMC, is able to search the model parameter space between two pre-trained models and find a path containing points with high robustness against diversified $\\ell_p$ attacks. In light of the effectiveness of RMC, we develop a second phase, RMC-based optimization, with RMC serving as the basic unit for further enhancement of neural network diversified $\\ell_p$ robustness. To increase computational efficiency, we incorporate learning with a self-robust mode connectivity (SRMC) module that enables the fast proliferation of the population used for endpoints of RMC. Furthermore, we draw parallels between SRMC and the human immune system. Experimental results on various datasets and model architectures demonstrate that the proposed defense methods can achieve high diversified $\\ell_p$ robustness against $\\ell_\\infty$, $\\ell_2$, $\\ell_1$, and hybrid attacks. Codes are available at \\url{https://github.com/wangren09/MCGR}.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10225v1"
    ],
    "publication_venue": null
}