{
    "arxiv_id": "2303.15680",
    "paper_title": "A framework for experimental-data-driven assessment of Magnetized Liner Inertial Fusion stagnation image metrics",
    "authors": [
        "William E. Lewis",
        "Eric C. Harding",
        "David A. Yager-Elorriaga",
        "Jeffrey R. Fein",
        "Patrick F. Knapp",
        "Kristian Beckwith",
        "David J. Ampleford"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "physics.plasm-ph",
        "physics.data-an"
    ],
    "abstract": "A variety of spherical crystal x-ray imager (SCXI) diagnostics have been developed and fielded on Magnetized Liner Inertial Fusion (MagLIF) experiments at the Sandia National Laboratories Z-facility. These different imaging modalities provide detailed insight into different physical phenomena such as mix of liner material into the hot fuel, cold liner emission, or reduce impact of liner opacity. However, several practical considerations ranging from the lack of a consistent spatial fiducial for registration to different point-spread-functions and tuning crystals or using filters to highlight specific spectral regions make it difficult to develop broadly applicable metrics to compare experiments across our stagnation image database without making significant unverified assumptions. We leverage experimental data for a model-free assessment of sensitivities to instrumentation-based features for any specified image metric. In particular, we utilize a database of historical and recent MagLIF data including $N_{\\text{scans}} = 139$ image plate scans gathered across $N_{\\text{exp}} = 67$ different experiments to assess the impact of a variety of features in the experimental observations arising from uncertainties in registration as well as discrepancies in signal-to-noise ratio and instrument resolution. We choose a wavelet-based image metric known as the Mallat Scattering Transform for the study and highlight how alternate metric choices could also be studied. In particular, we demonstrate a capability to understand and mitigate the impact of signal-to-noise, image registration, and resolution difference between images. This is achieved by utilizing multiple scans of the same image plate, sampling random translations and rotations, and applying instrument specific point-spread-functions found by ray tracing to high-resolution datasets, augmenting our data in an effectively model-free fashion.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15680v1"
    ],
    "publication_venue": "17 pages, 14 figures"
}