{
    "arxiv_id": "2303.10927",
    "paper_title": "Chain Conformation and Exciton Delocalization in a Push-Pull Conjugated Polymer",
    "authors": [
        "Yulong Zheng",
        "Rahul Venkatesh",
        "Connor P. Callaway",
        "Campbell Viersen",
        "Kehinde H. Fagbohungbe",
        "Aaron L. Liu",
        "Chad Risko",
        "Elsa Reichmanis",
        "Carlos Silva-Acuña"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci",
        "physics.chem-ph"
    ],
    "abstract": "Linear and nonlinear optical lineshapes reveal details of excitonic structure in semiconductor polymers. We implement absorption, photoluminescence, and transient absorption spectroscopies in DPP-DTT, an electron push-pull copolymer, to explore the relationship between their spectral lineshapes and chain conformation, deduced from resonance Raman spectroscopy and from \\textit{ab initio} calculations. The viscosity of precursor polymer solutions before film casting displays a transition that suggests gel formation above a critical concentration. Upon crossing this viscosity deflection concentration, the lineshape analysis of the absorption spectra within a photophysical aggregate model reveals a gradual increase in interchain excitonic coupling. We also observe a red-shifted and line-narrowed steady-state photoluminescence spectrum, along with increasing resonance Raman intensity in the stretching and torsional modes of the dithienothiphene unit, which suggests a longer exciton coherence length along the polymer-chain backbone. Furthermore, we observe a change of lineshape in the photoinduced absorption component of the transient absorption spectrum. The derivative-like lineshape may originate from two possibilities: a new excited-state absorption, or from optical Stark effect, both of which are consistent with the emergence of high-energy shoulder as seen in both photoluminescence and absorption spectra. Therefore, we conclude that the exciton is more dispersed along the polymer chain backbone with increasing concentrations, leading to the hypothesis that the polymer chain order is enhanced when the push-pull polymers are processed at higher concentrations. Thus, tuning the microscopic chain conformation by concentration would be another factor of interest when considering the polymer assembly pathways for pursuing large-area and high-performance organic optoelectronic devices.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10927v1"
    ],
    "publication_venue": "33 manuscript pages, submitted for publication"
}