{
    "arxiv_id": "2303.17246",
    "paper_title": "Sub-Millimetre Galaxies with Webb: Near-Infrared Counterparts and Multi-wavelength Morphology",
    "authors": [
        "S. Gillman",
        "B. Gullberg",
        "G. Brammer",
        "A. Vijayan",
        "M. Lee",
        "D. Blánquez",
        "M. Brinch",
        "T. Greve",
        "I. Jermann",
        "S. Jin",
        "V. Kokorev",
        "L. Liu",
        "G. Magdis",
        "F. Rizzo",
        "F. Valentino"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-08-02"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We utilise the unprecedented depth and resolution of recent early-release science (ERS) JWST observations to define the near-infrared counterparts of sub-millimetre selected galaxies (SMGs). We identify 45 SCUBA-2 SMG positions within The Cosmic Evolution Early Release Science Survey (CEERS) JWST/NIRCam fields. Through an analysis of multi-wavelength $p$-values, NIRCam colours and predicted SCUBA-2 fluxes, we define 43 JWST/NIRCam counterparts to the SCUBA-2 SMGs, finding a 63 per cent agreement with those identified in prior $HST$ studies. Using EaZy-py we fit the available HST and JWST observations to quantify the photometric redshifts of the NIRCam-SMGs, establishing a broad range of redshift from $z$$\\approx$0.2$-$5.4 with a median of $z$$\\approx$2.29, in agreement with other studies of SMGs. We analyse their rest-frame optical and near-infrared morphological properties (e.g. effective radius (R$_{\\rm e}$), Sérsic index ($n$), CAS, Gini and M$_{20}$), finding, on average, late-type disc-like morphologies with large scatter into the intermediate and merger regions of the non-parametric parameter space. For the non-merging galaxies, we find a median rest-frame optical size and Sérsic index (and $1σ$ scatter) of R$_{\\rm e}$=3.10$\\pm$1.67kpc and $n$=0.96$\\pm$0.66. Whilst in the rest-frame near-infrared we establish more compact, higher Sérsic index morphologies (R$_{\\rm e}$=1.64$\\pm$0.97, $n$=1.85$\\pm$0.63). We further establish that both the rest-frame optical and near-infrared effective radii correlate negatively (at a 2$σ$ level) with redshift whilst the Sérsic index remains constant with cosmic time. Our results are consistent with the picture of inside-out galaxy evolution, with more centrally concentrated older stellar populations, and more extended, younger star-forming regions whose stellar emission is heavily attenuated in the central regions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17246v1"
    ],
    "publication_venue": "Submitted for publication in A&A. Comments welcome. 18 pages",
    "doi": "10.1051/0004-6361/202346531"
}