{
    "arxiv_id": "2303.12945",
    "paper_title": "Classical Thought in Newton's General Scholium",
    "authors": [
        "Karin Verelst"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "physics.hist-ph"
    ],
    "abstract": "Isaac Newton, in popular imagination the Ur-scientist, was an outstanding humanist scholar. His researches on, among others, ancient philosophy, are thorough and appear to be connected to and fit within his larger philosophical and theological agenda. It is therefore relevant to take a closer look at Newton's intellectual choices, at how and why precisely he would occupy himself with specific text-sources, and how this interest fits into the larger picture of his scientific and intellectual endeavours. In what follows, we shall follow Newton into his study and look over his shoulder while reading compendia and original source-texts in his personal library at Cambridge, meticulously investigating and comparing fragments and commentaries, and carefully keeping track in private notes of how they support his own developing ideas. Indeed, Newton was convinced that precursors to his own insights and discoveries were present already in Antiquity, even before the Greeks, in ancient Egypt, and he puts a lot of time and effort into making the point, especially, and not incidentially, in the period between the first and the second edition of the Principia. A clear understanding of his reading of the classic sources therefore matters to our understanding of its content and gestation process. In what follows we will confine ourselves to the classical legacy, and investigate Newton's intellectual intercourse with it.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12945v1"
    ],
    "publication_venue": "57 pages, 6 pictures, 1 appendix. Content presented at the Symposium \"Isaac Newton's General Scholium: science, religion, metaphysics\", at King's College, Halifax, Canada, on 2013"
}