{
    "arxiv_id": "2303.10473",
    "paper_title": "Report of the Medical Image De-Identification (MIDI) Task Group -- Best Practices and Recommendations",
    "authors": [
        "David A. Clunie",
        "Adam Flanders",
        "Adam Taylor",
        "Brad Erickson",
        "Brian Bialecki",
        "David Brundage",
        "David Gutman",
        "Fred Prior",
        "J Anthony Seibert",
        "John Perry",
        "Judy Wawira Gichoya",
        "Justin Kirby",
        "Katherine Andriole",
        "Luke Geneslaw",
        "Steve Moore",
        "TJ Fitzgerald",
        "Wyatt Tellis",
        "Ying Xiao",
        "Keyvan Farahani"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-04-04"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CR",
        "cs.CV",
        "eess.IV"
    ],
    "abstract": "This report addresses the technical aspects of de-identification of medical images of human subjects and biospecimens, such that re-identification risk of ethical, moral, and legal concern is sufficiently reduced to allow unrestricted public sharing for any purpose, regardless of the jurisdiction of the source and distribution sites. All medical images, regardless of the mode of acquisition, are considered, though the primary emphasis is on those with accompanying data elements, especially those encoded in formats in which the data elements are embedded, particularly Digital Imaging and Communications in Medicine (DICOM). These images include image-like objects such as Segmentations, Parametric Maps, and Radiotherapy (RT) Dose objects. The scope also includes related non-image objects, such as RT Structure Sets, Plans and Dose Volume Histograms, Structured Reports, and Presentation States. Only de-identification of publicly released data is considered, and alternative approaches to privacy preservation, such as federated learning for artificial intelligence (AI) model development, are out of scope, as are issues of privacy leakage from AI model sharing. Only technical issues of public sharing are addressed.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10473v1",
        "http://arxiv.org/pdf/2303.10473v2"
    ],
    "publication_venue": "131 pages"
}