{
    "arxiv_id": "2303.11209",
    "paper_title": "Constraints on the Binarity of the WN3/O3 Class of Wolf-Rayet Stars",
    "authors": [
        "Philip Massey",
        "Kathryn F. Neugent",
        "Kathryn F. Neugent"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "The WN3/O3 Wolf-Rayet (WR) stars were discovered as part of our survey for WRs in the Magellanic Clouds. The WN3/O3s show the emission lines of a high-excitation WN star and the absorption lines of a hot O-type star, but our prior work has shown that the absorption spectrum is intrinsic to the WR star. Their place in the evolution of massive stars remains unclear. Here we investigate the possibility that they are the products of binary evolution. Although these are not WN3+O3~V binaries, they could still harbor unseen companions. To address this possibility, we have conducted a multi-year radial velocity study of six of the nine known WN3/O3s. Our study finds no evidence of statistically significant radial velocity variations, and allows us to set stringent upper limits on the mass of any hypothetical companion star: for probable orbital inclinations, any companion with a period less than 100 days must have a mass less than 2Mo. For periods less than 10 days, any companion would have to have a mass less than 1Mo. We argue that scenarios where any such companion is a compact object are unlikely. The absorption lines indicate a normal projected rotational velocity, making it unlikely that these stars evolved with the aid of a companion star that has since merged. The modest rotation also suggests that these stars are not the result of homogenous evolution. Thus it is likely that these stars are a normal but short-lived stage in the evolution of massive stars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11209v1"
    ],
    "publication_venue": "Astrophysical Journal in press"
}