{
    "arxiv_id": "2303.17339",
    "paper_title": "Conceptual design of the Gas Injection and Vacuum System for DTT NBI",
    "authors": [
        "P. Agostinetti",
        "S. Dal Bello",
        "F. Dinh",
        "A. Ferrara",
        "M. Fincato",
        "L. Grando",
        "M. Mura",
        "A. Murari",
        "E. Sartori",
        "M. Siragusa",
        "F. Siviero",
        "F. Veronese"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "physics.plasm-ph",
        "physics.ins-det"
    ],
    "abstract": "The Divertor Tokamak Test (DTT) is a new experimental facility whose construction is starting in Frascati, Rome, Italy; its main goals are improving the understanding of plasma-wall interactions and supporting the development of ITER and DEMO. DTT will be equipped with a Neutral Beam Injector (NBI) based on negative deuterium ions, designed to inject 10 MW of power to the tokamak.\n  A fundamental system for the good operations of the DTT NBI will be its Gas injection and Vacuum System (GVS). Indeed, the efficiency of the entire NBI strongly depends on the good performance of its GVS.\n  The GVS for DTT NBI will be composed of two systems working in parallel: a grounded section connected to the main vacuum vessel, and a high voltage part connected to the ion source vessel and working at -510 kV voltage. The grounded part will feature a fore vacuum system (given by screw and roots pumps) plus a high vacuum system based on turbo-molecular pumps located on the side walls of the vessel and Non-Evaporable Getter (NEG) pumps located inside the vessel on the upper and lower surfaces. On the other hand, the high voltage part will feature a fore vacuum system (given by two compact screw pumps mounted on the external surface for the ion source vessel) plus a high vacuum system based on turbo-molecular pumps also located on the sidewalls of the ion source vessel. A dedicated deuterium gas injection will feed the process gas to the ion source and the neutralizer.\n  This paper gives a description of the conceptual design of the GVS for DTT NBI, and of the procedure followed to optimize this system considering the operational requirements and the other constraints of the DTT NBI.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17339v1"
    ],
    "publication_venue": "8 pages, 8 figures, presented at the SOFT 2022 conference",
    "doi": "10.1016/j.fusengdes.2023.113638"
}