{
    "arxiv_id": "2303.09103",
    "paper_title": "Machine learning based biomedical image processing for echocardiographic images",
    "authors": [
        "Ayesha Heena",
        "Nagashettappa Biradar",
        "Najmuddin M. Maroof",
        "Surbhi Bhatia",
        "Rashmi Agarwal",
        "Kanta Prasad"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-17"
    ],
    "latest_version": 1,
    "categories": [
        "eess.IV",
        "cs.CV",
        "cs.LG"
    ],
    "abstract": "The popularity of Artificial intelligence and machine learning have prompted researchers to use it in the recent researches. The proposed method uses K-Nearest Neighbor (KNN) algorithm for segmentation of medical images, extracting of image features for analysis by classifying the data based on the neural networks. Classification of the images in medical imaging is very important, KNN is one suitable algorithm which is simple, conceptual and computational, which provides very good accuracy in results. KNN algorithm is a unique user-friendly approach with wide range of applications in machine learning algorithms which are majorly used for the various image processing applications including classification, segmentation and regression issues of the image processing. The proposed system uses gray level co-occurrence matrix features. The trained neural network has been tested successfully on a group of echocardiographic images, errors were compared using regression plot. The results of the algorithm are tested using various quantitative as well as qualitative metrics and proven to exhibit better performance in terms of both quantitative and qualitative metrics in terms of current state-of-the-art methods in the related area. To compare the performance of trained neural network the regression analysis performed showed a good correlation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09103v1"
    ],
    "publication_venue": "10 figures 4 tables",
    "doi": "10.1007/s11042-022-13516-5"
}