{
    "arxiv_id": "2303.17381",
    "paper_title": "Exact dynamics of two holes in two-leg antiferromagnetic ladders",
    "authors": [
        "K. Knakkergaard Nielsen"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.quant-gas",
        "cond-mat.str-el"
    ],
    "abstract": "We study the motion of holes in a mixed-dimensional setup of an antiferromagnetic ladder, featuring nearest neighbor hopping $t$ along the ladders and Ising-type spin interactions along, $J_\\parallel$, and across, $J_\\perp$, the ladder. We determine exact solutions for the low-energy one- and two-hole eigenstates. The presence of the trans-leg spin coupling, $J_\\perp$, leads to a linear confining potential between the holes. As a result, holes on separate legs feature a super-linear binding energy scaling as $(J_\\perp / t)^{2/3}$ in the strongly correlated regime of $J_\\perp,J_\\parallel \\leq t$. This behavior is linked to an emergent length scale $λ\\propto (t/J_\\perp)^{1/3}$, stemming from the linear confining potential, and which describes how the size of the two-hole molecular state diverges for $J_\\perp,J_\\parallel \\ll t$. On the contrary, holes on the same leg unbind at sufficiently low spin couplings. This is a consequence of the altered short-range boundary condition for holes on the same leg, yielding an effective Pauli repulsion between them, limiting their kinetic energy and making binding unfavorable. Finally, we determine the exact nonequilibrium quench dynamics following the sudden immersion of initially localized nearest neigbhor holes. The dynamics is characterized by a crossover from an initial ballistic quantum walk to an aperiodic oscillatory motion around a finite average distance between the holes due to the confining potential between them. In the strongly correlated regime of low spin couplings, $J_\\perp, J_\\parallel \\leq t$, we find this asymptotic distance to diverge as $t / J_\\perp$, showing a much stronger scaling than the eigenstates. The predicted results should be amenable to state-of-the-art quantum simulation experiments using currently implemented experimental techniques.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17381v1"
    ],
    "publication_venue": "14 pages, 9 figures"
}