{
    "arxiv_id": "2303.10105",
    "paper_title": "Gender and Precarity in Astronomy",
    "authors": [
        "N. A. Webb",
        "C. Bot",
        "S. Charpinet",
        "T. Contini",
        "L. Jouve",
        "H. Meheut",
        "S. Mei",
        "B. Mosser",
        "G. Soucail"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.IM",
        "astro-ph.HE",
        "physics.soc-ph"
    ],
    "abstract": "Following the survey Well-being in astrophysics that was sent out in March 2021, to establish how astrophysics researchers, primarily in France, experience their career, some of the results were published in Webb et al. (2021). Here we further analyse the data to determine if gender can cause different experiences in astrophysics. We also study the impact on the well-being of temporary staff (primarily PhD students and postdocs), compared to permanent staff. Whilst more temporary staff stated that they felt permanently overwhelmed than permanent staff, the experiences in astrophysics for the different genders were in general very similar, except in one area. More than three times more females than males experienced harassment or discrimination, rising sharply for gender discrimination and sexual harassment, where all of those having experienced sexual harassment and who had provided their gender in the survey, were female. Further, as previously reported (Webb et al. 2021), 20% of the respondents had suffered mental health issues before starting their career in astrophysics. We found that whilst this group was split approximately equally with regards to males and females, the number rose sharply to almost 45% of astronomers experiencing mental health issues since starting in astrophysics. Of this population, there were 50% more females than males. This excess of females was almost entirely made up of the population of women that had been harassed or discriminated against.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10105v1"
    ],
    "publication_venue": "5 pages, 1 figure, published in the SF2A-2022: Proceedings of the Annual meeting of the French Society of Astronomy and Astrophysics. Eds.: J. Richard, A. Siebert, E. Lagadec, N. Lagarde, O. Venot, J. Malzac, J.-B. Marquette, M. N'Diaye, D. Briot, pp.171-175"
}