{
    "arxiv_id": "2303.17488",
    "paper_title": "An investigation of the circumgalactic medium around z~2.2 AGN with ACA and ALMA",
    "authors": [
        "G. C. Jones",
        "R. Maiolino",
        "S. Carniani",
        "C. Circosta",
        "Y. Fudamoto",
        "J. Scholtz"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "While observations of molecular gas at cosmic noon and beyond have focused on the gas within galaxies (i.e., the interstellar medium; ISM), it is also crucial to study the molecular gas reservoirs surrounding each galaxy (i.e., in the circumgalactic medium; CGM). Recent observations of galaxies and quasars hosts at high redshift (z>2) have revealed evidence for cold gaseous halos of scale r_CGM~10kpc, with one discovery of a molecular halo with r_CGM~200kpc and a molecular gas mass one order of magnitude larger than the ISM of the central galaxy. As a follow-up, we present deep ACA and ALMA observations of CO(3-2) from this source and two other quasar host galaxies at z~2.2. While we find evidence for CO emission on scales of r~10kpc, we do not find evidence for molecular gas on scales larger than r>20 kpc. Therefore, our deep data do not confirm the existence of massive molecular halos on scales of ~100 kpc for these X-ray selected quasars. As an interesting by-product of our deep observations, we obtain the tentative detection of a negative continuum signal on scales larger than r>200kpc, which might be tracing the Sunyaev-Zeldovich effect associated with the halo heated by the active galactic nucleus (AGN). If confirmed with deeper data, this could be direct evidence of the preventive AGN feedback process expected by cosmological simulations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17488v1"
    ],
    "publication_venue": "17 pages, 12 figures. Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad985"
}