{
    "arxiv_id": "2303.11342",
    "paper_title": "Simulations of 3D organoids suggest inhibitory neighbour-neighbour signalling as a possible growth mechanism in EGFR-L858R mutant alveolar type II cells",
    "authors": [
        "Helena Coggan",
        "Clare E. Weeden",
        "Philip Pearce",
        "Mohit P. Dalwadi",
        "Alastair Magness",
        "Charles Swanton",
        "Karen M. Page"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "q-bio.CB",
        "q-bio.QM"
    ],
    "abstract": "Mutations in the epidermal growth factor receptor (EGFR) are common in non-small cell lung cancer (NSCLC), particularly in never-smoker patients. However, these mutations are not always carcinogenic, and have recently been reported in histologically normal lung tissue from patients with and without lung cancer. To investigate the outcome of EGFR mutation in healthy lung stem cells, we grew murine alveolar type-II organoids monoclonally in a 3D Matrigel. Our experiments showed that the EGFR-L858R mutation induced a change in organoid structure: mutated organoids displayed more `budding', in comparison to non-mutant controls, which were nearly spherical. On-lattice computational simulation suggested that this can be explained by an increase in reproductive fitness combined with inhibitory neighbour-neighbour signalling in mutated organoids. We predict that these effects prohibit division by cells in the interior of the organoid and boost the fitness of cells on the surface, since this differential growth is sufficient to cause `budding' structures in our simulations. These results suggest that the L858R mutation produces structures which expand quickly from surface protrusions. We suggest that the likelihood of L858R-fuelled tumorigenesis is affected not just by random fluctuations in cell fitness, but by whether the mutation arises in a spatial environment that allows mutant cells to reproduce without being forced to encounter each other. These data may have implications for cancer prevention strategies and for understanding NSCLC progression.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11342v1"
    ],
    "publication_venue": "36 pages, 17 figures"
}