{
    "arxiv_id": "2303.10881",
    "paper_title": "Machine Learning Automated Approach for Enormous Synchrotron X-Ray Diffraction Data Interpretation",
    "authors": [
        "Xiaodong Zhao",
        "YiXuan Luo",
        "Juejing Liu",
        "Wenjun Liu",
        "Kevin M. Rosso",
        "Xiaofeng Guo",
        "Tong Geng",
        "Ang Li",
        "Xin Zhang"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-07-24"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.dis-nn",
        "cs.LG"
    ],
    "abstract": "Manual analysis of XRD data is usually laborious and time consuming. The deep neural network (DNN) based models trained by synthetic XRD patterns are proved to be an automatic, accurate, and high throughput method to analysis common XRD data collected from solid sample in ambient environment. However, it remains unknown that whether synthetic XRD based models are capable to solve u-XRD mapping data for in-situ experiments involving liquid phase exhibiting lower quality with significant artifacts. In this study, we collected u-XRD mapping data from an LaCl3-calcite hydrothermal fluid system and trained two categories of models to solve the experimental XRD patterns. The models trained by synthetic XRD patterns show low accuracy (as low as 64%) when solving experimental u-XRD mapping data. The accuracy of the DNN models was significantly improved (90% or above) when training them with the dataset containing both synthetic and small number of labeled experimental u-XRD patterns. This study highlighted the importance of labeled experimental patterns on the training of DNN models to solve u-XRD mapping data from in-situ experiments involving liquid phase.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10881v1"
    ],
    "publication_venue": "See link below for supporting information https://docs.google.com/document/d/1m2SyaBDej4BhkWCA38GRXJe5Jd7Di7cp/edit?usp=sharing&ouid=108731997922646321851&rtpof=true&sd=true",
    "doi": "10.1021/acs.jpcc.3c03572"
}