{
    "arxiv_id": "2303.11948",
    "paper_title": "Forming super-Mercuries: The role of stellar abundances",
    "authors": [
        "J. Mah",
        "B. Bitsch"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
    ],
    "abstract": "Super-Mercuries, rocky exoplanets with bulk iron mass fraction of more than 60 per cent, appear to be preferentially hosted by stars with higher iron mass fraction than the Earth. It is unclear whether these iron-rich planets can form in the disc, or if giant impacts are necessary. Here we investigate the formation of super-Mercuries in their natal protoplanetary discs by taking into account their host stars' abundances (Fe, Mg, Si, S). We employ a disc evolution model which includes the growth, drift, evaporation and recondensation of pebbles to compute the pebble iron mass fraction. The recondensation of outward-drifting iron vapour near the iron evaporation front is the key mechanism that facilitates an increase in the pebble iron mass fraction. We also simulate the growth of planetary seeds around the iron evaporation front using a planet formation model which includes pebble accretion and planet migration, and compute the final composition of the planets. Our simulations are able to reproduce the observed iron compositions of the super-Mercuries provided that all the iron in the disc are locked in pure Fe grains and that the disc viscosity is low. The combined effects of slow orbital migration of planets and long retention time of iron vapour in low-viscosity discs makes it easier to form iron-rich planets. Furthermore, we find that decreasing the stellar Mg/Si ratio results in an increase in the iron mass fraction of the planet due to a reduction in the abundance of Mg2SiO4, which has a very similar condensation temperature as iron, in the disc. Our results thus imply that super-Mercuries are more likely to form around stars with low Mg/Si, in agreement with observational data.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11948v1"
    ],
    "publication_venue": "9 pages, 6 figures, accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202346021"
}