{
    "arxiv_id": "2303.17406",
    "paper_title": "Constraining the Gravitational Potential from the Projected Morphology of Extragalactic Tidal Streams",
    "authors": [
        "Jacob Nibauer",
        "Ana Bonaca",
        "Kathryn V. Johnston"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "The positions and velocities of stellar streams have been used to constrain the mass and shape of the Milky Way's dark matter halo. Several extragalactic streams have already been detected, though it has remained unclear what can be inferred about the gravitational potential from only 2D photometric data of a stream. We present a fast method to infer halo shapes from the curvature of 2D projected stream tracks. We show that the stream curvature vector must point within 90 deg of the projected acceleration vector, in the absence of recent time-dependent perturbations. While insensitive to the total magnitude of the acceleration, and therefore the total mass, applying this constraint along a stream can determine halo shape parameters and place limits on disk-to-halo mass ratios. The most informative streams are those with sharp turns or flat segments, since these streams sample a wide range of curvature vectors over a small area (sharp turns) or have a vanishing projected acceleration component (flat segments). We apply our method to low surface brightness imaging of NGC 5907, and find that its dark matter halo is oblate. Our analytic approach is significantly faster than other stream modeling techniques, and indicates what parts of a stream contribute to constraints on the potential. The method enables a measurement of dark matter halo shapes for thousands of systems using stellar stream detections expected from upcoming facilities like Rubin and Roman.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17406v1"
    ],
    "publication_venue": "31 pages, 13 figures. Submitted to ApJ. Comments welcome!"
}