{
    "arxiv_id": "2303.08831",
    "paper_title": "VISIONS: The VISTA Star Formation Atlas -- I. Survey overview",
    "authors": [
        "Stefan Meingast",
        "João Alves",
        "Hervé Bouy",
        "Monika G. Petr-Gotzens",
        "Verena Fürnkranz",
        "Josefa E. Großschedl",
        "David Hernandez",
        "Alena Rottensteiner",
        "Magda Arnaboldi",
        "Joana Ascenso",
        "Amelia Bayo",
        "Erik Brändli",
        "Anthony G. A. Brown",
        "Jan Forbrich",
        "Alyssa Goodman",
        "Alvaro Hacar",
        "Birgit Hasenberger",
        "Rainer Köhler",
        "Karolina Kubiak",
        "Michael Kuhn",
        "Charles Lada",
        "Kieran Leschinski",
        "Marco Lombardi",
        "Diego Mardones",
        "Laura Mascetti",
        "Núria Miret-Roig",
        "André Moitinho",
        "Koraljka Mužic",
        "Martin Piecka",
        "Laura Posch",
        "Timo Prusti",
        "Karla Peña Ramírez",
        "Ronny Ramlau",
        "Sebastian Ratzenböck",
        "Germano Sacco",
        "Cameren Swiggum",
        "Paula Stella Teixeira",
        "Vanessa Urban",
        "Eleonora Zari",
        "Catherine Zucker"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-05-17"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "VISIONS is an ESO public survey of five nearby (d < 500 pc) star-forming molecular cloud complexes that are canonically associated with the constellations of Chamaeleon, Corona Australis, Lupus, Ophiuchus, and Orion. The survey was carried out with VISTA, using VIRCAM, and collected data in the near-infrared passbands J, H, and Ks. With a total on-sky exposure time of 49.4 h VISIONS covers an area of 650 deg$^2$, and it was designed to build an infrared legacy archive similar to that of 2MASS. Taking place between April 2017 and March 2022, the observations yielded approximately 1.15 million images, which comprise 19 TB of raw data. The observations are grouped into three different subsurveys: The wide subsurvey comprises shallow, large-scale observations and has visited the star-forming complexes six times over the course of its execution. The deep subsurvey of dedicated high-sensitivity observations has collected data on the areas with the largest amounts of dust extinction. The control subsurvey includes observations of areas of low-to-negligible dust extinction. Using this strategy, the VISIONS survey offers multi-epoch position measurements, is able to access deeply embedded objects, and provides a baseline for statistical comparisons and sample completeness. In particular, VISIONS is designed to measure the proper motions of point sources with a precision of 1 mas/yr or better, when complemented with data from VHS. Hence, VISIONS can provide proper motions for sources inaccessible to Gaia. VISIONS will enable addressing a range of topics, including the 3D distribution and motion of embedded stars and the nearby interstellar medium, the identification and characterization of young stellar objects, the formation and evolution of embedded stellar clusters and their initial mass function, as well as the characteristics of interstellar dust and the reddening law.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08831v1"
    ],
    "publication_venue": "Accepted for publication in Astronomy & Astrophysics on 19 January 2023",
    "doi": "10.1051/0004-6361/202245771"
}