{
    "arxiv_id": "2303.12542",
    "paper_title": "Discovery of the linear energy-dependence of the spectral lag of X-ray bursts from SGR J1935+2154",
    "authors": [
        "Shuo Xiao",
        "You-Li Tuo",
        "Shuang-Nan Zhang",
        "Shao-Lin Xiong",
        "Lin Lin",
        "Yan-Qiu Zhang",
        "Yue Wang",
        "Wang-Chen Xue",
        "Ce Cai",
        "He Gao",
        "Cheng-Kui Li",
        "Xiao-Bo Li",
        "Chao Zheng",
        "Jia-Cong Liu",
        "Ping Wang",
        "Jin Wang",
        "Wen-Xi Peng",
        "Cong Zhan Liu",
        "Xin-Qiao Li",
        "Xiang-Yang Wen",
        "Zheng-Hua An",
        "Li-Ming Song",
        "Shi-Jie Zheng",
        "Fan Zhang",
        "Ai-Jun Dong",
        "Wei Xie",
        "Jian-Chao Feng",
        "Qing-Bo Ma",
        "De-Hua Wang",
        "Xi-Hong Luo",
        "Shi-Jun Dang",
        "Lun-Hua Shang",
        "Qi-Jun Zhi",
        "Ti-Pei Li"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Spectral lag of the low-energy photons with respect to the high-energy ones is a common astrophysical phenomenon (such as Gamma-ray bursts and the Crab pulsar) and may serve as a key probe to the underlying radiation mechanism. However, spectral lag in keV range of the magnetar bursts has not been systematically studied yet. In this work, we perform a detailed spectral lag analysis with the Li-CCF method for SGR J1935+2154 bursts observed by {\\it Insight}-HXMT, GECAM and Fermi/GBM from July 2014 to Jan 2022. We discover that the spectral lags of about 61\\% (non-zero significance >1$σ$) bursts from SGR J1935+2154 are linearly dependent on the photon energy ($E$) with $t_{\\rm lag}(E)=α(E/{\\rm keV})+C$, which may be explained by a linear change of the temperature of the blackbody-emitting plasma with time. The distribution of the slope ($α$) approximately follows a Gaussian function with mean and standard deviation of 0.02 ms/keV (i.e. high-energy photons arrive earlier) and 0.02 ms/keV, respectively. We also find that the distribution can be well fitted with three Gaussians with mean values of $\\sim$ -0.009, 0.013 and 0.039 ms/keV, which may correspond to different origins of the bursts. These spectral lag features may have important implications on the magnetar bursts.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12542v1"
    ],
    "publication_venue": "accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad885"
}