{
    "arxiv_id": "2303.15912",
    "paper_title": "Angle-dependent Magnetoresistance of an Ordered Bose Glass of Vortices in YBa$_{2}$Cu$_{3}$O$_{7-δ}$ Thin Films with a Periodic Pinning~Lattice",
    "authors": [
        "Bernd Aichner",
        "Lucas Backmeister",
        "Max Karrer",
        "Katja Wurster",
        "Reinhold Kleiner",
        "Edward Goldobin",
        "Dieter Koelle",
        "Wolfgang Lang"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con",
        "cond-mat.mes-hall",
        "cond-mat.mtrl-sci",
        "physics.app-ph"
    ],
    "abstract": "The competition between intrinsic disorder in superconducting YBa$_{2}$Cu$_{3}$O$_{7-δ}$ (YBCO) thin films and an ultradense triangular lattice of cylindrical pinning centers spaced at 30 nm intervals results in an ordered Bose glass phase of vortices. The samples were created by scanning the focused beam of a helium-ion microscope over the surface of the YBCO thin film to form columns of point defects where superconductivity was locally suppressed. The voltage-current isotherms reveal critical behavior and scale in the vicinity of the second-order glass transition. The latter exhibits a distinct peak in melting temperature ($T_g$) vs. applied magnetic field ($B_a$) at the magnetic commensurability field, along with a sharp rise in the lifetimes of glassy fluctuations. Angle-dependent magnetoresistance measurements in constant-Lorentz-force geometry unveil a strong increase in anisotropy compared to a pristine reference film where the density of vortices matches that of the columnar defects. The pinning is therefore, dominated by the magnetic-field component parallel to the columnar defects, exposing its one-dimensional character. These results support the idea of an ordered Bose glass phase.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15912v1"
    ],
    "publication_venue": "9 pages, 4 figures",
    "doi": "10.3390/condmat8020032"
}