{
    "arxiv_id": "2303.07899",
    "paper_title": "User Preferences of Spatio-Temporal Referencing Approaches For Immersive 3D Radar Charts",
    "authors": [
        "Nico Reski",
        "Aris Alissandrakis",
        "Andreas Kerren"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [],
    "latest_version": 1,
    "categories": [
        "cs.HC",
        "H.5.2"
    ],
    "abstract": "The use of head-mounted display technologies for virtual reality experiences\nis inherently single-user-centred, allowing for the visual immersion of its\nuser in the computer-generated environment. This isolates them from their\nphysical surroundings, effectively preventing external visual information cues,\nsuch as the pointing and referral to an artifact by another user. However, such\ninput is important and desired in collaborative scenarios when exploring and\nanalyzing data in virtual environments together with a peer. In this article,\nwe investigate different designs for making spatio-temporal references, i.e.,\nvisually highlighting virtual data artifacts, within the context of\nCollaborative Immersive Analytics. The ability to make references to data is\nfoundational for collaboration, affecting aspects such as awareness, attention,\nand common ground. Based on three design options, we implemented a variety of\napproaches to make spatial and temporal references in an immersive virtual\nreality environment that featured abstract visualization of spatio-temporal\ndata as 3D Radar Charts. We conducted a user study (n=12) to empirically\nevaluate aspects such as aesthetic appeal, legibility, and general user\npreference. The results indicate a unified favour for the presented location\napproach as a spatial reference while revealing trends towards a preference of\nmixed temporal reference approaches dependent on the task configuration:\npointer for elementary, and outline for synoptic references. Based on immersive\ndata visualization complexity as well as task reference configuration, we argue\nthat it can be beneficial to explore multiple reference approaches as\ncollaborative information cues, as opposed to following a rather uniform user\ninterface design.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07899v1"
    ],
    "publication_venue": "29 pages, 9 figures, 1 table"
}