{
    "arxiv_id": "2303.11946",
    "paper_title": "A JWST/NIRSpec First Census of Broad-Line AGNs at z=4-7: Detection of 10 Faint AGNs with M_BH~10^6-10^8 M_sun and Their Host Galaxy Properties",
    "authors": [
        "Yuichi Harikane",
        "Yechi Zhang",
        "Kimihiko Nakajima",
        "Masami Ouchi",
        "Yuki Isobe",
        "Yoshiaki Ono",
        "Shun Hatano",
        "Yi Xu",
        "Hiroya Umeda"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-10-09"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "We present a first statistical sample of faint type-1 AGNs at $z>4$ identified by JWST/NIRSpec deep spectroscopy. Among the 185 galaxies at $z_\\mathrm{spec}=3.8-8.9$ confirmed with NIRSpec, our systematic search for broad-line emission reveals 10 type-1 AGNs at $z=4.015-6.936$ whose broad component is only seen in the permitted H$α$ line and not in the forbidden [OIII]$λ$5007 line that is detected with greater significance than H$α$. The broad H$α$ line widths of $\\mathrm{FWHM}\\simeq1000-6000\\ \\mathrm{km\\ s^{-1}}$ suggest that the AGNs have low-mass black holes with $M_\\mathrm{BH}\\sim10^6-10^8\\ M_\\odot$, remarkably lower than those of low-luminosity quasars previously identified at $z>4$ with ground-based telescopes. JWST and HST high-resolution images reveal that the majority of them show extended morphologies indicating significant contribution to the total lights from their host galaxies, except for three compact objects two of which show red SEDs, probably in a transition phase from faint AGNs to low luminosity quasars. Careful AGN-host decomposition analyses show that their host's stellar masses are systematically lower than the local relation between the black hole mass and the stellar mass, implying a fast black hole growth consistent with predictions from theoretical simulations. A high fraction of the broad-line AGNs ($\\sim5\\%$), higher than $z\\sim0$, indicates that a number density of such faint AGNs is higher than an extrapolation of the quasar luminosity function, implying a large population of AGNs including type 1 and type 2 in the early universe. Such faint AGNs contribute to cosmic reionization, while the total contribution is not large, up to $\\sim50\\%$ at $z\\sim6$, because of their faint nature.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11946v1",
        "http://arxiv.org/pdf/2303.11946v2"
    ],
    "publication_venue": "24 pages, 16 figures, accepted for publication in ApJ"
}