{
    "arxiv_id": "2303.11723",
    "paper_title": "Robust microphase separation through chemical reaction networks",
    "authors": [
        "Franco Blanchini",
        "Elisa Franco",
        "Giulia Giordano",
        "Dino Osmanovic"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.soft",
        "nlin.AO",
        "nlin.PS",
        "q-bio.MN"
    ],
    "abstract": "The interaction of phase-separating systems with chemical reactions is of great interest in various contexts, from biology to material science. In biology, phase separation is thought to be the driving force behind the formation of biomolecular condensates, i.e. organelles without a membrane that are associated with cellular metabolism, stress response, and development. RNA, proteins, and small molecules participating in the formation of condensates are also involved in a variety of biochemical reactions: how do the chemical reaction dynamics influence the process of phase separation? Here we are interested in finding chemical reactions that can arrest the growth of condensates, generating stable spatial patterns of finite size (microphase separation), in contrast with the otherwise spontaneous (unstable) growth of condensates. We consider a classical continuum model for phase separation coupled to a chemical reaction network (CRN), and we seek conditions for the emergence of stable oscillations of the solution in space. Given reaction dynamics with uncertain rate constants, but known structure, we derive easily computable conditions to assess whether microphase separation is impossible, possible for some parameter values, or robustly guaranteed for all parameter values within given bounds. Our results establish a framework to evaluate which classes of CRNs favor the emergence of condensates with finite size, a question that is broadly relevant to understanding and engineering life.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11723v1"
    ],
    "publication_venue": "6 pages, 2 figures"
}