{
    "arxiv_id": "2303.14073",
    "paper_title": "Blending from binarity in microlensing searches towards the Large Magellanic Cloud",
    "authors": [
        "Tristan Blaineau",
        "Marc Moniez"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
    ],
    "abstract": "Studies of gravitational microlensing effects require the estimation of their detection efficiency, as soon as one wants to quantify the massive compact objects along the line of sight of source targets. This is particularly important for setting limits on the contribution of massive compact objects to the Galactic halo. These estimates of detection efficiency must not only account for the blending effects of accidentally superimposed sources in crowded fields, but also for possible mixing of light from stars belonging to multiple gravitationally bound stellar systems. Until now, only accidental blending have been studied, in particular thanks to high resolution space images. We address in this paper the impact of unresolved binary sources in the case of microlensing detection efficiencies towards the Large Magellanic Cloud (LMC). We use the Gaia catalog of nearby stars to constrain the local binarity rate, which we extrapolate to the distance of the LMC. Then, we estimate the maximum fraction of the cases for which a microlensing event could be significantly modified, as a function of the lens mass. We find that less than 6.2% of microlensing events on LMC sources due to halo lenses heavier than $30 M_{\\odot}$ can be significantly affected by the fact that the sources belong to unresolved binary systems. For events caused by lighter lenses on LMC sources, our study shows that the risk of blending effects by binary systems is likely to be higher and efficiency calculations remain more uncertain.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14073v1",
        "http://arxiv.org/pdf/2303.14073v2"
    ],
    "publication_venue": "10 pages, 10 figures"
}