{
    "arxiv_id": "2303.10808",
    "paper_title": "Dimension-agnostic Change Point Detection",
    "authors": [
        "Hanjia Gao",
        "Runmin Wang",
        "Xiaofeng Shao"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "stat.ME"
    ],
    "abstract": "Change point testing is a well-studied problem in statistics. Owing to the emergence of high-dimensional data with structural breaks, there has been a recent surge of interest in developing methods to accommodate high-dimensionality. In practice, when the dimension is less than the sample size but is not small, it is often unclear whether a method that is tailored to high-dimensional data or simply a classical method that is developed and justified for low-dimensional data is preferred. In addition, the methods designed for low-dimensional data may not work well in the high-dimensional environment and vice versa. This naturally brings up the question of whether there is a change point test that can work for data of low, medium, and high dimensions.\n  In this paper, we first propose a dimension-agnostic testing procedure targeting a single change point in the mean of multivariate time series. Our new test is inspired by the recent work of arXiv:2011.05068, who formally developed the notion of ``dimension-agnostic\" in several testing problems for iid data. We develop a new test statistic by adopting their sample splitting and projection ideas, and combining it with the self-normalization method for time series. Using a novel conditioning argument, we are able to show that the limiting null distribution for our test statistic is the same regardless of the dimensionality and the magnitude of cross-sectional dependence. The power analysis is also conducted to understand the large sample behavior of the proposed test. Furthermore, we present an extension to test for multiple change points in the mean and derive the limiting distributions of the new test statistic under both the null and alternatives. Through Monte Carlo simulations, we show that the finite sample results strongly corroborate the theory and suggest that the proposed tests can be used as a benchmark for many time series data.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10808v1"
    ],
    "publication_venue": null
}