{
    "arxiv_id": "2303.15662",
    "paper_title": "ChatGPT4PCG Competition: Character-like Level Generation for Science Birds",
    "authors": [
        "Pittawat Taveekitworachai",
        "Febri Abdullah",
        "Mury F. Dewantoro",
        "Ruck Thawonmas",
        "Julian Togelius",
        "Jochen Renz"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-05-30"
    ],
    "latest_version": 2,
    "categories": [
        "cs.AI",
        "cs.CL"
    ],
    "abstract": "This paper presents the first ChatGPT4PCG Competition at the 2023 IEEE Conference on Games. The objective of this competition is for participants to create effective prompts for ChatGPT--enabling it to generate Science Birds levels with high stability and character-like qualities--fully using their creativity as well as prompt engineering skills. ChatGPT is a conversational agent developed by OpenAI. Science Birds is selected as the competition platform because designing an Angry Birds-like level is not a trivial task due to the in-game gravity; the quality of the levels is determined by their stability. To lower the entry barrier to the competition, we limit the task to the generation of capitalized English alphabetical characters. We also allow only a single prompt to be used for generating all the characters. Here, the quality of the generated levels is determined by their stability and similarity to the given characters. A sample prompt is provided to participants for their reference. An experiment is conducted to determine the effectiveness of several modified versions of this sample prompt on level stability and similarity by testing them on several characters. To the best of our knowledge, we believe that ChatGPT4PCG is the first competition of its kind and hope to inspire enthusiasm for prompt engineering in procedural content generation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15662v1",
        "http://arxiv.org/pdf/2303.15662v2"
    ],
    "publication_venue": "This paper accepted for presentation at IEEE CoG 2023 is made available for participants of ChatGPT4PCG Competition (https://chatgpt4pcg.github.io/) and readers interested in relevant areas"
}