{
    "arxiv_id": "2303.12458",
    "paper_title": "Nucleosynthesis in jet-driven and jet-associated supernovae",
    "authors": [
        "M. Obergaulinger",
        "M. Reichert"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "In contrast to regular core-collapse supernovae, explosions of rapidly rotating massive stars can develop jets, fast collimated outflows directed along the rotational axis. Depending on the rate of rotation and the magnetic field strength before collapse as well as on possible mechanisms amplifying the magnetic field, such a core can explode magnetorotationally rather than via the standard supernova mechanism based on neutrino heating. This scenario can explain the highest kinetic energies observed in the class of hypernovae. On longer time scales, rotation and magnetic fields can play an important role in the engine of long gamma-ray burst powered by proto-magnetars or hyperaccreting black holes in collapsars. Both classes of events are characterized by relativistic jets and winds driven by neutrinos or magnetic spin-down of the central objects. The nucleosynthesis in these events includes the production of Fe group elements, including a possibly enhanced synthesis of radioactive 56Ni leading to high peak luminosities. Additionally, these events are, out of all stellar core-collapse events the ones most likely to allow for the formation of the heaviest nuclei via rapid neutron captures. Increasingly sophisticated numerical simulations indicate that at least a limited r-process is possible, though it remains open how robust this result is against variations in the numerical methods and the initial conditions. If so, supernovae with jets could contribute to the observed galactic chemical enrichment, in particular at early times before neutron-star mergers might be able to set in.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12458v1"
    ],
    "publication_venue": "41 pages, 7 figures. Chapter to appear in Handbook of Nuclear Physics (Springer)"
}