{
    "arxiv_id": "2303.15854",
    "paper_title": "Ultrafast Variability in AGN Jets: Intermittency and Lighthouse Effect",
    "authors": [
        "Emanuele Sobacchi",
        "Tsvi Piran",
        "Luca Comisso"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Gamma-ray flares from Active Galactic Nuclei (AGN) show substantial variability on ultrafast timescales (i.e. shorter than the light crossing time of the AGN's supermassive black hole). We propose that ultrafast variability is a byproduct of the turbulent dissipation of the jet Poynting flux. Due to the intermittency of the turbulent cascade, the dissipation is concentrated in a set of reconnecting current sheets. Electrons energised by reconnection have a strong pitch angle anisotropy, i.e. their velocity is nearly aligned with the guide magnetic field. Then each current sheet produces a narrow radiation beam, which dominates the emission from the whole jet when it is directed towards the observer. The ultrafast variability is set by the light crossing time of a single current sheet, which is much shorter than the light crossing time of the whole emission region. The predictions of our model are: (i) The bolometric luminosity of ultrafast AGN flares is dominated by the inverse Compton (IC) emission, as the lower energy synchrotron emission is suppressed due to the pitch angle anisotropy. (ii) If the observed luminosity includes a non-flaring component, the variations of the synchrotron luminosity have a small amplitude. (iii) The synchrotron and IC emission are less variable at lower frequencies, as the cooling time of the radiating particles exceeds the light crossing time of the current sheet. Simultaneous multiwavelength observations of ultrafast AGN flares can test these predictions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15854v1"
    ],
    "publication_venue": "9 pages, accepted for publication in ApJL",
    "doi": "10.3847/2041-8213/acc84d"
}