{
    "arxiv_id": "2303.14606",
    "paper_title": "Spectroscopic signature of obstructed surface states in SrIn$_2$P$_2$",
    "authors": [
        "Xiang-Rui Liu",
        "Hanbin Deng",
        "Yuntian Liu",
        "Zhouyi Yin",
        "Congrun Chen",
        "Yu-Peng Zhu",
        "Yichen Yang",
        "Zhicheng Jiang",
        "Zhengtai Liu",
        "Mao Ye",
        "Dawei Shen",
        "Jia-Xin Yin",
        "Kedong Wang",
        "Qihang Liu",
        "Yue Zhao",
        "Chang Liu"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "The century-long development of surface sciences has witnessed the discoveries of a variety of quantum states. In the recently proposed \"obstructed atomic insulators\", insulators with symmetric charges pinned at virtual sites where no real atoms reside, the cleavage through these sites could lead to a set of obstructed surface states with partial occupation. Here, utilizing scanning tunneling microscopy, angle-resolved photoemission spectroscopy and first-principles calculations, we observe spectroscopic signature of obstructed surface states in SrIn$_2$P$_2$. We find a pair of surface states originated from the pristine obstructed surface states split by a unique surface reconstruction. The upper branch is marked with a striking differential conductance peak followed by negative differential conductance, signaling its localized nature, while the lower branch is found to be highly dispersive. This pair of surface states is in consistency with our calculational results. Our finding not only demonstrates a surface quantum state induced by a new type of bulk-boundary correspondence, but also provides a platform for exploring efficient catalysts and related surface engineering.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14606v1"
    ],
    "publication_venue": "20 Pages, 4 Figures",
    "doi": "10.1038/s41467-023-38589-0"
}