{
    "arxiv_id": "2303.15930",
    "paper_title": "Full counting statistics of ultrafast quantum transport",
    "authors": [
        "Matthias Hübler",
        "Wolfgang Belzig"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-08-02"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "Quantum transport in the presence of time-dependent drives is dominated by quantum interference and many-body effects at low temperatures. For a periodic driving, the analysis of the full counting statistics revealed the elementary events that determine the statistical properties of the charge transport. As a result, the noise correlations display quantum oscillation as functions of the ratio of the voltage amplitude and the drive frequency reflecting the detailed shape of the drive. However, so far only continuous wave excitations were considered, but recently transport by few-cycle light pulses were investigated and the need for a statistical interpretation became eminent. We address the charge transfer generated by single- or few-cycle light pulses. The fingerprints of these time-dependent voltage pulses are imprinted in the full counting statistics of a coherent mesoscopic conductor at zero temperature. In addition, we identify the elementary processes that occur in the form of electron-hole pair creations, which can be investigated by the excess noise. We study the quantum oscillations in the differential noise induced by a wave packet consisting of an oscillating carrier modulated by a Gaussian- or a box-shaped envelope. As expected, the differential noise exhibits an oscillatory behavior with increasing amplitude. In particular, we find clear signature of the so-called carrier-envelope phase in the peak heights and positions of these quantum oscillations. More carrier cycles under the Gaussian envelope diminish the influence of the carrier-envelope phase, while this is not true for the box pulses, probably related to the abrupt onset. As the quantum oscillations are due to the energy-time uncertainty of the short pulses, our results pave the way to a description of the nonequilibrium electron transport in terms of a many-body Wigner function of the electronic system.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15930v1"
    ],
    "publication_venue": "5 pages, submitted to APL Special Topic on \"Electronic Noise - From Advanced Materials to Quantum Technologies\"",
    "doi": "10.1063/5.0152161"
}