{
    "arxiv_id": "2303.08896",
    "paper_title": "SelfCheckGPT: Zero-Resource Black-Box Hallucination Detection for Generative Large Language Models",
    "authors": [
        "Potsawee Manakul",
        "Adian Liusie",
        "Mark J. F. Gales"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-05-09"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CL"
    ],
    "abstract": "Generative Large Language Models (LLMs) such as GPT-3 are capable of generating highly fluent responses to a wide variety of user prompts. However, LLMs are known to hallucinate facts and make non-factual statements which can undermine trust in their output. Existing fact-checking approaches either require access to the output probability distribution (which may not be available for systems such as ChatGPT) or external databases that are interfaced via separate, often complex, modules. In this work, we propose \"SelfCheckGPT\", a simple sampling-based approach that can be used to fact-check black-box models in a zero-resource fashion, i.e. without an external database. SelfCheckGPT leverages the simple idea that if a LLM has knowledge of a given concept, sampled responses are likely to be similar and contain consistent facts. However, for hallucinated facts, stochastically sampled responses are likely to diverge and contradict one another. We investigate this approach by using GPT-3 to generate passages about individuals from the WikiBio dataset, and manually annotate the factuality of the generated passages. We demonstrate that SelfCheckGPT can: i) detect non-factual and factual sentences; and ii) rank passages in terms of factuality. We compare our approach to several baselines and show that in sentence hallucination detection, our approach has AUC-PR scores comparable to or better than grey-box methods, while SelfCheckGPT is best at passage factuality assessment.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08896v1",
        "http://arxiv.org/pdf/2303.08896v2"
    ],
    "publication_venue": "13 pages, update to include additional results and larger dataset"
}