{
    "arxiv_id": "2303.15295",
    "paper_title": "The role of thermal fluctuations in the motion of a free body",
    "authors": [
        "Pep Español",
        "Mark Thachuk",
        "J. A. de la Torre"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.stat-mech"
    ],
    "abstract": "The motion of a rigid body is described in Classical Mechanics with the venerable Euler's equations which are based on the assumption that the relative distances among the constituent particles are fixed in time. Real bodies, however, cannot satisfy this property, as a consequence of thermal fluctuations. We generalize Euler's equations for a free body in order to describe dissipative and thermal fluctuation effects in a thermodynamically consistent way. The origin of these effects is internal, i.e. not due to an external thermal bath. The stochastic differential equations governing the orientation and central moments of the body are derived from first principles through the theory of coarse-graining. Within this theory, Euler's equations emerge as the reversible part of the dynamics. For the irreversible part, we identify two distinct dissipative mechanisms; one associated with diffusion of the orientation, whose origin lies in the difference between the spin velocity and the angular velocity, and one associated with the damping of dilations, i.e. inelasticity. We show that a deformable body with zero angular momentum will explore uniformly, through thermal fluctuations, all possible orientations. When the body spins, the equations describe the evolution towards the alignment of the body's major principal axis with the angular momentum vector. In this alignment process, the body increases its temperature. We demonstrate that the origin of the alignment process is not inelasticity but rather orientational diffusion. The theory also predicts the equilibrium shape of a spinning body.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15295v1"
    ],
    "publication_venue": "24 pages, 1 figure with Supplemental Material"
}