{
    "arxiv_id": "2303.10423",
    "paper_title": "Random site percolation thresholds on square lattice for complex neighborhoods containing sites up to the sixth coordination zone",
    "authors": [
        "Krzysztof Malarz"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2024-05-09"
    ],
    "latest_version": 3,
    "categories": [
        "cond-mat.stat-mech"
    ],
    "abstract": "The site percolation problem is one of the core topics in statistical physics. Evaluation of the percolation threshold, which separates two phases (sometimes described as conducting and insulating), is useful for a range of problems from core condensed matter to interdisciplinary application of statistical physics in epidemiology or other transportation or connectivity problems. In this paper with Newman--Ziff fast Monte Carlo algorithm and finite-size scaling theory the random site percolation thresholds $p_c$ for a square lattice with complex neighborhoods containing sites from the sixth coordination zone are computed. Complex neighborhoods are those that contain sites from various coordination zones (which are not necessarily compact). We also present the source codes of the appropriate procedures (written in C) to be replaced in original Newman--Ziff code. Similar to results previously found for the honeycomb lattice, the percolation thresholds for complex neighborhoods on a square lattice follow the power law $p_c(ζ)\\proptoζ^{-γ_2}$ with $γ_2=0.5454(60)$, where $ζ=\\sum_i z_i r_i$ is the weighted distance of sites in complex neighborhoods ($r_i$ and $z_i$ are the distance from the central site and the number of sites in the coordination zone $i$, respectively).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10423v1",
        "http://arxiv.org/pdf/2303.10423v2",
        "http://arxiv.org/pdf/2303.10423v3"
    ],
    "publication_venue": "13 pages, 1 table with 32 percolation thresholds, 5 figures, 6 subroutines",
    "doi": "10.1016/j.physa.2023.129347"
}