{
    "arxiv_id": "2303.15614",
    "paper_title": "Modeling Population Movements under Uncertainty at the Border in Humanitarian Crises: A Situational Analysis Tool",
    "authors": [
        "Arturo de Nieves Gutierrez de Rubalcava",
        "Oscar Sanchez Piñeiro",
        "Rebeca Moreno Jiménez",
        "Joseph Aylett-Bullock",
        "Azra Ismail",
        "Sofia Kyriazi",
        "Catherine Schneider",
        "Fred Sekidde",
        "Giulia del Panta",
        "Chao Huang",
        "Vanessa Maigné",
        "Miguel Luengo-Oroz",
        "Katherine Hoffmann Pham"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CY"
    ],
    "abstract": "Humanitarian agencies must be prepared to mobilize quickly in response to complex emergencies, and their effectiveness depends on their ability to identify, anticipate, and prepare for future needs. These are typically highly uncertain situations in which predictive modeling tools can be useful but challenging to build. To better understand the need for humanitarian support -- including shelter and assistance -- and strengthen contingency planning and protection efforts for displaced populations, we present a situational analysis tool to help anticipate the number of migrants and forcibly displaced persons that will cross a border in a humanitarian crisis. The tool consists of: (i) indicators of potential intent to move drawn from traditional and big data sources; (ii) predictive models for forecasting possible future movements; and (iii) a simulation of border crossings and shelter capacity requirements under different conditions. This tool has been specifically adapted to contingency planning in settings of high uncertainty, with an application to the Brazil-Venezuela border during the COVID-19 pandemic.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15614v1"
    ],
    "publication_venue": "9 pages, 5 figures"
}