{
    "arxiv_id": "2303.08681",
    "paper_title": "Ab initio spectroscopic studies of AlF and AlCl molecules",
    "authors": [
        "R. Bala",
        "V. S. Prasannaa",
        "D. Chakravarti",
        "D. Mukherjee",
        "B. P. Das"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "physics.atom-ph"
    ],
    "abstract": "In this work, we report results from our extensive spectroscopic study on AlF and AlCl molecules, keeping in mind potential laboratory as well as astrophysical applications. We carry out detailed electronic structure calculations in both the molecules, including obtaining the potential energy surfaces of the $X^1Σ$ ground electronic state and some of the relevant low-lying excited electronic states belonging to $Σ$ and $Π$ symmetries. This is followed by evaluating spectroscopic constants and molecular properties such as electric dipole moments and electric quadrupole moments. Throughout, we employ the multi-reference configuration interaction method and work with high-quality quadruple zeta basis sets, keeping in mind the need for precise results. Further, transition dipole moments between the ground electronic state and singlet excited states are also studied. The relevant vibrational parameters are computed by solving the vibrational Schrödinger equation. Subsequently, the vibrational energy spacings and transition dipole moments between the vibrational levels belonging to the same electronic states are used to evaluate the spontaneous and black-body radiation induced transition rates, followed by computing lifetimes. Finally, the energy differences between rotational levels belonging to different vibrational levels and within an electronic state as well as Einstein coefficients are reported.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08681v1"
    ],
    "publication_venue": "13pages, 6tables, 4figures + 19 pdf files for supplementary material"
}