{
    "arxiv_id": "2303.13495",
    "paper_title": "ReVersion: Diffusion-Based Relation Inversion from Images",
    "authors": [
        "Ziqi Huang",
        "Tianxing Wu",
        "Yuming Jiang",
        "Kelvin C. K. Chan",
        "Ziwei Liu"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV"
    ],
    "abstract": "Diffusion models gain increasing popularity for their generative capabilities. Recently, there have been surging needs to generate customized images by inverting diffusion models from exemplar images. However, existing inversion methods mainly focus on capturing object appearances. How to invert object relations, another important pillar in the visual world, remains unexplored. In this work, we propose ReVersion for the Relation Inversion task, which aims to learn a specific relation (represented as \"relation prompt\") from exemplar images. Specifically, we learn a relation prompt from a frozen pre-trained text-to-image diffusion model. The learned relation prompt can then be applied to generate relation-specific images with new objects, backgrounds, and styles. Our key insight is the \"preposition prior\" - real-world relation prompts can be sparsely activated upon a set of basis prepositional words. Specifically, we propose a novel relation-steering contrastive learning scheme to impose two critical properties of the relation prompt: 1) The relation prompt should capture the interaction between objects, enforced by the preposition prior. 2) The relation prompt should be disentangled away from object appearances. We further devise relation-focal importance sampling to emphasize high-level interactions over low-level appearances (e.g., texture, color). To comprehensively evaluate this new task, we contribute ReVersion Benchmark, which provides various exemplar images with diverse relations. Extensive experiments validate the superiority of our approach over existing methods across a wide range of visual relations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13495v1"
    ],
    "publication_venue": "First two authors contributed equally. Project page: https://ziqihuangg.github.io/projects/reversion.html Code: https://github.com/ziqihuangg/ReVersion"
}