{
    "arxiv_id": "2303.13576",
    "paper_title": "Gamma-rays and neutrinos from supernovae of Type Ib/c with late time emission",
    "authors": [
        "Prantik Sarmah",
        "Sovan Chakraborty",
        "Irene Tamborra",
        "Katie Auchettl"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.HE",
        "hep-ph"
    ],
    "abstract": "Observations of some supernovae (SNe), such as SN 2014C, in the X-ray and radio wavebands revealed a rebrightening over a timescale of about a year since their detection. Such a discovery hints towards the evolution of a hydrogen-poor SN of Type Ib/c into a hydrogen-rich SN of Type IIn, the late time activity being attributed to the interaction of the SN ejecta with a dense hydrogen-rich circumstellar medium (CSM) far away from the stellar core. We compute the neutrino and gamma-ray emission from these SNe, considering interactions between the shock accelerated protons and the non-relativistic CSM protons. Assuming three CSM models inspired by recent electromagnetic observations, we explore the dependence of the expected multi-messenger signals on the CSM characteristics. We also investigate the detection prospects of current and upcoming gamma-ray (Fermi-LAT and Cerenkov Telescope Array) and neutrino (IceCube, IceCube-Gen2 and KM3NeT) telescopes. Our findings are in agreement with the non-detection of neutrinos and gamma-rays from past SNe exhibiting late time emission. Nevertheless, the detection prospects of SNe with late time emission in gamma-rays and neutrinos with the Cerenkov Telescope Array and IceCube-Gen2 (Fermi and IceCube) are promising and could potentially provide new insight into the CSM properties, if the SN burst should occur within $10$ Mpc ($4$ Mpc).",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13576v1",
        "http://arxiv.org/pdf/2303.13576v2"
    ],
    "publication_venue": "KM3NeT/ARCA sensitivity is updated in Fig.3 and Fig.4"
}