{
    "arxiv_id": "2303.17625",
    "paper_title": "Sodium Brightening of (3200) Phaethon Near Perihelion",
    "authors": [
        "Qicheng Zhang",
        "Karl Battams",
        "Quanzhi Ye",
        "Matthew M. Knight",
        "Carl A. Schmidt"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-26"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
    ],
    "abstract": "Sunskirting asteroid (3200) Phaethon has been repeatedly observed in STEREO HI1 imagery to anomalously brighten and produce an antisunward tail for a few days near each perihelion passage, phenomena previously attributed to the ejection of micron-sized dust grains. Color imaging by the SOHO LASCO coronagraphs during the 2022 May apparition indicate that the observed brightening and tail development instead capture the release of sodium atoms, which resonantly fluoresce at the 589.0/589.6 nm D lines. While HI1's design bandpass nominally excludes the D lines, filter degradation has substantially increased its D line sensitivity, as quantified by the brightness of Mercury's sodium tail in HI1 imagery. Furthermore, the expected fluorescence efficiency and acceleration of sodium atoms under solar radiation readily reproduce both the photometric and morphological behaviors observed by LASCO and HI1 during the 2022 apparition and the 17 earlier apparitions since 1997. This finding connects Phaethon to the broader population of sunskirting and sungrazing comets observed by SOHO, which often also exhibit bright sodium emission with minimal visible dust, but distinguishes it from other sunskirting asteroids without detectable sodium production under comparable solar heating. These differences may reflect variations in the degree of sodium depletion of near-surface material, and thus the extent and/or timing of any past or present resurfacing activity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17625v1"
    ],
    "publication_venue": "30 pages, 14 figures, 6 tables; PSJ, in press",
    "doi": "10.3847/PSJ/acc866"
}