{
    "arxiv_id": "2303.15580",
    "paper_title": "Screening for electrically conductive defects in thin functional films using electrochemiluminescence",
    "authors": [
        "Harley Quinn",
        "Wenlu Wang",
        "Jörg G. Werner",
        "Keith A. Brown"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-11-17"
    ],
    "latest_version": 1,
    "categories": [
        "physics.app-ph"
    ],
    "abstract": "Multifunctional thin films in energy-related devices often must be electrically insulating where a single nanoscale defect can result in complete device-scale failure. Locating and characterizing such defects presents a fundamental problem where high-resolution imaging methods are needed to find defects, but imaging with high spatial resolution limits the field of view and thus the measurement throughput. Here, we present a novel high-throughput method for detecting sub-micron defects in insulating thin films by leveraging the electrochemiluminescence (ECL) of luminol. Through a systematic study of reagent concentrations, buffers, voltage, and excitation time, we identify optimized conditions at which it is possible to detect features with areas ~500 times smaller than the area interrogated by a single pixel of the camera, showing high-throughput detection of sub-micron defects. In particular, we estimate the minimum detectable features to be lines as narrow as 2.5 nm in width and pinholes as small as 35 nm in radius. We further explore this method by using it to characterize a nominally insulating phenol film and find conductive defects that are cross-correlated with high-resolution atomic force microscopy to provide feedback to synthesis. Given the inherent parallelizability and scalability of this assay, it is expected to have a major impact on the automated discovery of multifunctional films.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15580v1"
    ],
    "publication_venue": "24 pages, 5 figures, submitted to Langmuir",
    "doi": "10.1039/D3AY00687E"
}