{
    "arxiv_id": "2303.14877",
    "paper_title": "Error-mitigated Quantum Approximate Optimization via Learning-based Adaptive Optimization",
    "authors": [
        "Lixue Cheng",
        "Yu-Qin Chen",
        "Shi-Xin Zhang",
        "Shengyu Zhang"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2024-02-13"
    ],
    "latest_version": 2,
    "categories": [
        "quant-ph",
        "cs.LG"
    ],
    "abstract": "Combinatorial optimization problems are ubiquitous and computationally hard to solve in general. Quantum computing is envisioned as a powerful tool offering potential computational advantages for solving some of these problems. Quantum approximate optimization algorithm (QAOA), one of the most representative quantum-classical hybrid algorithms, is designed to solve certain combinatorial optimization problems by transforming a discrete optimization problem into a classical optimization problem over a continuous circuit parameter domain. QAOA objective landscape over the parameter variables is notorious for pervasive local minima and barren plateaus, and its viability in training significantly relies on the efficacy of the classical optimization algorithm. To enhance the performance of QAOA, we design double adaptive-region Bayesian optimization (DARBO), an adaptive classical optimizer for QAOA. Our experimental results demonstrate that the algorithm greatly outperforms conventional gradient-based and gradient-free optimizers in terms of speed, accuracy, and stability. We also address the issues of measurement efficiency and the suppression of quantum noise by successfully conducting the full optimization loop on the superconducting quantum processor. This work helps to unlock the full power of QAOA and paves the way toward achieving quantum advantage in practical classical tasks.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14877v1",
        "http://arxiv.org/pdf/2303.14877v2"
    ],
    "publication_venue": "Main text: 11 pages, 4 figures, SI: 5 pages, 5 figures"
}