{
    "arxiv_id": "2303.17175",
    "paper_title": "Weighted Scheduling of Time-Sensitive Coflows",
    "authors": [
        "Olivier Brun",
        "Rachid El-Azouzi",
        "Quang-Trung Luu",
        "Francesco De Pellergrini",
        "Balakrishna J. Prabhu",
        "Cédric Richier"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "cs.DC"
    ],
    "abstract": "Datacenter networks routinely support the data transfers of distributed computing frameworks in the form of coflows, i.e., sets of concurrent flows related to a common task. The vast majority of the literature has focused on the problem of scheduling coflows for completion time minimization, i.e., to maximize the average rate at which coflows are dispatched in the network fabric. However, many modern applications generate coflows dedicated to online services and mission-critical computing tasks which have to comply with specific completion deadlines. In this paper, we introduce $\\mathtt{WDCoflow}$, a new algorithm to maximize the weighted number of coflows that complete before their deadline. By combining a dynamic programming algorithm along with parallel inequalities, our heuristic solution performs at once coflow admission control and coflow prioritization, imposing a $σ$-order on the set of coflows. With extensive simulation, we demonstrate the effectiveness of our algorithm in improving up to $3\\times$ more coflows that meet their deadline in comparison the best SotA solution, namely $\\mathtt{CS\\text{-}MHA}$. Furthermore, when weights are used to differentiate coflow classes, $\\mathtt{WDCoflow}$ is able to improve the admission per class up to $4\\times$, while increasing the average weighted coflow admission rate.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17175v1"
    ],
    "publication_venue": "Submitted to IEEE Transactions on Parallel and Distributed Systems. Parts of this work have been presented at IFIP Networking 2022. arXiv admin note: substantial text overlap with arXiv:2205.01229"
}