{
    "arxiv_id": "2303.12420",
    "paper_title": "Use of vector polarizability to manipulate alkali-metal atoms",
    "authors": [
        "D. Cho"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "physics.atom-ph"
    ],
    "abstract": "We review a few ideas and experiments that our laboratory at Korea University has proposed and carried out to use vector polarizability βto manipulate alkali-metal atoms. βcomes from spin-orbit coupling, and it produces an ac Stark shift that resembles a Zeeman shift. When a circularly polarized laser field is properly detuned between the D1 and D2 transitions, an ac Stark shift of a ground-state atom takes the form of a pure Zeeman shift. We call it the \"analogous Zeeman effect\", and experimentally demonstrated an optical Stern-Gerlach effect and an optical trap that behaves exactly like a magnetic trap. By tuning polarization of a trapping beam, and thereby controlling a shift proportional to β, we demonstrated elimination of an inhomogeneous broadening of a ground hyperfine transition in an optical trap. We call it \"magic polarization\". We also showed significant narrowing of a Raman sideband transition at a special well depth. A Raman sideband in an optical trap is broadened owing to anharmonicity of the trap potential, and the broadening can be eliminated by a beta-induced differential ac Stark shift at what we call a \"magic well depth\". Finally, we proposed and experimentally demonstrated a cooling scheme that incorporated the idea of velocity-selective coherent population trapping to Raman sideband cooling to enhance cooling efficiency of the latter outside of the Lamb-Dicke regime. We call it \"motion-selective coherent population trapping\", and βis responsible for the selectivity. We include a program file that calculates both scalar and vector polarizabilities of a given alkali-metal atom when the wavelength of an applied field is specified. It also calculates depth of a potential well and photon-scattering rate of a trapped atom in a specific ground state when power, minimum spot size, and polarization of a trap beam are given.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12420v1"
    ],
    "publication_venue": "23 pages, 9 figures. Includes an Excel file to calculate scalar and vector polarizabilities, well depth and photon scattering rate of a given alkali-metal atom for given laser wavelength and intensity. Accepted for publication in Journal of the Korean Physical Society",
    "doi": "10.1007/s40042-023-00776-z"
}