{
    "arxiv_id": "2303.14689",
    "paper_title": "Weak Recovery Threshold for the Hypergraph Stochastic Block Model",
    "authors": [
        "Yuzhou Gu",
        "Yury Polyanskiy"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "math.PR",
        "cs.IT"
    ],
    "abstract": "We study the problem of weak recovery for the $r$-uniform hypergraph stochastic block model ($r$-HSBM) with two balanced communities. In HSBM a random graph is constructed by placing hyperedges with higher density if all vertices of a hyperedge share the same binary label. By analyzing contraction of a non-Shannon (symmetric-KL) information measure, we prove that for $r=3,4$, weak recovery is impossible below the Kesten-Stigum threshold. Prior work Pal and Zhu (2021) established that weak recovery in HSBM is always possible above the Kesten-Stigum threshold. Consequently, there is no information-computation gap for these $r$, which (partially) resolves a conjecture of Angelini et al. (2015). To our knowledge this is the first impossibility result for HSBM weak recovery.\n  As usual, we reduce the study of non-recovery of HSBM to the study of non-reconstruction in a related broadcasting on hypertrees (BOHT) model. While we show that BOHT's reconstruction threshold coincides with Kesten-Stigum for $r=3,4$, surprisingly, we demonstrate that for $r\\ge 7$ reconstruction is possible also below the Kesten-Stigum. This shows an interesting phase transition in the parameter $r$, and suggests that for $r\\ge 7$, there might be an information-computation gap for the HSBM. For $r=5,6$ and large degree we propose an approach for showing non-reconstruction below Kesten-Stigum threshold, suggesting that $r=7$ is the correct threshold for onset of the new phase. We admit that our analysis of the $r=4$ case depends on a numerically-verified inequality.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14689v1"
    ],
    "publication_venue": null
}