{
    "arxiv_id": "2303.08242",
    "paper_title": "Optimal Sampling Designs for Multi-dimensional Streaming Time Series with Application to Power Grid Sensor Data",
    "authors": [
        "Rui Xie",
        "Shuyang Bai",
        "Ping Ma"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2025-09-26"
    ],
    "latest_version": 1,
    "categories": [
        "stat.ML",
        "cs.LG",
        "stat.AP"
    ],
    "abstract": "The Internet of Things (IoT) system generates massive high-speed temporally correlated streaming data and is often connected with online inference tasks under computational or energy constraints. Online analysis of these streaming time series data often faces a trade-off between statistical efficiency and computational cost. One important approach to balance this trade-off is sampling, where only a small portion of the sample is selected for the model fitting and update. Motivated by the demands of dynamic relationship analysis of IoT system, we study the data-dependent sample selection and online inference problem for a multi-dimensional streaming time series, aiming to provide low-cost real-time analysis of high-speed power grid electricity consumption data. Inspired by D-optimality criterion in design of experiments, we propose a class of online data reduction methods that achieve an optimal sampling criterion and improve the computational efficiency of the online analysis. We show that the optimal solution amounts to a strategy that is a mixture of Bernoulli sampling and leverage score sampling. The leverage score sampling involves auxiliary estimations that have a computational advantage over recursive least squares updates. Theoretical properties of the auxiliary estimations involved are also discussed. When applied to European power grid consumption data, the proposed leverage score based sampling methods outperform the benchmark sampling method in online estimation and prediction. The general applicability of the sampling-assisted online estimation method is assessed via simulation studies.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08242v1"
    ],
    "publication_venue": "Accepted by The Annals of Applied Statistics",
    "doi": "10.1214/23-AOAS1757"
}