{
    "arxiv_id": "2303.10136",
    "paper_title": "MassNet: A Deep Learning Approach for Body Weight Extraction from A Single Pressure Image",
    "authors": [
        "Ziyu Wu",
        "Quan Wan",
        "Mingjie Zhao",
        "Yi Ke",
        "Yiran Fang",
        "Zhen Liang",
        "Fangting Xie",
        "Jingyuan Cheng"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "cs.HC",
        "cs.CV",
        "cs.LG"
    ],
    "abstract": "Body weight, as an essential physiological trait, is of considerable significance in many applications like body management, rehabilitation, and drug dosing for patient-specific treatments. Previous works on the body weight estimation task are mainly vision-based, using 2D/3D, depth, or infrared images, facing problems in illumination, occlusions, and especially privacy issues. The pressure mapping mattress is a non-invasive and privacy-preserving tool to obtain the pressure distribution image over the bed surface, which strongly correlates with the body weight of the lying person. To extract the body weight from this image, we propose a deep learning-based model, including a dual-branch network to extract the deep features and pose features respectively. A contrastive learning module is also combined with the deep-feature branch to help mine the mutual factors across different postures of every single subject. The two groups of features are then concatenated for the body weight regression task. To test the model's performance over different hardware and posture settings, we create a pressure image dataset of 10 subjects and 23 postures, using a self-made pressure-sensing bedsheet. This dataset, which is made public together with this paper, together with a public dataset, are used for the validation. The results show that our model outperforms the state-of-the-art algorithms over both 2 datasets. Our research constitutes an important step toward fully automatic weight estimation in both clinical and at-home practice. Our dataset is available for research purposes at: https://github.com/USTCWzy/MassEstimation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10136v1"
    ],
    "publication_venue": null
}