{
    "arxiv_id": "2303.10264",
    "paper_title": "A light strange star in the remnant HESS J1731-347: minimal consistency checks",
    "authors": [
        "J. E. Horvath",
        "L. S. Rocha",
        "L. M. de Sá",
        "P. H. R. S. Moraes",
        "L. G. Barão",
        "M. G. B. de Avellar",
        "A. Bernardo",
        "R. R. A. Bachega"
    ],
    "submission_date": "2023-03-17",
    "revised_dates": [
        "2023-04-26"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Context: Recently, Doroshenko and collaborators reported a very low-mass compact star, a Central Compact Object named XMMU J173203.3-344518 inside the supernova remnant HESS J1731-347. Its tiny mass is at odds with all calculations of minimum masses of neutron stars generated by iron cores, therefore (and even if not compellingly) it has been suggested to be a {\\it strange star}. Besides the mass, a radius and surface temperature have been extracted from data, and the whole body of information should ultimately reveal if this object is truly consistent with an exotic composition.\n  Aims: To understand the status of the compact object XMMU J173203.3-344518 in HESS J1731-347 within the existing models of strange stars, including its prompt formation.\n  Methods: The information obtained on the mass, radius and surface temperature are compared to theoretical calculations performed within usual theoretical models using General Relativity as the assumed theory of gravitation and a handful of cooling scenarios. A qualitative discussion showing the consistency of the strange-matter driven supernova scenario with a low-mass compact star is provided.\n  Results: We found that the object HESS J1731-347 fits within the same quark star models recently employed to explain the masses and radii of the NICER objects PSR J040+6620 and PSR J0030+0451, in which both quantities were simultaneously determined. It is also remarkable to find that a simple cooling scenario devised $30\\text{ yr}$ ago with superconducting quarks provides an overall good explanation of the surface temperature.\n  Conclusions: We conclude that XMMU J173203.3-344518 in the remnant HESS J1731-347 fits into a ``strange star'' scenario that is also consistent with heavier compact stars, which can also belong to the same class and constitute an homogeneous type of self-bound objects produced in Nature.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10264v1"
    ],
    "publication_venue": "Accepted by A&A Letters, in the press",
    "doi": "10.1051/0004-6361/202345885"
}