{
    "arxiv_id": "2303.13044",
    "paper_title": "Lightwave-controlled band engineering in quantum materials",
    "authors": [
        "Sambit Mitra",
        "Álvaro Jiménez-Galán",
        "Marcel Neuhaus",
        "Rui E F Silva",
        "Volodymyr Pervak",
        "Matthias F Kling",
        "Shubhadeep Biswas"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "cond-mat.mtrl-sci",
        "physics.optics"
    ],
    "abstract": "Stacking and twisting atom-thin sheets create superlattice structures with unique emergent properties, while tailored light fields can manipulate coherent electron transport on ultrafast timescales. The unification of these two approaches may lead to ultrafast creation and manipulation of band structure properties, which is a crucial objective for the advancement of quantum technology. Here, we address this by demonstrating a tailored lightwave-driven analogue to twisted layer stacking. This results in sub-femtosecond control of time-reversal symmetry breaking and thereby band structure engineering in a hexagonal boron nitride monolayer. The results practically demonstrate the realization of the topological Haldane model in an insulator. Twisting the lightwave relative to the lattice orientation enables switching between band configurations, providing unprecedented control over the magnitude and location of the band gap, and curvature. A resultant asymmetric population at complementary quantum valleys lead to a measurable valley Hall current, detected via optical harmonic polarimetry. The universality and robustness of the demonstrated sub-femtosecond control opens a new way to band structure engineering on the fly paving a way towards large-scale ultrafast quantum devices for real-world applications.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13044v1"
    ],
    "publication_venue": "4 pages main text, 4 figures"
}