{
    "arxiv_id": "2303.09348",
    "paper_title": "Large deviations for the Pearson family of ergodic diffusion processes involving a quadratic diffusion coefficient and a linear force",
    "authors": [
        "Cecile Monthus"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-05-26"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.stat-mech",
        "math.PR"
    ],
    "abstract": "The Pearson family of ergodic diffusions with a quadratic diffusion coefficient and a linear force are characterized by explicit dynamics of their integer moments and by explicit relaxation spectral properties towards their steady state. Besides the Ornstein-Uhlenbeck process with a Gaussian steady state, the other representative examples of the Pearson family are the Square-Root or the Cox-Ingersoll-Ross process converging towards the Gamma-distribution, the Jacobi process converging towards the Beta-distribution, the reciprocal-Gamma process (corresponding to an exponential functional of the Brownian motion) that converges towards the Inverse-Gamma-distribution, the Fisher-Snedecor process, and the Student process, so that the last three steady states display heavy-tails. The goal of the present paper is to analyze the large deviations properties of these various diffusion processes in a unified framework. We first consider the Level 1 concerning time-averaged observables over a large time-window $T$ : we write the first rescaled cumulants for generic observables and we identify the specific observables whose large deviations can be explicitly computed from the dominant eigenvalue of the appropriate deformed-generator. The explicit large deviations at Level 2 concerning the time-averaged density are then used to analyze the statistical inference of model parameters from data on a very long stochastic trajectory in order to obtain the explicit rate function for the two inferred parameters of the Pearson linear force.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09348v1",
        "http://arxiv.org/pdf/2303.09348v2"
    ],
    "publication_venue": "v2=revised version (63 pages) with new discussions of boundary conditions in various sections"
}