{
    "arxiv_id": "2303.14830",
    "paper_title": "Quasiparticle and excitonic properties of monolayer SrTiO$_3$",
    "authors": [
        "Lorenzo Varrassi",
        "Peitao Liu",
        "Cesare Franchini"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Strontium titanate SrTiO$_3$ is one of the most studied and paradigmatic transition metal oxides. Recently, a breakthrough has been achieved with the fabrication of freestanding SrTiO$_3$ ultrathin films down to the monolayer limit. However, the many-body effects on the quasiparticle and optical properties of monolayer SrTiO$_3$ remain unexplored. Using state-of-the-art many-body perturbation theory in the GW approximation combined with the Bethe-Salpeter equation, we study the quasiparticle band structure, optical and excitonic properties of monolayer SrTiO$_3$. We show that quasiparticle corrections significantly alter the band structure topology; however, the widely used diagonal $G_0W_0$ approach yields unphysical band dispersions. The correct band dispersions are restored only by taking into account the off-diagonal elements of the self-energy. The optical properties are studied both in the optical limit and for finite momenta by computing the electron energy loss spectra. We find that the imaginary part of dielectric function at the long wavelength limit is dominated by three strongly bound excitonic peaks and the direct optical gap is associated to a bright exciton state with a large binding energy of 0.93 eV. We discuss the character of the excitonic peaks via the contributing interband transitions, and reveal that the lowest bound excitonic state becomes optical inactive for finite momenta along $Γ$-M, while the other two excitonic peaks disperse to higher energies and eventually merge for momenta close to M.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14830v1"
    ],
    "publication_venue": "10 pages, 4 figures"
}