{
    "arxiv_id": "2303.08922",
    "paper_title": "UHECR Signatures and Sources",
    "authors": [
        "Daniele Fargion",
        "Pier Giorgio De Sanctis Lucentini",
        "Maxim Y. Khlopov"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-05-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "hep-ph"
    ],
    "abstract": "Abstract. We discuss recent results on the clustering, composition and distribution of Ultra-High Energy Cosmic Rays (UHECR) in the sky; from the energy of several tens of EeV in the dipole anisotropy, up to the highest energy of a few narrow clusters, those of Hot Spots. Following the early UHECR composition records deviations from proton, we noted that the UHECR events above 40 EeV can be made not just by any light or heavy nuclei, but mainly by the lightest ones as He,D, Li,Be. The remarkable Virgo absence and the few localized nearby extragalactic sources, such as CenA, NGC 253 and M82, are naturally understood: lightest UHECR nuclei cannot reach us from the Virgo distance of twenty Mpc, due to their nuclei fragility above a few Mpc distances. Their deflection and smearing in wide hot spots is better tuned to the lighter nuclei than to the preferred proton or heavy nuclei candidate courier. We note that these lightest nuclei still suffer of a partial photodistruction even from such close sources. Therefore, their distruption in fragments, within few tens EeV multiplet chain of events, have been expected and later on observed by Auger collaboration, nearly a decade ago. These multiplet presences, strongly correlate with the same CenA, NGC253 sources. The statistical weight of such correlation is reminded. We conclude that the same role of NGC 253 clustering at lower energies could also feed the Auger dipole anisotropy at lower energy ranges, integrated by nearest Vela, Crab, LMC and Cas A contributes. In our present UHECR model, based on lightest nuclei in local volumes of a few Mpcs, closest AGN, Star-Burst or very close SNR are superimposing their signals, frozen in different epochs, distances and directions, feeding small and wide anisotropy. Possible tests to confirm, or untangle the current model from alternative ones, are suggested and updated.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08922v1"
    ],
    "publication_venue": "4 pages, 4 figures",
    "doi": "10.1051/epjconf/202328304010"
}