{
    "arxiv_id": "2303.12598",
    "paper_title": "A LOFAR sample of luminous compact sources coincident with nearby dwarf galaxies",
    "authors": [
        "D. Vohl",
        "H. K. Vedantham",
        "J. W. T. Hessels",
        "C. G. Bassa",
        "D. O. Cook",
        "D. L. Kaplan",
        "T. W. Shimwell",
        "C. Zhang"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-23"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
    ],
    "abstract": "The vast majority of extragalactic, compact continuum radio sources are associated with star formation or jets from (super)massive black holes and, as such, are more likely to be found in association with starburst galaxies or early type galaxies. Recently, two new populations of radio sources have been identified: (a) compact and persistent sources (PRS) associated with fast radio bursts (FRB) in dwarf galaxies and (b) compact sources in dwarf galaxies that could belong to the long-sought population of intermediate-mass black holes. Despite the interesting aspects of these newly found sources, the current sample size is small, limiting scrutiny of the underlying population. Here, we present a search for compact radio sources coincident with dwarf galaxies. We search the LOFAR Two-meter Sky Survey (LoTSS) -- the most sensitive low-frequency (144 MHz central frequency) large-area survey for optically thin synchrotron emission to date. Exploiting LoTSS' high spatial resolution (6 arcsec) and low astrometric uncertainty (about 0.2 arcsec), we match its compact sources to the compiled sample of dwarf galaxies in the Census of the Local Universe -- an Hα survey with the Palomar Observatory's 48-inch Samuel Oschin Telescope. We identify 29 overluminous compact radio sources, evaluate the probability of chance alignment within the sample, investigate the potential nature of these sources, and evaluate their volumetric density. While optical line-ratio diagnostics on the nebular lines from the host galaxies prefer a star-formation origin (against an AGN origin), future high angular resolution radio data is necessary to ascertain the origin of the radio sources. We discuss planned strategies to differentiate them between candidate FRB hosts and intermediate-mass black holes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12598v1"
    ],
    "publication_venue": "Submitted. arXiv admin note: text overlap with arXiv:2303.11967"
}