{
    "arxiv_id": "2303.09373",
    "paper_title": "MAPSeg: Unified Unsupervised Domain Adaptation for Heterogeneous Medical Image Segmentation Based on 3D Masked Autoencoding and Pseudo-Labeling",
    "authors": [
        "Xuzhe Zhang",
        "Yuhao Wu",
        "Elsa Angelini",
        "Ang Li",
        "Jia Guo",
        "Jerod M. Rasmussen",
        "Thomas G. O'Connor",
        "Pathik D. Wadhwa",
        "Andrea Parolin Jackowski",
        "Hai Li",
        "Jonathan Posner",
        "Andrew F. Laine",
        "Yun Wang"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-11-29"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
    ],
    "abstract": "Robust segmentation is critical for deriving quantitative measures from large-scale, multi-center, and longitudinal medical scans. Manually annotating medical scans, however, is expensive and labor-intensive and may not always be available in every domain. Unsupervised domain adaptation (UDA) is a well-studied technique that alleviates this label-scarcity problem by leveraging available labels from another domain. In this study, we introduce Masked Autoencoding and Pseudo-Labeling Segmentation (MAPSeg), a $\\textbf{unified}$ UDA framework with great versatility and superior performance for heterogeneous and volumetric medical image segmentation. To the best of our knowledge, this is the first study that systematically reviews and develops a framework to tackle four different domain shifts in medical image segmentation. More importantly, MAPSeg is the first framework that can be applied to $\\textbf{centralized}$, $\\textbf{federated}$, and $\\textbf{test-time}$ UDA while maintaining comparable performance. We compare MAPSeg with previous state-of-the-art methods on a private infant brain MRI dataset and a public cardiac CT-MRI dataset, and MAPSeg outperforms others by a large margin (10.5 Dice improvement on the private MRI dataset and 5.7 on the public CT-MRI dataset). MAPSeg poses great practical value and can be applied to real-world problems. Our code and pretrained model will be available later.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09373v1",
        "http://arxiv.org/pdf/2303.09373v2"
    ],
    "publication_venue": "16 pages and 7 figures. Revised and extended to test-time and federated domain adaptation. Xuzhe Zhang and Yuhao Wu are co-first authors. Andrew F. Laine and Yun Wang are co-senior supervising authors"
}