{
    "arxiv_id": "2303.14723",
    "paper_title": "Robust superconducting correlation against inter-site interactions in the extended two-leg Hubbard ladder",
    "authors": [
        "Zongsheng Zhou",
        "Weinan Ye",
        "Hong-Gang Luo",
        "Jize Zhao",
        "Jun Chang"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2024-06-17"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.str-el"
    ],
    "abstract": "The Hubbard and related models serve as a fundamental starting point in understanding the novel experimental phenomena in correlated electron materials, such as superconductivity, Mott insulator, magnetism and stripe phases. Recent numerical simulations indicate that the emergence of superconductivity is connected with the next nearest-neighbor hopping $t^\\prime$ in the Hubbard model. However, the impacts of complex inter-site electron interaction in the $t^\\prime$-Hubbard model are less explored. Utilizing the state-of-art density-matrix renormalization group method, we investigate the $t^\\prime$-Hubbard model on a two-leg ladder with inter-site interactions extended to the fourth neighbor sites. The accurate numerical results show that the quasi-long-range superconducting correlation remains stable under the repulsive nearest-neighbor and the next nearest-neighbor interactions though these interactions are against the superconductivity. The ground state properties are also undisturbed by the longer-range repulsive interactions. In addition, inspired by recent experiments on one-dimensional cuprates chain $\\mathrm{Ba}_{2-x}\\mathrm{Sr}_x\\mathrm{CuO}_{3+δ}$, which implies an effective attraction between the nearest neighbors may exist in the cuprates superconductors, we also show that the attractive interaction between the nearest neighbors significantly enhances the superconducting correlation when it is comparable to the strength of the nearest-neighbor hopping $t^\\prime$. Stronger attraction drives the system into a Luther-Emery liquid phase. Nevertheless, with the attraction further increasing, the system enters an electron-hole phase separation and the superconducting correlation is destroyed. Finally, we investigate the effects of on-site Coulomb interaction on superconductivity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14723v1"
    ],
    "publication_venue": null,
    "doi": "10.1103/PhysRevB.108.195136"
}