{
    "arxiv_id": "2303.14431",
    "paper_title": "Odd symmetry planar Hall effect: A method of detecting current-induced in-plane magnetization switching",
    "authors": [
        "Raghvendra Posti",
        "Abhishek Kumar",
        "Mayank Baghoria",
        "Bhanu Prakash",
        "Dhananjay Tiwari",
        "Debangsu Roy"
    ],
    "submission_date": "2023-03-25",
    "revised_dates": [
        "2023-04-20"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall"
    ],
    "abstract": "Type-x device attracts considerable interest in the field of spintronics due to its robust spin-orbit torque (SOT) induced magnetization switching, and easy deposition technique. However, universally applicable and straightforward detection of type-X magnetization reversal is still elusive, unlike type-Z switching, which employs DC-based anomalous Hall effect measurement. Here, we, demonstrated that the odd planar Hall signal (O-PHV) exhibits an odd symmetry with the application of an external magnetic field which motivates us to develop a reading mechanism for detecting magnetization switching of in-plane magnetized type-X devices. We verified our DC-based reading mechanism in the Pt/Co/NiFe/Pt stack where a thin Co layer is inserted to create dissimilar interfaces about the NiFe layer. Remarkably, the current-induced in-plane fields are found to be significantly large in Pt/Co/NiFe/Pt stack. Further, we successfully employed the O-PHV method to detect the current-induced magnetization switching. The pure DC nature of the writing and reading mechanism of our proposed type-X detection technique through O-PHV makes it the easiest in-plane magnetization detection technique. Moreover, the high repeatability and easy detection of our proposed method will open new avenues toward in-plane SOT switching based memory devices and sensors.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14431v1"
    ],
    "publication_venue": null,
    "doi": "10.1063/5.0143904"
}