{
    "arxiv_id": "2303.11518",
    "paper_title": "On the Stability of IMEX Upwind gSBP Schemes for Linear Advection-Diffusion Equations",
    "authors": [
        "Sigrun Ortleb"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "math.NA"
    ],
    "abstract": "A fully discrete energy stability analysis is carried out for linear advection-diffusion problems discretized by generalized upwind summation-by-parts~(upwind gSBP) schemes in space and implicit-explicit Runge-Kutta~(IMEX-RK) schemes in time. Hereby, advection terms are discretized explicitly while diffusion terms are solved implicitly. In this context, specific combinations of space and time discretizations enjoy enhanced stability properties. In fact, if the first and second-derivative upwind gSBP operators fulfill a compatibility condition, the allowable time step size is independent of grid refinement, although the advective terms are discretized explicitly. In one space dimension it is shown that upwind gSBP schemes represent a general framework including standard discontinuous Galerkin~(DG) schemes on a global level. While previous work for DG schemes has demonstrated that the combination of upwind advection fluxes and the central-type first Bassi-Rebay~(BR1) scheme for diffusion does not allow for grid-independent stable time steps, the current work shows that central advection fluxes are compatible with BR1 regarding enhanced stability of IMEX time stepping. Furthermore, unlike previous discrete energy stability investigations for DG schemes, the present analysis is based on the discrete energy provided by the corresponding SBP norm matrix and yields time step restrictions independent of the discretization order in space since no finite-element-type inverse constants are involved. Numerical experiments are provided confirming these theoretical findings.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11518v1"
    ],
    "publication_venue": "24 pages, 4 figures, submitted to Communications on Applied Mathematics and Computation"
}