{
    "arxiv_id": "2303.09671",
    "paper_title": "A quantitative variational phase field framework",
    "authors": [
        "Arnab Mukherjee",
        "James A. Warren",
        "Peter W. Voorhees"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "The finite solid-liquid interface width in phase field models results in non-equilibrium effects, including solute trapping. Prior phase field modeling has shown that this extra degree of freedom, when compared to sharp-interface models, results in solute trapping that is well captured when realistic parameters, such as interface width, are employed. However, increasing the interface width, which is desirable for computational reasons, leads to artificially enhanced trapping thus making it difficult to model departure from equilibrium quantitatively. In the present work, we develop a variational phase field model with independent kinetic equations for the solid and liquid phases. Separate kinetic equations for the phase concentrations obviate the assumption of point wise equality of diffusion potentials, as is done in previous works. Non-equilibrium effects such as solute trapping, drag and interface kinetics can be introduced in a controlled manner in the present model. In addition, the model parameters can be tuned to obtain ``experimentally-relevant\" trapping while using significantly larger interface widths than prior efforts. A comparison with these other phase field models suggests that interface width of about three to twenty-five times larger than current best-in-class models can be employed depending upon the material system at hand leading to a speed-up by a factor of $W^{(d+2)}$, where $W$ and $d$ denote the interface width and spatial dimension, respectively. Finally the capacity to model non-equilibrium phenomena is demonstrated by simulating oscillatory instability leading to the formation of solute bands.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09671v1"
    ],
    "publication_venue": "45 pages, 9 figures, supplemental materials"
}