{
    "arxiv_id": "2303.17432",
    "paper_title": "Involution game with strategy of specialization",
    "authors": [
        "Bo Li"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-06-16"
    ],
    "latest_version": 3,
    "categories": [
        "physics.soc-ph",
        "nlin.CD"
    ],
    "abstract": "Involution now refers to the phenomenon that competitors in the same field make more efforts to struggle for limited resources but get lower individual ``profit effort ratio''. In this work, we investigate the evolution of the involution game when competitors in the same field can adopt not only the strategy of making more efforts but also a specialization strategy which allows competitors to devote all their efforts to part of the competitive field. Based on the existing model, we construct the involution game with the specialization strategy and simulate the evolution of it on a square lattice under different social resource, social temperature, effort and other conditions. In addition, we also conduct an analytical analysis to further understand the underlying mechanism of our model and to avoid illusive results caused by the model settings. Our main results show that, if the total effort of the specialization strategy and the ordinary strategy is equal, the group composed of all the agents has a certain probability to choose the ordinary strategy when the ratio of the effort to the social temperature is approaching zero, otherwise the group will choose the specialization strategy; if the total effort of the two strategies is not equal, the proportion of the specialization strategy adoption is related to the social resource, the effort and the social temperature. To some extent, our study can explain why division of labor appears in human society, and provide suggestions for individuals on competition strategy selection and governments on competition policy development.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17432v1",
        "http://arxiv.org/pdf/2303.17432v2",
        "http://arxiv.org/pdf/2303.17432v3"
    ],
    "publication_venue": "21 pages, 10 figures"
}