{
    "arxiv_id": "2303.14204",
    "paper_title": "On the dearth of C-enhanced metal-poor stars in the Galactic bulge",
    "authors": [
        "Giulia Pagnini",
        "Stefania Salvadori",
        "Martina Rossi",
        "David Aguado",
        "Ioanna Koutsouridou",
        "Ása Skúladóttir"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "The chemical fingerprints of the first stars are retained within the photospheres of ancient unevolved metal-poor stars. A significant fraction of these stellar fossils is represented by stars known as Carbon-Enhanced Metal-Poor (CEMP), $\\rm [C/Fe]>+0.7$ and $\\rm [Fe/H]<-2$, which are likely imprinted by low-energy primordial supernovae. These CEMP stars are largely observed in the Galactic halo and ultra-faint dwarf galaxies, with values reaching $\\rm [C/Fe]=+4.5$. The Galactic bulge is predicted to host the oldest stars, but it shows a striking dearth of CEMP stars with $\\rm [C/Fe]\\gtrsim +2.0$. Here we explore the possible reasons for this anomaly by performing a statistical analysis of the observations of metal-poor stars in combination with the predictions of $Λ$CDM models. We suggest that the dearth of CEMP stars with high $\\rm [C/Fe]$ is not due to the low statistics of observed metal-poor stars but is the result of the different formation process of the bulge. $N$-body simulations show that the first star-forming halos which end up in the bulge are characterized by the highest star-formation rates. These rates enable the formation of rare massive first stars exploding as pair-instability supernovae (PISNe), which wash out the signature of primordial faint supernovae. We demonstrate that the mean $\\rm [C/Fe]$ of first stars polluted environments decreases with the increasing contribution of PISNe. We conclude that the dearth of CEMP stars in the Galactic bulge indirectly probes the existence of elusive PISNe, and propose a novel method which exploits this lack to constrain the mass distribution of the first stars.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14204v1"
    ],
    "publication_venue": null,
    "doi": "10.1093/mnras/stad912"
}