{
    "arxiv_id": "2303.10162",
    "paper_title": "Probing the interference between non-linear, axionic and space-time-anisotropy effects in the QED vacuum",
    "authors": [
        "J. M. A. Paixão",
        "L. P. R. Ospedal",
        "M. J. Neves",
        "J. A. Helayël-Neto"
    ],
    "submission_date": "2023-03-13",
    "revised_dates": [
        "2023-08-03"
    ],
    "latest_version": 2,
    "categories": [
        "physics.gen-ph",
        "hep-th"
    ],
    "abstract": "We pursue the investigation of a generic non-linear extension of axionic electrodynamics (ED) in a Carroll-Field-Jackiw (CFJ) scenario that implements Lorentz-symmetry violation (LSV). The model consists of an arbitrary non-linear ED action coupled to the axion field in presence of an anisotropy four-vector that realizes the breaking of Lorentz symmetry under the particle point of view. The non-linear electromagnetic field is expanded around a constant and uniform magnetic background up to second order in the propagating photon field. Our attention is the study of the material properties of the vacuum in the particular case of a space-like CFJ $4$-vector. The dispersion relations associated to the plane wave solutions are explicitly worked out in two situations: the magnetic background perpendicular and parallel to the wave direction. We extend these results to consider the analysis of the birefringence phenomenon in presence of non-linearity, the axion and the LSV manifested through the spatial anisotropy. Three specific proposals of non-linear ED are contemplated: Euler-Heisenberg, Born-Infeld and the Modified Maxwell ED. Throughout the paper, we shall justify why we follow the unusual path of connecting, in a single Lagrangian density, three pieces of physics beyond the Standard Model, namely, non-linearity, axions and LSV. We anticipate that we shall not be claiming that the simultaneous introduction of these three topics beyond the Standard Model will bring new insights or clues for the efforts to detect axions or to constrain parameters associate to both non-linear ED and LSV physics . Our true goal is to actually inspect and describe how axionic, non-linear and LSV effects interfere with one another whenever physical entities like refraction indices and birefringence are computed in presence of an external constant and homogeneous magnetic background.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10162v1",
        "http://arxiv.org/pdf/2303.10162v2"
    ],
    "publication_venue": "27 pages, no figures"
}