{
    "arxiv_id": "2303.12511",
    "paper_title": "Control of light emission of quantum emitters coupled to silicon nanoantenna using cylindrical vector beams",
    "authors": [
        "Martin Montagnac",
        "Yoann Brûlé",
        "Aurélien Cuche",
        "Jean-Marie Poumirol",
        "Sébastien J. Weber",
        "Jonas Müller",
        "Guilhem Larrieu",
        "Vincent Larrey",
        "Franck Fournel",
        "Olivier Boisron",
        "Bruno Masenelli",
        "Gérard Colas des Francs",
        "Gonzague Agez",
        "Vincent Paillard"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-09-20"
    ],
    "latest_version": 1,
    "categories": [
        "physics.optics"
    ],
    "abstract": "Light emission of europium (Eu3+) ions placed in the vicinity of optically resonant nanoantennas is usually controlled by tailoring the local density of photon states (LDOS). We show that the polarization and shape of the excitation beam can also be used to manipulate light emission, as azimuthally or radially polarized cylindrical vector beam offers to spatially shape the electric and magnetic fields, in addition to the effect of silicon nanorings (Si-NRs) used as nanoantennas. The photoluminescence mappings of the Eu3+ transitions and the Si phonon mappings are strongly dependent of both the excitation beam and the Si-NR dimensions. The experimental results of Raman scattering and photoluminescence are confirmed by numerical simulations of the near-field intensity in the Si nanoantenna and in the Eu3+-doped film, respectively. The branching ratios obtained from the experimental PL maps also reveal a redistribution of the electric and magnetic emission channels. Our results show that it is possible to spatially control both electric and magnetic dipolar emission of Eu3+ ions by switching the laser beam polarization, hence the near-field at the excitation wavelength, and the electric and magnetic LDOS at the emission wavelength. This paves the way for optimized geometries taking advantage of both excitation and emission processes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12511v1"
    ],
    "publication_venue": "8 pages, 4 figures",
    "doi": "10.1038/s41377-023-01229-9"
}