{
    "arxiv_id": "2303.16409",
    "paper_title": "Exact solutions and cosmological constraints in fractional cosmology",
    "authors": [
        "Esteban González",
        "Genly Leon",
        "Guillermo Fernandez-Anaya"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
    ],
    "abstract": "This paper investigates exact solutions of cosmological interest in fractional cosmology. Given $μ$, the order of the fractional derivative, and $w$, the matter equation of state, we present particular exact power-law solutions. We discuss the exact general solution of the system obtained by solving a Riccati Equation, where the solution for the scale factor is a combination of power-law. Using cosmological data, we estimate the free parameters $(α_0, μ)$, where $H_{0}=100\\frac{\\text{km/s}}{\\text{Mpc}}h$, and $α_0:=t_0 H_0 = \\frac{1}{6} \\left(9 -2 μ+\\sqrt{8 μ(2 μ-9)+105}\\right)(1+ 2 ε_0)$, is the current age parameter. The joint analysis with data from SNe Ia + OHD leads to $h=0.684_{-0.027}^{+0.031}$, $μ=1.840_{-0.773}^{+1.446}$ and $ε_0=\\left(1.213_{-1.057}^{+0.482}\\right)\\times 10^{-2}$, where the best-fit values are calculated at $3σ$ CL. On the other hand, these best-fit values lead to an age of the Universe with a value of $t_0=α_0/H_0=25.62_{-4.46}^{+6.89}\\;\\text{Gyrs}$, a current deceleration parameter of $q_{0}=-0.37_{-0.11}^{+0.08}$, both at $3σ$ CL, and a current matter density parameter of $Ω_{m,0}=0.531_{-0.260}^{+0.195}$ at $1σ$ CL. Finding a Universe roughly twice older as the one of $Λ$CDM is a distinction of Fractional Cosmology. Focusing our analysis on these results, we can conclude that the region in which $μ>2$ is not ruled out by observations. This region of a parameter is relevant because, in the absence of matter, fractional cosmology gives a power-law solution $a(t)= \\left(t/t_0\\right)^{μ-1}$, which is accelerated for $μ>2$. We present a fractional origin model that leads to an accelerated state without appealing to $Λ$ or Dark Energy.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16409v1"
    ],
    "publication_venue": "51 pages, 10 figures"
}