{
    "arxiv_id": "2303.17415",
    "paper_title": "A huge-amplitude white-light superflare on a L0 brown dwarf discovered by GWAC survey",
    "authors": [
        "Li-Ping Xin",
        "Hua-li Li",
        "Jing Wang",
        "Xu-Hui Han",
        "Hong-Bo Cai",
        "Xin-Bo Huang",
        "Jia-Xin Cao",
        "Yi-Nan Zhu",
        "Xiang-Gao Wang",
        "Guang-Wei Li",
        "Bin Ren",
        "Cheng Gao",
        "Da Song",
        "Lei Huang",
        "Xiao-Meng Lu",
        "Jian-Ying Bai",
        "Yu-Lei Qiu",
        "En-Wei Liang",
        "Zi-Gao Dai",
        "Xiang-Yu Wang",
        "Chao Wu",
        "Jing-Song Deng",
        "Yuan-Gui Yang",
        "Jian-Yan Wei"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-04-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
    ],
    "abstract": "White-light superflares from ultra cool stars are thought to be resulted from magnetic reconnection, but the magnetic dynamics in a fully convective star is not clear yet. In this paper, we report a stellar superflare detected with the Ground Wide Angle Camera (GWAC), along with rapid follow-ups with the F60A, Xinglong 2.16m and LCOGT telescopes. The effective temperature of the counterpart is estimated to be $2200\\pm50$K by the BT-Settl model, corresponding to a spectral type of L0. The $R-$band light curve can be modeled as a sum of three exponential decay components, where the impulsive component contributes a fraction of 23\\% of the total energy, while the gradual and the shallower decay phases emit 42\\% and 35\\% of the total energy, respectively. The strong and variable Balmer narrow emission lines indicate the large amplitude flare is resulted from magnetic activity. The bolometric energy released is about $6.4\\times10^{33}$ ergs, equivalent to an energy release in a duration of 143.7 hours at its quiescent level. The amplitude of $ΔR=-8.6 $mag ( or $ΔV=-11.2$ mag), placing it one of the highest amplitudes of any ultra cool star recorded with excellent temporal resolution. We argue that a stellar flare with such rapidly decaying and huge amplitude at distances greater than 1 kpc may be false positive in searching for counterparts of catastrophic events such as gravitational wave events or gamma-ray bursts, which are valuable in time-domain astronomy and should be given more attention.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17415v1"
    ],
    "publication_venue": "9 pages, 5 figures, 1 table, MNRAS accepted",
    "doi": "10.1093/mnras/stad960"
}