{
    "arxiv_id": "2303.11609",
    "paper_title": "Convergence analysis of a positivity-preserving numerical scheme for the Cahn-Hilliard-Stokes system with Flory-Huggins energy potential",
    "authors": [
        "Yunzhuo Guo",
        "Cheng Wang",
        "Steven M. Wise",
        "Zhengru Zhang"
    ],
    "submission_date": "2023-03-21",
    "revised_dates": [
        "2023-03-22"
    ],
    "latest_version": 1,
    "categories": [
        "math.NA"
    ],
    "abstract": "A finite difference numerical scheme is proposed and analyzed for the Cahn-Hilliard-Stokes system with Flory-Huggins energy functional. A convex splitting is applied to the chemical potential, which in turns leads to the implicit treatment for the singular logarithmic terms and the surface diffusion term, and an explicit update for the expansive concave term. The convective term for the phase variable, as well as the coupled term in the Stokes equation, are approximated in a semi-implicit manner. In the spatial discretization, the marker and cell (MAC) difference method is applied, which evaluates the velocity components, the pressure and the phase variable at different cell locations. Such an approach ensures the divergence-free feature of the discrete velocity, and this property plays an important role in the analysis. The positivity-preserving property and the unique solvability of the proposed numerical scheme are theoretically justified, utilizing the singular nature of the logarithmic term as the phase variable approaches the singular limit values. An unconditional energy stability analysis is standard, as an outcome of the convex-concave decomposition technique. A convergence analysis with accompanying error estimate is provided for the proposed numerical scheme. In particular, a higher order consistency analysis, accomplished by supplementary functions, is performed to ensure the separation properties of numerical solution. In turn, using the approach of rough and refined error (RRE) estimates, we are able to derive an optimal rate convergence. To conclude, several numerical experiments are presented to validate the theoretical analysis.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11609v1"
    ],
    "publication_venue": "This article has been submitted to Mathematics of Computation"
}