{
    "arxiv_id": "2303.12702",
    "paper_title": "Automatic Identification of Crystal Structures and Interfaces via Artificial-Intelligence-based Electron Microscopy",
    "authors": [
        "Andreas Leitherer",
        "Byung Chul Yeo",
        "Christian H. Liebscher",
        "Luca M. Ghiringhelli"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 2,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Characterizing crystal structures and interfaces down to the atomic level is an important step for designing novel materials. Modern electron microscopy routinely achieves atomic resolution and is capable to resolve complex arrangements of atoms with picometer precision. Here, we present AI-STEM, an automatic, artificial-intelligence based method, for accurately identifying key characteristics from atomic-resolution scanning transmission electron microscopy (STEM) images of polycrystalline materials. The method is based on a Bayesian convolutional neural network (BNN) that is trained only on simulated images. Excellent performance is achieved for automatically identifying crystal structure, lattice orientation, and location of interface regions in synthetic and experimental images. The model yields classifications and uncertainty estimates through which both bulk and interface regions are identified. Notably, no explicit information on structural patterns at the interfaces is provided during training. This work combines principles from probabilistic modeling, deep learning, and information theory, enabling automatic analysis of experimental, atomic-resolution images.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12702v1",
        "http://arxiv.org/pdf/2303.12702v2"
    ],
    "publication_venue": "Code (https://github.com/AndreasLeitherer/ai4stem) and data (https://doi.org/10.5281/zenodo.7756516) are available for public use. The manuscript contains 19 pages (14 pages main text, 5 supplementary material), including 5 main figures and 4 supplementary figures"
}