{
    "arxiv_id": "2303.08046",
    "paper_title": "Ultra-High-Resolution Detector Simulation with Intra-Event Aware GAN and Self-Supervised Relational Reasoning",
    "authors": [
        "Baran Hashemi",
        "Nikolai Hartmann",
        "Sahand Sharifzadeh",
        "James Kahn",
        "Thomas Kuhr"
    ],
    "submission_date": "2023-03-07",
    "revised_dates": [
        "2024-04-25"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ins-det",
        "cs.AI",
        "cs.CV",
        "hep-ph",
        "physics.data-an"
    ],
    "abstract": "Simulating high-resolution detector responses is a storage-costly and computationally intensive process that has long been challenging in particle physics. Despite the ability of deep generative models to make this process more cost-efficient, ultra-high-resolution detector simulation still proves to be difficult as it contains correlated and fine-grained mutual information within an event. To overcome these limitations, we propose Intra-Event Aware GAN (IEA-GAN), a novel fusion of Self-Supervised Learning and Generative Adversarial Networks. IEA-GAN presents a Relational Reasoning Module that approximates the concept of an ''event'' in detector simulation, allowing for the generation of correlated layer-dependent contextualized images for high-resolution detector responses with a proper relational inductive bias. IEA-GAN also introduces a new intra-event aware loss and a Uniformity loss, resulting in significant enhancements to image fidelity and diversity. We demonstrate IEA-GAN's application in generating sensor-dependent images for the high-granularity Pixel Vertex Detector (PXD), with more than 7.5M information channels and a non-trivial geometry, at the Belle II Experiment. Applications of this work include controllable simulation-based inference and event generation, high-granularity detector simulation such as at the HL-LHC (High Luminosity LHC), and fine-grained density estimation and sampling. To the best of our knowledge, IEA-GAN is the first algorithm for faithful ultra-high-resolution detector simulation with event-based reasoning.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08046v1"
    ],
    "publication_venue": null
}