{
    "arxiv_id": "2303.12871",
    "paper_title": "Redshift determination of blazars for the Cherenkov Telescope Array",
    "authors": [
        "Eli Kasai",
        "Paolo Goldoni",
        "Santiago Pita",
        "Catherine Boisson",
        "Michael Backes",
        "Garret Cotter",
        "Filippo D'Ammando",
        "Brian van Soelen"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-03-24"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE"
    ],
    "abstract": "Blazars are the most numerous type of observed high-energy gamma-ray emitters. However, their emission mechanisms and population properties are still not well-understood. Crucial to this understanding are their cosmological redshifts, which are often not easy to obtain. This presents a great challenge to the next-generation ground-based observatory for very-high-energy gamma rays, the Cherenkov Telescope Array (CTA), which aims to detect a large number of distant blazars to study their intrinsic emission properties and to place tight constraints on the extragalactic background light density, amongst others. The successful investigation of these subjects needs a precise redshift determination. Motivated by these challenges, the CTA redshift task force initiated more than 3 years ago a spectroscopic observing program using some of the largest optical and infrared telescopes to measure the redshifts of a large fraction of blazars that are likely to be detected with CTA. In this proceedings, we give an overview of the CTA redshift task force, discuss some of the difficulties associated with measuring the redshifts of blazars and present our sample selection and observing strategies. We end the proceedings with reporting selected results from the program, the on-going collaborative efforts and our plans for the future.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12871v1"
    ],
    "publication_venue": "4 pages, 2 figures, IAU Symposium 375"
}