{
    "arxiv_id": "2303.13343",
    "paper_title": "Observation of the dead cone effect in charm and bottom quark jets and its QCD explanation",
    "authors": [
        "Stefan Kluth",
        "Wolfgang Ochs",
        "Redamy Perez Ramos"
    ],
    "submission_date": "2023-03-23",
    "revised_dates": [
        "2023-06-14"
    ],
    "latest_version": 1,
    "categories": [
        "hep-ph"
    ],
    "abstract": "The production of a heavy quark is accompanied by gluon bremsstrahlung which is suppressed at small angles $Θ\\lesssim M_Q/E$ for mass $M_Q$ and high energy $E$ according to perturbative Quantum Chromo Dynamics (QCD) (``dead cone effect''). As particles at small angles typically have large momenta, the heavy quark mass also causes a suppression of high momentum particles. In this paper, we studied this effect in c- and b-quark events using data from Z boson decays in $e^+e^-$ annihilation. The heavy quark fragmentation function for charged particles is reconstructed in the momentum fraction variable $x$ or $ξ=\\ln(1/x)$ by removing the decays of the heavy quark hadrons. Indeed, we find an increasing suppression of particles with rising $x$ down to a fraction of $\\lesssim 1/10$ for particles with $x\\gtrsim0.2$ in b-quark and $x\\gtrsim0.4$ in c-quark jets in comparison to light quark fragmentation. The sensitivity to the dead cone effect in the present momentum analysis is considerably increased in comparison to the recently presented angular analysis. This amount of suppression and the differences between c- and b-quark fragmentation are in good quantitative agreement with the expectations based on perturbative QCD within the Modified Leading Logarithmic Approximation (MLLA) in the central kinematic region. The data also support a two parameter description in the MLLA of these phenomena (``Limiting Spectrum''). The sensitivity of these measurements to the heavy quark mass is investigated.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.13343v1"
    ],
    "publication_venue": "16 pages, 8 figures",
    "doi": "10.1103/PhysRevD.107.094039"
}