{
    "arxiv_id": "2303.11154",
    "paper_title": "LeMMINGs. V. Nuclear activity and bulge properties: a detailed multi-component decomposition of $e$-MERLIN Palomar galaxies with $HST$",
    "authors": [
        "B. T. Dullo",
        "J. H. Knapen",
        "R. J. Beswick",
        "R. D. Baldi",
        "D. R. A. Williams",
        "I. M. McHardy",
        "J. S. Gallagher",
        "S. Aalto",
        "M. K. Argo",
        "A. Gil de Paz",
        "H. -R. Klöckner",
        "J. M. Marcaide",
        "C. G. Mundell",
        "I. M. Mutie",
        "P. Saikia"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-07-12"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
    ],
    "abstract": "[Abridged] We use high-resolution $HST$ imaging and $e$-MERLIN 1.5-GHz observations of galaxy cores from the LeMMINGs survey to investigate the relation between optical structural properties and nuclear radio emission for a large sample of galaxies. We perform accurate, multi-component decompositions of new surface brightness profiles extracted from $HST$ images for 163 LeMMINGs galaxies and fit up to six galaxy components (e.g., bulges, discs, AGN, bars, rings, spiral arms, and nuclear star clusters) simultaneously with Sérsic and/or core-Sérsic models. By adding such decomposition data for 10 LeMMINGs galaxies from our past work, the final sample of 173 nearby galaxies (102 Ss, 42 S0s, 23 Es plus 6 Irr) with bulge stellar mass (typically) M_*, bulge ~ 10^6-10^12.5 M_sun, encompasses all optical spectral classes (LINER, Seyfert, ALG and H II). We show that the bulge mass can be significantly overestimated in many galaxies when components such as bars, rings and spirals are not included in the fits. We additionally implement a Monte Carlo method to determine errors on bulge, disc and other fitted structural parameters. Moving (in the opposite direction) across the Hubble sequence, i.e., from the irregular to elliptical galaxies, we confirm that bulges become larger, more prominent and round. Such bulge dominance is associated with a brighter radio core luminosity. We also find that the radio detection fraction increases with bulge mass. At M_*,bulge > 10^11 M_sun, the radio detection fraction is 77%, declining to 24% for M_bulge < 10^10 M_sun. Furthermore, we observe core-Sérsic bulges tend to be systematically round and to possess high radio core luminosities and boxy-distorted or pure elliptical isophotes.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11154v1"
    ],
    "publication_venue": "102 pages, 26 figures, 10 tables, accepted for publication in A&A",
    "doi": "10.1051/0004-6361/202345913"
}