{
    "arxiv_id": "2303.16255",
    "paper_title": "[Transitional strength under plasma] Precise estimations of astrophysically relevant electromagnetic transitions of Ar$^{7+}$, Kr$^{7+}$, Xe$^{7+}$, and Rn$^{7+}$ under plasma atmosphere",
    "authors": [
        "Swapan Biswas",
        "Anal Bhowmik",
        "Arghya Das",
        "Radha Raman Pal",
        "Sonjoy Majumder"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-30"
    ],
    "latest_version": 1,
    "categories": [
        "physics.atom-ph"
    ],
    "abstract": "The growing interest in atomic structures of moderately-stripped alkali-like ions in diagnostic study and modeling of astrophysical and laboratory plasma makes an accurate many-body study of atomic properties inevitable. This work presents transition line parameters in the absence or presence of plasma atmosphere for astrophysically important candidates, Ar$^{7+}$, Kr$^{7+}$, Xe$^{7+}$, and Rn$^{7+}$. We employ relativistic coupled-cluster (RCC) theory, a well-known correlation exhaustive method. In the case of a plasma environment, we use Debye Model. Our calculations agree with experiments available in the literature for ionization potentials, transition strengths of allowed and forbidden selections, and lifetimes of several low-lying states. The unit ratios of length and velocity forms of transition matrix elements are the critical estimation of the accuracy of the transition data presented here, especially for a few presented first time in the literature. We do compare our findings with the available recent theoretical results. Our reported data can be helpful to the astronomer in estimating the density of the plasma environment around the astronomical objects or in the discovery of observational spectra corrected by that environment. The present results should be advantageous in the modeling and diagnostics laboratory plasma, whereas the calculated ionisation potential depression parameters reveal important characteristics of atomic structure.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16255v1"
    ],
    "publication_venue": null
}