{
    "arxiv_id": "2303.08540",
    "paper_title": "Automatic scenario generation for efficient solution of robust optimal control problems",
    "authors": [
        "Marta Zagorowska",
        "Paola Falugi",
        "Edward O'Dwyer",
        "Eric C. Kerrigan"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-06-14"
    ],
    "latest_version": 2,
    "categories": [
        "math.OC",
        "eess.SY"
    ],
    "abstract": "Existing methods for nonlinear robust control often use scenario-based approaches to formulate the control problem as large nonlinear optimization problems. The optimization problems are challenging to solve due to their size, especially if the control problems include time-varying uncertainty. This paper draws from local reduction methods used in semi-infinite optimization to solve robust optimal control problems with parametric and time-varying uncertainty. By iteratively adding interim worst-case scenarios to the problem, methods based on local reduction provide a way to manage the total number of scenarios. We show that the local reduction method for optimal control problems consists of solving a series of simplified optimal control problems to find worst-case constraint violations. In particular, we present examples where local reduction methods find worst-case scenarios that are not on the boundary of the uncertainty set. We also provide bounds on the error if local solvers are used. The proposed approach is illustrated with two case studies with parametric and additive time-varying uncertainty. In the first case study, the number of scenarios obtained from local reduction is 101, smaller than in the case when all $2^{14+3\\times192}$ extreme scenarios are considered. In the second case study, the number of scenarios obtained from the local reduction is two compared to 512 extreme scenarios. Our approach was able to satisfy the constraints both for parametric uncertainty and time-varying disturbances, whereas approaches from literature either violated the constraints or became computationally expensive.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08540v1",
        "http://arxiv.org/pdf/2303.08540v2"
    ],
    "publication_venue": "arXiv admin note: substantial text overlap with arXiv:2204.14145 (IFAC conference submission)"
}