{
    "arxiv_id": "2303.09473",
    "paper_title": "Molecular gas in super spiral galaxies",
    "authors": [
        "Ute Lisenfeld",
        "Patrick M. Ogle",
        "Philip N. Appleton",
        "Thomas H. Jarrett",
        "Blanca M. Moncada-Cuadri"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA"
    ],
    "abstract": "At the highest stellar masses (log(\\mstar) $\\gtrsim$ 11.5 \\msun), only a small fraction of galaxies are disk-like and actively star-forming objects. These so-called `super spirals' are ideal objects to better understand how galaxy evolution proceeds and to extend our knowledge about the relation between stars and gas to a higher stellar mass regime. We present new CO(1-0) data for a sample of 46 super spirals and for 18 slightly lower-mass (log(\\mstar) $>$ 11.0 \\msun ) galaxies with broad HI lines -- HI fast-rotators (HI-FRs). We analyze their molecular gas mass, derived from CO, in relation to their star formation rate (SFR) and stellar mass, and compare the results to values and scaling relations derived from lower-mass galaxies. We confirm that super spirals follow the same star-forming main sequence (SFMS) as lower-mass galaxies. We find that they possess abundant molecular gas, which lies above the extrapolation of the scaling relation with stellar mass derived from lower-mass galaxies, but within the relation between \\mmol/\\mstar and the distance to the SFMS. The molecular gas depletion time, \\taudep = \\mmol/SFR, is higher than for lower-mass galaxies on the SFMS (\\taudep = 9.30 $\\pm$ 0.03, compared to \\taudep = 9.00 $\\pm$ 0.02 for the comparison sample) and seems to continue an increasing trend with stellar mass. HI-FR galaxies have an atomic-to-molecular gas mass ratio that is in agreement with that of lower-mass galaxies, indicating that the conversion from the atomic to molecular gas proceeds in a similar way. We conclude that the availability of molecular gas is a crucial factor to enable star formation to continue and that, if gas is present, quenching is not a necessary destiny for high-mass galaxies. The difference in gas depletion time suggests that the properties of the molecular gas at high stellar masses are less favorable for star formation.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09473v1"
    ],
    "publication_venue": "28 pages, accepted for publication in Astronomy & Astrophysics",
    "doi": "10.1051/0004-6361/202245675"
}