{
    "arxiv_id": "2303.15141",
    "paper_title": "Magnetic properties of cobalt ultrathin film structures controlled by buffer layer roughness",
    "authors": [
        "Carlos H. Verbeno",
        "Jakub Zázvorka",
        "Lukáš Nowak",
        "Martin Veis"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-08-21"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mtrl-sci"
    ],
    "abstract": "Growth optimization of multilayers is a topic of interest due to their unique physical properties. Systems containing magnetic materials, such as platinum-cobalt, have been studied because of their potential for technological applications, e.g. spintronics, magnetic storage and magnetic sensors. Since the magnetic properties of thin layers are strongly related to the growth parameters, the fine tuning of these parameters is necessary to produce multilayers with specific properties required in various applications. Here, an efficient approach to tune the coercive field of Co ultrathin films in the multilayer by varying the underlayer thickness is demonstrated. Using magnetron sputtering, we prepared multilayer systems of Au(x)/Pt(5nm)/Co(0.7nm)/Au(5nm) with various thicknesses of Au underlayer. The surface morphology of Au(x)/Pt(5nm) stack on which Co layer was deposited was studied by atomic force microscopy. We show the possibility to control the interfacial roughness by changing the Au underlayer thickness due to its island-like growth mechanism (Volmer-Weber mode). As the nominal thickness of Au increases, the islands grow in larger lateral size, resulting in a higher overall roughness of the layer surface. Magnetization measurements indicate a direct influence of the underlayer roughness on the coercivity of the multilayers by promoting additional magnetic anisotropy. With thickness of the Au layer up to 20 nm, we can change the coercive field in the range from ~200 Oe to ~1100 Oe, while remaining a nearly constant saturation magnetization. The use of Cu replacing Au underlayer in the same multilayers was also investigated, demonstrating the possibility of coercivity adjustment using different materials. The results are important for applications where the magnetic properties of multilayer structures based on Co thin films could be adjusted via buffer layer roughness engineering.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15141v1"
    ],
    "publication_venue": "15 pages, 8 figures",
    "doi": "10.1016/j.jmmm.2023.171124"
}