{
    "arxiv_id": "2303.11241",
    "paper_title": "Constraining atmospheric parameters and surface magnetic fields with $\\texttt{ZeeTurbo}$: an application to SPIRou spectra",
    "authors": [
        "P. I. Cristofari",
        "J. -F. Donati",
        "C. P. Folsom",
        "T. Masseron",
        "P. Fouqué",
        "C. Moutou",
        "E. Artigau",
        "A. Carmona",
        "P. Petit",
        "X. Delfosse",
        "E. Martioli"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
    ],
    "abstract": "We report first results on a method aimed at simultaneously characterising atmospheric parameters and magnetic properties of M dwarfs from high-resolution nIR spectra recorded with SPIRou in the framework of the SPIRou Legacy Survey. Our analysis relies on fitting synthetic spectra computed from MARCS model atmospheres to selected spectral lines, both sensitive and insensitive to magnetic fields. We introduce a new code, $\\texttt{ZeeTurbo}$, obtained by including the Zeeman effect and polarised radiative transfer capabilities to $\\texttt{Turbospectrum}$. We compute a grid of synthetic spectra with $\\texttt{ZeeTurbo}$ for different magnetic field strengths and develop a process to simultaneously constrain $T_{\\rm eff}$, $\\log{g}$, [M/H], [$α$/Fe] and the average surface magnetic flux. In this paper, we present our approach and assess its performance using simulations, before applying it to six targets observed in the context of the SPIRou Legacy Survey (SLS), namely AU Mic, EV Lac, AD Leo, CN Leo, PM J18482+0741, and DS Leo. Our method allows us to retrieve atmospheric parameters in good agreement with the literature, and simultaneously yields surface magnetic fluxes in the range 2-4 kG with a typical precision of 0.05 kG, in agreement with literature estimates, and consistent with the saturated dynamo regime in which most of these stars are.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11241v1"
    ],
    "publication_venue": "17 pages plus supplementary material. Accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad865"
}