{
    "arxiv_id": "2303.09340",
    "paper_title": "Improving Automated Hemorrhage Detection in Sparse-view Computed Tomography via Deep Convolutional Neural Network based Artifact Reduction",
    "authors": [
        "Johannes Thalhammer",
        "Manuel Schultheiss",
        "Tina Dorosti",
        "Tobias Lasser",
        "Franz Pfeiffer",
        "Daniela Pfeiffer",
        "Florian Schaff"
    ],
    "submission_date": "2023-03-16",
    "revised_dates": [
        "2023-07-25"
    ],
    "latest_version": 3,
    "categories": [
        "eess.IV",
        "cs.CV",
        "cs.LG",
        "physics.med-ph"
    ],
    "abstract": "Purpose: Sparse-view computed tomography (CT) is an effective way to reduce dose by lowering the total number of views acquired, albeit at the expense of image quality, which, in turn, can impact the ability to detect diseases. We explore deep learning-based artifact reduction in sparse-view cranial CT scans and its impact on automated hemorrhage detection. Methods: We trained a U-Net for artefact reduction on simulated sparse-view cranial CT scans from 3000 patients obtained from a public dataset and reconstructed with varying levels of sub-sampling. Additionally, we trained a convolutional neural network on fully sampled CT data from 17,545 patients for automated hemorrhage detection. We evaluated the classification performance using the area under the receiver operator characteristic curves (AUC-ROCs) with corresponding 95% confidence intervals (CIs) and the DeLong test, along with confusion matrices. The performance of the U-Net was compared to an analytical approach based on total variation (TV). Results: The U-Net performed superior compared to unprocessed and TV-processed images with respect to image quality and automated hemorrhage diagnosis. With U-Net post-processing, the number of views can be reduced from 4096 (AUC-ROC: 0.974; 95% CI: 0.972-0.976) views to 512 views (0.973; 0.971-0.975) with minimal decrease in hemorrhage detection (P<.001) and to 256 views (0.967; 0.964-0.969) with a slight performance decrease (P<.001). Conclusion: The results suggest that U-Net based artifact reduction substantially enhances automated hemorrhage detection in sparse-view cranial CTs. Our findings highlight that appropriate post-processing is crucial for optimal image quality and diagnostic accuracy while minimizing radiation dose.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.09340v1",
        "http://arxiv.org/pdf/2303.09340v2",
        "http://arxiv.org/pdf/2303.09340v3"
    ],
    "publication_venue": "11 pages, 6 figures, 1 table"
}