{
    "arxiv_id": "2303.16554",
    "paper_title": "Cyber Security aboard Micro Aerial Vehicles: An OpenTitan-based Visual Communication Use Case",
    "authors": [
        "Maicol Ciani",
        "Stefano Bonato",
        "Rafail Psiakis",
        "Angelo Garofalo",
        "Luca Valente",
        "Suresh Sugumar",
        "Alessandro Giusti",
        "Davide Rossi",
        "Daniele Palossi"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2024-06-18"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CR",
        "eess.SY"
    ],
    "abstract": "Autonomous Micro Aerial Vehicles (MAVs), with a form factor of 10cm in diameter, are an emerging technology thanks to the broad applicability enabled by their onboard intelligence. However, these platforms are strongly limited in the onboard power envelope for processing, i.e., less than a few hundred mW, which confines the onboard processors to the class of simple microcontroller units (MCUs). These MCUs lack advanced security features opening the way to a wide range of cyber security vulnerabilities, from the communication between agents of the same fleet to the onboard execution of malicious code. This work presents an open source System on Chip (SoC) design that integrates a 64 bit Linux capable host processor accelerated by an 8 core 32 bit parallel programmable accelerator. The heterogeneous system architecture is coupled with a security enclave based on an open source OpenTitan root of trust. To demonstrate our design, we propose a use case where OpenTitan detects a security breach on the SoC aboard the MAV and drives its exclusive GPIOs to start a LED blinking routine. This procedure embodies an unconventional visual communication between two palm sized MAVs: the receiver MAV classifies the LED state of the sender (on or off) with an onboard convolutional neural network running on the parallel accelerator. Then, it reconstructs a high-level message in 1.3s, 2.3 times faster than current commercial solutions.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16554v1"
    ],
    "publication_venue": null,
    "doi": "10.1109/ISCAS46773.2023.10181732"
}