{
    "arxiv_id": "2303.12484",
    "paper_title": "Label-Efficient Deep Learning in Medical Image Analysis: Challenges and Future Directions",
    "authors": [
        "Cheng Jin",
        "Zhengrui Guo",
        "Yi Lin",
        "Luyang Luo",
        "Hao Chen"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2023-12-21"
    ],
    "latest_version": 4,
    "categories": [
        "cs.CV",
        "cs.AI"
    ],
    "abstract": "Deep learning has seen rapid growth in recent years and achieved state-of-the-art performance in a wide range of applications. However, training models typically requires expensive and time-consuming collection of large quantities of labeled data. This is particularly true within the scope of medical imaging analysis (MIA), where data are limited and labels are expensive to be acquired. Thus, label-efficient deep learning methods are developed to make comprehensive use of the labeled data as well as the abundance of unlabeled and weak-labeled data. In this survey, we extensively investigated over 300 recent papers to provide a comprehensive overview of recent progress on label-efficient learning strategies in MIA. We first present the background of label-efficient learning and categorize the approaches into different schemes. Next, we examine the current state-of-the-art methods in detail through each scheme. Specifically, we provide an in-depth investigation, covering not only canonical semi-supervised, self-supervised, and multi-instance learning schemes, but also recently emerged active and annotation-efficient learning strategies. Moreover, as a comprehensive contribution to the field, this survey not only elucidates the commonalities and unique features of the surveyed methods but also presents a detailed analysis of the current challenges in the field and suggests potential avenues for future research.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12484v1",
        "http://arxiv.org/pdf/2303.12484v2",
        "http://arxiv.org/pdf/2303.12484v3",
        "http://arxiv.org/pdf/2303.12484v4"
    ],
    "publication_venue": "Update Few-shot Methods"
}