{
    "arxiv_id": "2303.07993",
    "paper_title": "The unusual distribution of spin-triplet supercurrents in disk-shaped Josephson junctions",
    "authors": [
        "Remko Fermin",
        "Junxiang Yao",
        "Kaveh Lahabi",
        "Jan Aarts"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-05-03"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.supr-con",
        "cond-mat.mes-hall",
        "cond-mat.mtrl-sci"
    ],
    "abstract": "The phenomenon of s-wave spin triplet Cooper pairs induced in ferromagnetic metals has been researched now for more than a decade, and its main aspects are well understood. Crucial in converting s-wave singlet pairs in the superconductor to s-wave triplets in the ferromagnet is the engineering of well-defined magnetic inhomogeneity (the 'generator') at the interface with the superconductor. Vertical layer stacks are typically used as such, where two separate thin ferromagnetic layers with homogeneous but non-collinear magnetizations, provide the inhomogeneity. Alternatively, magnetic textures, like ferromagnetic domain walls and vortices, are possible triplet generators, although they are far less studied. In this paper we review our experiments on lateral disk-shaped Josephson junctions where a ferromagnetic bottom layer provides a weak link with a vortex magnetization imposed by the shape of the disk. We present three different junction configurations, exhibiting their own generator mechanism. In the first, we utilize the non-collinearity with a second ferromagnetic layer to produce the triplet correlations. The second configuration consists of only the bottom ferromagnet and the superconducting contacts; it relies on the vortex magnetization itself to generate the spin-polarized supercurrents. In the third case we exploit an intrinsic generator by combining a conventional superconductor (NbTi) and a half-metallic ferromagnetic oxide (La$_{0.7}$Sr$_{0.3}$MnO$_3$). We find strong supercurrents in all cases. A particularly interesting finding is that the supercurrents are strongly confined at the rims of the device, independent of the generating mechanism, but directly related to their triplet nature. What causes these rim currents remains an open question.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.07993v1"
    ],
    "publication_venue": null,
    "doi": "10.1088/1361-6668/acc982"
}