{
    "arxiv_id": "2303.11338",
    "paper_title": "Towards Domain Generalization for ECG and EEG Classification: Algorithms and Benchmarks",
    "authors": [
        "Aristotelis Ballas",
        "Christos Diou"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-05-10"
    ],
    "latest_version": 2,
    "categories": [
        "eess.SP",
        "cs.LG"
    ],
    "abstract": "Despite their immense success in numerous fields, machine and deep learning systems have not yet been able to firmly establish themselves in mission-critical applications in healthcare. One of the main reasons lies in the fact that when models are presented with previously unseen, Out-of-Distribution samples, their performance deteriorates significantly. This is known as the Domain Generalization (DG) problem. Our objective in this work is to propose a benchmark for evaluating DG algorithms, in addition to introducing a novel architecture for tackling DG in biosignal classification. In this paper, we describe the Domain Generalization problem for biosignals, focusing on electrocardiograms (ECG) and electroencephalograms (EEG) and propose and implement an open-source biosignal DG evaluation benchmark. Furthermore, we adapt state-of-the-art DG algorithms from computer vision to the problem of 1D biosignal classification and evaluate their effectiveness. Finally, we also introduce a novel neural network architecture that leverages multi-layer representations for improved model generalizability. By implementing the above DG setup we are able to experimentally demonstrate the presence of the DG problem in ECG and EEG datasets. In addition, our proposed model demonstrates improved effectiveness compared to the baseline algorithms, exceeding the state-of-the-art in both datasets. Recognizing the significance of the distribution shift present in biosignal datasets, the presented benchmark aims at urging further research into the field of biomedical DG by simplifying the evaluation process of proposed algorithms. To our knowledge, this is the first attempt at developing an open-source framework for evaluating ECG and EEG DG algorithms.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.11338v1",
        "http://arxiv.org/pdf/2303.11338v2"
    ],
    "publication_venue": "Preprint of under review manuscript at IEEE Transactions on Emerging Topics in Computational Intelligence"
}