{
    "arxiv_id": "2303.12342",
    "paper_title": "One-Step Detection Paradigm for Hyperspectral Anomaly Detection via Spectral Deviation Relationship Learning",
    "authors": [
        "Jingtao Li",
        "Xinyu Wang",
        "Shaoyu Wang",
        "Hengwei Zhao",
        "Liangpei Zhang",
        "Yanfei Zhong"
    ],
    "submission_date": "2023-03-22",
    "revised_dates": [
        "2024-04-22"
    ],
    "latest_version": 1,
    "categories": [
        "cs.CV",
        "cs.AI"
    ],
    "abstract": "Hyperspectral anomaly detection (HAD) involves identifying the targets that deviate spectrally from their surroundings, without prior knowledge. Recently, deep learning based methods have become the mainstream HAD methods, due to their powerful spatial-spectral feature extraction ability. However, the current deep detection models are optimized to complete a proxy task (two-step paradigm), such as background reconstruction or generation, rather than achieving anomaly detection directly. This leads to suboptimal results and poor transferability, which means that the deep model is trained and tested on the same image. In this paper, an unsupervised transferred direct detection (TDD) model is proposed, which is optimized directly for the anomaly detection task (one-step paradigm) and has transferability. Specially, the TDD model is optimized to identify the spectral deviation relationship according to the anomaly definition. Compared to learning the specific background distribution as most models do, the spectral deviation relationship is universal for different images and guarantees the model transferability. To train the TDD model in an unsupervised manner, an anomaly sample simulation strategy is proposed to generate numerous pairs of anomaly samples. Furthermore, a global self-attention module and a local self-attention module are designed to help the model focus on the \"spectrally deviating\" relationship. The TDD model was validated on four public HAD datasets. The results show that the proposed TDD model can successfully overcome the limitation of traditional model training and testing on a single image, and the model has a powerful detection ability and excellent transferability.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.12342v1"
    ],
    "publication_venue": null
}