{
    "arxiv_id": "2303.10827",
    "paper_title": "Normalization of the vacuum and the ultraviolet completion of Einstein gravity",
    "authors": [
        "Philip D. Mannheim"
    ],
    "submission_date": "2023-03-20",
    "revised_dates": [
        "2023-03-21"
    ],
    "latest_version": 1,
    "categories": [
        "hep-th"
    ],
    "abstract": "Second-order-derivative plus fourth-order-derivative gravity is the ultraviolet completion of second-order-derivative quantum Einstein gravity. While it achieves renormalizability through states of negative Dirac norm, the unitarity violation that this would entail can be postponed to Planck energies. As we show in this paper the theory has a different problem, one that occurs at all energy scales, namely that the Dirac norm of the vacuum of the theory is not finite. To establish this we present a procedure for determining the norm of the vacuum in any quantum field theory. With the Dirac norm of the vacuum of the second-order-derivative plus fourth-order-derivative theory not being finite, the Feynman rules that are used to establish renormalizability are not valid, as is the assumption that the theory can be used as an effective theory at energies well below the Planck scale. This lack of finiteness is also manifested in the fact that the Minkowski path integral for the theory is divergent. Because the vacuum Dirac norm is not finite, the Hamiltonian of the theory is not Hermitian. However, it turns out to be $PT$ symmetric. And when one continues the theory into the complex plane and uses the $PT$ symmetry inner product, viz. the overlap of the left-eigenstate of the Hamiltonian with its right-eigenstate, one then finds that for the vacuum this norm is both finite and positive, the Feynman rules now are valid, the Minkowski path integral now is well behaved, and the theory now can serve as a low energy effective theory. Consequently, the theory can now be offered as a fully consistent, unitary and renormalizable theory of quantum gravity.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10827v1"
    ],
    "publication_venue": "11 pages. Essay written for the Gravity Research Foundation 2023 Awards for Essays on Gravitation. arXiv admin note: substantial text overlap with arXiv:2301.13029"
}