{
    "arxiv_id": "2303.10337",
    "paper_title": "Non-Gaussian assembly bias from a semi-analytic galaxy formation model",
    "authors": [
        "M. Marinucci",
        "V. Desjacques",
        "A. Benson"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-07-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
    ],
    "abstract": "We use $z=1$ mock galaxy catalogues produced with the semi-analytic code GALACTICUS to study the dependence of the non-Gaussian bias parameter $b_φ$ on the mass assembly history of the host halos. We generate large sets of merger trees and measure the non-Gaussian assembly bias $Δb_φ$ for galaxies selected by color magnitude and emission line luminosities. For galaxies selected by $g-r$ color, we find a large assembly bias consistent with the analysis of Barreira et al. (2020) based on hydro-dynamical simulations of galaxy formation. This effect arises from the fact that a larger value of the normalization amplitude $σ_8$ implies a faster mass assembly (at fixed halo mass) and, therefore, older and redder galaxies. On the contrary, for galaxies selected by their H$α$ luminosity, we do not detect a significant assembly bias, at least at $z=1$ and in the halo mass range $3\\times10^{10} < M < 10^{12}\\ M_\\odot$ considered here. This is presumably due to the fact that emission line strengths are mainly sensitive to the instantaneous star formation rate, which appears to depend weakly on $σ_8$ at $z=1$. This indicates that the non-Gaussian assembly bias should be less of a concern for future emission line galaxy surveys. We also investigate, for the first time, the sensitivity of the non-Gaussian assembly bias to a change in the parameters of the galaxy formation model that control the AGN and stellar feedback as well as the star formation rate. When these parameters change within a factor of two from their fiducial value, they induce variations up to order unity in the measured $Δb_φ$, but the overall trends with color or luminosity remain the same. However, since these results may be sensitive to the choice of galaxy formation model, it will be prudent to extend this analysis to other semi-analytic models in addition to halo mass and redshift.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10337v1"
    ],
    "publication_venue": "11 pages. Comments are welcome",
    "doi": "10.1093/mnras/stad1884"
}