{
    "arxiv_id": "2303.17019",
    "paper_title": "Scalable Implicit Solvers with Dynamic Mesh Adaptation for a Relativistic Drift-Kinetic Fokker-Planck-Boltzmann Model",
    "authors": [
        "Johann Rudi",
        "Max Heldman",
        "Emil M. Constantinescu",
        "Qi Tang",
        "Xian-Zhu Tang"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "math.NA",
        "physics.comp-ph",
        "physics.plasm-ph"
    ],
    "abstract": "In this work we consider a relativistic drift-kinetic model for runaway electrons along with a Fokker-Planck operator for small-angle Coulomb collisions, a radiation damping operator, and a secondary knock-on (Boltzmann) collision source. We develop a new scalable fully implicit solver utilizing finite volume and conservative finite difference schemes and dynamic mesh adaptivity. A new data management framework in the PETSc library based on the p4est library is developed to enable simulations with dynamic adaptive mesh refinement (AMR), parallel computation, and load balancing. This framework is tested through the development of the runaway electron solver that is able to dynamically capture both bulk Maxwellian at the low-energy region and a runaway tail at the high-energy region. To effectively capture features via the AMR algorithm, a new AMR indicator prediction strategy is proposed that is performed alongside the implicit time evolution of the solution. This strategy is complemented by the introduction of computationally cheap feature-based AMR indicators that are analyzed theoretically. Numerical results quantify the advantages of the prediction strategy in better capturing features compared with nonpredictive strategies; and we demonstrate trade-offs regarding computational costs. The full solver is further verified through several benchmark problems including manufactured solutions and solutions of physics models. We particularly focus on demonstrating the advantages of using implicit time stepping and AMR for runaway electron simulations.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17019v1"
    ],
    "publication_venue": "submitted"
}