{
    "arxiv_id": "2303.10001",
    "paper_title": "Improving Data Transfer Efficiency for AIs in the DareFightingICE using gRPC",
    "authors": [
        "Chollakorn Nimpattanavong",
        "Ibrahim Khan",
        "Thai Van Nguyen",
        "Ruck Thawonmas",
        "Worawat Choensawat",
        "Kingkarn Sookhanaphibarn"
    ],
    "submission_date": "2023-03-11",
    "revised_dates": [
        "2023-03-20"
    ],
    "latest_version": 1,
    "categories": [
        "cs.NI",
        "cs.AI",
        "cs.PF"
    ],
    "abstract": "This paper presents a new communication interface for the DareFightingICE platform, a Java-based fighting game focused on implementing AI for controlling a non-player character. The interface uses an open-source remote procedure call, gRPC to improve the efficiency of data transfer between the game and the AI, reducing the time spent on receiving information from the game server. This is important because the main challenge of implementing AI in a fighting game is the need for the AI to select an action to perform within a short response time. The DareFightingICE platform has been integrated with Py4J, allowing developers to create AIs using Python. However, Py4J is less efficient at handling large amounts of data, resulting in excessive latency. In contrast, gRPC is well-suited for transmitting large amounts of data. To evaluate the effectiveness of the new communication interface, we conducted an experiment comparing the latency of gRPC and Py4J, using a rule-based AI that sends a kick command regardless of the information received from the game server. The experiment results showed not only a 65\\% reduction in latency but also improved stability and eliminated missed frames compared to the current interface.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10001v1"
    ],
    "publication_venue": "The paper is made publically available for prospective participants of the 2023 DareFightingICE Competition. https://tinyurl.com/DareFightingICE/ It has been accepted for presentation at the 2023 8th International Conference on Business and Industrial Research. https://icbir.tni.ac.th/"
}