{
    "arxiv_id": "2303.16070",
    "paper_title": "Understanding the temperatures of H3+ and H2 in diffuse interstellar sightlines",
    "authors": [
        "Jacques Le Bourlot",
        "Evelyne Roueff",
        "Franck Le Petit",
        "Florian Kehrein",
        "Annika Oetjens",
        "Holger Kreckel"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "physics.atom-ph"
    ],
    "abstract": "The triatomic hydrogen ion H3+ is one of the most important species for the gas phase chemistry of the interstellar medium. Observations of H3+ are used to constrain important physical and chemical parameters of interstellar environments. However, the temperatures inferred from the two lowest rotational states of H3+ in diffuse lines of sight - typically the only ones observable - appear consistently lower than the temperatures derived from H2 observations in the same sightlines. All previous attempts at modelling the temperatures of H3+ in the diffuse interstellar medium failed to reproduce the observational results. Here we present new studies, comparing an independent master equation for H3+ level populations to results from the Meudon PDR code for photon dominated regions. We show that the populations of the lowest rotational states of H3+ are strongly affected by the formation reaction and that H3+ ions experience incomplete thermalisation before their destruction by free electrons. Furthermore, we find that for quantitative analysis more than two levels of H3+ have to be considered and that it is crucial to include radiative transitions as well as collisions with H2. Our models of typical diffuse interstellar sightlines show very good agreement with observational data, and thus they may finally resolve the perceived temperature difference attributed to these two fundamental species.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16070v1"
    ],
    "publication_venue": null
}