{
    "arxiv_id": "2303.17332",
    "paper_title": "Clusters of African countries based on the social contacts and associated socioeconomic indicators relevant to the spread of the epidemic",
    "authors": [
        "Evans Kiptoo Korir",
        "Zsolt Vizi"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "math.DS",
        "q-bio.QM"
    ],
    "abstract": "Introduction. It is well known that social contact patterns differ from country to country. This variation coincides with significant socioeconomic heterogeneity that complicates the design of effective non-pharmaceutical interventions. This study examined how socioeconomic heterogeneity in selected African countries might be factored in to explain better social contact mix patterns between countries.\n  Methods. We used a standardized contact matrix for 32 African countries, estimated in [31]. We scaled the matrices using an epidemic model from [34]. We also analyzed aggregated data from the World Bank country website. The data includes 28 variables; social, economic, environmental, institutional, governance, health and well-being, education, gender inequality, and other development-related indicators describing countries. Principal components analysis was used to visualize socioeconomic similarities between countries and identify the indicators for maximum variation. The (2D)2 PC A approach was used to reduce the dimension of the synthetic contact matrices for each country to avoid the dimensionality curse. Agglomerative hierarchical clustering was then used to identify groups of countries with similar social patterns, taking into account the countrys socioeconomic performance.\n  Results. Our model yielded four meaningful clusters, each with a few distinguishing features. Social contacts varied between groups but were generally similar within each set. The countrys socioeconomic performance influenced the clusters.\n  Conclusions. Our results suggest that integrating socioeconomic factors into social contacts can better explain infectious disease transmission dynamics and that similar interventions can be implemented in countries within the cluster.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17332v1"
    ],
    "publication_venue": null
}