{
    "arxiv_id": "2303.16011",
    "paper_title": "Nonlocal Scalar QFT with Fractional Power Self-Interaction",
    "authors": [
        "Daniel V. Skliannyi",
        "Stanislav L. Ogarkov",
        "Nikita A. Ignatyuk"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-04-04"
    ],
    "latest_version": 2,
    "categories": [
        "hep-th",
        "cond-mat.stat-mech"
    ],
    "abstract": "The main aim of this paper is to derive a new perturbation theory that has converging series, which is derived from the nonlocal scalar quantum field theory (QFT) with fractional power potential. We construct the perturbation theory for the generating functional (GF) of complete Green functions (including disconnected functions parts) $\\mathcal{Z}\\left[j\\right]$ as well as for the GF of connected Green functions $\\mathcal{G}\\left[j\\right]=\\ln \\mathcal{Z}\\left[j\\right]$ in powers of coupling constant $g$. Its has IR-finite terms, which are also UV-finite in local limit after simple rescaling. We have proved that the obtained series, which has the form of a grand canonical partition function, is dominated by a convergent series, in other words, has majorant in the presence and absence of field source, which allows to expand beyond weak coupling limit. Vacuum energy density in second order in $g$ was calculated and researched for different types of Gaussian part $S_{0}[φ]$ of the action $S[φ]$. Using the polynomial expansion, the general calculable series for $\\mathcal{G}\\left[j\\right]$ was derived. We provide, compare and research simplifications in cases of second degree polynomial approximation and hard-sphere gas approximations. The developed formalism allows to research physical properties of the considering system across the entire range of coupling constant, and we use it for the study of vacuum energy of the model.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.16011v1",
        "http://arxiv.org/pdf/2303.16011v2"
    ],
    "publication_venue": "V1 - raw peprint V2 - fix of language"
}