{
    "arxiv_id": "2303.14791",
    "paper_title": "Are magnetic fields universal in O-type multiple systems?",
    "authors": [
        "S. Hubrig",
        "S. P. Jarvinen",
        "I. Ilyin",
        "M. Schöller",
        "R. Jayaraman"
    ],
    "submission_date": "2023-03-26",
    "revised_dates": [
        "2023-04-05"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR"
    ],
    "abstract": "Although significant progress has been achieved in recent surveys of the magnetism in massive stars, the origin of the detected magnetic fields remains to be the least understood topic in their studies. We present an analysis of 61 high-resolution spectropolarimetric observations of 36 systems with O-type primaries, among them ten known particle-accelerating colliding-wind binaries exhibiting synchrotron radio emission. Our sample consists of multiple systems with components at different evolutionary stages with wide and tight orbits and different types of interactions. For the treatment of the complex composite spectra of the multiple systems, we used a special procedure involving different line masks populated for each element separately. Out of the 36 systems, 22 exhibit in their LSD Stokes V profiles definitely detected Zeeman features, among them seven systems with colliding winds. For fourteen systems the detected Zeeman features are most likely associated with O-type components whereas for three systems we suggest an association with an early B-type component. For the remaining five systems the source of the field is unclear. Marginal evidence for the detection of a Zeeman feature is reported for eleven systems and non-detection for three systems. The large number of systems with definitely detected Zeeman features presents a mystery, but probably indicates that multiplicity plays a definite role in the generation of magnetic fields in massive stars. The newly found magnetic systems are supreme candidates for spectropolarimetric monitoring over their orbital and rotation periods to obtain trustworthy statistics on the magnetic field geometry and the distribution of field strength.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14791v1"
    ],
    "publication_venue": "21 pages, 2 tables, 9 figures, accepted for publication in MNRAS",
    "doi": "10.1093/mnras/stad730"
}