{
    "arxiv_id": "2303.17041",
    "paper_title": "The secret of immersion: actor driven camera movement generation for auto-cinematography",
    "authors": [
        "Xinyi Wu",
        "Haohong Wang",
        "Aggelos K. Katsaggelos"
    ],
    "submission_date": "2023-03-29",
    "revised_dates": [
        "2023-05-25"
    ],
    "latest_version": 2,
    "categories": [
        "cs.MM",
        "cs.GR",
        "cs.LG"
    ],
    "abstract": "Immersion plays a vital role when designing cinematic creations, yet the difficulty in immersive shooting prevents designers to create satisfactory outputs. In this work, we analyze the specific components that contribute to cinematographic immersion considering spatial, emotional, and aesthetic level, while these components are then combined into a high-level evaluation mechanism. Guided by such a immersion mechanism, we propose a GAN-based camera control system that is able to generate actor-driven camera movements in the 3D virtual environment to obtain immersive film sequences. The proposed encoder-decoder architecture in the generation flow transfers character motion into camera trajectory conditioned on an emotion factor. This ensures spatial and emotional immersion by performing actor-camera synchronization physically and psychologically. The emotional immersion is further strengthened by incorporating regularization that controls camera shakiness for expressing different mental statuses. To achieve aesthetic immersion, we make effort to improve aesthetic frame compositions by modifying the synthesized camera trajectory. Based on a self-supervised adjustor, the adjusted camera placements can project the character to the appropriate on-frame locations following aesthetic rules. The experimental results indicate that our proposed camera control system can efficiently offer immersive cinematic videos, both quantitatively and qualitatively, based on a fine-grained immersive shooting. Live examples are shown in the supplementary video.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17041v1",
        "http://arxiv.org/pdf/2303.17041v2"
    ],
    "publication_venue": null
}