{
    "arxiv_id": "2303.08170",
    "paper_title": "Multi-scale velocity statistics in NGC 6334: deviation from a continuous and universal turbulence cascade due to massive star formation activity",
    "authors": [
        "Junhao Liu",
        "Qizhou Zhang",
        "Hauyu Baobab Liu",
        "Keping Qiu",
        "Shanghuo Li",
        "Zhi-Yun Li",
        "Paul T. P. Ho",
        "Josep Miquel Girart",
        "Tao-Chung Ching",
        "Huei-Ru Vivien Chen",
        "Shih-Ping Lai",
        "Ramprasad Rao",
        "Ya-wen Tang"
    ],
    "submission_date": "2023-03-14",
    "revised_dates": [
        "2023-03-16"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "We use molecular line data from ALMA, SMA, JCMT, and NANTEN2 to study the multi-scale ($\\sim$15-0.005 pc) velocity statistics in the massive star formation region NGC 6334. We find that the non-thermal motions revealed by the velocity dispersion function (VDF) stay supersonic over scales of several orders of magnitudes. The multi-scale non-thermal motions revealed by different instruments do not follow the same continuous power-law, which is because the massive star formation activities near central young stellar objects have increased the non-thermal motions in small-scale and high-density regions. The magnitudes of VDFs vary in different gas materials at the same scale, where the infrared dark clump N6334S in an early evolutionary stage shows a lower level of non-thermal motions than other more evolved clumps due to its more quiescent star formation activity. We find possible signs of small-scale-driven (e.g., by gravitational accretion or outflows) supersonic turbulence in clump N6334IV with a three-point VDF analysis. Our results clearly show that the scaling relation of velocity fields in NGC 6334 deviates from a continuous and universal turbulence cascade due to massive star formation activities.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08170v1"
    ],
    "publication_venue": "14 pages, 7 figures, 1 table. Accepted by ApJ"
}