{
    "arxiv_id": "2303.08842",
    "paper_title": "Multiwavelength monitoring of the nucleus in PBC J2333.9-2343: the giant radio galaxy with a blazar-like core",
    "authors": [
        "L. Hernández-García",
        "F. Panessa",
        "G. Bruni",
        "L. Bassani",
        "P. Arévalo",
        "V. M. Patiño-Alvarez",
        "A. Tramacere",
        "P. Lira",
        "P. Sánchez-Sáez",
        "F. E. Bauer",
        "V. Chavushyan",
        "R. Carraro",
        "F. Förster",
        "A. M. Muñoz Arancibia",
        "P. Ubertini"
    ],
    "submission_date": "2023-03-15",
    "revised_dates": [
        "2023-03-29"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
    ],
    "abstract": "PBC J2333.9-2343 is a giant radio galaxy at z = 0.047 with a bright central core associated to a blazar nucleus. If the nuclear blazar jet is a new phase of the jet activity, then the small orientation angle suggest a dramatic change of the jet direction. We present observations obtained between September 2018 and January 2019 (cadence larger than three days) with Effeslberg, SMARTS-1.3m, ZTF, ATLAS, Swift, and Fermi-LAT, and between April-July 2019 (daily cadence) with SMARTS-1.3m and ATLAS. Large (>2x) flux increases are observed on timescales shorter than a month, which are interpreted as flaring events. The cross correlation between the SMARTS-1.3m monitoring in the NIR and optical shows that these data do not show significant time lag within the measured errors. A comparison of the optical variability properties between non-blazars and blazars AGN shows that PBC J2333.9-2343 has properties more comparable to the latter. The SED of the nucleus shows two peaks, that were fitted with a one zone leptonic model. Our data and modelling shows that the high energy peak is dominated by External Compton from the dusty torus with mild contribution from Inverse Compton from the jet. The derived jet angle of 3 degrees is also typical of a blazar. Therefore, we confirm the presence of a blazar-like core in the center of this giant radio galaxy, likely a Flat Spectrum Radio Quasar with peculiar properties.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.08842v1"
    ],
    "publication_venue": "Accepted for publication in MNRAS. 15 pages, 6 figures, 2 appendix including tables and figures",
    "doi": "10.1093/mnras/stad510"
}