{
    "arxiv_id": "2303.14903",
    "paper_title": "Strong Inter-valley Electron-Phonon Coupling in Magic-Angle Twisted Bilayer Graphene",
    "authors": [
        "Cheng Chen",
        "Kevin P. Nuckolls",
        "Shuhan Ding",
        "Wangqian Miao",
        "Dillon Wong",
        "Myungchul Oh",
        "Ryan L. Lee",
        "Shanmei He",
        "Cheng Peng",
        "Ding Pei",
        "Yiwei Li",
        "Shihao Zhang",
        "Jianpeng Liu",
        "Zhongkai Liu",
        "Chris Jozwiak",
        "Aaron Bostwick",
        "Eli Rotenberg",
        "Chu Li",
        "Xu Han",
        "Ding Pan",
        "Xi Dai",
        "Chaoxing Liu",
        "B. Andrei Bernevig",
        "Yao Wang",
        "Ali Yazdani",
        "Yulin Chen"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "cond-mat.mes-hall",
        "cond-mat.str-el"
    ],
    "abstract": "The unusual properties of superconductivity in magic-angle twisted bilayer graphene (MATBG) have sparked enormous research interest. However, despite the dedication of intensive experimental efforts and the proposal of several possible pairing mechanisms, the origin of its superconductivity remains elusive. Here, using angle-resolved photoemission spectroscopy with micrometer spatial resolution, we discover replicas of the flat bands in superconducting MATBG unaligned with its hexagonal boron nitride (hBN) substrate, which are absent in non-superconducting MATBG aligned with the hBN substrate. Crucially, the replicas are evenly spaced in energy, separated by 150 +- 15 meV, signalling the strong coupling of electrons in MATBG to a bosonic mode of this energy. By comparing our observations to simulations, the formation of replicas is attributed to the presence of strong inter-valley electron-phonon coupling to a K-point phonon mode. In total, the observation of these replica flat bands and the corresponding phonon mode in MATBG could provide important information for understanding the origin and the unusual properties of its superconducting phase.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14903v1"
    ],
    "publication_venue": "17 pages, 4 figures"
}