{
    "arxiv_id": "2303.17287",
    "paper_title": "General exponential basis set parametrization: Application to time-dependent bivariational wave functions",
    "authors": [
        "Mads Greisen Højlund",
        "Alberto Zoccante",
        "Ove Christiansen"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-03-31"
    ],
    "latest_version": 1,
    "categories": [
        "physics.chem-ph"
    ],
    "abstract": "We present equations of motion (EOMs) for general time-dependent wave functions with exponentially parametrized biorthogonal basis sets. The equations are fully bivariational in the sense of the time-dependent bivariational principle (TDBVP) and offer an alternative, constraint free formulation of adaptive basis sets for bivariational wave functions. We simplify the highly non-linear basis set equations using Lie algebraic techniques and show that the computationally intensive parts of the theory are in fact identical to those that arise with linearly parametrized basis sets. Our approach thus offers easy implementation on top of existing code with minimal computational overhead in the context of both nuclear dynamics and time-dependent electronic structure. Computationally tractable working equations are provided for single and double exponential parametrizations of the basis set evolution. The EOMs are generally applicable for any value of the basis set parameters, unlike the approach of transforming the parameters to zero at each evaluation of the EOMs. We show that the basis set equations contain a well-defined set of singularities, which are identified and removed by a simple scheme. The exponential basis set equations are implemented in conjunction with time-dependent vibrational coupled cluster with time-dependent modals (TDMVCC) and we investigate the propagation properties in terms of the average integrator step size. For the systems we test, the exponentially parametrized basis sets yield slightly larger step sizes compared to linearly parametrized basis set.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17287v1"
    ],
    "publication_venue": "The following article has been submitted to the Journal of Chemical Physics"
}