{
    "arxiv_id": "2303.10393",
    "paper_title": "Ensemble Nonlinear Model Predictive Control for Residential Solar-Battery Energy Management",
    "authors": [
        "Yang Li",
        "D. Mahinda Vilathgamuwa",
        "Daniel E. Quevedo",
        "Chih Feng Lee",
        "Changfu Zou"
    ],
    "submission_date": "2023-03-18",
    "revised_dates": [
        "2023-09-19"
    ],
    "latest_version": 1,
    "categories": [
        "eess.SY"
    ],
    "abstract": "In a dynamic distribution market environment, residential prosumers with solar power generation and battery energy storage devices can flexibly interact with the power grid via power exchange. Providing a schedule of this bidirectional power dispatch can facilitate the operational planning for the grid operator and bring additional benefits to the prosumers with some economic incentives. However, the major obstacle to achieving this win-win situation is the difficulty in 1) predicting the nonlinear behaviors of battery degradation under unknown operating conditions and 2) addressing the highly uncertain generation/load patterns, in a computationally viable way. This paper thus establishes a robust short-term dispatch framework for residential prosumers equipped with rooftop solar photovoltaic panels and household batteries. The objective is to achieve the minimum-cost operation under the dynamic distribution energy market environment with stipulated dispatch rules. A general nonlinear optimization problem is formulated, taking into consideration the operating costs due to electricity trading, battery degradation, and various operating constraints. The optimization problem is solved in real-time using a proposed ensemble nonlinear model predictive control-based economic dispatch strategy, where the uncertainty in the forecast has been addressed adequately albeit with limited local data. The effectiveness of the proposed algorithm has been validated using real-world prosumer datasets.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.10393v1"
    ],
    "publication_venue": "13 pages, 9 figures",
    "doi": "10.1109/TCST.2023.3291540"
}