{
    "arxiv_id": "2303.15823",
    "paper_title": "Automated wildlife image classification: An active learning tool for ecological applications",
    "authors": [
        "Ludwig Bothmann",
        "Lisa Wimmer",
        "Omid Charrakh",
        "Tobias Weber",
        "Hendrik Edelhoff",
        "Wibke Peters",
        "Hien Nguyen",
        "Caryl Benjamin",
        "Annette Menzel"
    ],
    "submission_date": "2023-03-28",
    "revised_dates": [
        "2023-07-24"
    ],
    "latest_version": 2,
    "categories": [
        "cs.CV",
        "stat.AP"
    ],
    "abstract": "Wildlife camera trap images are being used extensively to investigate animal abundance, habitat associations, and behavior, which is complicated by the fact that experts must first classify the images manually. Artificial intelligence systems can take over this task but usually need a large number of already-labeled training images to achieve sufficient performance. This requirement necessitates human expert labor and poses a particular challenge for projects with few cameras or short durations. We propose a label-efficient learning strategy that enables researchers with small or medium-sized image databases to leverage the potential of modern machine learning, thus freeing crucial resources for subsequent analyses.\n  Our methodological proposal is two-fold: (1) We improve current strategies of combining object detection and image classification by tuning the hyperparameters of both models. (2) We provide an active learning (AL) system that allows training deep learning models very efficiently in terms of required human-labeled training images. We supply a software package that enables researchers to use these methods directly and thereby ensure the broad applicability of the proposed framework in ecological practice.\n  We show that our tuning strategy improves predictive performance. We demonstrate how the AL pipeline reduces the amount of pre-labeled data needed to achieve a specific predictive performance and that it is especially valuable for improving out-of-sample predictive performance.\n  We conclude that the combination of tuning and AL increases predictive performance substantially. Furthermore, we argue that our work can broadly impact the community through the ready-to-use software package provided. Finally, the publication of our models tailored to European wildlife data enriches existing model bases mostly trained on data from Africa and North America.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15823v1",
        "http://arxiv.org/pdf/2303.15823v2"
    ],
    "publication_venue": null
}