{
    "arxiv_id": "2303.17424",
    "paper_title": "A novel survey for young substellar objects with the W-band filter VI: Spectroscopic census of sub-stellar members and the IMF of $σ$ Orionis cluster",
    "authors": [
        "Belinda Damian",
        "Jessy Jose",
        "Beth Biller",
        "Gregory J. Herczeg",
        "Loic Albert",
        "Katelyn Allers",
        "Zhoujian Zhang",
        "Michael C. Liu",
        "Sophie Dubber",
        "KT Paul",
        "Wen-Ping Chen",
        "Bhavana Lalchand",
        "Tanvi Sharma",
        "Yumiko Oasa"
    ],
    "submission_date": "2023-03-30",
    "revised_dates": [
        "2023-07-19"
    ],
    "latest_version": 1,
    "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA"
    ],
    "abstract": "Low-mass stars and sub-stellar objects are essential in tracing the initial mass function (IMF). We study the nearby young $σ$ Orionis cluster (d$\\sim$408 pc; age$\\sim$1.8 Myr) using deep NIR photometric data in J, W and H-bands from WIRCam on the Canada-France-Hawaii Telescope. We use the water absorption feature to photometrically select the brown dwarfs and confirm their nature spectroscopically with the IRTF-SpeX. Additionally we select candidate low-mass stars for spectroscopy and analyze their membership and that of literature sources using astrometry from Gaia DR3. We obtain the near-IR spectra for 28 very low-mass stars and brown dwarfs and estimate their spectral type between M3-M8.5 (mass ranging between 0.3-0.01 M$_{\\odot}$). Apart from these, we also identify 5 new planetary mass candidates which require further spectroscopic confirmation of youth. We compile the comprehensive catalog of 170 spectroscopically confirmed members in the central region of the cluster, for a wide mass range of $\\sim$19-0.004 M$_{\\odot}$. We estimate the star/BD ratio to be $\\sim$4, within the range reported for other nearby star forming regions. With the updated catalog of members we trace the IMF down to 4 M$_\\mathrm{Jup}$ and we find that a two-segment power-law fits the sub-stellar IMF better than the log-normal distribution.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.17424v1"
    ],
    "publication_venue": "Accepted for publication in The Astrophysical Journal (ApJ). 27 pages, 9 figures, 2 tables",
    "doi": "10.3847/1538-4357/acd115"
}