{
    "arxiv_id": "2303.15531",
    "paper_title": "Eccentricity dynamics of wide binaries -- I. The effect of Galactic tides",
    "authors": [
        "Shaunak Modak",
        "Chris Hamilton"
    ],
    "submission_date": "2023-03-27",
    "revised_dates": [
        "2023-07-26"
    ],
    "latest_version": 2,
    "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
    ],
    "abstract": "A major puzzle concerning the wide stellar binaries (semimajor axes $a\\gtrsim 10^3$ AU) in the Solar neighborhood is the origin of their observed superthermal eccentricity distribution function (DF), which is well-approximated by $P(e) \\propto e^α$ with $α\\approx 1.3$. This DF evolves under the combined influence of (i) tidal torques from the Galactic disk and (ii) scattering by passing stars, molecular clouds, and substructure. Recently, Hamilton (2022) (H22) demonstrated that Galactic tides alone cannot produce a superthermal eccentricity DF from an initially isotropic, non-superthermal one, under the restrictive assumptions that the eccentricity DF was initially of power law form and then was rapidly phase-mixed toward a steady state by the tidal perturbation. In this paper we first prove analytically that H22's conclusions are in fact valid at all times, regardless of these assumptions. We then adopt H22's Galactic disk model and numerically integrate the equations of motion for several ensembles of isotropically oriented wide binaries to study the time evolution in detail. We find that even non-power law DFs can be described by an effective power law index $α_\\mathrm{eff}$ which accurately characterizes both their initial and final states. Any DF with initial (effective or exact) power law index $α_\\mathrm{i}$ is transformed by Galactic tides into another power law with index $α_\\mathrm{f} \\approx (1+α_\\mathrm{i})/2$ on a timescale $\\sim 2$ Gyr $(a/10^4\\mathrm{AU})^{-3/2}$. In a companion paper, we investigate separately the effect of stellar scattering. As the GAIA data continues to improve, these results will place strong constraints on wide binary formation channels.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.15531v1",
        "http://arxiv.org/pdf/2303.15531v2"
    ],
    "publication_venue": "13 pages, 9 figures. Main result in Figure 7. Submitted to MNRAS, comments are welcome!",
    "doi": "10.1093/mnras/stad2073"
}