{
    "arxiv_id": "2303.14287",
    "paper_title": "Monte Carlo analysis of the contributions of long-lived positronium to the spectra of positron-impact-induced secondary electrons measured using an annihilation-gamma-triggered time-of-flight spectrometer",
    "authors": [
        "S. Lotfimarangloo",
        "V. A. Chirayath",
        "S. Mukherjee",
        "H. Akafzade",
        "A. J. Fairchild",
        "R. W. Gladen",
        "A. R. Koymen",
        "A. H. Weiss"
    ],
    "submission_date": "2023-03-24",
    "revised_dates": [
        "2023-03-28"
    ],
    "latest_version": 1,
    "categories": [
        "physics.ins-det",
        "cond-mat.other"
    ],
    "abstract": "Magnetic bottle Time-of-Flight (ToF) spectrometers can measure the energy spectra of all electrons emitted into a 2$π$ sr solid angle simultaneously, greatly reducing data collection time. When the detection of the annihilation gamma ($γ$) and the detection of the electron (e) are used as timing signals for ToF spectrometers, the e-$γ$ time difference spectra (e-$γ$ TDS) are reflective of the positron-induced electron energy distributions provided the times between the impact of the positrons and the emission of the annihilation gammas are short compared to the flight times of the electrons. This is typically the case since positrons have short lifetime in solids ($\\sim$ 100 - 500 ps) compared to the flight times of the secondary electrons ($10^2$ ns to $10^3$ ns). However, if the positron leaves the surface as a positronium atom (a bound electron-positron state), the annihilation gamma photons can be appreciably delayed due to the longer ortho-positronium (o-Ps) lifetime. This can result in an e-$γ$ TDS having an exponential tail with a decay constant related to the o-Ps lifetime. Here, we present an analysis of the e-$γ$ TDS using a Monte Carlo model which estimates the spectral contributions resulting from o-Ps annihilations. By removing the contributions from the delayed gamma signal, the energy spectrum of Positron Impact-Induced Secondary electrons (PIISE) can be isolated. Furthermore, our analysis allows an estimation of the intensity of the exponential tail in the e-$γ$ TDS providing a method to measure the fraction of positrons that form Ps at solid surfaces without relying on assumed 100% Ps emitting surfaces for calibration.",
    "pdf_urls": [
        "http://arxiv.org/pdf/2303.14287v1"
    ],
    "publication_venue": null
}